{"h_qs0McOKixhkyb_v7CJ2w":{"text":"Extremely upscale bar in the french quarter. I would definitely go here and check it out. ","useful":0,"cool":0},"k3dDFpLiBA_YAQt3cSp5sA":{"text":"A must stop if your interested in visiting the quarter's historic bars and sipping NOLA's ","useful":0,"cool":1},"-KxFpvoGYJ6hmd3peIZP_A":{"text":"Went here for a before dinner drink on a special night. I have always loved this place and","useful":7,"cool":5},"PAEG86pWg6iP1qGwkjukgQ":{"text":"We had an amazing time here! Chris Hannah was attentive to my dry palate and made a custom","useful":3,"cool":0},"jw-wDuneS5b2hswd-mYJjg":{"text":"We came here as our first stop on a self-guided \"Cocktails of NOLA\" tour. Since we put thi","useful":0,"cool":0},"o5tTn0Ta8Smh7DXt4I7Jcw":{"text":"DEFINITELY put this one on your TO DO LIST! If your looking for a classic NOLA cocktail ba","useful":0,"cool":0},"Hn86tMVp4LLTVfXSIvb9Hg":{"text":"This the most uptight bar I have ever been to. The staff is rude and full of them selfs.","useful":0,"cool":0},"Uc8BjE2bgsiLo21ovVGRTw":{"text":"After kicking off our weekend with a horrible Sazerac at the bar named after the classic c","useful":6,"cool":4},"GjpLTVlDRggGIQk00U83IA":{"text":"A different world from Bourbon Street.  Pecan pie (traditional, room temp) and a French 75","useful":0,"cool":0},"f1p7ZyfVLiPSuzi9wRT3cA":{"text":"It seems superfluous to write about an establishment that already has so many laudatory re","useful":1,"cool":0},"OeB9_JbxEV6r5F90AOrm6Q":{"text":"One of my favorite places to have a drink, the bartenders are splendid, the atmosphere is ","useful":0,"cool":1},"d-x2kE12fv2NzNo3kLA1wQ":{"text":"The food, the service, and the upstairs museum was so well worth it. I hope to return ther","useful":0,"cool":0},"Bp58O9h9Us7ZlWaIKvOj2w":{"text":"Classic, classy.  Must have drink here for experience without drunk boozy tourists, no pla","useful":0,"cool":0},"9SsQKYhs8kfHiPgFp3H5VQ":{"text":"This is a really cool, upscale bar in the quarter. With it's cozy atmosphere and waiters i","useful":10,"cool":2},"RVZtzmKn__e7WB1ukSWMFA":{"text":"This is an essential stop on a cocktail tour of New Orleans.  The French 75 is not my favo","useful":0,"cool":0},"c361ix3pnlvgeO964s0XDw":{"text":"This is one of my favorite bars in New Orleans.  It's part of Arnaud's, and is located rig","useful":0,"cool":0},"PL5RDcaqVy5_IMrCKb_LlA":{"text":"We went to this place with high expectations and it was very disappointing.  The drinks we","useful":0,"cool":0},"SEiQPnTohcCUulxjaWOFNw":{"text":"Classy cigar bar in the French Quarter.  Great place to stop for a drink (and a photo or t","useful":0,"cool":1},"DDDi6DSVgLiJLgEXe0aagQ":{"text":"Great little cocktail bar with monkey lamps.  Sazeracs are phenomenal. Pleasant atmosphere","useful":2,"cool":1},"e6DWAOc_HuEqQeizwfa9mA":{"text":"This is a gem to find in the Quarter as an escape from the craziness outside on Bourbon.  ","useful":0,"cool":0},"IMBKlMgprzIrGvag_i3egg":{"text":"Great bar with a great atmosphere. Fantastic service, they treat everyone like they're VIP","useful":0,"cool":0},"gKPC8_5Obdq6bOQPi5MxOw":{"text":"Ended up at Arnauds after not being impressed at Carousel Bar. It's def a tiny place but f","useful":2,"cool":3},"N8onLzH-4txMVzT2RbpugA":{"text":"My first time in New Orleans, and plus it was my birthday. \nThe food is epic.  Try to sit ","useful":0,"cool":1},"948d6e1NcXnron8UQv1b-g":{"text":"A delightful, elegant & romantic spot for a digestif after a romantic evening or a pre-din","useful":0,"cool":0},"rTXRU3xLnfK1q9wxXPo6Og":{"text":"What a wonderful atmosphere! An absolutely perfect place to stop and have an excellent coc","useful":1,"cool":1},"CA4rPvW-FWvhbfDo9Q0_hw":{"text":"Very small intimate bar thats decorated like it opened as a speakeasy in the 20's and neve","useful":0,"cool":0},"E4tzDBQG3WvLQ0tuII0sCQ":{"text":"Cocktail Geek Heaven.  Worth Traveling by Jet.  Or swamp boat.","useful":0,"cool":0},"uxTJl4LksbCIlfYwEJB78g":{"text":"Quintessential New Orleans fine dining.  Many individual rooms and Balcony complete the sc","useful":0,"cool":0},"nEesVzND7RwzSqaY8P1l7g":{"text":"This is my fav in NO (so far)! Amazing ambiance, and the service is incredible.  And the c","useful":0,"cool":0},"qETixQV3soJjB3iJs1Fo-g":{"text":"We've crawled all over New Orleans in jeans, sandals and tank tops. But with my mom along,","useful":8,"cool":1},"XvnTOBDx_d6ufq1fDplgxg":{"text":"The bar was a wonderful dark wooden place.  Very inviting.  It is obviously on the tour bu","useful":0,"cool":0},"uCHdkyPFRJ--W5cG_luz_Q":{"text":"This bar should be on everyone's list of bars to visit in New Orleans.  The Contessa, thei","useful":2,"cool":1},"VlWFH1ElNN1yl-wN5vljXw":{"text":"AMAZING overall experience. The restaurant and atmosphere is wonderful. I went there with ","useful":1,"cool":0},"gaASItI99aRpDJYENJJV3A":{"text":"I'll preface the review with we're from NY and Miami. The food was, ok, nothing to write h","useful":0,"cool":0},"rq-UedPzyroce4Y1iWfX5w":{"text":"My phone won't let me add the extra 1/2 star. This place is great! The ambiance is so clas","useful":0,"cool":0},"JqdNnajhli5Vi4SVqzTing":{"text":"Lovely place to have some drinks and snacks before dinner! Very cozy seats and an old scho","useful":0,"cool":0},"2CNGeemRKFReVfECbSa7yg":{"text":"Classic and classy way to get your night started in New Orleans. The vibe here couldn't po","useful":2,"cool":1},"Xh1bhODBRIVLp_i_jYtR9A":{"text":"My girlfriend and I were visiting New Orleans for the first time and we ended up at the Ja","useful":0,"cool":1},"YBspWF6NGJ4hQewYxQ_4JQ":{"text":"Spec. Tac. Ular. My husband and I walked into the restaurant without reservations. They di","useful":0,"cool":0},"WFt5O1Uo5XOFBgaza8Sg0g":{"text":"Loved coming to this bar!  Sure, it's in the Quarter, but because of its swankness, it kep","useful":2,"cool":1},"zwdJUG37UpPyXen42AMLAQ":{"text":"Four drinks later, and it was nearly a $50 bill. But that was expected. Named after the NO","useful":0,"cool":0},"nNi3aZye4ghZCf2Z0eEnkg":{"text":"Tracy and I went here because we were so over Bourbon St. It's a high end, fancy shmancy c","useful":0,"cool":1},"0PngsCdMr9ID5sYm3hpQYw":{"text":"quality food. Amazing service and great atmosphere. Wine selection is good and the food ta","useful":0,"cool":1},"jIdBPFgnx4LeMjq7pUGZfw":{"text":"Had a fantastic dinner. Underwood was great he showed us the museum upstairs and should be","useful":1,"cool":1},"8T6TbAgicd98hf_bJRsotA":{"text":"You can't beat the southern charm of this place! The staff is terrific. Very sweet and rom","useful":0,"cool":0},"oxiTzojXlBPN267b7ayMug":{"text":"Drinks were good and the service friendly and quick. Wines were from $8-$12 a glass. But b","useful":0,"cool":0},"hgmE48yZYnodKcwaOqApLQ":{"text":"Cute authentic place. Went only for the French 75 drink and it was great, pretty steep at ","useful":0,"cool":0},"GXZgLageaSDGRN3_3lN-yA":{"text":"If you are in New Orleans for any amount of time, you'd be remiss not to step into French ","useful":0,"cool":0},"_mO11YOgTYJ6hm2Hr7q0iA":{"text":"In a sea of Bourbon Street bars, this one is an uptown oasis.  It's just off of Bourbon St","useful":0,"cool":2},"cJKiP2J1RpAZ-OFF1wibTg":{"text":"One of the nicest, most refreshingly unique bars in the area. I would say 5 stars if they ","useful":0,"cool":1},"7VyTli_ovlzkt0AzdoE5qQ":{"text":"Great bar for drinks and appetizers. Prices are reasonable and the location is fabulous.  ","useful":1,"cool":1},"6DOOT2DNU9NteyclNwG2SA":{"text":"Wow, absolutely amazing ambiance. It felt really old-school and classy, but somehow laid-b","useful":1,"cool":1},"-WU2kyFFgCeYmyTzWscKrA":{"text":"Good ambiance. Cocktails are good and their chocolate toffee bombe dessert is delish!","useful":0,"cool":0},"z7Ed1oxShwTzPkzU1lnKqw":{"text":"My friend and I did not want to deal with Bourbon Street and the smelly bars, so at the re","useful":0,"cool":0},"Sw6DWuo3STmjrgWod4x0oQ":{"text":"Not mind blowing but a very nicely made French 75 which I enjoyed and husband's Sazerac  e","useful":0,"cool":0},"stgjS0lyAsV6yiLDZ9mIow":{"text":"Can I give this 6 stars? How about 7 stars? What a spectacular place. We had the Jazz Brun","useful":0,"cool":0},"kgsma-Yt1xQNY6-0z6JqMQ":{"text":"I enjoyed a lovely, delicious dinner at Arnaud's with a large group of ladies.  We were tr","useful":0,"cool":0},"RMcwa1I-kL74anyvMplr5g":{"text":"We stopped here to get a French 75 because they are a NOLA and Arnaud's classic. The drink","useful":0,"cool":0},"xeBV7UyVuXlSw9hD2scplA":{"text":"Not a dive bar, thank god. This is an excellent upscale cocktail bar where they make drink","useful":0,"cool":0},"EbcV8gpUM5F7MoGdAbQmHQ":{"text":"Our favorite bar in New Orleans!  The French 75 signature drink is a must-have.  So refres","useful":0,"cool":0},"oITMm8RuoH1XFy_DS2rQ_A":{"text":"The cocktail bar was like time traveling to the 30s. Looks like a swanky speakeasy with ba","useful":0,"cool":0},"UtlH2mTUbQQYNsqPvp1lvQ":{"text":"Not withstanding that this place isn't the best for vegetarians it is really good with tha","useful":0,"cool":0},"UykQ-vBIEt15gWY2dh7ocg":{"text":"Paul was a great bartender! He told us a few stories about the history of the restaurant a","useful":0,"cool":0},"fabmh54SeaSod2_cMxu31g":{"text":"Amazing dinner date place!!! Very few veg options and the quantity was too small but the a","useful":0,"cool":0},"YhunLtMzRIpUyw_DMNyrFQ":{"text":"Excellent old school bar and lounge. Loved the ambiance and the service. The drinks are to","useful":0,"cool":0},"skkTSlxpqhYs_h_oKJm3hg":{"text":"Had a great experience here at Arnaud's. I had to direct a meeting there and the employees","useful":0,"cool":0},"N6czJd2mLT1q_nlQvnvrTw":{"text":"Great place for lunch or dinner. I highly recommend starting with the alligator sausage an","useful":0,"cool":0},"MiA6rIhDwljyg50Es6gGMA":{"text":"Don't miss the soufflé potatoes as a great snack while enjoying Chris' French 75 made with","useful":1,"cool":1},"yuilBVQo99z7m50r_y4zbg":{"text":"After trying the French 75 at Luke's and immensely enjoying it, we decided we need to stop","useful":0,"cool":1},"3ThmddkKTSTypF0CD1tabg":{"text":"Came here with my daughter for drinks and appetizers before heading across the street to G","useful":1,"cool":2},"aOkd3vZL9IXcBukAZyA56g":{"text":"7 Dinners all different, all very good  i had filet and done very nicely.  Had asparagus a","useful":0,"cool":0},"Fe76C_0rb9XqCWt8nxr8NQ":{"text":"The vibe of this place is cool, it takes you back in time for sure. The drinks are delicio","useful":0,"cool":0},"wSmRTizlzTfbf4gHwe9dCw":{"text":"Cozy spot off Bourbon Street. We met the bridal party here for cocktails after their rehea","useful":0,"cool":0},"OOEhiZVJBnQwXtjoUAG2yw":{"text":"Stopped in here for a French 75 to start our recent Saturday night on the town. Loved the ","useful":2,"cool":1},"pCHxaN9NGV70E0Y6w9Lndg":{"text":"I am not a big fan of mixed drinks because they all end up tasting like alcohol anyways. B","useful":1,"cool":0},"R398ghaJ1yJ95ucOND6w7A":{"text":"Only had drinks here and they specialize in a gin based menu which is not my favorite. Nea","useful":0,"cool":0},"FyiZBbu9NXAxgYyIaVsoYg":{"text":"Arnauds is interesting New Orleans eatery. It has a long history and has maintained is qua","useful":1,"cool":0},"ROx2LkkcMUgSDnud1JqYCQ":{"text":"This bar is so pretty inside. Very old school. And as always in NOLA, we felt severely und","useful":2,"cool":1},"Q4DHiCAEnakLA9gm7Dvz-A":{"text":"If you're coming to New Orleans you're probably thinking you're going to need a cocktail. ","useful":3,"cool":2},"k_ytR9eP-_8GceBeiI184w":{"text":"One of my favorite bars in New Orleans! It is a hidden gem and classy establishment. Great","useful":1,"cool":2},"ENz70Gc1jmVcamP-nZmmRQ":{"text":"Officially my favorite bar in the FQ (I'm not the Bourbon St. type). We went two out of th","useful":0,"cool":1},"-FcAtD07OUbnsdTFVYPnIg":{"text":"Awesome dining experience. The restaurant almost seems over staffed. You're never unattend","useful":0,"cool":0},"ZRPwNfkFemhvkofWUZ5nAg":{"text":"The Bananas Foster dessert is exceptional. Prepared right beside the table, fire show and ","useful":0,"cool":0},"CJPZesH364mc16lx-CvylQ":{"text":"Amazing cocktails!  Thank you Vincent!  TLC in a glass.","useful":0,"cool":0},"dhOYZU7r94O0ufgOG5b-xQ":{"text":"I have nothing bad to say about this restaurant. I was worried the jazz music in the bistr","useful":0,"cool":0},"4cxdc48gGiSgADQWmXP2LQ":{"text":"I love the people that my friends and I become when we decide on French 75 for a night of ","useful":4,"cool":4},"X9vOo12BFRGHLnAt8Kf_6w":{"text":"A real treasure, just steps from the fetid river of undeserving humanity that seeks swill ","useful":1,"cool":1},"jO106BHHYwTI1OATSbWnQw":{"text":"This place makes an amazing French 75 cocktail (duh), has wonderful waiters, and is a beau","useful":1,"cool":1},"CoqfpxYiXinFPRdb_3WWNQ":{"text":"Awesome cocktail bar.  Great (fancy) service.  It's off of Bourbon so the crowd isn't frat","useful":0,"cool":0},"KhJ2dBgyPTiNuP5RCCuy9w":{"text":"Well- made drinks in a sophisticated atmosphere. We got there right after the kitchen clos","useful":0,"cool":1},"bajlF0C75v-HSCKuP3G3DA":{"text":"Stopped in here for cocktails before meeting friends for dinner. The sazerac is a wonderfu","useful":0,"cool":1},"XQzLGLbxEEUUMkP9ZdEX3w":{"text":"We stopped here for drinks on a Friday night. The bar is beautiful inside. Our bartender, ","useful":0,"cool":0},"BF5X5SMT5RrDbb7FLZ4TsQ":{"text":"Probably the most charming and authentic place that you can get a drink in anywhere close ","useful":0,"cool":1},"5BGyDw3lp3AkfgyVlrsS3g":{"text":"Nice, but small. The couches fill up fast. Nothing really makes this place special. The dr","useful":0,"cool":0},"w6M-75RKwjysySz9eGx9MA":{"text":"Chris Hannah, widely considered New Orleans' best bartender and one of the tops in the cou","useful":2,"cool":2},"-vRhNVhfOG7eR_zhbizi7A":{"text":"I thought this bar was just ok, but better than most things in the area. It didn't seem to","useful":0,"cool":0},"vjHPaFLoSl-MyKxdk9E-BA":{"text":"The Good:\n\nAMAZING atmosphere!!!  This is your quintessential old New Orleans bar.  It's j","useful":2,"cool":2},"ALJcKxpLzXkTQx2qOQtJwA":{"text":"What a wonderful place to get away from the craziness of Bourbon Street.  Love the vibe an","useful":0,"cool":0},"A7Ycdibt86uygxShLA0TYw":{"text":"Couldn't have been better! Very cool bar. Stayed for dinner which was outstanding. Excelle","useful":0,"cool":0},"_0MRLy7OtIQGi8W2rW1kyg":{"text":"Our party of 7 had to wait awhile for seating.  We lucked out and sat right next to the fr","useful":0,"cool":0},"ZRTEgmioaaL93eBAVeR7pw":{"text":"A classy, pricey spot to grab a drink from a French Quarter treasure. \nIf you are in New O","useful":0,"cool":0},"3ZvBKmBGG5tQsTJfKHaiFg":{"text":"My favorite bar in New Orleans....we go for special occasions.","useful":0,"cool":0},"z_bJ70-7E17g2tMj69pkoQ":{"text":"Delicious brunch. Perfectly attentive service without being obsequious. I recommend orderi","useful":0,"cool":0},"Ad2ase8OXUYfLIBmkIlTGw":{"text":"Had a really great experience here. Cocktails were really great. Of course, everybody trie","useful":0,"cool":0},"zImio7z2dIMhkLqbfuLBOQ":{"text":"This is probably the best place to eat on Bourbon Street, frankly. You will have to pay a ","useful":1,"cool":0},"Qs9J1inO-c_BqMYme-F0mw":{"text":"Beautiful cocktail room, friendly staff, hand crafted cocktails. Although it feels fancy i","useful":0,"cool":0},"DahSKBjgEIL7Qp0tz6jijw":{"text":"Serious cocktails that are reasonably priced in a cozy room. A nice escape from Bourbon St","useful":0,"cool":0},"uEb1Jl4Yn3UQHfFqweimpg":{"text":"Fantastic. I came to Arnaud's French 75 twice during my trip to New Orleans. The cocktails","useful":1,"cool":0},"aFGnchNLyDqTUpyyrEHgeg":{"text":"If you're looking for Don Draper in New Orleans, look no more. Picture a classic, historic","useful":3,"cool":2},"tJnYTFJJb38WW_SgT2vvNQ":{"text":"What a great little bar for a cocktail and appetizers. I didn't want to leave.","useful":0,"cool":0},"qKDpccSIkb8Txl8veQ2A8A":{"text":"Nice ambiance and just a relaxed but classy vibe to it.  Beautiful full scale wood bar wit","useful":0,"cool":0},"WBpaqex4dmurIj8U8gnSEw":{"text":"The best throwback to another era. Amazing food wonderful service and great ambiance.","useful":0,"cool":0},"0NTfrygtfYwDT9jrH40ToQ":{"text":"The building is beautiful and the staff is knowledgeable on the amazing history of the res","useful":0,"cool":0},"lTfLKtOCOwqdg4PlpKd5hA":{"text":"Chris Hannah is the most handsome, well-dressed and polite gentleman you could ever find t","useful":0,"cool":0},"5q61M5_MwaDzOZJbdqGQqQ":{"text":"The food was excellent. The alligator sausage was delicious and juicy. The oysters were al","useful":0,"cool":0},"lm6Yz4pR09RruPCChWxyUQ":{"text":"I think it's official-- this may be one of the most expensive bars in the French Quarter--","useful":0,"cool":1},"NkRGkdE-8vl2f-m6vil66A":{"text":"GREAT PLACE.  Professional bartenders......they can make anything...and specialize in old ","useful":0,"cool":0},"M8KK0hFuCLlp_Y9XlH0NAQ":{"text":"Amazing experience. We dined here for a birthday and everything was great. There were seve","useful":3,"cool":3},"vx93pz7CbJAJmkIiW-jBbQ":{"text":"Well, I was dressed too cool to go into the main restaurant last time I went, so they park","useful":0,"cool":0},"RuEJw5bPIMQn47WrMYCZsw":{"text":"I feel this is the finest old-world New Orleans Restaurant.  The food and presentation are","useful":0,"cool":0},"4HaoBiu4u5f_p8ef90qqFg":{"text":"A classy cocktail lounge and fine dining restaurant that offers quality New Orleans and Cr","useful":0,"cool":0},"xCVCABQCGirxumWDyTawww":{"text":"Ask for the full menu at the bar! You will have an awesome night watching people walk to a","useful":0,"cool":0},"vT6LVuk2Yf0ooNEDRigiUA":{"text":"Definitely recommend the French 75 signature cocktail - it was a lovely and tasty drink!  ","useful":0,"cool":1},"X1yL8BuqACeytZHHkTr0mg":{"text":"Stopped in for a quick drink. The bar is adorable and the cocktail selection is fantastic.","useful":0,"cool":0},"gfhG69yF-QXcECeaT-ZZJQ":{"text":"Although this is an establishment that has been in the French Quarter for quite some time,","useful":1,"cool":0},"MXTirkG__koQ-hyb51I6-A":{"text":"Stopped in late one Sunday evening for drinks with friends.  There are several cozy and co","useful":0,"cool":0},"3ZdVOCmKItukZPjxcLHFyw":{"text":"One of my favorite places in this entire city. It's like stepping back into 1930's Paris..","useful":0,"cool":0},"1G4uiYUEOmjtrVyStOoT_Q":{"text":"So we got married. We went to the courthouse and kept things pretty simple but we wanted t","useful":0,"cool":0},"OJPVfK6GGe1jdLL_EW8u4w":{"text":"This is a great classic bar - part of Arnaud's restaurant next door. Chris Hanna is the ba","useful":1,"cool":0},"jhE8NtQMx-ciupfncjLSJw":{"text":"\"Work is the curse of the drinking class\" ~ Oscar Wilde\n\nThis is a bar with a setting of t","useful":2,"cool":0},"UfjEGW7N9y2zReJ_kGAHPw":{"text":"The food was excellent, and the ambiance was amazing. the only reason this isn't a 5 star ","useful":0,"cool":0},"a2oq6J5XiZOVB6ZE12yXMw":{"text":"Great quiet cocktail lounge that appears to be a throwback to those found a century ago. W","useful":0,"cool":0},"JAUIfgLk_N_Yb8xEqb0lPA":{"text":"This was the best food I had in New Orleans.\nThe crabmeat was so fresh and delicious. I or","useful":0,"cool":0},"VEfqbAg_53ABEYono8FGLg":{"text":"Came for dessert and drinks on a weeknight. A  fancy, clean and quiet little place by bour","useful":0,"cool":0},"oA8d7COmM1IAq8QzlV-36A":{"text":"Upon entering Arnauds French 75 bar you feel transported back into time. Love the decor. E","useful":0,"cool":1},"z1zIdBS8sunCtB-TXvvA7A":{"text":"Of all the wonderful restaurants I visited in New Orleans, Arnaud's stands out in my memor","useful":1,"cool":1},"4U6cL-VzFQr4Mr0SZX3uzw":{"text":"We enjoyed Arnauds French 75, the drinks were quite good. I really like a French 75, but t","useful":0,"cool":1},"eSmlMFfopl2i2veaq9fMUA":{"text":"They had the two drinks we were craving : mojito and Ramos Gin ! Drinks were delish. Good ","useful":0,"cool":0},"wET7wdXFwejPJMk7Gxwltg":{"text":"Gorgeous, classy bar, and excellent service.  Great place to catch a drink before dinner, ","useful":0,"cool":0},"1hNN5D4j40gImfzWBeFKfg":{"text":"Great bar...but I don't even want to call it a bar, she's more of a lady than that!  Actua","useful":0,"cool":0},"xs3nwmqYL0H5KxJ6hOdo-g":{"text":"Alas, they don't sell cigars anymore (boo!) but the drinks are still good. We had the gin ","useful":0,"cool":1},"63E8kS6AAdutzeJIUoL8RA":{"text":"It has a lovely ambiance. It is small and intimate, which is perfect. The waiters are frie","useful":0,"cool":0},"XjagKPezAen0ezQhFiXQ1g":{"text":"Best cocktail bar we visited in new orleans. Entire staff was great. Chris Hannah was real","useful":0,"cool":0},"4bDeyd_wZjXvHLxArh3AWA":{"text":"I really dig Arnaud's French 75.  It just feels like such an old school bar.  Dark wood. .","useful":0,"cool":0},"okjm-1TxVZ0L3ZqbCnBJRw":{"text":"Hands down the best cocktail menu I've experienced. The El Guapo Fashioned is highly recom","useful":0,"cool":2},"aJminUoUFsTLIhb15xg37Q":{"text":"Came in for Fri Happy Hour at French 75.  Excellent old fashioned's and French 75's. They ","useful":1,"cool":1},"2NpYSmcSp4HwHcWR33DJ_g":{"text":"Came here for a drink before dinner while on a Bachelorette party.  The space it's self is","useful":0,"cool":0},"aZmG573Cklbxcz4xwX7Seg":{"text":"Back home I would have balked at the thought of paying $13.75 for a cocktail, but this was","useful":4,"cool":7},"SAdcUas41oAM4Twf663C1A":{"text":"We had a great experience here. We came in right before the brunch hour was over, so we di","useful":0,"cool":0},"NXguSJpYx9Rd6wemRuYIvQ":{"text":"I have been here a number of times with clients.  Never fails, and never not exceed expect","useful":0,"cool":0},"xGft851PoBZKgfKnqfdZhQ":{"text":"Just go. And try to go when Chris Hannah is on shift. He is described elsewhere as a treas","useful":2,"cool":1},"TpRIkqRMU3f7QoZfQZQCQA":{"text":"I had the pleasure of getting to visit this historic location during the 2012 Tale's of th","useful":1,"cool":1},"e_5fWwTthqh8TJStF3xxlQ":{"text":"When my girlfriend and I visited on a Saturday night close to closing time, I did not expe","useful":0,"cool":0},"XJ5aICm9SvHjevAM_6JVAA":{"text":"What a fabulous place to be!! Visit from out of town and wanted to grab a bite at a local ","useful":0,"cool":0},"8rnBLyBraI4AND0nslfOag":{"text":"Ended up going here with a group of friends for a progressive dinner during Christmas time","useful":2,"cool":2},"98l1kNjRzylYxl6xBq74OQ":{"text":"Amazing food and exceptional service. Definitely have Strawberries Arnaud and the filet. I","useful":0,"cool":0},"1F6AoLMXzZOnhn5Svm_aiA":{"text":"We dined here with a larger party and arrived without reservations.  The staff was able to","useful":1,"cool":1},"4lrnQZ2M4dHQ8ymNOPdZ5w":{"text":"Came here for Thanksgiving dinner and it was amazing. We didn't have a reservation but the","useful":0,"cool":0},"IEJ1W6rt0vuCceeeoZhaeQ":{"text":"An absolute gem in the French Quarter.  Arriving late evening, under light rain, the momen","useful":3,"cool":1},"bd4OVdwwZiJdSOqN_j1QcQ":{"text":"We went to this bar area to get the French 75 drink; a remembrance of a lovely family wedd","useful":0,"cool":1},"kGQkth5Q-DowQ7ZnanG7UQ":{"text":"We were recommended to this place by an old man we thought was just a random, but turned o","useful":0,"cool":1},"S6rwtZZKqe3Gw3CxDmR2GQ":{"text":"I love French 75 when I have guests visiting Nola.  Ordering some of their classic (but la","useful":0,"cool":0},"n1lBxRyTTyAPRKYq1ycSVQ":{"text":"Decent food, nice ambiance, classic NOLA.  I had the fish and the trio of veal, crayfish a","useful":0,"cool":0},"0Z9uBxHb8sua8LBJRfTKrQ":{"text":"This is a great old school speakeasy style place with great cocktails. They have many of t","useful":0,"cool":0},"f3LN6-3SXsr1yR3blpeaUA":{"text":"The smoked Pompano was so delicate and Devine, the filet au pouv was five star delicious, ","useful":0,"cool":0},"X57LqObQqXZfUMrKgRtrDg":{"text":"The French 75 Is one of the most beautiful fancy bars in the whole world. Between the eleg","useful":0,"cool":0},"gk-oBTIFnwWJ2Ktw0XSndA":{"text":"When my gf and I stopped by on Saturday night, the bar was beyond packed so we walked out.","useful":1,"cool":0},"CRc42yb9f1mtWpV_TXRu6A":{"text":"Wonderful restaurant! Impeccable service and delicious food! The gumbo is awesome! The sau","useful":1,"cool":0},"wn1irYQWcA-uSmY7RKIISA":{"text":"Awesome oysters! Southern hospitality \n\n Hung out here as I was waiting for my table at Ar","useful":0,"cool":0},"h0VMZKcaPpbYipNvopZNDg":{"text":"Declicous food, prompt service, and great location right in the mix of everything.  What's","useful":0,"cool":0},"oqdbGjVGkFvk8-MqozXKNw":{"text":"Cocktail landmark headed by the most talented historical cocktail bartender in the country","useful":0,"cool":0},"yqnTpmoF0BN_3DIM41p_Lg":{"text":"Elegant does not even begin to describe this place.  For me, it was like stepping off the ","useful":0,"cool":0},"9Wq4hDadlzev7qzJu4BW8g":{"text":"First I would like to say that we ate at several four and a half to five star restaurants ","useful":0,"cool":0},"7_aLJf1zwReRERbkywNttA":{"text":"Small bar but efficiently managed with great drinks.  We were a group of 6.  Came in and t","useful":0,"cool":0},"DWW28MkyYMf6CY_9UA4rww":{"text":"Iconic, beautiful, a must visit spot in New Orleans if you are a cocktail fan.","useful":0,"cool":0},"4yASqNaS0p3kaC_2qrt9jA":{"text":"A French 75 costs a pretty penny but let me tell ya! It was worth EVERY cent! My favorite ","useful":0,"cool":0},"szOriTsUbrbmKitFiBtpFw":{"text":"When I make a mental list of the places I MUST visit in New Orleans, Arnaud's is always at","useful":0,"cool":0},"E5Z1NF578SBZRVI1EiFtDA":{"text":"GREAT!  The drinks where great, the food was wonderful and still new orleans.  They blende","useful":0,"cool":0},"xrCzjIJMMLoNSQlwZYlVRg":{"text":"Absolutely the best atmosphere of any bar we visited in New Orleans. A little smokey, but ","useful":0,"cool":0},"--mziYr8pxnXJg_1BQMO5A":{"text":"Excellent bar, they know everything there is about mixing a good drink (and a detailed dri","useful":1,"cool":0},"M9ieF2JUAeEBQLfZ72Ye7A":{"text":"Wow, where do I start? The atmosphere? The cocktails? The souffle potatoes? My head is spi","useful":0,"cool":1},"K1oLY59T61WK3tUAD27Ikw":{"text":"After having a really bad experience in other restaurant I'm very glad we found Arnaud's. ","useful":0,"cool":0},"C46RRG7uv6XGGkbj4PKxDQ":{"text":"Everything was great about this restaurant!!! The Jazz combo performed during dinner and w","useful":0,"cool":0},"U-p8DYsgBn-dOuB_L8ZknA":{"text":"Great place...loved the atmosphere and the beautiful crystal chandeliers. Service was good","useful":0,"cool":0},"9qd9lEVDh6hxjr-KDqPkrg":{"text":"Best bar I've been to in ages. Like another world after walking the 1/2 block down from Bo","useful":2,"cool":0},"daw_AH_pC7KE6QhtslBR1A":{"text":"It's day two of eating and drinking in the French quarter, now we are stepping it up a not","useful":3,"cool":1},"39mO9Gz0Z0e4IHmCOvwKqQ":{"text":"Admittedly, I have several hundred more pet peeves than the average person; most deali wit","useful":7,"cool":6},"rZIB6zjCiupvTBwSqB2T9A":{"text":"Came here for a drink with a friend before our 6:30 dinner reservation at another restaura","useful":0,"cool":0},"q6dFgbhQ0r2EcB7wXJDXpA":{"text":"Stopped in for some old fashioned cocktails and some New Orleans charm.  Drinks and servic","useful":0,"cool":0},"9EnmO1Zvq9UK7lVmTUBadw":{"text":"Beautiful 19 century decor, delicious selection of high grade spirits including single mal","useful":0,"cool":0},"G9BeHg0iGC6H0C64stjl4Q":{"text":"Dinner here is elegant and the food traditionally new orleans french cuisine. Cocktails ar","useful":0,"cool":0},"Hie3Heft8x-0KgFaQqab2Q":{"text":"While on another visit to New Orleans, we were really excited about going back to the Fren","useful":1,"cool":0},"BTMT3nKWosP2xol6H1kQRA":{"text":"This restaurant is southern classy.  Don't try to enter in jeans and a t.  The food was wo","useful":1,"cool":1},"El3bsLjcCXpYwGjAycW4CA":{"text":"Intimate and classy, this lounge places you back in the 1920's. The French 75 became our g","useful":0,"cool":0},"XlIR1-IautTKqhx4Sdmoqw":{"text":"This is a great little spot that I usually go to if I'm hopping around the French Quarter.","useful":1,"cool":0},"ws6sPECREzeloBMb7WDTtQ":{"text":"Ar dual has been here FOREVER, decades upon decades. We enjoy the old school service, the ","useful":2,"cool":1},"ZEpi-OE0WNbOTsh_LAc6Pw":{"text":"Upscale old world cocktail/cigar lounge. Gorgeous interior, perfect lighting. Cocktails ar","useful":0,"cool":0},"tlE-GheLUz28pgUozfrIow":{"text":"This is the most elegant little bar. Despite being a native, I've never eaten at Arnaud's ","useful":3,"cool":2},"nPqx279uoD1hKmw695kSNg":{"text":"Fantastic bar and location. \n\nSome of the most friendly people I have ever meet.\n\nWalked i","useful":1,"cool":0},"d6SMOmKkBrivI4uaGrJ6mg":{"text":"Sometimes you just feel fancy AND drinky and you just want to have a cocktail in a relaxed","useful":7,"cool":8},"pqUD2DeHVD3cn7v6m1yv9g":{"text":"We were looking for dessert and after dinner drinks so we decided Arnaud's would be a good","useful":0,"cool":0},"Sb95-Ix_oQ2biPjOJ2ZvMg":{"text":"Wound up here twice on this trip, and would love to make it back in the future.  I'm thank","useful":0,"cool":0},"2kj8tk7L768LPgR3Knjs-Q":{"text":"We went to Arnauds for dinner last weekend while visiting New Orleans ! Made a reservation","useful":0,"cool":0},"LsieP7oVGO9zsMMRjuabfg":{"text":"The drink of the same name was invented here, and the food comes from the Arnaud's kitchen","useful":0,"cool":0},"b684mVaa5W_dae1NMSDwcQ":{"text":"I loved my whole experience dinning here. 5 star service, and I would recommend this resta","useful":0,"cool":1},"APBYsXPt2eWAIdhLhtMVTg":{"text":"Jazz brunch is fabulous! The music is great, service is wonderful and such a fun atmospher","useful":0,"cool":0},"iRzm0LsT18YkvBlP-6UOdg":{"text":"Bartenders are AMAZING!! Would recommend without reservation.  The bartenders were friendl","useful":0,"cool":0},"dflhnS2MTBN2gMC-bwS68Q":{"text":"Excellent cocktails. Had French 75's (Of course!) and Sazerac's.\nVery nice atmosphere.\nThe","useful":1,"cool":0},"f8i1GvpVywUUfF9f9ZfajQ":{"text":"Delightful and not nearly as smokey as one would expect. We could barely make out cigar sm","useful":1,"cool":0},"lgfdmM85KAXi03gYWEfh6g":{"text":"Wow, this place is the real deal. Thomas and Ron did an excellent job of serving and hosti","useful":0,"cool":0},"xtTFW_lXlvsYgpWYawBXpA":{"text":"Excellent! The staff went above and beyond to make our dining experience enjoyable. Upscal","useful":0,"cool":0},"1dz2_5qQ_fcJtRYcNnVI0w":{"text":"The French 75 is delicious (ask for it to be made with Gin). This was my first night out a","useful":1,"cool":1},"Zn_0A0nUA-RHFOgAW8d-vQ":{"text":"Beautiful setting.   Service was fabulous!   The wait staff seems to work as a team, so th","useful":0,"cool":0},"kSyGqPBm-8v4Lo2NAhtcCw":{"text":"This is one of my favorite bars in the French Quarter. I was there last over Thanksgiving ","useful":1,"cool":0},"JltZh4dyHxrpA7mKCngSFA":{"text":"After trying so many places near Bourbon Street, we went here on our last night b/c it see","useful":0,"cool":0},"azoZco9xDofxk_QOu2WLwQ":{"text":"Liked the restaurant and great, friendly staff but the crowd kills the ambience. It draws ","useful":0,"cool":0},"XxoLN-CWaxzY_sBwnE_FGA":{"text":"Insane food... insanely good service.. I mean WOW!!!!! I loved every minute and every bite","useful":0,"cool":0},"mXtqN5X0XcylVfvGIKd1FQ":{"text":"We are foodies from San Francisco. Every single meal, we have a gourmet experience. I have","useful":0,"cool":0},"ySTpISXRoEZ_93YVEm5CIA":{"text":"Delicious and classic drinks - friendly bartenders who gave great recommendations for our ","useful":0,"cool":0},"TqIggFqOHYbuOtIRJ2NkbA":{"text":"First trip to New Orleans, had to try Arnaud's. :) Was impressed that there are separate r","useful":0,"cool":0},"zCbGlLnOe9IMroqPq_tU6w":{"text":"I've recently embarked on a journey to patronize every old-school New Orleans bar in this ","useful":2,"cool":1},"Kz4NV6J03aMMB1zQQMXPKQ":{"text":"Mellow scene... Awesome drinks... Fair prices ... If u are looking for a mojo boost... Pop","useful":0,"cool":0},"F5ruWL8V3VLA3M2c7m_16Q":{"text":"Wow I love Arnaud's. A New Orleans local, I'm always trying to expand my list of New Orlea","useful":0,"cool":0},"ad8ymXVWle03105NunRugA":{"text":"My husband and I are just shy of 30 but we are true old souls at heart. We walked right pa","useful":1,"cool":0},"-ljSHg5uU5I4ruW_k-8UHA":{"text":"Great bar. Small and cozy. Nice and smart staff. The French 75 is an amazing drink. One of","useful":0,"cool":0},"gzMx-VdRck4vCjSVQiRcrQ":{"text":"The drinks here are really unique and classy.  The interior appears very unique and old fa","useful":0,"cool":0},"4iJIcYM-QtESnNdx8K3C6w":{"text":"Found it by chance doing a cigar bar search on google. Great ambiance. Went for drinks and","useful":0,"cool":0},"pckaX5-UJimWcA27ODC8Zg":{"text":"Excellent ambiance, patrons and bartenders. The drinks were very good and the staff had lo","useful":0,"cool":0},"tR1Wg3z-oaibxWZurqrGxg":{"text":"We had the best time dining here when in town for business last September. It was my first","useful":0,"cool":0},"23G3FJy8qZgE2WCE6YErtQ":{"text":"I planned on going to Arnaud's solely to try their French 75 cocktail with bourbon and it ","useful":0,"cool":1},"yVwZ3BJ9BJkZqr-cDFos-Q":{"text":"Came here for a late evening cocktail. \nThe interior is awesome, you feel as if you are in","useful":1,"cool":1},"DzE_GYuDbsTMOENEYzuKrw":{"text":"This place is pricey but is worth it.  The cocktails were strong and well made, the servic","useful":1,"cool":0},"p7hlTbwRTmjIwITPrPLdxw":{"text":"Located next to Arnaud's Restaurant, the French 75 is a cocktail lounge where one can also","useful":2,"cool":1},"eYV6oFkxbMFu3E-siW58Ng":{"text":"Great staff, historic place, yummy nosh","useful":0,"cool":0},"tDs9j1pA7r6bEpSW4g9HUQ":{"text":"One of the best bar's I've ever been to.\n\nGreat service, ambiance, and drinks. Everything ","useful":1,"cool":0},"i2Zdkx1EDfAs6vFL5td_Ew":{"text":"I simply don't have the resources to enjoy the high art of cocktail making, but when in Ne","useful":0,"cool":0},"bgLkhZDPSR8rHx2afHuuYQ":{"text":"The drinks here were just okay.  My wife seemed to enjoy her French 75, but I didn't enjoy","useful":0,"cool":1},"6_4-boPvfWudLa9pGgU_6w":{"text":"Very historical looking.  If you're in NO, please do yourself a favor and don't miss Arnau","useful":0,"cool":0},"kDW3NpZ8WPMzXfoZ58n8CA":{"text":"I was here when it wasn't busy. Very swanky, but I wasn't made to feel unwelcome for being","useful":0,"cool":1},"H9CzMuu2iZzx72HLXC7ZEw":{"text":"Beautiful place delicious food  fish crabs kake volvería a vivírselo ,excelent servicio y ","useful":0,"cool":0},"8ArDE56qlvBawbR86byLZA":{"text":"I adore this place. The \"safari Victorian-esque\" decor just works. The cocktails were very","useful":2,"cool":1},"63742OkSBexY_NGGAdDm3Q":{"text":"The cocktails here are outrageously delicious. The bartenders are true craftsmen and can a","useful":0,"cool":1},"mXRyYpA3fQ1tdtmeNRYuog":{"text":"Make a reservation and follow the dress code. This place is really a must when in NOLA, me","useful":0,"cool":0},"QgYfGwadUd5NjMLv7t6XZA":{"text":"Good for first dates, old friends, and people with amnesia that think it's the 1920's. Thi","useful":0,"cool":1},"fV09r1iaiu8JTUJzntwHgw":{"text":"Do yourself a favor and start by ordering the French 75, the shrimp and andouille calas an","useful":0,"cool":0},"nV8iGfNe8XNDTerk2o6QeA":{"text":"I'm sitting in the French 75 bar at Arnaud's with my very handsome and dashing husband Ala","useful":0,"cool":0},"1VYfo9tx1nzIU9071hG55w":{"text":"The food is average so I feel the place is slightly overrated. The ambiance is trying VERY","useful":1,"cool":0},"dJDi5lOBSBiQ3jMLAQc2Cw":{"text":"All I can say is wow.  The food here is really amazing.  Wine list is deep and strong.  Th","useful":0,"cool":0},"7iCktnJKKQ23j1nrAWkSVw":{"text":"Must see the Mardi gras museum.  Arnaud's French 75 is a fantastic bar - very classy and e","useful":4,"cool":3},"mwVHo_gpvJtF6wyV5KnhNA":{"text":"Superb drinks. Excellent staff. I didn't eat but everything that came out for others looke","useful":0,"cool":0},"GUv-Ehnob44BeHKefrgAWA":{"text":"Chill and cozy spot just off of Bourbon.  Great old French decor, friendly/knowledgeable s","useful":0,"cool":0},"Kk9bVUkK-Uy01eWvzHAAIQ":{"text":"Great ambiance, deliciously balanced cocktails, and yummy food. The bartenders were knowle","useful":0,"cool":0},"ZOOJkXDBRo7jQ-LqRTPwxQ":{"text":"Arnaud's was the highlight of our eating festival in New Orleans. This is an elegant resta","useful":0,"cool":0},"Jvv9m-6zA-MRU6lKvafzbw":{"text":"This spot is on point. Great drinks. Attentive service. Comfy seats. Laidback vibe. Stella","useful":2,"cool":1},"0RNtA76W6bNpEkmldATg4g":{"text":"Solid classic cocktail here at French 75 (I mean, there's a classic cocktail named for thi","useful":1,"cool":1},"aadR3vuqS6vUPRDSMOmBAQ":{"text":"My family and I went here for dinner and it was wonderful. Bobby, Thomas, and Gary were ta","useful":1,"cool":0},"ayZku_eeVFlexz9btRJKYA":{"text":"This was an experience that started out good and ended very bad.  The place is beautiful, ","useful":0,"cool":0},"TRZQLeU7YUDiqsAGl_F0lA":{"text":"French 75 Bar at Arnaud's! What a exceptional experience! My fiancé experienced her first ","useful":1,"cool":0},"tqj_S32B5YCQpNGWXBTj2w":{"text":"Hands down best libation experience I had while visiting New Orleans. Sazerac was top notc","useful":0,"cool":0},"WBPntXiHS2UVTmbRMF843g":{"text":"Great speakeasy-ish vibe.  Great Old fashioned.  Cigar friendly.","useful":0,"cool":0},"FG173gmgyco6oRU2TTRibw":{"text":"Very cool ambiance. We had Sazeracs and French 75s which were mixed very well, even if the","useful":0,"cool":0},"jYJQo-BDo3bDojTeeJ4DGA":{"text":"Food was good but the service was TERRIBLE. Salad came out with entry and they forgot two ","useful":0,"cool":0},"ml93pFg62Z7Bb0vSHEvGjA":{"text":"If you love a cool cocktail bar, you really must check this place out. The interior is bea","useful":0,"cool":0},"O8xk_W-ZHyYPVMUa_D9A8A":{"text":"We were throughly disappointed with the service at this bar. We had heard so much about th","useful":1,"cool":0},"3_41834xQjos0DnCjqXVDA":{"text":"Great place to have a drink. The French 75 was a new one for me, and was a good start to t","useful":0,"cool":0},"oKdl_HKfchVYcycwlu3mog":{"text":"Excellent  Sazarac. El guapo old fashioned was tasty, but a bit sweet.  It was a little ha","useful":0,"cool":1},"syaFLnN9fk9t-OA35pkvQg":{"text":"Food is below average and overpriced. Nice decor. Friendly staff (not very professional si","useful":0,"cool":0},"RUFsiQ3575_GmbJ8qFlq4w":{"text":"A group of us were not exactly dressed upscale but they let us in anyway for drinks and de","useful":0,"cool":0},"y0insHGdBsUHyVT88fmUNw":{"text":"Honestly, we were so excited for this dinner but if I could I'd skip it and go back to Res","useful":1,"cool":0},"909bd-1d5KZm7YlXmGTQEw":{"text":"As much as I am not happy to give 3 stars , I have to. On the other hand I will say there ","useful":1,"cool":0},"GMEgnPXvNbNknoOzpO9VGA":{"text":"I really loved grabbing a cocktail here! The cocktails were exceptional -- we had a brandy","useful":1,"cool":2},"vyWt9b5xpT8en8Zlt5qaNQ":{"text":"We had dinner at 7pm on Monday 3.18.19 while on vacation. I had never dined at Arnaud's be","useful":0,"cool":0},"HSNIsk0AUf5zl7uVILysaQ":{"text":"We stopped by here in the middle of the day   during the Sugar Bowl. We had just come from","useful":0,"cool":1},"RIRSO2oL6oy-y0xbIUgAYQ":{"text":"Very relaxed atmosphere makes you forget bourbon street is just a few feet away. We got co","useful":0,"cool":0},"HjwZlhx2kf7AGzzcITrVdg":{"text":"Went for drinks on a Saturday night. Good ambiance, would be an ideal spot for drinks befo","useful":0,"cool":0},"QaX8jRu3gB38ILa7-rmVlQ":{"text":"We stopped in for a meal while visiting the French Quarter and were hoping to be \"wowed\" b","useful":2,"cool":0},"DyjT5cgAib6m34vH9S7Jrg":{"text":"I really am not a big fan of fine dining. It is not because I am a low key person who can ","useful":2,"cool":3},"P0B5mn7Ll-NqXgh92w8WFg":{"text":"Chris Hannah .... you rock!!!! \nCame for the French 75 but fell in love with your Dark and","useful":3,"cool":2},"QiVu029Twum-tLYpvPYT7w":{"text":"Stopped in for a French 75 after the Krewe du Vieux parade. Service was excellent, as was ","useful":0,"cool":0},"udTwUHUOCHYJg-wtWgecqA":{"text":"Classy bar. Bartenders are great. We stopped in for dessert and drinks and I could have st","useful":0,"cool":0},"L7u6qr7EVB_bzMIRqLRRVA":{"text":"This is a classy joint with classy drinks - a place I'd expect to find in DTLA or Chicago.","useful":0,"cool":0},"4FCGbf_5drDSoqKy_wzV7g":{"text":"This was recommended by the hotel concierge and although the food was good there were a fe","useful":1,"cool":0},"C8oNRSsUtzmseH2bJGAy2A":{"text":"This is a lovely cocktail bar! You'll enjoy plenty of atmosphere and attentive staff.","useful":0,"cool":0},"ggKggFh6P2SthBsoFpr7ZA":{"text":"One of the coolest places I've ever visited.  French 75 is a gorgeous, classic bar with so","useful":4,"cool":5},"1Q5NoPLNxZZjuLQqqe8__w":{"text":"Just wonderful.  Perfect drinks.  Wonderfull bar bites!  Just perfect.  Maybe cramped at t","useful":0,"cool":0},"xfoGYaX2TqTod6qQrf27OQ":{"text":"Have you ever seen that show Drunk History? Well, it doesn't have really anything to do wi","useful":11,"cool":8},"t9FiJqhZG0wf9-WZWrpd9g":{"text":"I've been to Arnaud's Restaurant for dinner but this time, I wanted to stop by the bar jus","useful":6,"cool":3},"cYfZzx7qSwtdZCiw0HeHcA":{"text":"Arnaud's really is an institution.  I simply knew I had to visit during a most recent trip","useful":2,"cool":2},"c0ShQKnTTYJBTiX1GpB5oQ":{"text":"I may be biased because we received some of the best service I have ever experienced in a ","useful":0,"cool":0},"ltaeZ6Bof-s6ZYSVmPtyCw":{"text":"Stopped in for a cocktail and potato puffs. We really enjoyed both, a must stop in NOLA ev","useful":0,"cool":1},"Uxy9IYd_9NSqcrO5gZw5FA":{"text":"I gave this two stars because the food was good. But I came for my birthday and for a 262 ","useful":0,"cool":0},"HedqZ1lVFlc5GczNQPWN3w":{"text":"Elegant but not stuffy is the best description of this gem, connected to the excellent Arn","useful":0,"cool":1},"01JSdDFw1tsOI25Zwi4G9Q":{"text":"Customer service is excellent! They gave me a \"finger bath with lemon\" to wash my hands af","useful":0,"cool":0},"l1bQskx1BFFkYTNo0bSpXA":{"text":"Famous for the French 75, but also makes the best traditional Pimm's Cup I've had. History","useful":1,"cool":0},"Zpj2KEsQnZCJUe28LYEgdw":{"text":"Just a drink and appetizers for this visit.  The bar is small, intimate, elegant.  The ser","useful":0,"cool":0},"1YqQHAHlDXbthn7pF6NrOg":{"text":"This review is for Richelieu's Bar . Wanted to get a French 75 at the French 75 Bar! So st","useful":2,"cool":1},"zJ00U8sNDsPQgN0aWnpPXw":{"text":"The menus are so beautiful- I wanted to take one home with me!\n\nWe were here for V-day din","useful":1,"cool":0},"FIYlkeJsQ3nJ6FVELqBwTA":{"text":"Way overpriced; one person input group was double-charged on their credit card; the food w","useful":0,"cool":0},"hj17dctbQZKzGOLbfOKDxQ":{"text":"Terrific ambience.  Great cocktails.  What more could you want in the big easy.  Apparentl","useful":0,"cool":0},"BMcyLnNgvfHKQWKqLEcmrw":{"text":"Good cocktail but nothing to write home about. The bar was not only mostly empty but there","useful":0,"cool":0},"9vxc2fZNQfNmG75FFVuuYg":{"text":"Probably my favorite place for a fancy drink. Do clean up...people are fancy here. My favo","useful":7,"cool":5},"JZeTE13spxDV_0OzzAqDxw":{"text":"After exploring countless bars on my first visit to NO, French 75 was THE best. \n\nWhen you","useful":1,"cool":2},"zgwQzGwHKLL4_dIOP-PlCw":{"text":"A bit disappointing, we made a reservation to celebrate an occasion. Upon arriving there w","useful":0,"cool":0},"1Q1WnFzC8TqsPaNa4QPNhg":{"text":"This was easily the best experience I had in my visit to New Orleans. It's not often that ","useful":0,"cool":0},"9hBCzjDmzn01psY7mcHnhg":{"text":"Great quiet bar. Classy ambiance and good drinks. Was a welcome break from the noisy bourb","useful":0,"cool":0},"O3XfeRMqyOsAomtcbqSu2g":{"text":"My wife and I made a reservation to celebrate a special occasion. despite having reservati","useful":0,"cool":0},"5OhIqdkP6zJCdz0PZql9Eg":{"text":"Chris hannah makes a great Sazerac. He was also friendly and engaging. Sit at the bar, wat","useful":1,"cool":0},"poZDJxfMCg96wq3JYxGT8g":{"text":"This place has the best bartender team in the French Quarter. They were all great, especia","useful":0,"cool":0},"Z9ygxdg-vxi00EFKlNhcuw":{"text":"Food is fantastic, service is world-class.  Came with my bachelor party before my wedding ","useful":0,"cool":0},"ukGUv0ZbtQtZkI9Chq2TzA":{"text":"Had dinner in the bar.\n\nPluses:\nBeautiful space and great ambiance.\nGood service\n\nMinuses:","useful":0,"cool":0},"hizQijDoVqnMGATgsn4K0A":{"text":"This was a very nice spot to come to for drinks. It is small and intimate and a great spot","useful":0,"cool":0},"GKoQzSJWlIbP34wX-IujdQ":{"text":"Now I can completely relate to Owen Wilson's character in Midnight in Paris. Walking into ","useful":2,"cool":2},"ZgBcUQOjAxoCvS0egDxu0A":{"text":"Great food service I would highly recommend it if you are in Nola. Best restaurant on Bour","useful":0,"cool":0},"_cQtM1EFxgN_3-JV-8Z6cg":{"text":"Classy bar in the French Quarter that happened to be right around the corner from our hote","useful":1,"cool":0},"PwckXUJE_WNGnzfHprVtUQ":{"text":"The appetizers were amazing the crab prentiss was rich and creamy, the alligator sausage w","useful":0,"cool":0},"MGyAMX52I3uKnM2_czPqNw":{"text":"Way too loud! The acoustics are terrible, maybe the tile floors contributed to the noise. ","useful":0,"cool":1},"VMK_JPZTTpj5Q0uvQvCJNA":{"text":"Nice, classy lounge. Super polite, prompt service. Wide variety of cocktails. Even if noth","useful":0,"cool":0},"__palzD_P_M89uH6d1Xulg":{"text":"Based solely on experience, Aurnaud's was a wonderful restaurant for dinner. \n\nThe space i","useful":3,"cool":2},"q3Z8nSbvQ3ho-nvgvuqgAQ":{"text":"I feel like this is the perfect, classy bar from a bygone era. It has the old school ambia","useful":0,"cool":0},"tHOYiLal3Uehkijx6-npLA":{"text":"The best. Just the best. Cocktails and bar snacks are delicious, ambiance is classy, low l","useful":0,"cool":1},"yHrh5XzQZ19S5GoqXK51-g":{"text":"I loved this place as you feel completely transported back into time away from the debauch","useful":1,"cool":0},"41zwu3B4YB0cMBe2o88lXQ":{"text":"We had a group of approximately 15. We got to the restaurant at 7:00ish. Ordered drinks at","useful":0,"cool":0},"zsD1u8qcLyk__sVR8bRTlQ":{"text":"The cocktails and service was so great here, we cane here twice! First, let's focus on the","useful":5,"cool":2},"8PicStn0XYO04znf7hvaXA":{"text":"I'm a classic cocktail girl at heart, so this place had been on my list for NOLA for some ","useful":1,"cool":1},"lsICr8czsm4tTNMxwVsrlA":{"text":"Great cocktails, ambiance, and service. But...as a tourist, I didn't realize that smoking ","useful":0,"cool":0},"-BzAIbDeiSb73nfNuK3D0Q":{"text":"We arrived with expectations high, after seeing rave reviews on Fox News.  Atmosphere was ","useful":0,"cool":0},"TkwrnIYldA_0E-mEquy92Q":{"text":"Fantastic bartenders that have extensive knowledge in classic cocktails. Old fashioned and","useful":2,"cool":1},"NZGsLJ_DBlX2z3dmvvJcTw":{"text":"So many places to eat...this place was simply fantastic. Started with their house cocktail","useful":0,"cool":0},"GAFxNIDqcYrIhLV4KYXOzw":{"text":"This bar is exactly opposite everything around it. Its just past the Bourbon street madnes","useful":0,"cool":1},"Q7nOGD1Qq4cnhO6k4X27FA":{"text":"A great place to duck away from the chaos of Bourbon Street during Mardi Gras. French 75 h","useful":0,"cool":0},"TXeI6ZkDdZ_U_DE2MjCjbg":{"text":"I finally got myself to this gorgeous spot after meaning to for a very long time.  Chris H","useful":7,"cool":4},"ymOr3soZ_rEkRGgEIOtpNA":{"text":"Sunday brunch is absolutely amazing!! LIve Jazz music with your meal is hard to beat.  The","useful":0,"cool":0},"7hyVjJVHgGOQJpyKzr3pBQ":{"text":"Incredible French 75, beautiful bar, very classic scene.  The only issue (and the reason I","useful":1,"cool":0},"W5Qh9xvshq1mB5-r4GAShg":{"text":"Extremely classy old-school New Orleans bar just steps away from the madness of Bourbon St","useful":2,"cool":1},"YRxQ5LPcjb3rf6p5JPG-7g":{"text":"First things first, their cocktails are amazing! \n\nDeep fried fish with beans was deliciou","useful":1,"cool":0},"H-tM8qpBm-Lwnt2MGkYftw":{"text":"Just spent a week in Nola. Had Sazeracs at every major cocktail bar to see which was best.","useful":0,"cool":0},"UFXfMA3qPRFqvuK_NB-AVQ":{"text":"Never had escargot before. Tried it hear it was not bad the crab legs are the best I love ","useful":0,"cool":0},"VQ4PJvP8MnuHXmdUg8N6jg":{"text":"This place is trapped in 1920.  The food is heavy and French.  The service is extremely fo","useful":0,"cool":0},"bmujw48G8qhuaXAeO6Tziw":{"text":"Coming off my third visit here, I can't say enough good things about Arnaud's French 75. T","useful":13,"cool":11},"UTuQdyTS1R9g7iKD9zuHgg":{"text":"The bartender over at 21st Amendment confirmed that French 75 was a must-see, and off to t","useful":0,"cool":0},"0Uglzw6ep3PMFCVsljwKsQ":{"text":"We had high expectations based on recommendations from the area.  While the food itself wa","useful":0,"cool":0},"KumxFsVWzwSC8YBCq47TEQ":{"text":"We raced in here 15 minutes before close on Saturday night. This is a beautiful old school","useful":0,"cool":0},"h2HekuK2jrDLufegX1evGw":{"text":"What a fun bar!  It's refined and yet laid back at the same time.  Home of the famous Fren","useful":0,"cool":1},"zTaB_byCUxTL9skDTfCxVw":{"text":"We would have stayed for a drink but the overall stinch inside this place was toooooooooo ","useful":1,"cool":2},"HPgM1YloYFCVg-9s7N9Ypw":{"text":"Classy. Sophisticated. Timeless. Intimate. If you want to feel like you just walked onto t","useful":1,"cool":2},"Ee7Jy8Jb3WLz52szz_Iiig":{"text":"Stopped in just to try the French 75 since our waiter at GW Fins, the restaurant across th","useful":1,"cool":0},"ZWq4dP_euTkTVy_OoB_IwA":{"text":"I love Sazeracs, so my trip to New Orleans would not have been complete without one. I did","useful":2,"cool":1},"4-ijQGJNheuJlLGzjTstvA":{"text":"The staff was so sweet which is why they get 2 stars. But the food was some of the worst I","useful":0,"cool":0},"cXM3ieSmRvvDfsXzZrF_LA":{"text":"Great spot for a romantic dinner, live jazz band was a great touch to the evening. The foo","useful":0,"cool":0},"9RkBQYz4i2HDnPmjQn2GpQ":{"text":"Our experience was AWFUL!\nArnaud's has changed Owners, I hear, and it is evident.  The res","useful":2,"cool":0},"-AKYBUwfrRonL1Y7_Ge4JQ":{"text":"I've visited this classy place a few times for drinks. Best French 75 I've ever had. Serio","useful":0,"cool":1},"B7-goKxd_EZZJdepEgUmuw":{"text":"Swanky and fun; great (expensive) cocktails but where else can you get a French 75 from th","useful":0,"cool":0},"Ihe2RFZUSiUGNtvmjJOHVA":{"text":"Great, quiet, classy bar. Came in last night with my partner to order a Rebennack in honor","useful":1,"cool":0},"l5sSJFce-FVuhPXzSa5N3w":{"text":"Charming well groomed bar.  Perfect atmosphere. We stopped in for a cool drink on a very h","useful":0,"cool":0},"_GPJ1Q8eXipMxS1F4hEyKA":{"text":"Best chicken I've ever had in my entire 23 years walking this earth. The best service I've","useful":0,"cool":0},"M4UMhcnqOzINnHXOsgmQpg":{"text":"Bartenders are the best in New Orleans. \n\nThey are true mixologists. \n\nSetting is calm and","useful":0,"cool":1},"8gqbwobroVL-JFaSbE7ANw":{"text":"Came here as a largish group on a Sunday night. It was quite busy but they managed to take","useful":3,"cool":0},"W2kiYznBlZP6wVrqVIY1qQ":{"text":"A friend and I had to come here to get a cocktail..... That's what they're know for, right","useful":1,"cool":1},"7n-LrOMRxSny0m2l0i0gew":{"text":"Wonderful spot for a classic cocktail. I wish it was bigger, though. Seating is limited. I","useful":0,"cool":0},"jQgAQO0QpHm1uTq0pn41Gw":{"text":"Arnaud's French 75 is definitely my favourite cocktail bar I visited during my Weekend in ","useful":2,"cool":1},"m_X3VtS9cyG9KP7ZiO0MXg":{"text":"We absolutely loved this place. Such a wonderfully elegant throwback cocktail bar. Truth. ","useful":1,"cool":2},"XvQV8_ar0VFE9Al0oyd9Hw":{"text":"This bar has been on my bucket list for a long time and I'm so glad I got to experience it","useful":3,"cool":3},"1JS4EO2tXPP0X7cbAGqMKw":{"text":"Best cocktail bar in New Orleans. After having so many overly sugary drinks in New Orleans","useful":2,"cool":1},"tV1ruh_mbW032fVHKUyd1w":{"text":"My husband and I loved the atmosphere and the best cocktails ever. We also went to have di","useful":0,"cool":0},"AFLMCf8fDVvGTf9Gga6MjQ":{"text":"For an exceptional and VIP experience, come have a drink at the classy, upscale Arnaud's F","useful":12,"cool":12},"ZuF90pPQIBr7XtqCCLzoUw":{"text":"I can't say I ever deliberately crave \"turtle\", but this menu item jumped out at me amidst","useful":4,"cool":3},"ltTgZ8Rkl9GXYgqdnOzCVg":{"text":"Great food, service  and ambiance.  Highly recommend the escargot and the veal.  Eddie the","useful":0,"cool":0},"kyAFuBfjUdKt61UBU6MGmA":{"text":"We visited Armaud's last night. The pros: nice, semi-upscale environment in the very busy ","useful":0,"cool":0},"eyxvIHFvqq9mC4UEq9bI4A":{"text":"Well this is already my favorite bar in the quarter! It is just everything you want in a c","useful":0,"cool":1},"oNTL_Qw4_K0w2cPzObfofw":{"text":"One of our favorite bars in the city!   Chris Hannah is a genius and never lets my wife an","useful":2,"cool":1},"fJ5eh0BeXEXY83y_46dLGQ":{"text":"They kept us waiting just to tell us there's no table available. Didn't even make an effor","useful":0,"cool":0},"-cao_XaQeg2KZV8ewJ5olA":{"text":"This was the very first bar we visited in NOLA and it spoiled us! Bartender Vincent was so","useful":0,"cool":0},"FkuqT8BdZmAeWTng3PECcw":{"text":"We went to this bar on Friday night. Great atmosphere! They are very good with all the cov","useful":0,"cool":0},"R8V-fFLg0qrJDxL53jxeKw":{"text":"We had a seven course meal here.  Both the redfish and the fillet were the best I have eve","useful":1,"cool":1},"ooAPUrzijLMCw-CCHY6gTQ":{"text":"I chose to make reservations here to celebrate my 40th birthday in November 2019. BEST DEC","useful":0,"cool":0},"psOdDUD66iRYA35rvO8_5g":{"text":"Great happy hour on Friday 3-5:30pm but even without that it's the pace to be. Chris Hanna","useful":3,"cool":1},"Dbzqv9ypzvxOx9Tkzikzvg":{"text":"Connected to Arnaud's restaurant, a classic creole restaurant in the French Quarter. The b","useful":4,"cool":2},"scLIK_9_nzCZdFi_LN09bA":{"text":"Fantastic!  This is the type of restaurant that I reserve a 5* rating.  When I come to NOL","useful":0,"cool":0},"dQG_pwOGibCbWP8dI9OO4g":{"text":"Wow!\nThis is a perfect place to start your night off with a fantastic cocktail. They have ","useful":5,"cool":4},"xZmGhLib0DXy_0xy49R-GQ":{"text":"If you visit New Orleans and don't grab a drink or dine at Arnaud's - did you really go to","useful":4,"cool":2},"Q8iq1vNVxqfzHu0HT9GCPw":{"text":"Escape from Quarter just steps off Bourbon. Dip in for their signature namesake drink. 3.5","useful":0,"cool":0},"G1rdmCRZ2OBwWMBWNAzisw":{"text":"This one was just OK, didn't measure up to all of the hype. Service has great dough. They ","useful":0,"cool":0},"_F-AAVM7zcPLinF8HeBFww":{"text":"Old world respite from sugar and iced bourbon street drinks. This is where you go to have ","useful":0,"cool":0},"CRrIHwW9BSZp95NfQ4YjhQ":{"text":"The cocktails were good and the interior and decor were a sight....\n\nHowever, this place r","useful":2,"cool":1},"Blh77DnN9Mtn_WzGWIrFyw":{"text":"Stasia and Austin were amazing!  So comfortable and happy with the food and drinks!  Had t","useful":0,"cool":0},"-_7ymwDI8v1OL-zzMk7zzg":{"text":"OMG Delish! My mother and I both had the Gulf Fish Potato Crusted with a Buttery Fennel Sa","useful":3,"cool":3},"4Y_45y_rttupEVG1aNex5A":{"text":"Walk in to French 75 at around 9pm. Immediately turn right or left to grab one of the nook","useful":4,"cool":5},"T2u-9AjDceSHQ-iTBvtCGA":{"text":"We only did the bar but that was enough for me. Awesome. I love a clean professional drink","useful":0,"cool":0},"XYQzDB71HBKsyxj9QZKojw":{"text":"I was very impressed with my meal at Arnaud's. I ordered the quail and it was delicious! \n","useful":1,"cool":1},"MlyB6QhYovSSBxYB69Sjew":{"text":"Get the French 75 from the original. It's a great drink.","useful":0,"cool":0},"cUVlHjk6-0uZmKBKJxG4kQ":{"text":"OK - the drinks are decent and the service is good. I suppose it's a good place given that","useful":1,"cool":0},"XM1Zxqi8IIB5cSyo3-92Dw":{"text":"My husband and I decided to dine here for dinner to experience one of the old family owned","useful":1,"cool":3},"GUhlmwZj6MHCI4wIwjo-QQ":{"text":"I had heard nothing but good things about this place before we came here, even a couple of","useful":5,"cool":6},"bD7ytd2zXgv3ewp8aXRb0A":{"text":"Arnaud's French 75 is conveniently located off of Bourbon Street in the French Quarter. Th","useful":0,"cool":3},"WsdhCf6kqdBeXaGaBR55Dw":{"text":"French 75. I could probably finish the review there, but I won't, but I probably should. Y","useful":15,"cool":17},"zCys8pHrGUFLuMmjAogxNQ":{"text":"We had drinks before dinner and then dinner in the main area. I was way more impressed wit","useful":0,"cool":0},"dobW1b8y-WWkyuNrqFXLRA":{"text":"Very delicious, everything! We went during the Valentines Day Brunch so we got 3 courses.","useful":0,"cool":0},"ENXTWM2AAqtNfjNmCYydoA":{"text":"OF COURSE IT'S THE BEST FRENCH 75 IN TOWN\nalbeit pricey and never on happy hour. It'll set","useful":10,"cool":5},"xYfzzhgT2Sg9K6URAkvqXA":{"text":"Arnaud's French 75 is connected to Arnaud's restaurant, but has its own entrance.  A lot o","useful":1,"cool":1},"-wixjlzMY2wmQT-tP7S0wQ":{"text":"Such a great bar! Very laid back and unbelievably comfortable. The staff is so accommodati","useful":1,"cool":1},"pSqFCtEi5DtI8mH_iPsf8g":{"text":"i came here with some friends when i was in town.. only got drinks but loved it here.. has","useful":0,"cool":0},"hQQ7bxAInWdP-uGbWPlmDg":{"text":"Nice atmosphere. Cocktails were mediocre and over priced. Go to Napeleon's House instead.","useful":0,"cool":0},"KsOEWrbCCFxnmKiXiWGHjQ":{"text":"Delicious food . The place even is located close to Bourbon St doesn't feel like it. Amazi","useful":0,"cool":0},"AMlJXQa0BPq_hMNxLGbcrA":{"text":"Absolutely fantastic. From the food to the service to the ambience , it couldn't have been","useful":0,"cool":0},"b848mFnxgZo5NZXaFe2kyg":{"text":"I can't speak to the food, but their drinks are top notch. The ambience is definitely upsc","useful":0,"cool":1},"BeAGZCC3b_Ak2GL3iNwNxg":{"text":"Classic old money bar - in the best way. Business meetings and romantic dates mean you're ","useful":0,"cool":0},"j2Y1oH3Wxz8phvkxU2gYYA":{"text":"Best bar & best bartender (Chris Hannah) in New Orleans. French 75 is my favorite place to","useful":4,"cool":0},"oWagFMkz_MPSk614tICtmw":{"text":"Unfortunately their hostess and customer service needs a lot of work.  Went in twice and c","useful":0,"cool":0},"bVRcuaHwkisH07P3DcU77g":{"text":"Arnaud's French 75 is great. In fact, it may be my new favorite fancy pants establishment.","useful":10,"cool":8},"jK4va5LVcIBbEz0xUURxDA":{"text":"In the *spirit* of Tales of the Cocktail, the time has come for me to at long last review ","useful":13,"cool":11},"kXqnt0tXLDNBbAr47-uuxg":{"text":"I tell you what. There are a few places that I am willing to go, spend over a hundred buck","useful":1,"cool":2},"RYrtDuX99GgD0ZRLx0HJYA":{"text":"I just got back from New Orleans a few days ago, and out of the many bars I went to, this ","useful":3,"cool":3},"PqV-qEiPZqMGRlpGPH-BTQ":{"text":"Super knowledgeable bartenders. My wife and I dressed up and had an incredibly fun time tr","useful":0,"cool":0},"4CuBbGVVx0taAcybf0t_uA":{"text":"Anniversary dinners should not be held anywhere else. Classy restaurant with the service y","useful":0,"cool":0},"TS8aoqOkbpqvKxs2fEIP3w":{"text":"Jonny O and the Creole tomato salad. Those are the two most memorable parts of my dining e","useful":1,"cool":0},"fZ7IDuA1lIQMF95sZKAJJg":{"text":"Loved this bar must try the pear cobbler. It has such a old school charm to it and as a bo","useful":0,"cool":0},"MS13wYfp_8Lnu4deTaGIRg":{"text":"So glad my friend wanted to try this place out. Cocktails are more than reasonably priced ","useful":1,"cool":1},"y6i4RHwmfaYQix90lxbh4A":{"text":"Why 3 stars? Because nothing seemed to click.\n\n   ---   ---   ---\n\nI, along with two frien","useful":4,"cool":2},"XpyJZQRjU3yWp-UpvcB5LQ":{"text":"Amazing! This is what every classy cocktail bar aspires to be. I visited during the Christ","useful":0,"cool":1},"mctrQBqMiw8okoDZHFd5yA":{"text":"The worst, worst seafood gumbo!  Rubbery seafood and no favor.    Everything else was perf","useful":0,"cool":0},"S2O0m_s0wFvpqfSnEQykeA":{"text":"We came here for a rehearsal dinner, with one of the large rooms booked upstairs. First th","useful":52,"cool":48},"TfPJTVBbQOA2YQatkLkmnQ":{"text":"Came here only to try a French 75. This is my favorite cocktail so had to get one at the p","useful":0,"cool":1},"c0UkMRwHm35Cv3SslKHSOw":{"text":"We have been to Arnaud's French 75 in the past, and this time we went, it was just as good","useful":1,"cool":1},"PQExVOsnmfgWQE98Rnj2hw":{"text":"Surprisingly, finding a good bar in the French Quarter is actually pretty difficult.  Most","useful":12,"cool":8},"gi0VRIK2TFZGEKqGppXdrA":{"text":"Cute spot off of bourbon st. The drinks and service are great. \nI got the potato soufflé f","useful":0,"cool":0},"9WUZhGYFSJdZTPIuwyM5uQ":{"text":"In a city that is filled with active buildings that are older than our country, one is for","useful":3,"cool":1},"dsyGnYVhOw0N8dFe-y9whw":{"text":"It is beautiful and delicious. We went for brunch on Saturday morning - which is a bit pri","useful":2,"cool":1},"sF3q56eWbpl9VRZVj72TxA":{"text":"Several hours before the Sugar Bowl, we stroll into Arnaud's for some cocktails.\n\nArnaud's","useful":2,"cool":1},"g_QdMzP4um8kGw_16MjtKg":{"text":"Came here with company and 20 clients.  Was one of the BEST meals I've ever had.  Drinks w","useful":0,"cool":0},"x2HY1fOsNwRsMbv9Y6DfNQ":{"text":"Saw this on Anthony bourdain and just had to try it. Very fancy even in the bathrooms the ","useful":1,"cool":3},"Y-_fKgMM6RpEJtzF67VLXA":{"text":"Fantastic spot attached to Arnaud's Restaurant. We found the bar no problem and entered it","useful":2,"cool":0},"QXblLsk0cL-JmfGaiws2-Q":{"text":"One of the best in the city. Highly recommend the frog legs and turtle soup. The French 75","useful":1,"cool":1},"F93gScWAkZzbGcI8DPD6aQ":{"text":"This is probably the only occasion I will ever write that I preferred a place before the s","useful":15,"cool":10},"CButyayPfqHOSJ7lGyef9g":{"text":"I hate and loathe people who give bad reviews of places based on one-off factors that are ","useful":3,"cool":1},"w5RzGB3sixCN0UiS2qezrg":{"text":"Great cocktail bar!  Charming and fantastic cocktails.  Come here.  I only wish they had b","useful":2,"cool":2},"aB_CWU45L0YcmN-oSCOQkA":{"text":"Boy oh boy, did we get lucky at Arnaud's!\n\nWe don't normally do a lot of dining in the Fre","useful":2,"cool":1},"CjTr73SNZrAJKNs7eoL8Yw":{"text":"Any place in the French Quarter can be at the mercy of tourists for both revenue and reput","useful":0,"cool":3},"k3hGGdHe6JfsUF1ZBcCcEQ":{"text":"Great cocktails, delicious baked oysters. They are proud of their heritage and of upholdin","useful":3,"cool":3},"Ol-DrgIr5vzbo5ZfJGTpGw":{"text":"If I could give 0 star I will. Dont come here if you want to experience racist service. My","useful":1,"cool":0},"fcUR9gQIqpqPCR-1jOt_Cg":{"text":"Chilly atmosphere, from the AC and the waiters. One of them recommended a cocktail to warm","useful":1,"cool":0},"10Ge-yurRBM6V_1vH3d40w":{"text":"This place is top notch. Say in the bar waiting for our reservation and had escargot and c","useful":1,"cool":0},"Ks8IW6bjzPlsayIGcATfnA":{"text":"Perfect highlight on a whirlwind trip to New Orleans. The food was classic and the service","useful":1,"cool":0},"mJnhZEA2FGBa4Z8imhrs2A":{"text":"Fantastic drinks - definitely order something complicated as the bartenders are up to the ","useful":0,"cool":0},"uasFXLA2kXs-oonpARHMIg":{"text":"We ordered a $120 bottle of champagne that retails for $40.  It's a restaurant we are ok o","useful":1,"cool":0},"pOL_ZONhHtlH6bU1JZId9g":{"text":"Horrible place, really bad attitude from receptionist, lied to my group and belittled my w","useful":0,"cool":1},"2us2Ln2Om9G5mAe5SHAwrw":{"text":"The star power attracted me, the professional staff sealed my fate. White table cloths, ha","useful":1,"cool":1},"DdmJhghCG0SvrWM_MQC9Fg":{"text":"Love love love this place. \n\nWon James beard award for best bar in America in 2017. Fantas","useful":2,"cool":0},"2_0xgSrijoaolLGnsOtufQ":{"text":"I'm only giving this place five stars because I cannot give it ten. I discovered Arnaud's ","useful":1,"cool":2},"iNZHcPXf_X3AWAfATdKtvQ":{"text":"We had excellent drinks, service and atmosphere.  I would go back for sure, but it is a li","useful":0,"cool":0},"LCHX8xaaXFlb6IxRF2mSRQ":{"text":"Looks old and probably has a lot of history.  I was a little tipsy coming in and a lot goi","useful":1,"cool":0},"p0X_JOOoxd4fzMXIuoDg4A":{"text":"We stopped into Arnaud's for some pre-dinner drinks and to imbibe and pay homage to the OG","useful":4,"cool":3},"dD2Q2YRYbpNPUP7uk46O_w":{"text":"This started out as a two star review but my group left so annoyed that we decided one was","useful":0,"cool":0},"AYK7YBT_OHh0v87MmYZWAg":{"text":"This is the bar attached (next to) Arnaud's.  \n\nIt is a beautiful over-stuffed leather cha","useful":1,"cool":0},"lY5qoxRspkpHcuP6A6XdrQ":{"text":"One of the worst restaurants I've ever been to. The food at every turn and every course wa","useful":1,"cool":0},"hcLTfJtn3VJxR10XGQ1Qtw":{"text":"Excellent spot for classy cocktails and a break from the madness of Bourbon Street.\n\nMy wi","useful":1,"cool":0},"BYyfLazSugCnvMbeSkXRyg":{"text":"Such a good choice for our anniversary brunch. The service was spectacular. We made a rese","useful":2,"cool":2},"Bk4P8mq1u6v9bBFOYGhQAg":{"text":"Absolutely one of the most fantastic dining experiences I have ever had. The food was ligh","useful":0,"cool":0},"xgrEBGg3prBo3UmDEpQs0A":{"text":"Brought some friends here while they were visiting for Jazz Fest. We got lucky with a tabl","useful":2,"cool":1},"xzD2SggdysYsHZRLx792_w":{"text":"Who doesn't love old world charm, friendly bartenders and strong drinks?  Perhaps it was t","useful":1,"cool":0},"EVnGkpwB6DOnmmUv5m-7kA":{"text":"I really enjoyed this restaurant from the service to the music to the meal, overall a grea","useful":10,"cool":4},"egFe3Z0_LGlm-6QXcLTYnQ":{"text":"So nice to have my favorite cocktail (French 75) made perfectly! Arnaud's is definitelyyyy","useful":7,"cool":8},"oUCf4MutPqIVxK7jZvyqGQ":{"text":"I have come here both times I have traveled to NOLA, and I love it!\nBoth times, I was with","useful":8,"cool":2},"3AuEao10eWagqHpn9lKOiQ":{"text":"Biggest rip-off I've experienced in a long time. They should be ashamed of the \"food\" on t","useful":0,"cool":1},"zjtBCL1KcddL3VeFBhObJQ":{"text":"Holy smokes what a fantastic Thanksgiving dinner at Arnaud's. Beautiful French restaurant ","useful":3,"cool":2},"_n5OwGnYQY3-1pooUrXqpw":{"text":"I end up here with a group several times a year prior to a long, fun lunch in Arnaud's and","useful":9,"cool":5},"vGYJVYUKeREOS6a9-vgzfA":{"text":"Simply put, Arnaud's French 75 bar is like taking a step back in time. This is the closest","useful":0,"cool":1},"DD3MZuq0qrqDbQnSUBUjYg":{"text":"Went to this bar last night, discovered their racist esthetic claimed as \"1920s safari the","useful":1,"cool":0},"Xyn-QSJU4ERwRfF91Jpnew":{"text":"Well, this place was a breath of fresh air! We were trying to find a place to grab some co","useful":1,"cool":1},"WWKWApJ55AGf4Hng3sSjqw":{"text":"French 75 bar discriminates against asians.\n\nOrdered 2 drinks and 2 appetizers at 6pm on T","useful":1,"cool":0},"5YxO6v9fNdqxxIBm8KAvWw":{"text":"Meal came luke warm and was rather tasteless and highly overpriced for the quality I got. ","useful":1,"cool":0},"Gzau92gJvnHZ8EsInsQyYg":{"text":"I had very high hopes for this bar back in February. My mom and I came here after a dinner","useful":0,"cool":0},"XWyakSweCuGjWDsCl_07_g":{"text":"I really, really love this bar and would say this is a must-visit, especially if you're a ","useful":3,"cool":0}}