{"GL6PSspqWW5SxTeFdd4zYQ":{"text":"The Batt Brothers are da best docs in the city. Best service and takes the time to explain","useful":0,"cool":0},"UBe8y3kQBLU-QdjWfVCkXg":{"text":"We loved everything about our experience. The staff was extremely friendly and the bill wa","useful":0,"cool":0},"_fN1eCFatcV29aeS0IqgGA":{"text":"These are the best vets.  I am a little bit visually disabled so they work with me.  they ","useful":0,"cool":0},"bH6algshyA6xQK5Zek8zGw":{"text":"Dr. Batt will bend over backwards for his patients and clients. He does what is right for ","useful":2,"cool":0},"4_Xz2jATfYZFfLlXZwSyaw":{"text":"The doctors Batt are amazing!! They are so knowledgeable and caring. It feels a bit like g","useful":1,"cool":0},"1YAIRSYcSKIDsrgVIEAALQ":{"text":"The best veterinary service I've ever utilized. The whole crew makes sure that every time ","useful":2,"cool":0},"aIYJ6V2mOV8rQN4yGNQFbg":{"text":"This is the greatest group of people all working for one business. The Drs, the Batt broth","useful":0,"cool":0},"CUEA2rBywEAoeETFsgBAYQ":{"text":"These doctors are fantastic! I have a pet with a very unique health situation that few vet","useful":0,"cool":0},"EcFF88SvvduncWixbr_a2A":{"text":"I happened to come across Batt Vet when looking for at home euthanasia options for my dog.","useful":2,"cool":0},"VSMnHdlqdeFRdEjgTjpqgg":{"text":"Love this vet. Greeted by Gertie the goat who thinks she's a dog. Friendly staff. Knowledg","useful":1,"cool":0},"R7wENJZZ1QmTwdmuYVrrgw":{"text":"These guys are the best. I adopted a dog from Kane Haven Rescue and they recommended I bri","useful":0,"cool":0},"THIZQRp9GCb9xELkkRIQgA":{"text":"Hands down the best veterinary services in the Orleans and Jefferson area . They provide e","useful":0,"cool":0},"uWbhCs6SdiYWvbIYI5TUQg":{"text":"Batt gave our dog a heart worms preventative when we specifically asked them not to (we ca","useful":0,"cool":0},"ZU1fGi1cRVdBha8IVUI1Yw":{"text":"This place is a mess. No concern for your time or money. Vain as all possible. They are te","useful":1,"cool":0},"f3BL51PUyssToH2lDUje7g":{"text":"Hats off to Dr Batt and his tech Steven for their home service.  They made a difficult day","useful":0,"cool":0},"LSa74qtFLzJCC70G3SzSsw":{"text":"I have only been bringing my dogs to the Batt brothers for 6 months but 10 minutes after I","useful":0,"cool":0},"b5yIzlzPn-cpI6ARvFrj9A":{"text":"My puppy was there for her rabies shot and heart worm medicine. She was returned to me in ","useful":2,"cool":0}}