{"0ogJmIOH-JIxl1AogHCgoQ":{"text":"I highly recommend this doctor and office! \nDr. Tripp is a lifesaver! I cracked my tooth i","useful":4,"cool":0},"8HsYhu_owR_hSjcBkPcdGQ":{"text":"I got in right away they didn't charge me for x rays cause I brought recent ones they coul","useful":0,"cool":0},"kUJgiNl44wEedwFI-PFCYQ":{"text":"If you're looking for a dentist in NOLA, Dr. Tripp is your guy! My first visit to see Dr. ","useful":3,"cool":0},"kTgJgBLYwnQngTK5GwGsiQ":{"text":"This is my 2nd visit to Dr. Tripp and on both occasions I was uber impressed with the prof","useful":8,"cool":1},"abk7HqMqKtB7jNN_6BOLvg":{"text":"Dr. Tripp was excellent. He was gentle and professional throughout my exam. My complaint i","useful":3,"cool":0},"FL3G2vdMBQncLgCFokhwuA":{"text":"Dr. Tripp was excellent. He was gentle and professional throughout my exam. My complaint i","useful":0,"cool":0},"bD4rHr44mzw4nBGBZ4DN0Q":{"text":"I'm so thrilled that I made an appointment with Dr.Tripp...omg my tooth cracked and needed","useful":1,"cool":0},"ACBqraQM53As7jJmIlOMjw":{"text":"I wanted to put my exact Google review here as well 'cause I'd like for Dr. Tripp & his te","useful":0,"cool":0},"OLcHEExY3nwvkWouLR3z3w":{"text":"Dr Tripp is the best! Very nice office, massage chairs, and friendly staff! They schedule ","useful":1,"cool":1},"DxxjEpQ09W4UULC0C08qtQ":{"text":"I'm here visiting and Dr. Tripp took great care of me! It's always scary having to visit a","useful":0,"cool":0},"8QrWMcZMKGHm50JzlJrv9g":{"text":"I was on my bachelorette trip in New Orleans and as the weekend started, my lumineer (vene","useful":6,"cool":0},"qPx6KE0qDf9kh5lDXG5JHw":{"text":"Dr. Tripp and his staff were courteous, punctual with very little wait time. They answered","useful":1,"cool":0},"NjoTy5_yZDb0nMZ9nbNCTQ":{"text":"The wait time was not extremely long, maybe 25 minutes.  I assume Dr. Tripp may have run i","useful":1,"cool":0},"TMcAFtu2Ka8XP4oz47yR3g":{"text":"The staff could not be nicer & Dr. Tripp was wonderful. Most dentist I have been to make y","useful":0,"cool":0},"tuGalu_vr1iwWGA-PgyKQA":{"text":"I had my first appointment here today after switching over from a previous dentist. Schedu","useful":2,"cool":2},"2ahkNPHmRuiskGUirfjJjw":{"text":"I have been there several times but my last two visits where  ok but the follow up was hor","useful":1,"cool":0},"Fin7RS5vp3eYVeZ6S65qCA":{"text":"Very clean office and nice staff. After cleanings, they give you an oral-b toothbrush and ","useful":1,"cool":0},"MnE78MLrsk_LtoKTSCe15w":{"text":"I haven't gone to the same dentist twice until Dr. Tripp (been seeing him for years) and a","useful":1,"cool":1},"qfM-cR4jJkNgskFeIyRLaQ":{"text":"Best dentist ever! Dr. Tripp and his staff always make me feel comfortable and welcome. An","useful":0,"cool":1},"XzKFv3fEPOxzn3hy0y7tAA":{"text":"Very welcoming staff, and professional! I love to come here because I'm always in and out!","useful":1,"cool":0},"xQ7yv9iemLI2dEtFPBPBxA":{"text":"Called with a broken tooth emergency. Was told I couldn't be seen until Friday, July 9. Wh","useful":0,"cool":0},"0zIXbQxgEX37oXql-VSDTw":{"text":"I've had three types of services with Dr. Tripp: basic cleaning, filling, and root canal. ","useful":1,"cool":0},"5v7UzthWcHH3Sy16MUWtUQ":{"text":"Dr. Tripp and is staff are friendly and accommodating. They worked around my busy schedule","useful":1,"cool":0},"Tky9sm8f8g0DqZymv5uRQw":{"text":"Let me start by complimenting the staff for being some of the sweetest and efficient folks","useful":1,"cool":0},"AVgxQINWNihnG5_MLghkLg":{"text":"I had been given a referral to 7 o'clock Dental from my military dentist. He was completel","useful":0,"cool":0},"dIJlezF-zzg_pl4AB-aSuQ":{"text":"Outstanding service! Dr. Tripp and his staff provided me an exceptional experience! I high","useful":0,"cool":0},"7JvDA71xAV37oKxNarjFTA":{"text":"Unfortunately, I don't feel that I can trust Dr. Tripp. I came to 7 O'Clock Dental about t","useful":2,"cool":0},"IVia_KJjvfuvQDjRFIVVag":{"text":"Dr. Smith is the best dentist I've ever had. She took time to explain what she was doing a","useful":0,"cool":0}}