{"NvjShhy2mCNQ__XBbVfo3g":{"text":"This is possibly one of the best fried chicken I've had in New Orleans. Chicken was juicy,","useful":1,"cool":0},"gZwpQHD9YnzFyNaZxe2Z0Q":{"text":"Native New Orleanian !!!! Best fried chicken I have had in a while ! Hot, fresh , not grea","useful":1,"cool":0},"tU5uI8UfQ0fY0kuAOEbFMg":{"text":"My husband and I went for the soft opening and despite it being their first night open, ev","useful":0,"cool":0},"Pmt5xJs16nxOpqtp-GDrJA":{"text":"There's no fried chicken in the world like Gus's. I've been a huge fan from back when I li","useful":0,"cool":1},"yLFYt_E3tFScoc0wcfDV3Q":{"text":"I discovered this restaurant when I lived in Burbank California with their super spicy chi","useful":0,"cool":1},"8SqCFti8f-9g5_OUwQApIA":{"text":"Just as good as I remember it in Memphis. The same hustle to find a good parking spot too ","useful":4,"cool":1},"9dIb67g_FsMVCp8nQcssCw":{"text":"GUS is fiya! This is third location I've been to and it stands up to the rest of the other","useful":2,"cool":1},"-8gjC0Q__WP0UzvVtPBS-Q":{"text":"Had heard the food was tasty but was super impressed. Had both dark and white meat chicken","useful":0,"cool":0},"Uwj5DLSeh5WtK8urwuIyQA":{"text":"This is an awesome fried chicken joint. The chicken was juicy on the inside, and not too g","useful":0,"cool":0},"FGEWkW0bRXtLXH9SUyF7tQ":{"text":"Can't say enough about this place. Atmosphere was great. The chicken was prob some of the ","useful":0,"cool":0},"PoDE7ED8iMwK_audpUhcmA":{"text":"Eat the chicken, Anna Mae!!!! Placed a last minute to go order (6mins to close) and not on","useful":1,"cool":2},"FBRQRHgig_OejKQiTdgFLw":{"text":"Gus's has the best chicken ever! I learned this in Memphis and sealed the deal here in Nol","useful":1,"cool":0},"mMoxAudmGGjgEk_9JH_LBQ":{"text":"I've heard so much about this place. There are many locations across the country. This is ","useful":1,"cool":3},"3TSpEH8Ztaa07uuc-pITlQ":{"text":"Absolute best fried chicken on the planet. Great location in New Orleans, great service an","useful":1,"cool":1},"_srUdTlRqS_O5EdyLv82gQ":{"text":"This is delicious gut busting fried chicken! The food was fresh & piping hot. I could not ","useful":0,"cool":1},"cBc5JNzadKpOOAXALsEN_w":{"text":"The best fried chicken there is! It is so crispy on the outside and juicy on the inside, s","useful":0,"cool":0},"8ph3ODc15dIpIXb-q_rZ_Q":{"text":"Deliciousness in every bite!  Love the spices!!! Location is perfect for hop on/hop off fr","useful":0,"cool":0},"uMnmM_XzzoD2-d7yrLJB3A":{"text":"This place is so so so good! We found this place at the 2019 Fried Chicken Fest where they","useful":1,"cool":0},"0vbScu5SU9mEyQcYk8wPKA":{"text":"Native New Orleanian, but lived in 8 States and now back in NOLA again, so I've had lots o","useful":0,"cool":0},"KcWEx_Bi-Q4VuETp7WOKRw":{"text":"I visited Gus's for the first time Tuesday night and went to the bar to order to go. After","useful":3,"cool":1},"Fdpdwkl54jF9r0UVHb87tA":{"text":"Awesome fried chicken, I was introduced by my wife because she had Gus's in Tennessee. I t","useful":0,"cool":1},"a4e7ONaii5dLt86jOUBvGQ":{"text":"My Favorite Fried Chicken\n\nIt's no exaggeration \"World Famous.\" At least to me it is. With","useful":1,"cool":0},"dFXvNJsB9tQzIvskOqfLYA":{"text":"Hands down new best fried chicken in Nola. I am a local and native and Willie Mae's now ha","useful":1,"cool":0},"B7Odd8P93QZCC97ynEpCsg":{"text":"Probably one of the best chicken I've had! So juicy,fresh and a really good batter!!!! Chi","useful":2,"cool":1},"-3XTtBetna9y1tk2p41qOw":{"text":"Awesome chicken! Hot moist and tasty. Ate mine and stole some tenders off my wife's plate.","useful":0,"cool":0},"ifoGUl_E9wFdrlMMxzbUcg":{"text":"Best everything ever! I'm from Indiana where we like our coleslaw on the sweeter side. Thi","useful":0,"cool":0},"PI9TVCihWUitlhVdI2lj1Q":{"text":"Great chicken and great service from Melva!","useful":2,"cool":1},"nWh4zX9DP7W7h0ECjBzQ7A":{"text":"Everything was amazing!!! Love the cute to go cups! The chicken was hot, crispy, and delic","useful":0,"cool":0},"_Tu0VF03ogBEGnuXyqtovw":{"text":"Gus's has to be one of the best fried chicken places I've ever been to! Better than Hattie","useful":1,"cool":0},"aPeoowVoTgmua4Gv5Mu78A":{"text":"Honestly, the service and the food at Gus's is top notch.  I first tried Gus's in Atlanta ","useful":0,"cool":0},"IsM5YYCVpFs-F8Wo8cZ_Vw":{"text":"Mediocre food. There's really not much to say. I only visited because it's down the street","useful":0,"cool":0},"MhlC_DCGvHyj_tiyFZoHqg":{"text":"The food was good. Chicken was fresh out the fryer and tasted good but not the best I've e","useful":0,"cool":0},"nEh4ro5TgPDWQfeZq_D-CQ":{"text":"Some of the best fried chicken I've ever had. The place was clean and the service was top ","useful":3,"cool":1},"_b3uECklkSr3ApcyIOE1tA":{"text":"The chicken was perfectly fried! Crispy on the outside but nice and juicy in the inside!","useful":0,"cool":1},"t8D_B5XETSSMZTdaa3IgpQ":{"text":"OMG, can you say DELICIOUS? Super fresh? Super hot(temperature)? Perfectly seasoned?? OMG ","useful":0,"cool":1},"Fy8MqEmmTisPy9ymAX7DaQ":{"text":"Excellent service, great tasting chicken as advertised!! The atmosphere is a little too lo","useful":0,"cool":0},"MSK4ttYF-FQLI4ugl8efJw":{"text":"Love, love, LOVE!!! I was super excited to get to the place that won my heart. I now under","useful":1,"cool":0},"JrQpQYS2q2VmehwQ6N_S9w":{"text":"Flew into New Orleans, went to WWII museum before it closed, left starving as hadn't eaten","useful":1,"cool":0},"tB3PQ_WFgHbLDzzhNuKEjA":{"text":"Was excited to try this place after reading the great reviews.I am sorry to inform you it ","useful":0,"cool":0},"GkpfYwztDjojV9iocfraww":{"text":"I have tried the Nashville hot several times before and was not a fan. This place though d","useful":3,"cool":1},"yB1KczGiiUQ4xtEsQfMJZQ":{"text":"Living in New Orleans my entire life, I am used to eating great fried chicken. Gus's Fried","useful":7,"cool":5},"pT6B2YRel9WgpWPYU42PiQ":{"text":"There is so much I could write but will keep it simple.  The food was simply, delicious.  ","useful":0,"cool":0},"pOXfVI02zJLQOY0z2A-2Sg":{"text":"Definitely not Tennessee Guss Fried Chicken. This must be a franchise. Chicken is good but","useful":0,"cool":0},"dYmrlHGAAoSgQOfdSj9vbQ":{"text":"I know why this place is world famous. The chicken was hot and delicious. Our server Melva","useful":2,"cool":2},"umm__DFL0oMl6zYivmwSlw":{"text":"Ok I just came back from Memphis and went to the Gus's fried chicken there. It's safe to s","useful":0,"cool":1},"SPlL8pVMU7KNZtJMnnim5w":{"text":"This place definitely lives up to their fried chicken hype. I consider myself somewhat of ","useful":1,"cool":0},"TmtnnfdEIab88aWh3vsb6Q":{"text":"We stopped in for lunch this past Sunday. Melva was our waitress. She was super sweet and ","useful":1,"cool":1},"6K7uKzIu6L41quYuIrUnYA":{"text":"Yum. Great hospitality. Quick service. I got the two piece dark meat. I wish I had gotten ","useful":1,"cool":2},"HXM3Bn3iFt-GWHGXWCqu_g":{"text":"Ate while traveling. All the other fried chickens need to stop. Perfectly spicy and salty.","useful":0,"cool":1},"vQ_YaSi2azkJaYsMQwuycQ":{"text":"Heck yes this is one of the worlds best. Well fried with mild seasonings. Friendly staff a","useful":0,"cool":0},"LrHM5FzGOJzG6u1OaQRPEg":{"text":"Fun place near the convention center! Food and service were excellent. The greens, baked b","useful":1,"cool":1},"AothS2ugUQ8lqAiIg8Ln-g":{"text":"This was my second location that I've visited. I went to the Austin location a while back ","useful":1,"cool":1},"PWuW25oQpDEMfZx9jUfo4Q":{"text":"Wow. Might be a top 5 favorite chicken place ever for me.  In Nola for the weekend and tha","useful":2,"cool":2},"5qYuq5kctPTa3WD6QzcPUw":{"text":"We love Gus' and are so happy they're in New Orleans! The chicken is to die for. Awesome s","useful":0,"cool":0},"CkbnuNklfYg4mWLJqzbNnQ":{"text":"Amazing. The waiter was an older guy but OMG he was so pleasant. I don't know was was bett","useful":0,"cool":0},"xYaIdpdx3gmbGLdUqhA9nQ":{"text":"Love love this place. Food is awesome. I love their fried chicken, Mac and cheese and Cole","useful":0,"cool":0},"PKqGMvC3Qd4QgFirvfbrhA":{"text":"Best fried chicken so far. I hate ppl who leave a 4 star review. If it's good leave 5 star","useful":0,"cool":0},"kmGl3ikQ8Y4OSvx7SqAufg":{"text":"As expected, Gus's has taken New Orleans by storm and has already claimed the title of bes","useful":2,"cool":3},"ClABV1II8wsFrhmfm6qdog":{"text":"Great atmosphere, and location love the fact this restaurant is sort of a old garage which","useful":1,"cool":0},"ULSWEgKmuPHKXfCaplr0Qg":{"text":"By far my favorite meal in NOLA! Used Yelp to be placed on waiting list. The staff are sup","useful":0,"cool":0},"MRf5-uQep0LCjFgSesnLag":{"text":"This was delicious chicken. The whole experience was great. Great staff, great ambiance, a","useful":0,"cool":0},"dU4ftAMwH4t5NSzUq85acQ":{"text":"That was great chicken!  Love the tempura style batter dipped chicken.  I had greens and M","useful":0,"cool":0},"3bNUFRFdO7QDNY-aFisonQ":{"text":"If you want hospitality New Orleans and Keene (our server) at Gus's is the place to go. An","useful":0,"cool":1},"enhRw1TN43CXVFQ9s81JWg":{"text":"Chicken and customer service were great. 40oz beers were a plus. Baked beans and potato sa","useful":1,"cool":2},"2zVJg7CPpu8XIyBhQb-L8g":{"text":"Chicken is Fried at order--perfectly spiced and fresh. Crispy on the outside, juicy inside","useful":0,"cool":0},"7R75hftvoXjj12ef2LzjEQ":{"text":"Was in town for a conference at the convention center and decided to check this place out ","useful":0,"cool":0},"kJFqP5RToo9yUmfoA3Uq6Q":{"text":"Absolutely amazing! The food is heavenly and the staff is friendly. The food comes out wit","useful":0,"cool":0},"1us21Uq0nQ0KnrTpOiTkLQ":{"text":"This was my second time trying the Gus's fried chicken and I thought it was going to taste","useful":0,"cool":0},"leP0cdaV-8EFIzUCIe35uw":{"text":"Jessica was amazing. Staff was very nice and the food was good . Hubby and I was passing G","useful":0,"cool":1},"919qf-Q94VfvoMWfW3oEkQ":{"text":"Best fried chicken I've ever eaten in New Orleans. Delicious sides too. Everything was sco","useful":1,"cool":2},"XUKb3xBvKNEE5PgaUkuB5g":{"text":"Ate here twice on our New Orleans trip. Best fried chicken I've had in a long time. Juicy ","useful":0,"cool":0},"7xeteEKliUoaPbGYcJlUXw":{"text":"This is an excellent place \nChicken and slaw was dee lish us \nWould strongly recommend thi","useful":0,"cool":2},"9cO3g_sMfL5fNk8tIE7sDg":{"text":"Same chicken as in the Memphis original location. Not fancy but darn fine chicken and the ","useful":0,"cool":0},"i-c_YK-09KNZ_Op0gIPnkw":{"text":"YUMMY, the chicken is so tasty and tender, the mac and cheese is to die for, the fried gre","useful":0,"cool":0},"WQHS6yJ2_AoxzRqfR0MSNg":{"text":"The chicken was very good. Moist, crispy, flavorful. The mac and cheese was fine, the pota","useful":0,"cool":0},"4aMnu1qhuue77noBnKsJ8w":{"text":"Loved this place just happened to pass it and my husband and I decided to give it a try. T","useful":0,"cool":0},"RqT74KxOOhYuJHmn2m3hdg":{"text":"It was my first trip to NOLA and I Found Gus's on Yelp.  It had great reviews so I went th","useful":0,"cool":0},"bfLiNydXKYc6J2ppkrP9vA":{"text":"Popeyes? Who is that? Y'all I finally got to try Gus's fried chicken and I can see why it'","useful":0,"cool":0},"Ddjd8_ooW2VhNYZDGdemtw":{"text":"Great food for a great price and amazing service. Ask for MJ she is amazing and knowledgea","useful":1,"cool":0},"t3YjyUc4Fh0tgs_JJh8arw":{"text":"Best chicken! Hands down. I have triiodothyronine it in several different spots and the co","useful":0,"cool":0},"V1-cWjIEp5OZ4vsSUfM_BQ":{"text":"You know if you have been to one Gus's you have been to all of them. That is the way it sh","useful":1,"cool":0},"jVJZpeX-d_9QwyDvBnA1XQ":{"text":"Just came to NOLA after getting off a cruise and wanted something low key and easy.  The 5","useful":0,"cool":1},"5-X3zgTEyWXO9d3TsJvrUw":{"text":"I am a big fan of hot chicken and this is the best I've ever had. Not only that but the co","useful":0,"cool":0},"b__ex_PtUXExxhdXRyZBSA":{"text":"Few places live up to the hype, but Gus's is the exception.  I've eaten at the original in","useful":0,"cool":0},"PwjX6_PS_P-bpuib5kvtrA":{"text":"Being from Memphis, I'm so glad this is finally here! I had the fried pickles, the 2 piece","useful":1,"cool":0},"Txw-220b44XjiKsNqSYjZw":{"text":"Our new spot for FRIED !! My first encounter with Gus was in Memphis a few years ago. It w","useful":0,"cool":1},"eJDmaC4pr41GM-SQBDgdhw":{"text":"It was great!  Soft opening and it said in training on the door.  They were friendly and f","useful":0,"cool":1},"OFccMKIkqljztTI2pYE6Gw":{"text":"I'm southern, born and raised.   I like to think that I know a little something about frie","useful":0,"cool":2},"bBd_gBLGmMxkKWz-v1UF8g":{"text":"Been to their place in Memphis and blown away. Same thing here, blown away again. Staff ex","useful":0,"cool":1},"ehranyFhLGeSA5wgRPB8lw":{"text":"First time we ate there today. We both order the the 3 piece dark plate with an order of f","useful":0,"cool":0},"iCQZ_9eqUbMHytEGjDAJqg":{"text":"So far second best experience in NOLA this trip has been a let down as far as food. But Gu","useful":0,"cool":0},"7i2Qm7_3m6UuaX8nBE0Q9w":{"text":"Ok ok first let me explain how Gus's perfected the breast...meaning keeping it tasteful an","useful":0,"cool":1},"aJYYrnFLwyNzDTFejnA6ew":{"text":"OMG I heard about Gus's World Famous Fried Chicken out of Memphis for years and never made","useful":0,"cool":1},"YvUEHCIObvCUYmuTetquJQ":{"text":"I love good fried chicken and this place is one of the best. Nice and spicy. It's not busy","useful":0,"cool":0},"gRv0cdL_QSPBZzI00rQE8g":{"text":"Bomb chicken and bomb service.... what can I say? I'll be going back to gus for sure! It's","useful":1,"cool":0},"XNBHCcmdaBVfxgnJvQZKkg":{"text":"Had heard so much about them I finally decided to go. Chicken is pretty good. Has a bit mo","useful":1,"cool":0},"KP3yB3KgJDHw1xn8hEvWfA":{"text":"Literally the best fried chicken I've ever had anyway, and I've had A LOT of fried chicken","useful":0,"cool":1},"Eiw524biNrWKCjTqPkJaXw":{"text":"Donna, our server was great! \n\nThe food here is AMAZING. A few locals recommended this spo","useful":4,"cool":2},"Smxo3lPWo9MLBTSBGoTckQ":{"text":"Tasty, spicy, and moist fried chicken. The service was great. Very helpful and polite. Def","useful":0,"cool":2},"u7dVEcOkrYQpRedNrmE8rQ":{"text":"I think it's overrated, the food was good but not great. The chicken was hot but not flavo","useful":0,"cool":0},"dAIkvo6nU7B7DEE8fScoOA":{"text":"I checked out this hotspot at the annual fried chicken festival last night. Line wasn't to","useful":0,"cool":0},"DvOqti6kRm_VYJUKSttD4Q":{"text":"Sooo soo good I've been here three times already. Twice with my boyfriend, and once I brou","useful":3,"cool":1},"rxRC_X8_9M_6is5o_dVf6g":{"text":"Their name says it all, it definitely is worthy of being world famous! The chicken is so j","useful":2,"cool":2},"Ckv_FyTKT4J87lRIJUxhgg":{"text":"I'm so happy to have a Gus's here in my home town. Yes, there are other wonderful fried ch","useful":0,"cool":0},"vDeN6tHjG3WrdpAz_tKEcw":{"text":"It was amazing!! Worth my trip from madisonville on my only day off! It's just as good as ","useful":4,"cool":0},"Gry7IaupCvdxL2IcA2Caew":{"text":"Chicken was great no complaints hot and juicy had the fried green tomatoes great, would ge","useful":0,"cool":0},"2dOAqU27fKdlDfZ1e7esZA":{"text":"Excellent fried chicken! I see why they won at the Fried Chicken Festival! Had both the da","useful":0,"cool":0},"YdK9LUi-9P0OwKh5e5vFvQ":{"text":"Found this place through yelp and finally had the chance to try it out. The chicken was ve","useful":0,"cool":0},"qeSWhzdwvATzBvuSyWGgaA":{"text":"Great retro looking place! If you go on Sundays parking it's free. I would do it again whe","useful":0,"cool":0},"pJhWOID8CxxjJeOdiAAfxA":{"text":"The ABSOLUTE BEST FRIED CHICKEN I have ever had. The first bite gave me goose bumps and th","useful":0,"cool":0},"LAWCsmQDZZ_-u-Mv41d2CA":{"text":"Fried Chicken was amazing.  Very juicy and had good seasoning.  We also tried multiple sid","useful":0,"cool":0},"HcKyCjtlG897-xe6ovZnCw":{"text":"Crispy, moist, flavorful. What more can you ask for! Definitely recommend this place. The ","useful":0,"cool":0},"jwEDFDdPsUnFeAgoEjt_HQ":{"text":"THE. BEST. FRIED. CHICKEN. EVER. We came home to tell everyone about this chicken. It was ","useful":0,"cool":0},"U5mB89WvZRDp7iVhogaeAw":{"text":"Decided to come to Gus's for a random Saturday lunch with a friend. We came and the restau","useful":2,"cool":1},"3i7-oNGAvq4MkSbFGZupWA":{"text":"Hate to be the one to bring reality back to the world... This place isn't great, but good.","useful":0,"cool":0},"UE4mTUoQ4IbC8J1H_3SWnQ":{"text":"We just got here and we were tired but hungry. Found this place on yelp and it liked prett","useful":1,"cool":1},"QqGEkNq1ng_iJgC64RM5Xw":{"text":"The food was excellent and the service outstanding. Melva, our waitress was exceptional!  ","useful":3,"cool":2},"mPpVbMy4y0IdN21_WPB6-w":{"text":"I have eaten at gases before in other states, but this place just opened in July here in N","useful":0,"cool":0},"qxlr9VZAaEqHd6da_YWTZQ":{"text":"Best crispy spicy fried chicken ever! Crisp breading with hot juicy meat inside!! Omg yum!","useful":1,"cool":0},"Mq1Lk2zmeLB9TbuRf4yiXA":{"text":"From all the reviews I was expecting something really good. I'll say it's your typical fri","useful":0,"cool":0},"r7ghCRh2P28gKARZ6Pgs0w":{"text":"Stopped by for lunch today. How can you go wrong with a place that sells Veuve Cliquot and","useful":1,"cool":1},"HPcispuffKM6ZVhyMm1NyQ":{"text":"The chicken is absolutely delicious and well paired with their Mac and cheese. But the rea","useful":2,"cool":3},"JyNT4aSVhnfhI1EGBRdDjg":{"text":"Let me start off by saying, I love Gus's. Their chicken is the BEST. They have many locati","useful":0,"cool":1},"P4xMHKLFCJoFByTieKkISg":{"text":"This place blew away any and all expectations I had. Best fried chicken I've had and Jenni","useful":1,"cool":1},"5ptGnuSAQc74c5TIJpOqLg":{"text":"Ok so now a days it's impossible to find food service. Coming from fine dining I often fin","useful":0,"cool":1},"KnM98Hgu9ubJT3ViqS99Jg":{"text":"This was my first time here and I'm in love  The restaurant was very clean and socially di","useful":0,"cool":1},"GhMOh84pUUa8hZl2hiP6BQ":{"text":"So good and nice portions! We tried a bit of it all and everyone did it was some of the be","useful":2,"cool":1},"kIuWiKhHePqtB6OUcgcuTg":{"text":"Came here looking for some good soul food, it was pretty good, very clean inside and frien","useful":1,"cool":0},"8UJb91NABrmG88Zi43I67g":{"text":"It took a looooooong time for the food to finally come out BUT it was worth the wait!  The","useful":0,"cool":1},"upScRYpX9dIY7nzDNYOoOQ":{"text":"This place did not disappoint!!! THEE best fried chicken I e ever had in my life!! Not gre","useful":1,"cool":2},"9eFVVVseWrtNV-waorvkBA":{"text":"Gus' chicken is NOT playing. They are packed with a punch of flavor and wooww...They are a","useful":2,"cool":5},"PMKOTmqzBEwfTukp5eiH2g":{"text":"Tasty. This meal hit the spot. Originally, prior to coming to Nola, I was craving for spic","useful":0,"cool":1},"0fqVYggsqjP_V7Tie5YcZg":{"text":"This Gus's location does have spicy chicken so be aware of that when ordering, especially ","useful":1,"cool":1},"2WB7jzzZAavAR5HZAusFHQ":{"text":"Couldn't leave New Orleans without trying some fried chicken. The crust was crispy and fla","useful":0,"cool":0},"EZ7zTQnF9yTk3LBfAuCo6g":{"text":"Came here late on a Saturday night, as it was only a few blocks from our hotel. Ordered a ","useful":0,"cool":0},"aoigCyP7bvU4USJwoUpVrg":{"text":"As causal and simple as it was, this was potentially my favorite place during my last trip","useful":1,"cool":1},"erKATDMcC1iJTnKu8hiyqA":{"text":"My AAA guy who helps me plan amazing trips recommended this place so of course I had to ch","useful":3,"cool":1},"e_VMAVeRtTU7IGHjXcpC-g":{"text":"On a 5-point scale for fried chicken I had to give it all the stars possible. The skin had","useful":1,"cool":0},"ctwWE19fGgtKMKr_tXSiWg":{"text":"This place had the best fried chicken we've ever had! Great atmosphere, friendly staff ama","useful":1,"cool":1},"YKgTWo0XYApS6clrdEQ-fg":{"text":"The best fried chicken in The Big Easy \nIt was crispy and spicy N o wonder it is called Wo","useful":0,"cool":0},"QZyuxYBI-eJjgxkdrD_KmA":{"text":"This place remind me of a picnic but restuarant style! The chicken was hot and fresh, the ","useful":1,"cool":1},"GDV__KIFtUNyNrAq12LkNg":{"text":"Great chicken.  Probably had the best service here in our entire trip to NOLA.  Fried okra","useful":2,"cool":1},"GvegojQZpbfhdRLtZVaB9g":{"text":"This place has the SALTIEST, over fried, unflavored chicken! The greens taste and lol as i","useful":1,"cool":0},"v_6qn9mgbI2l3f5kebesUg":{"text":"The food is fresh and hot, but watch out for the heat level on the chicken. In traditional","useful":0,"cool":0},"FyPplfilpk4bYLR8na1a3Q":{"text":"Came back to Gus after my previous bad review after speaking with one of the managers. Thi","useful":2,"cool":2},"dUbZIV9o67HRmVftzNo27g":{"text":"SO SO GOOD! Best fried chicken we've ever had! The kids loved it and the atmosphere is com","useful":0,"cool":0},"j9JHbid50P1kUeohXKkAZw":{"text":"Easily the best fried chicken I've ever had.  A tad bit spicy and incredibly juicy meat.  ","useful":1,"cool":1},"3tmaN2jeSpQlBw5mT3JVjA":{"text":"Came into Gus's tonight and my order was messed up. Jennifer the manager went above and be","useful":0,"cool":1},"gm70sRCvvfpiW_rB0YlisA":{"text":"\"This is the best fried chicken I've ever eaten in my life\" he said in between chewing. So","useful":0,"cool":0},"O58SVbpjLhmPXymTf16T-g":{"text":"It's spicy！！！I love spicy！！Also, fry okura is good too！！\nDefinitely, I'll go here again.","useful":0,"cool":1},"25BArugLqpsqM6ulDfNTBQ":{"text":"My daughter's job catered Gus's for lunch and I had to go and try for myself. Nestled alon","useful":0,"cool":1},"lFWPf4LnJsJWtgiwcGGdhA":{"text":"I was recently in NU ORLINS for a few days and me and my old lady, her especially, wanted ","useful":1,"cool":2},"6EBdZWCzo2osDPcxI9TRLA":{"text":"So our first experience at Gus' was in Memphis and we waited for this NOLA location.  For ","useful":1,"cool":1},"ZMvy_FpIfJpAEqW0ex6vVQ":{"text":"Recent winner of fried chicken fest and only a week later I'm back for more. What can I sa","useful":2,"cool":1},"HR3PsWlD3XQLBXM_iwM5eA":{"text":"We love our fried chicken and often try to find the best chicken in the cities we visit. G","useful":1,"cool":1},"_NhaofG_c20rJB51dd6_0Q":{"text":"This was our favorite place to eat while in New Orleans!!The food was amazing & so is the ","useful":1,"cool":1},"2Aq5aGaeSDiCG6BQDsEkiA":{"text":"Stayed in NOLA for one night. Loved how you could see the kitchen and the food being prepa","useful":1,"cool":1},"MuN7201DUSLdj0xTvqMbLg":{"text":"I was so excited to eat from here; however I was not that satisfied. The chicken was just ","useful":1,"cool":0},"8_dc0nTCuF-wVLfLGtx2qw":{"text":"Amazing chicken.  This is a place that originates in Memphis and has a world-wide followin","useful":0,"cool":0},"1oqv894cTTVF2f4QFucLPQ":{"text":"I went there for a quick lunch. Not from here (Houston) and when I tried the chicken tende","useful":0,"cool":1},"fl_DP8QQuQvN65iKEI1pmA":{"text":"If you are looking for a quick, southern comfort food, with great service. This place is t","useful":0,"cool":0},"-42yrI2ld_hZ23rvojAEQw":{"text":"Devin, our server was such a warm and friendly face welcoming us into Gus's, suiting the w","useful":0,"cool":1},"C08UosgIZQBF69IvT_HWbw":{"text":"Hmm.. all this time I thought a check in was the review too ‍ I was TODAY years old when I","useful":1,"cool":0},"sZvTRNXqKZUUVSh0x2n49w":{"text":"Our first time there and it was amazing!! The food is so delicious and not pricey what so ","useful":0,"cool":0},"AOpTN4UX8D39ZdU9zqi0Mw":{"text":"I have waited a few years for this Gus's to open. It did not disappoint !!! I love this ch","useful":0,"cool":1},"Mg57hQso5GFNUhoupmWaIg":{"text":"This spot is ridiculously amazing, but let me tell you, our server AJ made it through the ","useful":0,"cool":2},"gcY5aMQeq9PncWmtBMfd_Q":{"text":"Brought my plate and told me they ran out of fries and would be bringing some more shortly","useful":0,"cool":0},"Lr3WO30CAv25wcjj1YagMw":{"text":"We thoroughly enjoyed the food at this restaurant: the chicken, fried okra, baked beans, p","useful":0,"cool":0},"VRni6VGwMOlk5UhQrMy6nw":{"text":"This is some of the best fried chicken I've ever had. The skin was perfectly seasoned and ","useful":1,"cool":1},"GkeR67uowCKCYrwbAdev6Q":{"text":"I ordered on Door Dash to work, it was sitting a while because I was busy, but I reheated ","useful":1,"cool":0},"oo900BGTkMKApzpG6zngjg":{"text":"Went back to Gus a third time after their owner insisted that they get in right and wow di","useful":1,"cool":2},"5UvvOO1sgd8MhHiWtS53rQ":{"text":"Kind of a interesting spot, decent chicken, great fried Okra... world famous Um, okay if y","useful":1,"cool":1},"E8k0ALqgJrx3c-RQneK_pQ":{"text":"This has to be the best chicken in town. So juicy, and the service was great too! I can't ","useful":1,"cool":1},"fhZXtNehQr_QO5flc1gEzQ":{"text":"We've eaten our fair share of fried chicken BUT this is hands down the BEST We've ever had","useful":1,"cool":1},"eqoBPEa4gESCCD3p2L-v_g":{"text":"THE BEST FREAKIN CHICKEN IN THE WHOLE WIDE WORLD! \n\nP.S the staff is great too! \n\n\n\nThe ch","useful":2,"cool":0},"-9qYEA7Pb0PwtoztKc7sIA":{"text":"This place seems like the kinda place that started as a hole in the wall. But it is AMAZIN","useful":0,"cool":0},"qPZp7VojjKdZNZOM9dnMGQ":{"text":"The chicken was absolutely delicious and unique, served fresh and hot!! The sides were a b","useful":0,"cool":0},"LgRhXnq58FadQSwo7j7o-g":{"text":"Being from Memphis, I was very excited to see a Gus's in New Orleans. Food was very tasty ","useful":0,"cool":1},"gV9IP3QPO5vuBhuB8aU4Jw":{"text":"Friendly staff. Great fried chicken. Close proximity to convention center. Service was slo","useful":0,"cool":1},"LBF4V_gHZTOmbVYL22QWxA":{"text":"You can't come to NOLA without getting some fried chicken. This place was walking distance","useful":2,"cool":2},"OkD1ANMiHp40F98j-qggLQ":{"text":"Best fried chicken I've had and the waiter and hostess were very nice and welcoming. Made ","useful":1,"cool":0},"0RHyqSdaf6whfIL-Xrg0Uw":{"text":"Where do I even begin?  Where do these 5 starts reviews come from? Dirty, unclean tables l","useful":0,"cool":1},"RgNQtOgpKH4hX9WagNxGkA":{"text":"The food was delicious and the service was so friendly! The chicken was juicy and the Mac ","useful":0,"cool":0},"clkQHrWdWEj8R9aMpVLV5w":{"text":"Chicken is really good, great spice - nice and crispy. I didnt realize the restaurant had ","useful":0,"cool":0},"FnCIws3Q_lEstPrHhvAC3g":{"text":"My husband, Steve, and I recently just returned from a beautiful trip to NOLA. After just ","useful":0,"cool":0},"ydq_qLlegHUzdIRRgLS7-Q":{"text":"The first time I had Gus's was when I was in Chicago. It was across the street from my hot","useful":5,"cool":1},"zHGedSKWB9z0KnzXWkVoaw":{"text":"We ordered fried pickles (soooo good), two orders of chicken dark meat, coleslaw, potato s","useful":2,"cool":2},"72hXyArkuI173Zgyu0K76w":{"text":"I mean it's chicken, it's fried AND it's world famous!! The name even says so!\nLegit may b","useful":0,"cool":0},"X_wnw4Bs-TdzoQaUx_o-8A":{"text":"Holy fudge this place was phenomenal. The service was great, the chicken was perfectly cri","useful":1,"cool":0},"IDIky-Ma09epZRYy-pnBWg":{"text":"We finally have a Gus's in Nola!! Bless da lords bc you know we love some good fried chick","useful":4,"cool":4},"MXGcFKWIt6o9M2Vfucds2w":{"text":"The chicken speaks for itself. If you haven't had it yet, you're doing yourself a disservi","useful":0,"cool":2},"7c4PcvqfEOvfEeQ5GqOrGA":{"text":"I went to Gus's last night and had a two piece with Mac and cheese and beans.  The chicken","useful":0,"cool":1},"QSTwMEyONI3vsg36CCA5QA":{"text":"Good food. Chicken was tender and juicy. Good portions. Friendly and fast service. Dessert","useful":0,"cool":0},"H8FpfvvYhijuzvIdGg1qDg":{"text":"The chicken was crisped to perfection and it had so much flavor! The Mac and cheese was al","useful":0,"cool":0},"loRTG4mUu0JDJgP1lYjuQA":{"text":"Such awesomely seasoned, made to order chicken!! It does usually take a while to get your ","useful":1,"cool":2},"jv8LhEcvP0A0_dwLt7qHTw":{"text":"Food was damn good. Chicken crispy and mac was some of the best I had at a restaurant. But","useful":0,"cool":1},"TnsGaJY6FFLvmwe3ganWFw":{"text":"I had a 3 piece wing platter with Mac and cheese. The chicken was okay. It was just a lil ","useful":0,"cool":0},"ekfS_EaCUeK_tb6WzSNvMQ":{"text":"This place did not disappoint ! Food was great , our server A.J. Has been one of the frien","useful":0,"cool":2},"_1qcOHgh7NOvLNdLq0C4Hg":{"text":"I ate at Gus in Austin, Texas many times..and they never disappoint!! The BEST FRIED CHICK","useful":1,"cool":0},"Kw7alcNTndqez0gqE6hJMA":{"text":"Surprisingly, the dish that stood out the most here was the side of mac and cheese. It's s","useful":2,"cool":1},"Khqbxg8hIgBj0gQH7E6zhg":{"text":"Out here in NOLA for work deployment and decided to stop by Gus's to try it out.. From the","useful":0,"cool":1},"DbjhjHJ-PIr7V-mk14jHyA":{"text":"Gus's is incredible!! The chicken was hot, moist, with a perfectly crispy skin. Had the 3 ","useful":0,"cool":0},"FUxiMwYnO3h8REwiJDLhKw":{"text":"Everything was so good. My group of friends all ordered chicken wings. We each ordered dif","useful":0,"cool":0},"UoX0eXz5IrbztH29KvcxBQ":{"text":"Ok - this will be short - simply the best fried chicken I've ever eaten in these United St","useful":0,"cool":0},"boAhod40uAgbDECv3oitiQ":{"text":"Best fried chicken! We got the dark meat three piece meal with amazing Mac and cheese and ","useful":0,"cool":0},"OrpUe6Mcdgb8znzY6w8hMg":{"text":"My second time to visit this location, my first time at Gus's was in Memphis.. bruh why is","useful":0,"cool":1},"wbIPZ8CBTaaZLEmFFs66uQ":{"text":"Great food. Wonderful service. Fun atmosphere.\n\nThis place was a wonderful surprise. We we","useful":0,"cool":1},"nwfWnkGQ3GPEAf7YpHS_RA":{"text":"The food was absolutely delicious. My wife and I came to New Orleans for a birthday/ vacat","useful":0,"cool":0},"ZnaSBWZ7y1tZdMOqxWqBcA":{"text":"Really good yelp reviews and this was close to where I was staying. You walk in and seat y","useful":4,"cool":3},"fAM-Q8-2ZQdXNtn_Mnyyag":{"text":"We had a great dinner here before leaving NOLA. What an experience. Fried green tomatoes w","useful":0,"cool":2},"mP1ZBut7kpDH6qJ9WwP19g":{"text":"Place is rolling.\nLeave the chicken tenders for the kids. \nGet ur self the half chicken 3 ","useful":0,"cool":0},"jExSvLaK0fzRTX6Nw9TuHQ":{"text":"The chicken is not bad, but everything else was not good. It's over priced and the lady be","useful":0,"cool":0},"21mDiO7kvXaNXNuV7fmUDg":{"text":"Went here today and AJ is an awesome server .. super fun and entertaining! \nHighly recomme","useful":0,"cool":1},"lLOnfiIDaOVs_gPVfiDgcw":{"text":"I'll never be able to go to any other chicken place again after eating here. The portions ","useful":0,"cool":0},"CVdwLBb4IXub4OWUn_FWEQ":{"text":"Chicken was amazing omg\nThe flavor and the spice is just rite.\nI can see why they the frie","useful":1,"cool":0},"BOfxD2IzV-9OTHyWIhkuCw":{"text":"Yes. It's like heaven in your mouth. The chicken is well seasoned and spicy. I actually do","useful":0,"cool":1},"5fNGQx-by9tKgEYjNgH8sw":{"text":"This chicken Hott with fire & spice! It's located in the Warehouse District 2 blocks from ","useful":2,"cool":1},"VmSPRN1B2H4ML9Ta5jRypg":{"text":"Oh yeah it's happening over here with the chicken. Places like these make me wish I lived ","useful":2,"cool":1},"aE6l4zIRSljSPLwjoHqJlw":{"text":"This is the best fried chicken I had in New Orleans, and yes, I made a stop at Willie Mae'","useful":0,"cool":0},"tdo1rc0nsobZzRAVjmcqWw":{"text":"Excellent chicken fried to perfection and the sides are exceptional . We will make this a ","useful":0,"cool":0},"j8o8JAfrvfwSmHbFKPA3rQ":{"text":"Best fried chicken!! We ordered all of the side orders and fried okras. All of them were s","useful":2,"cool":2},"Q69mlrPOSlU51fggbEvrWg":{"text":"I thought this place was a local, but they actually have restaurants throughout the United","useful":0,"cool":1},"kaKjWTzguG8cC7l0MSu5IA":{"text":"This is the best fried chicken I've ever had. We've been to many of the staple Southern ch","useful":0,"cool":0},"CCph7TI7QzFZjIG9dq2IDw":{"text":"OMG. This place is amazing!! When you go in, definitely ask for AJ to be your server. He i","useful":0,"cool":1},"MgW19mr6TYOS45bkzIE9Pw":{"text":"This place is great! I love how the soft opening was a event with a local non profit. \n\nTh","useful":1,"cool":2},"UrQwzLPQw2Q55-cgM1CAvg":{"text":"Wow! This place is amazing. A southern boy's dream. Hot fried chicken and greens. Looked a","useful":2,"cool":1},"pi0HHoQj4xinKs8zvh9JJQ":{"text":"By far the best chicken I've ever had. Tenders were crispy and thick full of meat. Baked b","useful":1,"cool":1},"W5BUtz5IhB0U_Fc4RLG8rA":{"text":"Good chicken, just wish they did fresh fried okra rather than pre-breaded frozen. I'd defi","useful":2,"cool":1},"Xlt4mIBaBnnrc3IbvyCbgA":{"text":"3.5! I actually really liked Gus's, but I've definitely had better chicken! It's your sout","useful":1,"cool":0},"Ny0flf8nP4P-q2jz5K4ICA":{"text":"I don't know if they have the \"best fried chicken\" in the world but I went and ordered chi","useful":2,"cool":0},"CkzvgBAYZ-r0RJ_531OKAw":{"text":"Ok - this will be short - simply the best fried chicken I've ever eaten in these United St","useful":0,"cool":0},"iwRpR07RlX1ygTvf7FyfHQ":{"text":"First time here...AJ is the best server.  We got the special..3 juicy chicken breast, mac ","useful":0,"cool":2},"lHnmjF-vQWaHXWGS0slCMA":{"text":"First day opened. While everyone is in the training phase they seem to have things down pa","useful":0,"cool":2},"eHM8ErE72yhqMqpcC9bV9A":{"text":"One of the few places that was open during COVID during our two month stay in NOLA. Indoor","useful":0,"cool":1},"bHEB46dj45-lN_Aa8uwEZA":{"text":"So I enjoy taking trips to Memphis for mainly two reasons: Rendezvous BBQ and Gus's Fried ","useful":11,"cool":10},"FbbkBiBDCchN_IANI9XGFQ":{"text":"I didn't get his name but the tall black gentlemen was very pleasant and the food was deli","useful":0,"cool":1},"q3lCEcOVEPQ06ywTMMVV0Q":{"text":"Where do I  start... as soon as we walked in we were greeted and told we can sit wherever.","useful":0,"cool":0},"ATSmhCYs1X4IP7XVbYJU5Q":{"text":"Recently travelled to New Orleans on my USA trip from Australia and we arrived late at nig","useful":0,"cool":1},"RrvYGKDcZW3CgRO5rjLkfA":{"text":"Some of the best fried chicken you will ever eat. Also some of the best service you will e","useful":0,"cool":1},"ktbYMWcz6S2vJ-u7U6uTNw":{"text":"Our absolute favorite chicken!!! So much flavor and not greasy!\nA must stop whenever we ar","useful":1,"cool":1},"Kf-fMfWTO4-s2wzIFPX1iA":{"text":"This place is on point! The tenders were like the proportional equivalent to the theme par","useful":0,"cool":0},"qKMuUdp19TqhKUurwijAkw":{"text":"Not worth the price and I felt like I was paying for the experience. Seems like a tourist ","useful":0,"cool":0},"j7vFF4t6QUn0qL0xjh3OzQ":{"text":"The restaurant was a short walk from our hotel and we just so happen to stumble upon it. T","useful":0,"cool":0},"LHzVbLBP0-d-hs99fWbAuQ":{"text":"Man let me tell you we are from jersey and currently live in Florida so we know about the ","useful":1,"cool":2},"5wTBVjjiHn_dMYCFWT1yMw":{"text":"BETTER THAN WILLIE MAE'S\nThe chicken is very similar.\nThat sort of tempura-ish batter with","useful":7,"cool":4},"htNkd4RvWi7mxpwrtSSHwQ":{"text":"Hands down one of the best fried chicken I've ever had! My wife, who does not like fried a","useful":0,"cool":1},"647ExGbleMz5-zS-diQKpg":{"text":"I thought I couldn't be impressed with something so simple and available in the area but I","useful":0,"cool":0},"5G9p8T5iH6hH7dhUtaJukA":{"text":"Wonderful attentive service, great tasting chicken and sides. I had coleslaw and potato sa","useful":1,"cool":0},"_uxyJWN54af4ol6ljlzquQ":{"text":"Wow!!! I wish they had a spot in Jeff parish! Their chicken was flavorful and SUPER crispy","useful":2,"cool":3},"DQuXQ3r3SFBJJJyqrlhaCQ":{"text":"Amazing. If you are in the mood for classic fried chicken and grub food, this is the place","useful":0,"cool":1},"n80vbIHp-N1j8IA6_vAa8Q":{"text":"Best meal I've had all weekend! Fantastic service and delicious food! Highly recommend fri","useful":0,"cool":0},"tSCzGlI1gbKYlJhrXkSsuQ":{"text":"We love Gus's , We try to.go to them anytime we pass by. This location is newer than most ","useful":0,"cool":0},"lvvWVvQzIlPs3QW-wjE00A":{"text":"I was exited to see Gus's added a spot in New Orleans in my favorite neighborhood to visit","useful":0,"cool":0},"HQMC_AGo4mXhsANsB28GAQ":{"text":"Best fried chicken we've ever had. The crust perfect. The spice level perfect. I had the g","useful":1,"cool":1},"a3V0HrLH6VDW4IY6hii6zQ":{"text":"This Place was Delicious! Customer Service was Amazing! I believe Aj was the name! From th","useful":0,"cool":1},"hAV-r7T4J0szNuDR9QivCg":{"text":"AJ was amazing serving us for our first time at Gus's. He stayed incredibly positive and w","useful":0,"cool":1},"M6uY81HVsGdk8tr31LrJtQ":{"text":"Fresh Hot chicken Made To Order it has a special kick to it the staff is nice and friendly","useful":0,"cool":0},"8FUrEZswGY9f-N26fpH-2Q":{"text":"While driving to see some Mardi Gras houses with family from out of town we decided fried ","useful":3,"cool":2},"efBexwQPLe83n3rBEyztXw":{"text":"Not sure what kind of witch craft got out on my fried chicken, but whoever did it, thank y","useful":2,"cool":3},"Gtyna41I9-W33qyxFDyaSw":{"text":"Bomb ass fried chicken!! And the sides are just as good! A must eat in Nola!! I would high","useful":1,"cool":0},"da3DjCIqHj9vEhbjpzJVjg":{"text":"I love me some Gus. When I say this place is very consistent with providing great service ","useful":2,"cool":1},"ZUs_22vr9LPRnrcb3YoBaA":{"text":"Everything was amazing. Chicken was very moist and flavorful. Sides were steller. Service ","useful":0,"cool":1},"yYggKgDk6UtlKKO5z10nXg":{"text":"Great place!! Good food. Celebrating my 10th anniversary and this spot is well worth the t","useful":0,"cool":0},"dj-L8m2FzaCZYzxYVhWPnQ":{"text":"This is what's good, if you like spicy fried chicken. A classic from Memphis, this place c","useful":0,"cool":0},"pewzfT1-xOzrGnOmKDKUBw":{"text":"Reminds me of the good ole days when spicy chicken was actually spicy! Before you could of","useful":0,"cool":0},"S2ieENLybSNFRryc47eiNQ":{"text":"We were in town for Mardi Gras and left one of parades and checked the map to decide where","useful":0,"cool":1},"g19TmNRmYAeFPVyUY5FrDg":{"text":"This place was well worth the try since we wanted some chicken.  We were greeted upon ente","useful":0,"cool":1},"El0n6z1C5RHfjqkyHuNJZg":{"text":"Did not disappoint. The chicken was crispy, delicious and had a mice little spice kick to ","useful":1,"cool":1},"XWaLml_Gx9FPosdhObbWVw":{"text":"I loved every thing about this place. The food was awesome! The chicken not too spicy but ","useful":0,"cool":0},"D5KCK-8PEFYI7hzHVg86Iw":{"text":"Literally hot and spicy chicken! Had a really nice server who started us with the Fried to","useful":1,"cool":1},"NijMLzwe0s0osejMgSryiw":{"text":"BOY. Let me tell you! I found this place on Yelp and I went in with high expectations cons","useful":3,"cool":2},"i1isbul7xAYSsTrH8qhlBw":{"text":"I ordered in on a Sunday afternoon through doordash.  They included plasticware as I reque","useful":4,"cool":5},"154tM0_0q8O9i1okleZ9qw":{"text":"By far the BEST fried chicken I've had in a MF long time  \n*\n*\n*\n*\nAsk for the Arnold Palm","useful":1,"cool":2},"GEQnfzrXB567yqDadFGARA":{"text":"\"If you haven't eaten at Gus', you haven't eaten fried chicken\". 100% agreed. It taste lik","useful":0,"cool":0},"4NvewMnv0bFqPHewg3i2vA":{"text":"Finally i found the best fried chicken in new orleans! The chicken are crispy and tasty! A","useful":0,"cool":1},"7NpoVq7_uWXL96zsufT9ow":{"text":"Went to Austin two weeks ago and had Gus's. I almost cried when I took my first bite. I wo","useful":0,"cool":0},"fyyu1VCk5cJhT9jYze7ZJw":{"text":"All I can say is our server AJ was the best part of our dining experience.   The chicken i","useful":0,"cool":1},"RcUTSRLfxI3Bky0SpVqOpA":{"text":"AJ you were an absolute delight! Walking in we weren't sure at first but then you brought ","useful":1,"cool":1},"gBVLkiryugZLnbfgJouePA":{"text":"Very good! The Chicken was seasoned perfectly and fried crispy the way I like it! The cust","useful":0,"cool":0},"6JSM6OLldWV5_9njrIXgpA":{"text":"I love Gus's in Nola it's my go to for chicken. The best chicken in the city and I always ","useful":0,"cool":0},"x8CiWTsngshpzS_vY1nOBw":{"text":"Dear 8lb 3oz sweet little baby Jesus... this chicken has changed the game for me, when I t","useful":0,"cool":1},"qybKCJivJKTEwFMQV-MmrQ":{"text":"Finally got a Gus in New Orleans. Great service. Great food. A must go to place. See AJ wh","useful":0,"cool":1},"TSmmQy2OQMLRN01sIKvv5A":{"text":"This place is amazing! Even better the next day as leftovers. I had the mac n cheese, bean","useful":0,"cool":1},"U9eI8EyXOXqbLfFYFk-Vpw":{"text":"Yummy fried chicken to-go!  Freshly fried it's hot when you get home with just the right s","useful":0,"cool":1},"WRg_QTmuuTI1Mg_6-2u4-Q":{"text":"The best fried chicken , hands down! Service great too!!\nWindow is open breeze is blowing ","useful":1,"cool":1},"RHI7HFMWnePeUl5uS0kNNQ":{"text":"First time at this Gus's. First one was in Atlanta. \nI got my siblings in here for the hot","useful":1,"cool":1},"JeXi8fXefUeDEhJKrKd2Qg":{"text":"This chicken.... SO GOOD! My husband and I are tough critics when it comes to fried chicke","useful":0,"cool":0},"GHIEomlvl_n5CVoOYah2oQ":{"text":"First time I tried this place was in Austin and I've dreamt about it ever since then. When","useful":0,"cool":0},"bq-VJNtld89SvglCAGJu2g":{"text":"Great customer service always on top of everything, the chicken was pretty good too but mo","useful":1,"cool":0},"lZmgLjEXWUFPhqFi2jLJKA":{"text":"This is THE BEST fried chicken you will ever have!!!! And the sides...beans and slaw are j","useful":0,"cool":1},"0Gj70hvgEYe802fnSkbVjA":{"text":"Food was great. Service was on point. Store was a little small but had amazing A/C. Just d","useful":0,"cool":0},"3MuBFeQuGDqCV01QjfWKDA":{"text":"Atmosphere: Gus's has a very simple interior with bar seating. It sticks out as the only r","useful":2,"cool":1},"7nC8uq3z6pmctt94DbaLLQ":{"text":"Worthy of waiting for about 30 mins. \nThe only suggestion would be if could offer some gre","useful":12,"cool":11},"bO0YYg_7vACAZY-UUX1QnQ":{"text":"Y'ALL!!! (I'm not even Southern and this place has me starting my review like that!) I tot","useful":3,"cool":2},"bLgSTV0ryqqjlSVi7Krrjw":{"text":"This is some good chicken. I don't know how they cook this chicken so good, the crust and ","useful":0,"cool":0},"wo01C9quI48Gxhs2qpBuKw":{"text":"First time eating her, after reading the mutiple reviews of so many fried chicken spots.  ","useful":0,"cool":1},"o-9SJwTfw2d2Aa1i2-ccWw":{"text":"Great food and location. Service was really and again the food was legit.  Definitely a La","useful":0,"cool":0},"Ku8tjI7MNpX_paq4Z3oeyQ":{"text":"The staff was attentive. Wings were delicious and crispy. Okra fried to perfection and Mac","useful":0,"cool":1},"1dehkm7ktrdaJskfpFipgQ":{"text":"Yummy fried chicken, delicious sides and great ambience! Chicken was crispy, well frjand b","useful":0,"cool":0},"3At7d0B58w09ic1cTRb4gw":{"text":"Excellent service AJ made us feel at home. The chicken was crispy, spicy  and good loved t","useful":1,"cool":2},"htu9iaUte8dkcB7Qyz9gwQ":{"text":"On my last day in New Orleans my boyfriend and I decided to try out Gus's due to the high ","useful":0,"cool":0},"RtAKmw420kYwr05ilj9BBg":{"text":"Very excellent service probably some of the best chicken you can eat in the world. I must ","useful":0,"cool":1},"dRdmD6HsMd5EeuzEqieCQg":{"text":"This is now my go to chicken spot in the CBD! The first time I ordered food from here, I o","useful":2,"cool":1},"4SEyh7r_MkYwx3MncI349g":{"text":"The chicken was great! I lve never had chicken like it, i also added some honey to my orde","useful":1,"cool":0},"-Kodvgzkw2GLVHdQe8uWRw":{"text":"Wow, first time to taste this awesome fried chicken. Hard to explain how light and fresh t","useful":1,"cool":3},"3nvdyGClvIjbc2cEbH7bFw":{"text":"Ok - this will be short - simply the best fried chicken I've ever eaten in these United St","useful":0,"cool":1},"P-UQqjK0SSBj6CdCRSkk0w":{"text":"If you want excellent fried chicken and tasty sides, come on over to Gus! Slow service but","useful":1,"cool":0},"MlqKC4rsPFrhSqJ7SBv1EQ":{"text":"Talk about amazing!!  This place has the best fried chicken ever.  Juicy, cooked to perfec","useful":1,"cool":2},"71yJL7pgfx8NS_ipw3XLjg":{"text":"Was really excited to try this place with all the great reviews however I was incredibly d","useful":0,"cool":0},"DN3gFEBHxvQsTwiSsJipAQ":{"text":"Great fried chicken and sides! Service was excellent and COVID precautions were followed t","useful":0,"cool":0},"4cPj6O4otUpQbMJE0voaPQ":{"text":"Excellent customer service and friendly staff. The food is good and offer generous portion","useful":1,"cool":1},"MiZJuDaXa_53W1LovU4c4w":{"text":"DO NOT RECOMMEND THIS PLACE AT ALL. HORRIBLE SERVICE. FOOD WAS COLD AND NASTY. STAFF (besi","useful":0,"cool":1},"SPInBVEQC-ap8-bzH37kwg":{"text":"Got the 2-piece White / delicious; just a tad spicy, but overall fantastic.\n\nNeed one in M","useful":0,"cool":1},"urZ4ss1o6PVsqCbQI1aaeQ":{"text":"We had the chicken at the Fried Chicken Festival, and it was so good, we went back today j","useful":0,"cool":0},"okepY8JvBFHhTXiDwqdQAA":{"text":"Mannnnnnnnn listen! This chicken is phenomenal, it's spicy, juicy, cooked to perfection an","useful":0,"cool":0},"mkJmXW35xOat3mcBdCeunQ":{"text":"Great chicken. Great service. Got free homemade ice cream from our server that was spectac","useful":1,"cool":1},"DjXvYf1kQg-8faCLKS0w-g":{"text":"I haven't written a review in a while but gotta say, that 2 piece dark fried chicken, frie","useful":1,"cool":1},"fevjZ5aPUM0vpo1tSvE1GQ":{"text":"This is a hidden gem of New Orleans!  The best fried chicken in the city, and I've tried a","useful":1,"cool":1},"WT6i8s6h64hhZ6PcRyuEVA":{"text":"Tried Gus 's for the first time yesterday. Thought the setting was pretty cool, and was ex","useful":1,"cool":1},"bBxu5dSWKXUCCapCDOc-Lw":{"text":"Oct 2, 2019. Being I was in the South I had to try some fried chicken and this place was j","useful":0,"cool":0},"o-9JmjmXlfwSasJK9tmk8g":{"text":"The Chicken is a little spicier than I would normally eat, but it was extremely well cooke","useful":4,"cool":4},"M3crwhnOGNelVDwU9vOW7A":{"text":"Great Food! I'm really impressed. I think that anyone would be happy here. I'm from Cali a","useful":2,"cool":1},"yZ6_iJA-TeayXbkq8RjDYw":{"text":"I came for the fried chicken and was not disappointed. Terrific crunch into a juicy chicke","useful":0,"cool":1},"vH7yY6RZkQyu2ytqtDsGZQ":{"text":"I am simply obsessed with this chicken! The first time I tried them it was at the fried ch","useful":1,"cool":0},"cyd1rniZnINpaPmq3Z93cA":{"text":"I love Love this place. The food is always hot and made fresh. My favorite waiter AJ is th","useful":0,"cool":1},"NPZd7da6lf6FmKhJowAmLQ":{"text":"It's a hidden gem  \nIf you ever in Nola please do stop by and try their chickens.  Not gre","useful":2,"cool":1},"0mv9j8dSaZbRvdAJNCsifg":{"text":"Fried chicken was excellent and my wife loved the potato salad. Genae was the best. Nice s","useful":0,"cool":0},"O8Hfu_tftc_2vTGTUL7HLQ":{"text":"First day opened. While everyone is in the training phase they seem to have things down pa","useful":1,"cool":1},"X7DqFCSV3QHaCtT7f_ILxQ":{"text":"Came for marti gracias and found! Best fried chicken and Mac & cheese in NOLA. AJ OUR SERV","useful":0,"cool":1},"95pca0TWdPtUKhAOlnCxcA":{"text":"Been living here all my life and this is the Best fried chicken I've tried in New Orleans ","useful":1,"cool":1},"Nl9aMRpv1rAMSxPK5bu3mw":{"text":"I LOVED Gus's Fried Chicken. The spice and the crunch of the chicken was amazing. Also, th","useful":1,"cool":0},"d-lACxxE-QuSQ57mhFbzSA":{"text":"Look...do not second guess your choice to come here!  This chicken is MONEY. Since it's a ","useful":0,"cool":2},"3rLmkz2Oi_6ZJpYadMJ2iw":{"text":"Great location with good fried chicken. We came in at a busy lunch hour and had to wait ab","useful":2,"cool":3},"vJ4RXpS6xzh_HYVyhBfwwA":{"text":"My husband and I are visiting New Orleans & wanted Fried Chicken. We found Gus's & thoroug","useful":0,"cool":0},"NUbqT4uKvVMlDH0xmtJZoQ":{"text":"Fabulous!!! 10 STARS. We went 2 days after they reopened dine-in June 2020 from the COVID1","useful":0,"cool":1},"wlpVVHLBQY2AyQot8pXcCg":{"text":"Great chicken and great service. Food is good every time we go in. And always fresh. Go in","useful":0,"cool":1},"tg9Feaij0zA5PLLgi-q4LA":{"text":"So I see a friend has posted about this chicken spot in the city.  Looking for something t","useful":0,"cool":2},"x0Te86p3fIcLDAhdKLI0UQ":{"text":"Best place to eat fried chicken !!!! The wings, mac and cheese and potatoes salad was amaz","useful":0,"cool":0},"oTO1sMZDUippSBNABwQGqA":{"text":"Exceeded all expectations and my expectations were high after wanting to try Gus's for yea","useful":0,"cool":0},"6P2uBrdwpyBggVQDsEARLw":{"text":"This fried chicken dinner was so good and felt like I was back home in NC. The customer se","useful":4,"cool":3},"_ersqPcacQfrXQ57DYep2w":{"text":"Absolutely amazing.  We bought a 3 piece white and split it between my husband and I, We s","useful":1,"cool":1},"lLcqBaY-HSLlkPXQN8pVCg":{"text":"Look...do not second guess your choice to come here!  This chicken is MONEY. Since it's a ","useful":1,"cool":1},"2R14JdkHrwPFXy2GsM09OQ":{"text":"We are in New Orleans for the True Value Hardware Show. Gus's came highly recommended and ","useful":0,"cool":1},"ExW2mHrO8wxHjjuyEpCCsw":{"text":"Let me.just say, if you are looking for a place to eat and don't come here, you're an idio","useful":1,"cool":1},"503jQWDFS-yiiZfH-q2B6w":{"text":"Chain restaurant or not, Gus's has THEEEE JUICIEST CHICKEN EVER!!! Haven't had a bad meal ","useful":0,"cool":2},"5U2e3dZWkUK-Gg33AsEH-Q":{"text":"Dang good chicken!  Best I've had in a while!  Loved the Memphis and AJ was a hell of a wa","useful":1,"cool":1},"9w2e61_q9AVf2sMPpw6zfg":{"text":"I have been wanting to try Gus's and did so today. It is the best. Not greasy AT ALL. Perf","useful":0,"cool":0},"Ey9TrXFcovihxVWPeOKDPg":{"text":"I read all the Yelp reviews that rave about how good their fried chicken is. How could I p","useful":2,"cool":2},"pvpAaWZ6Z6uTSImq5f1N7A":{"text":"My husband and I visited Gus's World Famous Fried Chicken in New Orleans for the first tim","useful":1,"cool":1},"Z6T0FdpmQNk04F1oRadEIQ":{"text":"You have no idea how good they are!!!! I love their fried chicken so much!! We ordered 3 p","useful":0,"cool":0},"L8oJxkadf_n59Tkqfni41g":{"text":"We've eaten at Gus's in Memphis several times. I just recently found out that there was on","useful":1,"cool":0},"f6AzLlhyIzcQctbjuidUTg":{"text":"I was evacuated from Lake Charles & I wanted to try 1-2 places a week while here. I went t","useful":0,"cool":0},"ZBC715095_vHnsHZfnbKGg":{"text":"Oh my goodness!! I am in love with Gus's! The chicken is amazing! The fries and coleslaw a","useful":1,"cool":0},"xwXTsyIDhQxbvOHNn83Ysw":{"text":"Let me tell you!!!!!The Chicken is fresh and cooked to order. I ate here twice in one day ","useful":1,"cool":1},"uYFmV3JDmcejOfgDKEn1PA":{"text":"I've been in New Orleans for almost 4 years now. I have driven pass Gus's and always seen ","useful":1,"cool":1},"sA1yBbCQplRQzJ28M-2I_Q":{"text":"Oh my gosh...delicious and delightful place.  The chicken was on-point and the staff was b","useful":2,"cool":2},"UdowdMNj2VdMfZ8B2siJJA":{"text":"We loved the food!! Not only was the chicken amazing, but the Mac & Cheese!  Staff was gre","useful":1,"cool":1},"LLhR4MjUSStxj4WGAlk53w":{"text":"Imagine the scene... it was late at night, I was resting in the hotel room with my comfy c","useful":7,"cool":6},"WTPDXjwiVqyOBsLm6Mo6hA":{"text":"The chicken here was really good. Perfectly seasoned with just the right amount of spice. ","useful":1,"cool":2},"6DhuNRC2b63R2rWPNsItPA":{"text":"AMAZING probably the BEST FRIED CHICKEN we ever had!! Service was also quick and excellent","useful":0,"cool":0},"5GljQsk3Jq1cG99I6zEqfA":{"text":"Y'all !! I can't even fix my mouth to write a large review. This place is life changing ..","useful":0,"cool":1},"VH_47SvOhyyZ8Yyu0MAexg":{"text":"WOW you have to try this place out, may not look the best BUT it is the BEST. Chicken was ","useful":0,"cool":0},"DhBhPW7wM92BxaUlQ6UHLA":{"text":"The chicken here is AMAZING! I got a plate of two dark with coleslaw and beans. The breadi","useful":0,"cool":0},"gX31drE4jRQ-gOL7ulIuSQ":{"text":"This used to be a place my family and I would dine weekly but the ambiance has really chan","useful":0,"cool":0},"ISJC-h8j7i7tZwGcb4hDzA":{"text":"like the chicken very much!\ncrispy and juice chicken.\ncoleslaw are tasty also.\nservice are","useful":1,"cool":0},"1zjayaZPcErMl9H9UrvSPQ":{"text":"I had ordered through Uber eats the chicken was cooked perfectly and the baked beans was a","useful":1,"cool":1},"Bmzfk5Gl5zBXuimZz4qsdg":{"text":"Took my daughter here for the first time tonight and she loved it!!!! AJ is AWESOME!!!","useful":0,"cool":2},"mvGWJKl0BfGybtiSJD_uqQ":{"text":"This is truly by far the best fried chicken I have ever had! It is fresh, not greasy at al","useful":0,"cool":3},"WSZb-jKReSItxycyz6ggJw":{"text":"Oh man! Awesome yardbird.  I'm told Willie Mae's is better but how can it get any better?\n","useful":1,"cool":1},"fNQXn0CV_t_QYsLh0xvtqA":{"text":"BEST FRIED CHICKEN I have ever had. I have been searching for fried chicken all my life (h","useful":3,"cool":3},"y6KH82c4MvpXLOS3TdrGyg":{"text":"Hands down some of the best fried chicken I've ever had! And that says a lot!  This place ","useful":2,"cool":2},"ZuLojyZbY9vmp1OScs5SxQ":{"text":"The staff was so nice.  I love the decor and vibe.\nWe ordered one appetizer which was the ","useful":5,"cool":2},"5Ass2hkwuBDFIW8NcCAkdg":{"text":"Oh. My. God. One bite and my boyfriend and I decided we'll be back. It's the best fried ch","useful":0,"cool":0},"4MdTtg6EF85UqJ_Ig0f61w":{"text":"That chicken was on point. Was going to drive and eat one try and I had to pull over and e","useful":1,"cool":1},"S-lJEikAKxAnFH6q-cExmA":{"text":"I ordered 8 piece with 4 sides, extremely slow, from the time I ordered till the time we g","useful":0,"cool":0},"1grYvbttNRE79zzGCWc-oA":{"text":"The food was delicious!The MAC and Cheese was fantastic.The chicken had some spice but it ","useful":0,"cool":0},"7tkhNj8gAteZtAAgidcb2Q":{"text":"Great food best Fried chicken I've had. I forgot my wallet there and they had it very grac","useful":0,"cool":0},"ER-oUdjQZxibR1YDJaq79Q":{"text":"We visited from AL where the service is consistently terrible every where we go. It was su","useful":0,"cool":1},"OQKJYRWDvz4hlyfoAgdcbQ":{"text":"5 stars for the delicious chicken, but the hour long wait made them lose a star for me. I ","useful":0,"cool":0},"_P5194khb7gOlPTBLTWNpA":{"text":"One of the best places for fried chicken in the city. The chicken is amazing, slightly spi","useful":0,"cool":0},"hNlZggJuRIU3cgvFwo4y5w":{"text":"Cute spot! Arrived around 6pm, no wait! Staff super friendly and accommodating. I ordered ","useful":0,"cool":1},"qHKnpI19wpsBVoRnLQxV3A":{"text":"This chicken is the BEST IN THE CITY. It was fresh and the spice was just right. I will de","useful":0,"cool":0},"qzDDZWGt-7iARaEeXb7tOw":{"text":"We were so impressed at how delicious the chicken was at this restaurant.  We highly recom","useful":2,"cool":2},"LHoK_5wEt_ZkGGQ1cDbOlA":{"text":"Was in Nola for a workshop which lasted all day! They gave us a hour lunch which we came t","useful":1,"cool":2},"e8QP6GnTskVo4GIJ2Uc3BA":{"text":"When they say World famous fried Chicken they mean it!! The environment was awesome our se","useful":0,"cool":0},"3MiTIRfCz8jMsx04MGU5dw":{"text":"I did not enjoy it how everyone else did. The chicken smells good upon receiving, but afte","useful":2,"cool":0},"goF2S9CvPAPgMREzlusXxA":{"text":"Ok, so the chicken here is amazing. Hot, crispy, and juicy, and perfectly spicy. Really de","useful":0,"cool":0},"jywKEjH5BKWLXP5vAlofsg":{"text":"Solid fried chicken. Slightly spicy.   Causal atmosphere and great service.  All they serv","useful":0,"cool":1},"ODDNkciXpU2sohvUAcodYQ":{"text":"Gus's is good fried chicken, it says hot and Spicy, well not too hot but good spice which ","useful":0,"cool":0},"54liTSkLY0WQufDleYyT8Q":{"text":"Every time I travel the first thing I look for in a town is Gus's. I love the food and atm","useful":0,"cool":1},"ehZuhSkm57HK-8E-CbwZJw":{"text":"From Memphis so this place brings me home. Thank you for coming down to NOLA! Chicken is t","useful":0,"cool":1},"YDyb-XvBmCZM7GPipoz54g":{"text":"Our first stop in our first trip to NOLA, the food was amazing but service was better! AJ ","useful":0,"cool":1},"O17Z8tBCO97Q5XaN_5zk5w":{"text":"Gus Gus Gus.\nAlthough this is a \nNational fried chicken\nWinner it was not my\nFave. I waite","useful":0,"cool":0},"GDASIaF6GTruoaoFy_dxZw":{"text":"Wow....I didn't have high expectations, I thought Fried Chicken is Fried Chicken wherever ","useful":0,"cool":0},"45KlLGgOtE28fh1NSslJcQ":{"text":"Sooo, if you're ever in the mood for some really good chicken! GO TO GUS's.... I didn't kn","useful":0,"cool":1},"_4oyLfps-Pec4LnGyXdPeQ":{"text":"My family of 6 came from Miami to enjoy authentic fried chicken and Gus met our expectatio","useful":0,"cool":0},"dbU0-yE187WV0oNjuZwFNw":{"text":"This should be your first stop when you come to New Orleans, WOW. I have never seen such r","useful":0,"cool":1},"6J1gailU9PL8h0TnNhuPBQ":{"text":"I had a good experience here, decided to stop by after trying them at one of our local fes","useful":0,"cool":0},"lKDkOSFELwAOMVdl0hk99A":{"text":"Pretty good fried chicken. Different. Batter is a wet style and has hot sauce in it. Good ","useful":0,"cool":0},"eylhq8BZGy1BQM25iGBRCw":{"text":"I ate here today for the first time....... Chicken was fried to perfection!  The Mac and C","useful":0,"cool":0},"02TOBuoIqskY80qWonndpg":{"text":"Amazing fried chicken. Coming from east coast, we are used to Pop eyes chicken and we thou","useful":0,"cool":1},"iYzRK_HTXC-sr9YQ_9bVqQ":{"text":"I'm glad to report that all of the good things I've heard about Gus's is TRUE!!\n\nDined in ","useful":3,"cool":4},"u_1MLhlojByGa11AMNzlqQ":{"text":"There is deliciousness, and there is Gus's, which is beyond. This is the way fried chicken","useful":0,"cool":0},"sHn7CkfdAHeKqA8uut2JsQ":{"text":"Hands down best chicken I've had in a long time. The chicken slides right off the bones. T","useful":0,"cool":1},"fnIaCPQwLLkd2IGV_Dx-pQ":{"text":"Went during the Corona lockdown for take out. We had 5 separate orders with substitutions ","useful":2,"cool":2},"7R6lw-0zTTwLufTVmEp6zQ":{"text":"AJ is the BEST server here!!! Amazing service and conversation - so polite and interesting","useful":0,"cool":1},"Ji_qantzGEpbSykABP8FAQ":{"text":"Definitely better than Willie Mae's. Less greasy, more flavorful batter . NOT spicy .","useful":1,"cool":0},"4WJl5r2rjqAWw8ftwgimeQ":{"text":"How do I say it?  The best dang chicken ever!! I'm not sure why others eat at the other ch","useful":0,"cool":0},"T9cmc5_a-F5yT0PnGfvsxA":{"text":"This was my first time ever being here in New Orleans & Pierce gave the greatest customer ","useful":0,"cool":0},"CuS6UnYeueZqHprbNzyJOg":{"text":"There do not have a parking lot. You will have to street park. \nReally homey. Just go in a","useful":6,"cool":1},"rt1CTxLavau31rZRuTxQiQ":{"text":"I was super disappointed with the chicken here! The tenders were not juicy at all. It tast","useful":1,"cool":0},"7iz_5i-ciTmTFbvOBrPD6A":{"text":"While staying at The hilton garden inn for a tradeshow. We read about Gus's chicken and th","useful":0,"cool":1},"_KbCv842BP3tVWR9_C2V9g":{"text":"I've heard such good things about their hot chicken and it did not disappoint. Super crisp","useful":0,"cool":0},"ffZJTeA7xGstHpJUR36KNg":{"text":"The food is good and the place is nice but they real reason to goto Gus's is for AJ!! AJ i","useful":1,"cool":3},"Lqz2WU5nt_iGhqtGM6_Gvg":{"text":"I have to say that the  the fried chicken was very good. It had a hint of spice to it and ","useful":2,"cool":2},"L4A6Iyom6uBBU5DgKW4N1w":{"text":"The chicken is really juicy. Cooked to perfection! Didnt realize it was a chain but defini","useful":1,"cool":0},"7JAiyHmZ7NMQXWt66Ld5mA":{"text":"Gus's is world famous for a reason. The fried chicken is one of the best.  I highly recomm","useful":0,"cool":0},"WpZZdlu9B97G64iNTM_6Lg":{"text":"Best fried chicken in the city. Literally. Thought Manchu was best until they came along. ","useful":0,"cool":0},"o93l2K3PQY1FrZstlzJ2Mg":{"text":"This chicken y'all!!! Amazing... hot, crispy and just the right amount of spicy. Service w","useful":0,"cool":0},"ysbrcarcqdKSzxRHywZVwg":{"text":"Best chicken i've ever had.  We were approached by this lady who offered us pies the momen","useful":0,"cool":1},"QLym3lorBg4BWp1U0jCBhA":{"text":"I am having a hard time composing this because \"tha itis\" has set in - but I had to post a","useful":1,"cool":1},"1MyuEgnhiX_5Iq0yYJKv4Q":{"text":"Not from the area came to this place and couldn't have enjoyed my experience anymore. Pier","useful":0,"cool":0},"6SoL1dKxiRml84jpeIXIWg":{"text":"Prior experiences here were very, very good.  Last night's order of chicken was greasy, gr","useful":1,"cool":0},"FdcTd45MvHML_QXnwJUzbA":{"text":"I have been trying to get to this location for a long time.  Looking at the pictures, it l","useful":3,"cool":1},"wTJ54IDgBnUKK81M_aBo1Q":{"text":"A co worker and I stopped in for lunch. The place was steady . . not too busy. We were gre","useful":0,"cool":0},"uUvP7O2Xsx6xKfm38tPAwQ":{"text":"Gus's chicken is unassuming from the outside.  It looks like a local hole-in-the-wall that","useful":1,"cool":1},"hienQ5CJWethl9hjpx7nJw":{"text":"If you want some good old fried chicken this is the place for it. The place was clean, foo","useful":1,"cool":1},"Ogxrcy7ISLKUh0H9KQSHQQ":{"text":"Cas si beaucoup bon!!!! Talk about good. \nI'm eating a half chicken, greens and beans. Tot","useful":0,"cool":0},"DbfFMHQeTf495nGkz7by6Q":{"text":"This is definitely my go to spot for the best fried chicken. The cole slaw is very delicio","useful":1,"cool":1},"xkiJIiH2w7XanqGVAYVkJg":{"text":"I came twice and service was great with the old guy and horrible with the fat chick but fo","useful":1,"cool":0},"BM6bUZTLEAz-3TqVsuP-Uw":{"text":"This place is one of my new go tos. The chicken is very crispy and juicy with the perfect ","useful":2,"cool":2},"vZ6mZNQEwIzhF4rtBiL1WA":{"text":"The chicken is the devil in a good way...if that even exist!!! The only place where the br","useful":0,"cool":1},"D9zwG1LEb4WdhqyRrtP78w":{"text":"Stooped into Gus because I had a craving for their chicken so I ordered for a group of fri","useful":2,"cool":0},"P1O7hGApMMpcRk_l5u7Npw":{"text":"Dropped by on our way to the WWII museum for lunch - the place itself was very nice with a","useful":1,"cool":1},"qhSFGY9zryVWfhpMqtVdqA":{"text":"This place has the best fried chicken in New Orleans. Everybody's friendly and it's a grea","useful":0,"cool":0},"wtJTsblM0J6huBcqwE3-Fw":{"text":"Tastiest fried chicken chain in the world!! Everything is made from scratch in house. The ","useful":1,"cool":0},"4EpZ-dvPdMZyG8ur0YITNw":{"text":"The food was ok but it sure wasn't the best. The service was good considering they had a l","useful":0,"cool":0},"Svk2M6Z6nTzlR9p7JUqsCQ":{"text":"Good food for sure. They may have over exaggerated the whole \"best fried chicken thing\" bu","useful":0,"cool":0},"QhzwLX_nW7utdC1mtLa88A":{"text":"It ok i guess! Nothing crazy to write home to mom about! Their chicken was good but not an","useful":0,"cool":0},"AqxrlTRiL2I8xTFN1HBBiQ":{"text":"My wife and I were on vacation in New Orleans this year in May. We had one mission on our ","useful":0,"cool":0},"ymm6OUbIOS3C5SeoPdQOTw":{"text":"Amazing! We are so glad we visited here! We had the fried chicken, mac and cheese, collard","useful":0,"cool":0},"h_dl2xG3qGwKF5F-HIJwSQ":{"text":"Great chicken family ! Hot and spicy. Great prices and fast service. Great for pickup. Goo","useful":0,"cool":0},"pDRX0B8SwhMeTqYsBEc46g":{"text":"Enjoyed the atmosphere, they had the side of the building open, like a large window, the c","useful":0,"cool":0},"bDqkbzklBzE8lIAL5eM1eg":{"text":"Finally took a trip here with family to try the famous Gus's fried chicken and it did not ","useful":1,"cool":1},"QfpiqlblDrQizmy9-UKrKA":{"text":"Gus's fried chicken hit the spot. I came to New Orleans searching for great southern fried","useful":0,"cool":0},"WfTEibBntV-nQ4IrkLjC3g":{"text":"Great fried chicken. One of my New Orleans favs!spicy but not too bad. I can't handle a lo","useful":0,"cool":1},"pjGP3XHhI5rX5qYZJPe6jA":{"text":"The crust of the chicken was like eating cracking. So tastefully and it was seasoned well.","useful":1,"cool":0},"5ndcugg2pshgyCwuUNJyNA":{"text":"I experienced quick service with friendly waiting staff. The food was ok at best, I didn't","useful":1,"cool":0},"rj1kz0EOgp_JzFAwWfYgQA":{"text":"The chicken is good but the Mac and cheese take like it came out the box gross. The baked ","useful":0,"cool":0},"KyC0u686ShTHXAAV6dI5Og":{"text":"Tried this place because our other favorite was closed for memorial day. First time a d it","useful":0,"cool":1},"o6Askz7nCHK5Z2Dfuzr_kw":{"text":"Hands down the best chicken we have ever eaten. Coleslaw, mac n cheese, fried okra and bea","useful":2,"cool":1},"kEGGtDgpjpqOYalEvTdGjw":{"text":"Was walking down the street looking for something quick to eat.  Passed Guam's and stepped","useful":0,"cool":0},"hRrNxGL4L-C5d6-sYCugvQ":{"text":"Very cool place, chicken was good, customer service was even better. Pierce our server was","useful":0,"cool":1},"T_xpnDMpcsceUbU01gUauw":{"text":"A short walk from the World War II museum is Gus's World Famous Fried Chicken. The chicken","useful":1,"cool":0},"IB2vdEL4SkA8aosXLxROvw":{"text":"Droping off our Daughter for another adventure at Tulane. Decided to stop at Gus's for lun","useful":0,"cool":1},"JCXpxT_5njOQM2uakMUaXQ":{"text":"Wanted a quick bite to eat so I ordered take out. The Fried chicken was very good. It was ","useful":0,"cool":0},"3s1zUsgwCDu_9--zTm3Qig":{"text":"We make it a point to stop at Gus' every time we're in New Orleans. It is worth the 2 hour","useful":0,"cool":2},"L5REiknEMu7axbWgajGsOA":{"text":"I love Gus. This is the best-fried chicken this side of the Mississippi. I have had my sha","useful":2,"cool":1},"XCH4dapT87Ba285g7jq0ew":{"text":"As fried chicken goes, this is the top of that pyramid.  Wonderful cornbread crust, just t","useful":0,"cool":1},"xQM-rRtgaTihAzq1XoQfrQ":{"text":"Some of the best fried chicken I've had in a long time. The side were fantastic, as well! ","useful":0,"cool":1},"PBk7KItcNuRjIAlBfjIO4g":{"text":"Pleasantly surprised on how good the fried chicken is as well as the side of mac and chees","useful":1,"cool":1},"-B2dDglNuqp0aRcoeTVqKg":{"text":"I will begin with why I am leaving only a 2* review...It pertains to service!  On 11/2 we ","useful":0,"cool":0},"XAt572Fw2Kut4_MgvRh3NA":{"text":"Nice and spicy.  Fried fresh while you wait.  The service is also great!  I try and visit ","useful":2,"cool":1},"ZIXd0nM0OffeUufeMHC_Tg":{"text":"Great fried chicken, especially to share with friends! One of the waiters told me to try i","useful":1,"cool":2},"aHm12zHIV2fxcWhrPUyQlw":{"text":"Hot and fresh and made to order! Keep in mind I'm a local! I'm not speaking from a tourist","useful":2,"cool":1},"PXbgTZr0YXhm0MmwLZcPSQ":{"text":"Just recently went for the first time I must say I was expecting so much more I guess caus","useful":0,"cool":0},"BfFwUsIavFoe0ZkNpTj26g":{"text":"Found this little spot while passing through New Orleans. The food was amazing, the atmosp","useful":1,"cool":1},"gmqICCRbyG0VuDloVDXZ-Q":{"text":"Raw chicken. Got it on doordash. And I ordered a lemonade and I didn't get anything. Calle","useful":2,"cool":0},"W51c-UppJ1imJCBTcdbHAw":{"text":"I never was a fried chicken girl until I tried Gus now I'm in love with they impeccable we","useful":1,"cool":2},"F6ncF-Insjytl7xP6euk4w":{"text":"Best chicken i have ever had hands down.  I would love to know how they cook it. Its juicy","useful":0,"cool":1},"6WCFrvyj8Ph0qH_mTzfE7Q":{"text":"I've eaten at Gus's in Little Rock, Houston, Austin and now in New Orleans! This meal and ","useful":0,"cool":0},"fCPResDIId0Zs2zonpgnvw":{"text":"Ugh this place is my kryptonite! It's just sooo good. I've been ordering this since we've ","useful":5,"cool":0},"1alWXeepqm3dSdo8WGemGA":{"text":"This place never disappoints. So good I have on in my hometown and still went there while ","useful":2,"cool":1},"q84PZa1h11ffZITICrPdHw":{"text":"This chicken right here is special. They might not be local but they have fresh ingredient","useful":1,"cool":0},"rrpavm82-axYPcV9f33kSA":{"text":"Casual and relaxing atmosphere and quality food. There are multiplied chicken options and ","useful":0,"cool":0},"x3UKZ7aUMPoSTsU1J2nP-w":{"text":"Gus's is my favorite place to go. I travel for work and look for one everywhere I go. Wife","useful":0,"cool":0},"uOBzch7Y3IH40Ji5NMIAHw":{"text":"This is a great place to eat!  Fried chicken  with a kick.    Had their greens, Mac n , fr","useful":0,"cool":1},"vmujSqs3XwZDuDby7spJMg":{"text":"Nothing beats eating fried chicken from the South. We had the cajun spicy chicken sauce, w","useful":0,"cool":1},"Sxx9wKfgUxKXaaySBx-Anw":{"text":"Waiting 30 min for a to go order when they only have four tables of people, is ridiculous!","useful":1,"cool":0},"Qez9P_q0_rbZ4Ucc4Yt6gg":{"text":"Man I wish I would have taken a picture before I completely demolished my plate.\n\nI walked","useful":0,"cool":0},"AMJblUNzzsOnqwBaun8nBw":{"text":"I had the Memphis special of the day and it was only $10. The fired chicken was so good wi","useful":2,"cool":1},"gTTz93StKAq0dhuCzUwSjA":{"text":"AJ adds great flare & friendliness to the front of the house as cashier, host & server - h","useful":1,"cool":2},"VhxV7pNRzEtl-JWKwVxOPw":{"text":"This is literally the best fried chicken I have ever had!! I first tried Gus's at the frie","useful":0,"cool":1},"HEROruntgrOHvCz5stk-EA":{"text":"Gus's was alright to me. It's a place that I would most likely go to if I lived here and w","useful":1,"cool":1},"NrFkc950MdgmQklEh_wmdA":{"text":"Some of the best fried chicken I've had anywhere in the country. \n\nPerfectly cooked, wonde","useful":2,"cool":1},"oFXzjwU6u0CHqM496XI0bw":{"text":"Food was great and everything was fresh. There was no wait unlike every other place in the","useful":0,"cool":0},"B3nxsrqhFXLD09vDkv0OOg":{"text":"We've visited Gus's in a couple different states now and each one is delicious!! This loca","useful":1,"cool":1},"7vMnx57z9jFCpPT0_D4Ntg":{"text":"the fried green tomatoes didn't even last long enough for me to think about taking a pictu","useful":0,"cool":1},"jF9kGU4MggTf063bJVoKPw":{"text":"Delicious fried chicken with incredible hospitality. AJ was the best server we've had at a","useful":1,"cool":1},"s4Q1xdbFe5qgcovT4gGa9A":{"text":"I'm not ashamed to admit that I'm somewhat of a fried chicken aficionado, so Gus's has bee","useful":13,"cool":13},"vnIzhc59P5wZd_VM66x6pA":{"text":"We have a lot of good fried chicken in New Orleans from Willie Maes to your local gas stat","useful":2,"cool":1},"8pL-SubkO_-BhdsDQdtB8A":{"text":"Best place I ate after spending almost a week in New Orleans \n\"1.Customer Service was amaz","useful":2,"cool":0},"duPR50YTjpnBtlzt8TzUAg":{"text":"O.M.G. That fried chicken! The best. We travel around the country and have many \"best frie","useful":2,"cool":1},"jH4YDV6w7nz4rVHOCWLC8w":{"text":"Delicious chicken was hot and seasoned to perfection. Mac and cheese was great. Collard gr","useful":0,"cool":0},"ar3LHGam75tKoP0-f-Bhsg":{"text":"My husband and I can actually say this was the best fried chicken we've both had and that'","useful":0,"cool":0},"xcP69s8RiUcSL3vuQuezCg":{"text":"The Yelp reviews had my spirits high for Gus's but I was highly disappointed in the fried ","useful":0,"cool":0},"FFd7BMwjKnGBcfrABVD3Qw":{"text":"The mac&cheese and potato salad are great side items. \n\nI see why people outside of New Or","useful":1,"cool":1},"fpx_rL43HQvZRj49ZunvZA":{"text":"Fried chicken was a perfect spice, crunchy skin, and juicy meat.\n\nIn terms of the sides, I","useful":1,"cool":0},"ps7ZrF8DFOjTblBYkUDkSA":{"text":"This food was so good from the thighs, legs, wing I had down to the well seasoned fried. M","useful":0,"cool":0},"rpo1V5K7vJO-aimWt7PEhw":{"text":"Chicken make up for the slow service and we had a waiter that communicated well. It's hard","useful":1,"cool":0},"l8zqXk4ntbv4s67-iv0ePw":{"text":"Such juicy chicken with crispy skin and not too much batter~ just enough spice to make it ","useful":0,"cool":0},"vNYcv902wcIC0_cxb40pYA":{"text":"This is my third Gus location that I have been to and they did not disappoint. I did a tak","useful":3,"cool":3},"6wtUQJuSwaak23Y4INrsAg":{"text":"This is my third Gus's visit (previous ones were Atlanta and Mesa) and this was my worst o","useful":1,"cool":0},"pLSn_3tpScT75oqoY8gLLw":{"text":"Service seated us fast and we were forgotten. First they was out of okra; this is the sout","useful":2,"cool":0},"Zyk6KUeHIliK5CDJR7zvIA":{"text":"Excellent chicken & sides, nice location & good service. Great desserts too. Menu has lots","useful":0,"cool":0},"GORQBp-1Za9x9hhGzLyYEQ":{"text":"I took it to go for my family for the first time on Mardi Gras Day 2020.  The entire resta","useful":1,"cool":1},"gyeVl5p__ztu4jVw3Nggpg":{"text":"What have I been missing! This isn't just your average fried chicken spot. Crispy, juicy, ","useful":0,"cool":0},"f5CxuAXMqQO6enGS4iIXqA":{"text":"This place was AMAZING! I'm not even a big fried chicken fan and I will crave this! Perfec","useful":1,"cool":1},"gZeESspI8YxzhU1RPL9MLw":{"text":"Great fried chicken and even better customer service but not sure why it's 'world famous.'","useful":0,"cool":0},"IHbr2cUUg0ZJFT3S-7BrKQ":{"text":"So, really...where do I even begin!? \n\nI was introduced to the greatness that is Gus's in ","useful":3,"cool":2},"sIqFMu2VViWIe-Cfv4xUdA":{"text":"It was so good and so close to my room I went twice. I still think about this chicken. The","useful":1,"cool":1},"lhk4o2iM2tnExa_loA1-cQ":{"text":"I'm so sad cause I was expecting amazing food. The chicken is pretty decent in my opinion.","useful":2,"cool":1},"MG__D-wYWQpZYz118zfVrw":{"text":"Crispy skin fried chicken\n\nNot like other chain store, the chicken here has very crispy sk","useful":0,"cool":0},"SFE2X9G-4kPSfKd4QvJ8Ag":{"text":"White & dark chicken excellent. Slaw nice. Mac & cheese gummy. Don't order soda - their mi","useful":0,"cool":0},"tqRLuAz9h_6Mwq6zGoDQUw":{"text":"Let's start off with the lack of organization and staff. When we came in we were greeted a","useful":1,"cool":1},"Lc368lyrWeYcxrYiokK4hg":{"text":"If you're looking for great fried chicken in New Orleans, unfortunately Gus's is not your ","useful":0,"cool":1},"8BYTMDTTag4DkCDDC_jmcQ":{"text":"On a sister date with my sister we decided to go to Gus Chicken. I have been to Gis multip","useful":3,"cool":3},"ODrPXmBI03dzEc19BgYPiA":{"text":"Not sure what to say! This place is everything! Absolutely incredible fried chicken (with ","useful":0,"cool":1},"RJ1evpetxHlllJDeKvKpsA":{"text":"During the fried chicken festival, I had to try Gus's and they delivered. Piping hot and c","useful":1,"cool":0},"74qnsJ3EgCKMaNVaB5epbg":{"text":"Had a great time with great food! Ashley was a wonderful waitress! Will come back next tim","useful":0,"cool":0},"5XUmnZ2dJpZoKJhbVruhXw":{"text":"This is so far the best fried chicken I've ever had in my life. We we're there on vacation","useful":0,"cool":0},"nhaeOJHs29nMHfu9IzIPnA":{"text":"I've eaten at other Gus's World Famous Fried Chickens and they were way more spicy and del","useful":3,"cool":2},"NjmQ5WQZ5vt7T-yWBvhUww":{"text":"Probably the best fried chicken ever. Fried and perfectly seasoned, you will eat it to the","useful":0,"cool":0},"rky46dQruzP0R_SxHSzhrA":{"text":"We were hungry and tired and just landed and it was late at night. We ordered food from Gu","useful":0,"cool":1},"E1zzizMTftVCN21SxsjS6g":{"text":"This could have been one of the best meals I have ever had in New Orleans! The chicken was","useful":0,"cool":0},"4SVCL4lfW9UeSTfxBhjlhg":{"text":"This would have been a 5 -star review..if they didn't forget about our orders...while ever","useful":2,"cool":2},"flmD6YlOhWTBvybgXaoHKQ":{"text":"OMG amazing, slightly spicy, served HOT fried chicken, wonderful sides plus bottles of cha","useful":2,"cool":2},"TO5SaChP_2Bm-72YR7X9Gw":{"text":"On vacation in New Orleans and this has been the best meal I've had here by far. The fried","useful":0,"cool":0},"WdWot5uEJbFLI-NGEKBVSQ":{"text":"3.5 spicy non breaded fried chicken but not quite as juicy as expected.  nice amount of he","useful":1,"cool":1},"us2Ddy0fomGRUXfdLCzKPQ":{"text":"Best potato salad from any restaurant I've ever been too!! Food was good, service was good","useful":0,"cool":0},"AzlvWvov20c9Pf44hF1njg":{"text":"This fried chicken is so good it will make you want to slap someone's mama! The food is so","useful":1,"cool":1},"BvF7PlEShvZ-gF3tkX77Xg":{"text":"Nice casual atmosphere for a Saturday night. Extremely friendly staff and our waitress was","useful":0,"cool":0},"hMR8s7yR0cAso18YG1iU6g":{"text":"Crispy, hot, and perfectly seasoned fried chicken. I always get the mac and cheese and fri","useful":0,"cool":0},"ic9nNkqUPgIlDlHnN6tdYQ":{"text":"This place has superb fried chicken. I truly can't put in words how good the fried chicken","useful":4,"cool":3},"rMMiCA3U5e7ALPKj3gqGNA":{"text":"I have been waiting to try Gus chicken for quite awhile and was elated to see a New Orlean","useful":1,"cool":1},"3DsSVh_rKF9UHGagWu4g1w":{"text":"Gus' food tastes like home cook goodness. The fried green tomatoes were the best I've had ","useful":4,"cool":2}}