{"d5Ybsq0pV7vKhtthvJSIuQ":{"text":"One of the best places in New Orleans. When I first moved here this was one of the first p","useful":0,"cool":0},"UelSEfx-uqD0BF__GmD-Gg":{"text":"Stopped in for dinner cuuuuuuz we were too lazy to cook.  It had been a crazy week, so of ","useful":1,"cool":1},"OieevggpgB0zicRUOrLb6g":{"text":"Great food! Good drinks ! friendly staff ! In our experience   \nWe got so much food for wh","useful":0,"cool":0},"Wb1CTMhl7-laXOU_aFXmSw":{"text":"Love this place! Full of locals looking to wind down from a hard days work and to have a g","useful":0,"cool":0},"cnSCfeLcCUxGHfCYfpWw1A":{"text":"We asked a cab driver to take us somewhere local with good food and he dropped us here. I ","useful":0,"cool":0},"fKStRSpVRvzGR88wxdDhZg":{"text":"Total neighborhood scene - good food in fun, shabby setting.  Uber casual.  Cameos of drun","useful":0,"cool":0},"wObyJwJpiIkl61xFLbwwrA":{"text":"I inevitably end up at Tracey's every time I'm in New Orleans-- usually more than once.\nTh","useful":1,"cool":0},"KTifdTY86aEgZhIdRF305g":{"text":"This is NOT an Irish pub. It's a bar with a bunch of green crap thrown on the walls. If pa","useful":0,"cool":0},"F5vjbBgsV1y_Pip64MaTeA":{"text":"As a health freak I leaned towards the salad option. I didn't have a high expectation at a","useful":0,"cool":1},"yJC0Gw3i66UVocP5WouOgQ":{"text":"I wish I could give zero stars. They were out of numerous foods (shrimp, fried pickles, bo","useful":3,"cool":0},"h6SVFyhl-wowhRWSZ9PmjA":{"text":"The food was fair the atmosphere was great.  By 1pm on a weekday the place was packed.  It","useful":0,"cool":0},"c1INy9jRFwN-C4RPjbULEA":{"text":"Great place, local crowd and some of the best po'boys around. You really can't beat it.","useful":0,"cool":0},"D3ylLDbVB9RmjS4DUaNM2A":{"text":"Got here at 9:45. Didn't realize they'd cut us off from ordering at 9:55.  Very disappoint","useful":0,"cool":0},"422jXm5fGmf_Pqjvvs4_bw":{"text":"The gravy cheese fries are heavenly. I have had some poor service when it was really crowd","useful":0,"cool":0},"hzcb2o3bndfQs4pSJw3cGg":{"text":"Had the roast beef poboy. It was very good... Definitely need lots of napkins. It's nice w","useful":0,"cool":0},"qG_0RoCnZEW4wV1VeCXOVA":{"text":"I am ashamed to say that I feel this place deserves a five star rating.  At least four.fiv","useful":0,"cool":0},"y8W_itIVVFn_WozJ-D_lww":{"text":"This place appears to be a cool little neighborhood pub. However, the bar service is abysm","useful":0,"cool":1},"RXUpfLzMyXuRej576GjIkA":{"text":"What kind of monster serves a muffaletta with no Olive salad on it? Tracey's. I have been ","useful":0,"cool":0},"bValLV0sRte2iWuEZd4ltA":{"text":"I'm not usually a fan of Irish sports-oriented college bars but I was so happy to come acr","useful":1,"cool":0},"JuNpiqKYHUgy2BjifzwvFw":{"text":"Food was good. Atmosphere not so much. The older male cashier appeared to be annoyed to be","useful":0,"cool":0},"TxcXrQoxPxSzwJNLlQEDPA":{"text":"My husband had read a lot about the Parasol's vs. Tracey's roast beef po boy rivalry and d","useful":1,"cool":0},"3bRmusxw2CRdjzL2Hbe9Cg":{"text":"Laziest service and mediocre food. Bar smelled like pee and the tables were filthy. You ha","useful":0,"cool":0},"ffeGJVJC_l3ZO8KXbtV7Qw":{"text":"After two days of disappointing meals near Bourbon street, and a lot of drinking, my frien","useful":0,"cool":0},"u2Kwa4NSOokDZmDWCshb4Q":{"text":"I come here for the sports, but always leave once the game is over. Tracey's is not as muc","useful":2,"cool":1},"yDI5VO3PRuZfiq8_K3qZJg":{"text":"We met some people here while we were on a trip from Ohio State. The whole environment is ","useful":0,"cool":0},"D32Yk2HTOXkT_NRzS0-SNw":{"text":"Good local bar. \n\nGreat staff, as long as you play by the rules (I've never had trouble, b","useful":1,"cool":1},"ah95T0IfrZQ2jbgWZVWzqg":{"text":"Today, Thursday the 2 April..... They have the worlds WORST bartender working. She pays mo","useful":0,"cool":0},"8qW69_bfXJKPulJsTbrbCA":{"text":"So this was a pleasant surprise,  I love the mimosa and they also cook!  The fried fish is","useful":0,"cool":0},"lux9n506g2sFP4JIE46YBQ":{"text":"So happy to be able to update my review. About six months ago I had a bad experience at Tr","useful":0,"cool":0},"myUoapbUPJ_U1IqEX6EF1w":{"text":"I had really high hopes for this place. I've heard great things, and I really wanted to go","useful":0,"cool":0},"39xoGUFfoF-z33ps0Np5sQ":{"text":"Came here to wait for a cab so the guy could find us.  Decided to order a drink so as to n","useful":1,"cool":1},"msjSwA037sON_iGB1g3S5Q":{"text":"Good food. Casual and friendly. Prices are reasonable. Order your food one place and pay a","useful":0,"cool":0},"Pwxy6AahUVIUCBkafsyuBQ":{"text":"I had heard good things about Tracey's, so I brought some out of town guests there the oth","useful":1,"cool":1},"kNR4qjzo5iG8os7YhH0HKw":{"text":"This place is DISGUSTING!  We had visiting relatives--who are very familiar w NO food.  Si","useful":0,"cool":0},"6meMpbQ0eeTz2fMAoUFVBQ":{"text":"Fun bar but a lot of the food is garbage. Roast beef po-boy is overrated. Fried shrimp isn","useful":0,"cool":0},"9kEpCO1X071OvbAVArlhWg":{"text":"Tracey's is a special kind of place. The food is exceptional and I personally would put th","useful":1,"cool":0},"KLWeVG5Lw3r4C2c8yy0Kmg":{"text":"I was leaning towards one star, but they were fast at the bar, which is a rare quality now","useful":1,"cool":0},"a4sDAs-cXRXNf0D2_2tAcw":{"text":"This place was pretty close to where we stayed on Magazine St.  I had heard good things ab","useful":1,"cool":0},"l7XBl_CYMiUW1mYAWYJFuQ":{"text":"I was only here because of my social ride group and ordered a couple of beers and to my di","useful":1,"cool":0},"IaRLoTCskwfSUn8Eis51-g":{"text":"Love their poboys and they have great meat pies!! Fyi this is not a sit down kind of place","useful":0,"cool":0},"R7Hmeg09oLA796O9OYIb8w":{"text":"\"Tracey's\" is one of our neighborhood favorites, a place we go  several times each week.\n\n","useful":5,"cool":1},"x7A9g0Kokm1xqtB94Sigfw":{"text":"We stopped in for a quick bite, a couple roast beef poboys. We place the order, pay and ar","useful":4,"cool":1},"mo3-I801I5Auc5y8PxJiDA":{"text":"Stopped in here on a Saturday night with a group of friends for a couple drinks during a M","useful":3,"cool":2},"pN8Uo_mYYrCZpGrwnS-Prg":{"text":"Not sure of the girl's name but the bartender with the arm tattoo COMPLETELY ignored us. W","useful":0,"cool":0},"CR6pGWxlNI0wGW9-5mZdAQ":{"text":"The same owners as the old Parasols.\n\nHUGE place, delicious food and awesome atmosphere.  ","useful":2,"cool":1},"zza0PLEA6BpaQbkN52wTzw":{"text":"One of the best places in town to watch football. What I love about this place is the vari","useful":0,"cool":0},"f8XBk-08UsfVt2yMUKhJmg":{"text":"Today we waited more than an hour for our small order, which never came - they are serious","useful":0,"cool":0},"zmJsAwQ5ruZvUOMsrgbNdg":{"text":"We stopped in one afternoon after walking around the garden district with plans for a quic","useful":0,"cool":0},"AdE48PDlmfQzPum-mIln5w":{"text":"Get the gravy and cheese smothered fries, roast beef poboy and just about anything on the ","useful":3,"cool":1},"Buwp1Mx-e9EbfCZopecK0Q":{"text":"Don't get it. Lots of good reviews here; wasn't the place we visited. Got a table, realize","useful":1,"cool":0},"Y1uHMR0wcp0bDItuDrR96g":{"text":"Kind of fun atmosphere, but it was challenging to get a drink at the bar. However the wome","useful":0,"cool":0},"7TAi9eJVj_S7f78vv9Xvww":{"text":"Stopped by Tracy's at the recommendation of the owner of The Green House Inn BnB.  We aske","useful":0,"cool":0},"tB2-ZrXNnwZNea5D1YTGSA":{"text":"They finally accept credit cards but the original Parasols is good but not as good as it's","useful":3,"cool":1},"ijgfuMvLi_tcI7YvjUBqkA":{"text":"The space is large and breezy and we easily snagged an outside table.  If they weren't doi","useful":2,"cool":1},"87N4M4XHlIO_Zx3rM_0rJA":{"text":"once upon a time, there was an irish restaurant/bar called parasol's and it had the kick-a","useful":4,"cool":1},"GKqdePjUmqbFHsft7SSVPQ":{"text":"This place isn't really me I guess.  I didn't love it.  I ordered an old fashioned and the","useful":2,"cool":1},"Lqsq-vDontnuBMUvV6Vf3g":{"text":"Found Tracey's while wandering the Garden District on foot.  It was a hot June afternoon a","useful":1,"cool":1},"XznPkvULRfrdk6HdJVvDjQ":{"text":"Worst place ever. Ordered poboys, waited an hour, and they lost the order. When we went to","useful":0,"cool":0},"MsfgFD87jJv5HIRu4iZ5Yg":{"text":"I came here to watch the fight with some friends because they wanted a place to watch it t","useful":0,"cool":0},"YrBgYuf5kFFfNa6BOWbMXw":{"text":"Sorry but this place is disgusting. We ordered poboys and fries which took over an hour to","useful":0,"cool":0},"93ifpaThzcErResCgiWCFA":{"text":"Dirty. Sticky table. Stale bread. Overpriced food for the quality. No chicken. Had to pay ","useful":0,"cool":0},"4Vrbt8xJ_EKJKtX40gg7AA":{"text":"Tracey's served me the greatest po'boy I had in all of New Orleans. The server was very he","useful":0,"cool":0},"N-jfkunp09B8NVNcsDmEgQ":{"text":"This place is a great space with lots of seating, many large double doors that are frequen","useful":0,"cool":0},"ataeE40JFREYeUMWIwx1SQ":{"text":"So thanks to a sweltering weekday that made me not want to even think about cooking and a ","useful":5,"cool":3},"GHjv5EAJVdXKzcRgQmYkfQ":{"text":"I'll admit its been a few years since I have visited, but I give this place one star for f","useful":0,"cool":0},"Hh2uXYmNfBqx7iAvetKwQA":{"text":"Catfish Poboy good. Shrimp Poboy really fishy. not good. Just Hope it was a bad batch.  Be","useful":0,"cool":0},"i89D-zUa1egJAr5H_Bw80A":{"text":"Caught in a NOLA deluge walking down Magazine on a Thursday afternoon we took refuge in Tr","useful":0,"cool":0},"Tfu1XIV-K_qZPLgfO2ZWeQ":{"text":"Very disappointed with this experience. Ordered a salad and a crawfish sausage sandwich. I","useful":0,"cool":0},"ioielF2bRfjIj3KvXbGyzw":{"text":"I might have caught them on a bad night. Ok, since it was pouring outside and their TVs we","useful":2,"cool":2},"Ffl1xeA8tMnhFWFFVPgqJg":{"text":"Really good food at affordable prices, but on 4 different occassions I've tried to order s","useful":0,"cool":0},"WiYVig4EtZ5e9_rSsS3aKg":{"text":"Best PoBoys in the city!!!! Don't follow the tourist herd and go to Mothers for the signat","useful":0,"cool":0},"q-IRGWzT_N1fIDH3RrItrg":{"text":"Good, fast food at a great price. We stopped for a snack and ended up with more than we co","useful":0,"cool":0},"FdYpT2925GuRo8ApQ4f8xA":{"text":"For reasons that will remain known only to my father, he insists on calling it Theresa's. ","useful":0,"cool":0},"qbST0SHHMkOgzO_cmINGBA":{"text":"Tracey's remains the absolute go-to for amazing kickass New Orleans food, all-things-sport","useful":0,"cool":0},"_Y4do27l8xGzr9g8-aLiRw":{"text":"One of our very friendly Uber drivers recommended Tracy's to us.  We were a little disappo","useful":0,"cool":0},"pHsVbN2vx8HPHkDACxI7UQ":{"text":"Tracey's is a great dive/sports bar on Magazine St. I come here every Saturday when Nebras","useful":1,"cool":0},"kHdoAypxtZBeAfQSIUjEZA":{"text":"BEWARE... The blonde bartender with all the tattoos is a thief..   This thief changed my t","useful":0,"cool":0},"MJLP1ZdxEmP2KjHaMORzEw":{"text":"A local told us of this place so we had to try it. Got the roast beef Po boy and it was gr","useful":0,"cool":0},"LVWGxziY3gFgx6K1SqEIRw":{"text":"Food is average, bar is above average, crowd can get annoying. With that said, if you are ","useful":1,"cool":0},"jw487gDsNNxeFvWMV3Jsmw":{"text":"Full disclosure, my best friend and his girlfriend work here. That said, I would hang here","useful":0,"cool":0},"jga8IfL7N_LkzDdwfF4GHA":{"text":"The best place, hands down, to spend your weekends during college football season. You got","useful":2,"cool":1},"8E8VTsb8IgG7RC5SBnlW9A":{"text":"The best poboy restaurant I've been to in new Orleans. The shrimp were huge and the roast ","useful":0,"cool":0},"aCWuJpKIvoefZgutypDY4Q":{"text":"Best damn po boy in NOLA!! Fresh oysters for an appetizer and cold beer . Friendly staff a","useful":0,"cool":0},"R4vAaIxp4fUgX4Sizr0nhA":{"text":"We went for dinner after a saints game, and even though it was pretty crowded with people ","useful":1,"cool":0},"-DvMVAiOTT9i84z-165Dmw":{"text":"Yes, it's a dive. But it's a friendly dive. We stopped in because our friends wanted some ","useful":1,"cool":2},"pA_DdVV7qjViN7IiMNK7gg":{"text":"Went here for lunch last Sunday and ordered the shrimp and roast beef po boys and both sur","useful":0,"cool":0},"SH2EtqT_C896ZrO0S1j6Qg":{"text":"Tired of the hustle and bustle in the French Quarter? Take a stroll down Magazine Street a","useful":0,"cool":0},"3TSHWnbM3asiAKw0acNGYg":{"text":"This place is just great! The staff is friendly and fun. The food is amazing (try the boud","useful":0,"cool":1},"h0ysXJKh3uEI6wVE2XbTWg":{"text":"New Orleans' most delicious, mouth-watering and quite juicy soft shell crab po-boy.  Next ","useful":0,"cool":0},"No92cKnNvMwYrX3S0Wk3CQ":{"text":"This five stars is for the roast beef sandwich, which came from Parasol's and is, I've bee","useful":0,"cool":1},"dZgDvCz_HHP91uYVtgFqnA":{"text":"Had to meet a friend in the garden district and stopped in here. Great poboys for a bar. H","useful":0,"cool":0},"BHaB_lMUVolUVNFDhw9Igw":{"text":"Been here several times, but I'll stick to this most recent trip. \n\nPassed by for a couple","useful":0,"cool":0},"okvshgM7VbNl3CS7R_lT8A":{"text":"I had the most amazing roast beef po boy here. Literally almost teared up because of the d","useful":0,"cool":0},"IeVaV8hj-LbcU5L7ap9LoQ":{"text":"Great, low-key place for a lunch and drink while walking in the Garden District. Food isn'","useful":0,"cool":0},"-yaM1kLzi8czvIDD-4QUNQ":{"text":"Stopped in here in the midst of shopping on Magazine because I was losing my buzz and I wa","useful":0,"cool":0},"rAnU9x7TAJyjd3JxMeQW5w":{"text":"Just got one drink here. Drinks are way overpriced at around $ 6 for a small glass. Heard ","useful":1,"cool":0},"wyl99qfGhz9NyO2Iic_rwg":{"text":"Would give a zero if possible.  90 mins was no food.  Then kitchen staff said we were wron","useful":0,"cool":0},"du9fzoiK3o-vWO2nP2RH6A":{"text":"My friend and I went to Tracey's last night to watch the game and have a few beers. I have","useful":0,"cool":0},"NNTAdw_vx_QdnzIRBUoCrQ":{"text":"This place is my FAVORITE hangout in NOLA. More locals. Less tourist. Not that tourist are","useful":1,"cool":2},"JU8-wXSJEPpDXNKtR0h-HQ":{"text":"Roastbeef po'boy and ice cold Abita amber. I am so happy I learned that my beloved Parasol","useful":0,"cool":0},"vLI0dMS6l4hKSduIr1JZ5w":{"text":"Stopped by on our way out of town  awesome local place.  Try the roast beef  and the Irish","useful":0,"cool":0},"PhCzYp5kp7u_TK7vOoxL7A":{"text":"So... My Best Friend is a Bar:\n\nReason:  College Football Saturdays, Tuesday Night Trivia ","useful":1,"cool":1},"hIyVwKA8X6xYa3WekiC4DQ":{"text":"Stopped here kinda on accident killing time and glad we did. Six of us sat on the picnic t","useful":1,"cool":0},"ZhP7KsO69RqB2E0HcXW8vw":{"text":"They were very accommodating and really welcomed a large group from out of town. There wer","useful":0,"cool":0},"FvccYc9GRuuZf0rrMs7LKg":{"text":"Place to have a good time  tell Sylvia g to give a good review once in a while. I'm Irish ","useful":0,"cool":0},"4q7_11gXcKjtXHQ3ySzu1Q":{"text":"Good food, mediocre bar. Beer was warm :/ frozen Irish coffee was good. The AC dripped on ","useful":0,"cool":0},"jQO_q3PebZ4atCqbwyRd-w":{"text":"Tracy's is a fun place to catch a game, they have plenty of TVs. They have good food, alth","useful":0,"cool":0},"do8V0lTQiNT8TAmmeoeptA":{"text":"Good place to watch a game.  Lots of seating and TV's.  Save for one or two bartenders, th","useful":0,"cool":0},"KCDn8UzYC5w5eyQikqTtWw":{"text":"I really wanted a muffuletta but they were out. They should just erase that line (menu is ","useful":1,"cool":0},"25eJhfbIGf_sOG-EhOvvZw":{"text":"This is exactly the kind of bar you want to come to and watch a game with your friends. Th","useful":2,"cool":0},"IHrsEPU4VwNM0eysgLhB2Q":{"text":"The gravy on the roast beef po-boy was good, but the bigger pieces of meat can't match the","useful":0,"cool":0},"Zst-puhc6o4tgrZJeEoVmQ":{"text":"Tracey's is the epitome of a New Orleans neighborhood bar.  The owners and staff welcome e","useful":1,"cool":0},"Xv9NwGdEmvT331y1vzbSDQ":{"text":"The bar is 4 stars for a dive bar. Bathrooms are gross, but otherwise a great place to gra","useful":0,"cool":0},"VguctMfdBSTjD2Q6Ix1AOQ":{"text":"was tired from walking magazine street with a baby\n\nsome people sitting outside said the g","useful":0,"cool":0},"GMMr0G9cbJSw-Tuxrs1G6g":{"text":"Really?  Three stars?  Get over yourselves!  Took that jump on jump off bus and saw this p","useful":0,"cool":0},"ofm0KFWEJZdd5tTy1_e-7w":{"text":"Really .. Really .. as good as it gets! \n\nI'm not a fan of poboys, but if I'm going to eat","useful":1,"cool":0},"MnL8owSnr_GKlHNhZJq-Ew":{"text":"I give Tracey's a 3 star because the bar and atmosphere rate a 5 stars in my opinion! Howe","useful":0,"cool":0},"QCD77t6AwU1-LsIBkCy0uw":{"text":"Great place to watch football!!!  They had every game on not just the saints. The drinks w","useful":1,"cool":1},"hbvJzy8_q0xMnW7a8advlg":{"text":"The food is good, but this is basically a smoky bar. Even if you get it to go, you will co","useful":1,"cool":0},"Ga85Lz4rJXaa6e9p4VTM9g":{"text":"Had a hour plus wait for our food order and when it finally came out of the kitchen it was","useful":0,"cool":0},"ZgSy8x7JECditOx5N1sChg":{"text":"Tracey's is the new location for the entire staff and menu of Parasol's.  It looks like th","useful":3,"cool":2},"XXbs13t-rTwjCsDGdo73vA":{"text":"Not sure where the Irish is. It looks like an actual restaurant but it's a concession stan","useful":0,"cool":0},"h03OVkulSArvv5YsM-byOg":{"text":"Does not honor coupons to there own establishment. Pretty terrible service, I would recomm","useful":0,"cool":0},"V_JJGhkOIz5PmpowLBnxIA":{"text":"Called in for service and got the bar then was directed to another number. Then got hung u","useful":1,"cool":0},"FcvRjw-s7bKcJ2iNxWBPUw":{"text":"Tracey's had the best yourself po' boy in the world! Literally! I suggest getting it with ","useful":0,"cool":0},"P0h0trTjsybJjymQu-LUFw":{"text":"1. Roastbeef poboy ok but the CANNED GRAVY IS YUK\n2. French fries flat and boring  DON'T B","useful":0,"cool":0},"15gSnUi4-Qn3AgShaTZBog":{"text":"As others have said, this is the staff and food from Parasols.  As such it's an authentic ","useful":0,"cool":0},"_ouV0CQARL8PVuZ_a3u9vA":{"text":"Hummm this is a bit of a challenge to rank as I've been going for such a long time and the","useful":1,"cool":0},"kWDNKFabQkBpBAyZrFZhBw":{"text":"Came here in the middle of the day after a long bike ride tour of the city. Great\n\nPlace y","useful":1,"cool":0},"dz5EpbBjklVpdWHd3GYSaw":{"text":"Local  scene with down home food, po boys and friendly bartenders. Order at the counter an","useful":1,"cool":1},"NfK26JW31tpUGp5A-ZcDaw":{"text":"Sticky, dirty, below par food. Some of it totally inedible. \nThis place came recommend...I","useful":0,"cool":0},"khaktH2aCCHPd5IvHNsi0w":{"text":"Good roast beef but this wait is killer. Haven't ever waited this long before. Maybe kitch","useful":0,"cool":0},"1ISnXNxPB9ZReedgKqHRsw":{"text":"Best Roast Beef Po-Boy in town in my opinion.  Chicken Parmesan is also very good and the ","useful":0,"cool":0},"_T8ttEfeN3VBgB0ZsEgQ3A":{"text":"Yes, it's Mardi Gras. \nYes it's busy.  I understand, I really do and am willing to concede","useful":0,"cool":0},"uZi-2CH9VbQSxbyoGuBHvw":{"text":"Don't be fooled by the 'Irish' in the name.  This isn't your typical 'Irish pub'. This is ","useful":0,"cool":1},"73RuO8rZOsCTEgV9KqHTRQ":{"text":"So i walked in to a bar, asked bartender politely, \"do you have a beer list?\". She says, \"","useful":0,"cool":0},"0VNHic9cyRs0-EQKjivZbA":{"text":"The po boys are still good. Service a bit surly. They were busy, but since they moved into","useful":0,"cool":0},"1B0-rnebo9o1zLvEDgmx8A":{"text":"I really tried to give Tracey's a chance. I live so close by, they have a trivia night, an","useful":0,"cool":0},"NFwc3DQq8msgnI1lhqH11w":{"text":"Pretty chill place to watch the game. We went to catch the Jets play and they loss but tha","useful":0,"cool":0},"_cbL7Wi482UOM1dMrOR11w":{"text":"Great atmosphere. Roast beef sandwich was just ok. Not flavorful. Fried pickles good but v","useful":0,"cool":0},"NJyNl6a0CHCg7GkHRipSZw":{"text":"\"Y'all are the first people all day that weren't surprised when I asked them for their ID.","useful":1,"cool":1},"tAcp6vH_8h4fdWzggAVzSw":{"text":"Food was good and priced decent, ate here one night with my local friend T, the po boys ar","useful":0,"cool":0},"a9wTtGSWwmU0ZlPdHCAETw":{"text":"Outdoor seating on Magazine allows you to smoke. It is a nice neighborhood bar with friend","useful":1,"cool":1},"YeiYrnbWGmqgOs70Zqs26Q":{"text":"This is just a review for the food. Best roast beef po-boy in the city. Bar and whatnot is","useful":1,"cool":1},"2eujeaqwdr9q7klKby7tgQ":{"text":"This place is terrible, go next door! The only thing good about this place is it's locatio","useful":0,"cool":0},"FtFZZ-w98JhICrw6akPKdA":{"text":"Waiting and waiting....better not be a diabetic or be in a hurry because you will be a gon","useful":0,"cool":0},"58ZdSlNTXguwvgjjRzHduA":{"text":"Pretty large bar. (Our concierge mentioned this is same owner as old Parasol). They have g","useful":0,"cool":0},"wAlo7VG2bPgAeDcGovuqyg":{"text":"Roast beef po-boy is awesome. Super fresh soft bread! All the games on the televisions.","useful":0,"cool":0},"sKTf6EF6wIU0oYoQJqsNug":{"text":"I believe the owners of this location formally owned parasol's so the roast beef poboy is ","useful":0,"cool":0},"BMxdgOwiylVYizfvE4kHAw":{"text":"One of the  last  twenty places  in New Orleans I thought I would ever visit, but lo and  ","useful":1,"cool":2},"eiLochpqE_7PHi1jHy5WJA":{"text":"One of my favorite places to go in New Orleans. Great vibe. Good food.  Crawfish boils are","useful":0,"cool":0},"4I5vsdgdWNw6bfJdcn8sIw":{"text":"Great Po Boys and cool dive-bar environment.","useful":0,"cool":0},"cxeuu6mpEI7qisLbutrZgw":{"text":"Best Roast Beef Poboy ever in God's creation divined by the Pope himself, as touted by the","useful":2,"cool":1},"xbNP1TB1mIRabgjbfmodew":{"text":"Just awful po boys. We had 4 different kinds and they ALL sucked. Bad bread. Old oysters. ","useful":0,"cool":0},"yVMRtFh91hPKI95aiUoFaA":{"text":"While the food seems like the array of food offered at a fast food place it certainly isn'","useful":0,"cool":0},"5S0L3tAn79z_RbppJEqBhA":{"text":"Overpriced poboys given the portion size, and not a big fan of the quality of food they're","useful":1,"cool":0},"AH5tzT16Rhh05nNqE2J7XA":{"text":"Came here for Quizzo. I had the roast beef po-boy sandwich and it did not disappoint. The ","useful":0,"cool":0},"-Op49_OtF8jails1tVix3Q":{"text":"Nice spot for beers.  Not bad prices with $3 for LA 31 during happy hour.  The restaurant ","useful":0,"cool":0},"Syt-Ae3Ksm0oRenocbjD_g":{"text":"Stopped by during an afternoon walk.  Ordered some drinks and just hung out.  Drinks were ","useful":0,"cool":0},"jaix--42BqJveW-S4QDh4A":{"text":"Great place! I love the atmosphere and the neighborhood bar/restaurant vibe. The bartender","useful":0,"cool":0},"5_sY9K0HXKg9l_22zdqiVw":{"text":"The last 4 times I have been here, the bartenders would not make eye contact and I have le","useful":0,"cool":0},"Lh9j1x76zQFKWalCtG5Jvw":{"text":"Great place to watch a game, drink a $3 beer or have a snack.  Didn't notice anything part","useful":0,"cool":0},"sdrT32NwP5fdNYp0dHcuJA":{"text":"Tracey's has a lovely ambience on a nice sunny day (or cloudy day for that matter!) Nice, ","useful":0,"cool":0},"jZUVr63u69rSHoE-eranwA":{"text":"Lived in New Orleans all my life and somehow managed to have never been to parasols/tracey","useful":2,"cool":0},"0kpNuWChO-deJLx5mSCIxQ":{"text":"Don't be fooled by the dive-y feel of this place. The food was good and raw oysters were a","useful":0,"cool":0},"e7j6OGDfAcP1XK9QNxAcrA":{"text":"This is a really fun place to catch a saints game.","useful":0,"cool":0},"dh43WrdZ8H0Z1kNm3dbm2w":{"text":"They finally accept credit cards but the original Parasols is good but not as good as it's","useful":2,"cool":2},"OznlX15BvPn_A0dT3zkgNA":{"text":"Went to Tracy's for a friends going-away party.  The kitchen was closed (for staff vacatio","useful":0,"cool":1},"PKJra4WaEvuJwmvjiAopXg":{"text":"This is an average bar at best. It's great for groups and a light night drink, but if you'","useful":1,"cool":0},"qwOD7M6BGVPEc57PraFXGg":{"text":"First time trying Po-Boys. We came here after touring the Garden District and we had a Gro","useful":0,"cool":0},"aO2yMFpMs_RPIW44cgliJw":{"text":"This bar was recommended to us by our taxi driver when we had no clue what we were going t","useful":1,"cool":1},"u1TjZ1kdsFJ-M5u1SGc_Iw":{"text":"Best po' boy in town! I was in New Orleans for four days and we went twice! My favorite is","useful":0,"cool":0},"66HxG8QVvItygJouKn_LwA":{"text":"A bad night?  Planned a Reuben and a corned beef, long (~15 items?) list of items not avai","useful":0,"cool":0},"aZFWAnHLgGnewViIy8PQpg":{"text":"We found this place by accident when walking through the Garden District in New Orleans. G","useful":0,"cool":0},"-68_3rZgfBEq8gpeUYMTSA":{"text":"This is my first Yelp Review ever, as I have avoided this site.  Who wants to be that pers","useful":0,"cool":0},"XHS8or1lO78Wo6hwWJrzOw":{"text":"The po-boys and boudin balls were just decent. The worst part about our trip to Tracey's w","useful":0,"cool":0},"dgjCaI5uFakog4KTx92nWA":{"text":"Great roast beef po' boy! The atmosphere is fun--discovered some graffiti in the ladies' r","useful":0,"cool":0},"awX--dn5I-2nRtO1KCQLAw":{"text":"I love the roast beef poboys and their sweet potato fries.  Its as good as it gets.  If yo","useful":0,"cool":0},"pXK04En_Fs4sIJaVV6uF7Q":{"text":"I like traditional roast beef po boys with gravy, and Tracey's has the best traditional ro","useful":0,"cool":0},"hThBCIxkcdhiOY_sv7zCYw":{"text":"What can I say ... this is a family neighborhood bar mixed in with tourists eating poboys ","useful":0,"cool":0},"r_dzci3tmQN492jLTJOdcA":{"text":"I get it. These places aren't really meant for the likes of me. I'm just not a sports bar ","useful":12,"cool":8},"16yczp1PiUDm9qdUnP-zqA":{"text":"For some reason, I've never been over to Tracey's since it opened and while I know this lo","useful":5,"cool":2},"Xjp975Z2fUZIZoiI18oZHg":{"text":"Very uptown/uni crowd, decent (but not great) selection of beer. Really lovely food. Smoke","useful":0,"cool":0},"70rXdFQ1xwszgiHeRrNO6w":{"text":"The best shrimp po boy I've ever had!  Very casual and the perfect stop after a walking to","useful":0,"cool":0},"dm9UQExW2CKZCh3pp3TUlQ":{"text":"I ate here this past Monday with a dining companion for lunch.  We decided on eating here ","useful":0,"cool":0},"WiqAjo0uMeTa1n8MihCs5g":{"text":"Killer food: PO boys, fried pickles oyster etc.  fresh and delish.  Owner is super friendl","useful":0,"cool":0},"WoDrPuJFWBLJBjAE0Z33NQ":{"text":"This is a fine place to watch a game or grab a drink, but there's nothing special about it","useful":0,"cool":0},"KARTE9_5dySHpaRffKOsJw":{"text":"I was strolling down Magazine and decided to give this a try since it was the first Friday","useful":0,"cool":0},"a8fyv2PnIw_Fo3Zu6IJdTQ":{"text":"Last night, my friend and I turned around for a minute to close our tabs and our jackets w","useful":0,"cool":0},"yO_3D7cuHYTggtAehfvVQw":{"text":"i still love the roast beef po boys and have not been too disappointed with anything else ","useful":2,"cool":1},"FhrQuI8eQa3aDllLKu_mbw":{"text":"If I could give this place negative stars I would. For starters, the service is terrible. ","useful":0,"cool":0},"G5_biuVTIiDQVMUs_rt0_g":{"text":"Tracey's is a no-frills bar in the garden district. It's a fun place to hangout and you'll","useful":1,"cool":0},"URafjRD_Zko_jZqXkzbpGw":{"text":"1 word: Flavorless\n\nThe place is interesting enough, and clean.\n\nEaten in many other resta","useful":0,"cool":0},"A6BaiVile2rGPLgI75L0TA":{"text":"I wanted to really like this place because of the decent reviews on yelp and the smells wa","useful":0,"cool":0},"dzcQIKo7Xl5ESy6BSRIMUw":{"text":"Let me start by saying that as city's go, NOLA is perhaps the funnest city to visit of any","useful":0,"cool":0},"h7698YeC2spMz3qqC-OxwQ":{"text":"I stopped into this happening joint during the St. Patrick's Day parade. During the parade","useful":0,"cool":2},"KJs1pjLV0njabwqHaJiFVQ":{"text":"I used to like bringing out of town friends here. Food is mediocre now, restrooms were hor","useful":0,"cool":0},"r6cvp-M7yMOgtG8A9xknBQ":{"text":"If you are a JET fan or live in the neighborhood - don't bother. We've come here five time","useful":0,"cool":0},"sYXnig5YVJEM5hauXqCcKg":{"text":"Great bar to watch sports uptown. The staff will change a TV to watch specific games and t","useful":0,"cool":0},"qIGVveymf31mkehb8049gw":{"text":"I deliver here to tracys.  The place is clean in the kitchen probably because the customer","useful":0,"cool":0},"1tsJ_qRj0f_z_dXKQ5cQpg":{"text":"Ordered the chicken strips and fries.  Smallest,  driest chicken strips I have ever seen. ","useful":0,"cool":0},"1KFalRkQAMtH9tfJHzM3IQ":{"text":"We stopped by here to watch a little college football while walking the garden district. G","useful":0,"cool":0},"6BWNl_QzabVWLOA2YmThCA":{"text":"Just stumbled in here, but it's a really awesome bar! Good mix of locals and visitors, so ","useful":1,"cool":0},"soSxApu2TdMHlavmmeD8zA":{"text":"Female bartender the the tattoos and shorter hair was rude. Took for ever to come greet my","useful":1,"cool":0},"xC39eWfMA0lEaN8PXIK8yQ":{"text":"Went here the other day to watch the Saints. It was crowded and during Halloween week but ","useful":2,"cool":0},"I9mkWrcfVNjsS4DQknKg8A":{"text":"About as ordinary as you can get. Went to the men's room and one of the kitchen staff came","useful":1,"cool":0},"72MnUSgCWX3w9U6q1uYgDA":{"text":"Kind of a douchy bar but has a lot of different types of people so that is cool (equal coo","useful":0,"cool":2},"bwoI_0N8KRD3jlhRHDxSOw":{"text":"Good local beer. They sell crawfish out front that is amaaaazing. Our waiter hooked us up ","useful":0,"cool":0},"v4hMoX6aJkW4Ho6YtZgTBA":{"text":"Cute little neighborhood bar and restaurant. We had the surf and turf PoBoy. The roast bee","useful":1,"cool":1},"nVgqsuKNdQkrw3bAqRF00Q":{"text":"Another place we walked in to get out of the historical New Orleans cold weather and the p","useful":1,"cool":0},"QzG3d5F-aNB2ou2GBQRw4w":{"text":"Were waiting in line bc parasols was packed and watched one of the cooks spit on the floor","useful":0,"cool":0},"xoVDQ9LBdoGA2tv-542oJg":{"text":"Best po boy I have ever had! I had the fried oyster po boy and my husband had the shrimp a","useful":0,"cool":0},"U2wZeydo_L58dljgoug-ow":{"text":"Big fan of this place, as the food is way better than any run-of-the-mill sports bar. Grab","useful":0,"cool":0},"1L52X6r1iR71SCt5-VbL1g":{"text":"I came here after Wednesday at the Square with my two cousins one night.  One had a groupo","useful":0,"cool":0},"_6vN8ucJctmcHdJH7rnRJA":{"text":"I'm giving this place 2 stars only because the guy in the kitchen, who apparently had been","useful":1,"cool":0},"v2_ubTTKxq5Xbv1YiWyNAg":{"text":"I happened to be walking from the St. Charles streetcar end of the line (during it's const","useful":1,"cool":0},"rRBrBQDN1GpjZQgklIf4ew":{"text":"Decided to stop an try their roast beef po boy since we were in the area.  I have to say t","useful":0,"cool":0},"fr1kJ7PFTLKk2XPCLOpOYg":{"text":"Love this place! Definitely a great place to grab a drink- open and airy but with some coz","useful":0,"cool":0},"WHnEWNKKwZ4Y2QjOEZOPyw":{"text":"Surprisingly, I'm still waiting for my food as I'm writing this review. It's been 30 mins ","useful":0,"cool":0},"2EeKrkfXXvNVgIuolTgl-g":{"text":"The worst meal I've had my entire vacation. Overpriced and terrible bland food. 50$ for tw","useful":1,"cool":0},"bOam2awFvKIkwMQkEHZFiw":{"text":"We were told this was the place to go for a roast beef po boy, and unfortunately they were","useful":2,"cool":0},"ubMiCSExrPOLIX0e6N2Ciw":{"text":"The roast beef poboy was really good, it's much better than what you expected.  I would de","useful":0,"cool":0},"8ZIJJ-j-VKVnzUbdhKgnZw":{"text":"Atmosphere seemed fun. Stopped in here to get a beer during our history tour but didnt hav","useful":0,"cool":0},"NuW7Ql8Xv9wCRhoCF2Dg3Q":{"text":"I live just down the street from Tracey's, so I frequent here very often. My favorite food","useful":0,"cool":2},"whI6TZqOlWPO-V8amSrdMA":{"text":"If you're in the area, this isn't a bad place to drop in for a drink. It's a bit big and b","useful":0,"cool":0},"2EqXX3x-hEhkWCmVId350w":{"text":"I really like this spot. Perfect for game watching as there are at least 15 flat screens. ","useful":0,"cool":0},"4Kf3JwvFbgkmaw225GmIOg":{"text":"Note: This is basically the same review from Parasol's (being the same food, same cooks, a","useful":6,"cool":4},"_pS9UXGAsyLbx8wfK91BSg":{"text":"Bartenders are slow, like really slow. Your patience will surely be tested. But it's a goo","useful":0,"cool":0},"eezO3qCKZHpXIjTqmysdNg":{"text":"Good place to gather with friends and hang out. We were there for a New Orleans Pelicans w","useful":1,"cool":0},"NL8or502nXwG2nPWZ0CCdA":{"text":"I saw this place on some list or something somewhere as having some of the best Po' Boys. ","useful":1,"cool":1},"6Glx7Y3jBgCoFB5w_bpciA":{"text":"I came here with 3 friends after a walking tour in the Garden District.  Roastbeef po'boy,","useful":0,"cool":0},"nuwFsxQHCVp1h1SaV2SYeg":{"text":"Anytime I visit home, I visit Tracey's.  No frills, just good food, good drinks and good f","useful":0,"cool":0},"MpkX_rkCcTYJJ9qq8L_-Xw":{"text":"Dirty, no bottles of water, no catfish, ordering two po boy's with red beans and rice took","useful":0,"cool":0},"yVir8dua9mhpre9cZrej0g":{"text":"This a review of the bar during the St. Patrick's Block Party and annual parade.\n\nFor year","useful":2,"cool":1},"g5REHubR8eyAHfpEwqvjGg":{"text":"Love the po'boys especially the Fried Shrimp- a must try!! You can sit here watch any game","useful":2,"cool":0},"VeKMQZpU2NIW86YWNEfpUw":{"text":"Looking for an Irish pub?? Tracey's is your place. Went yesterday with three people and we","useful":9,"cool":4},"tVnyzOMsVP56aW0rXLAaOA":{"text":"Our Suggestions for Tracey's Irish Channel Block Party 2012:\n\nWow we're late. We're sorry.","useful":0,"cool":0},"BhTv-h1uFZcTo4G3KH3K3A":{"text":"Usually stay near Bourbon St., this trip we decided to stay on Magazine St. for the first ","useful":0,"cool":0},"DtERptfhMIdcBUE-p_yApg":{"text":"Cute little (actually rather large) bar and restaurant walking distance from St. Charles S","useful":0,"cool":0},"XpX2vK5GWUEP-TWP7_DDIw":{"text":"I have given this place so many chances because I live near it and every single time I hav","useful":0,"cool":0},"TMp1us-7D0b6gqC_KkPRCw":{"text":"We make it here every time we get to NOLA. It is a very laid back joint... No frills, exce","useful":1,"cool":0},"8t-lcWHOFG41pcg4-T1xKA":{"text":"We strolled in here on a Saturday night, the third stop on an evening of drinking. The sta","useful":0,"cool":1},"jlTzTz4GRD_6VEjk7Ps-Xg":{"text":"When will I learn my lesson about groupons? I decided to give this place a try again since","useful":3,"cool":0},"s28cDbmudyfIyZh1A_u1LA":{"text":"This is a nice place for watching sports, having a drink, and socializing. It's not fancy,","useful":0,"cool":0},"_ZXZ0nTDMrTz7il0ByeGgA":{"text":"Great place to watch sports and eat. The Muffaletta is very large, not the best I have had","useful":0,"cool":0},"LKT6bgtxEFem1nGCteGoGw":{"text":"For me, it's worth the walk.  I tend to walk everywhere I go so from my place at roughly N","useful":0,"cool":0},"KLIUvTUFVFtm6LjtS11JLQ":{"text":"Always Delish. Esp the BBQ pulled pork sandwich. And great place to watch your fav sports ","useful":0,"cool":0},"NTwCzkFTXpwpqn9bH2acOA":{"text":"You can skip Tracey's. \n\nWriting that, admitting that out loud, is hard for me. I loved th","useful":4,"cool":0},"qY0ND9HZmlllq44NYqzoeg":{"text":"The crowd here is unbeatable and the food tasty. They'll even put the Cal game on the TV i","useful":0,"cool":0},"pUJQJWmWp5XqGTsHP7vacQ":{"text":"Tracey's sucks, don't waste your time. They're food sucks n service is even worse. Fryer i","useful":0,"cool":0},"N1-jeu6bAYPVvH7lUym35Q":{"text":"Tracey's is your typical Irish Sports Bar. Usually I come here for the St. Patrick's Day B","useful":2,"cool":1},"g7MFXaRDWIBJUL_5O184tg":{"text":"I love Tracey's. \n\nI lived uptown nearby for about eight months. I love fried pickles, and","useful":0,"cool":0},"43V5SUyC04za5ITSvRndog":{"text":"Good place for a casual lunch and a beer. Service was good and the shrimp po boy was great","useful":0,"cool":0},"PGTxjh4vUgmgsvxz_NwSdw":{"text":"It's impossible to fully describe how much I dislike this place. I work right next to this","useful":3,"cool":0},"zuOBWqvbla7g5_sKhFoiuw":{"text":"No Guiness and no Smithwicks.  Not exactly an Irish Pub. Food was good tho. Boudin balls a","useful":0,"cool":0},"702hb304Pj0WrmRVEZmW3A":{"text":"Food is mediocre and if you don't get here early enough then you'll be standing surrounded","useful":1,"cool":0},"p8YQ7nypTced5DaJA8_w4g":{"text":"This is my fourth visit to Tracy's in the Irish Channel. It is your typical neighborhood b","useful":0,"cool":0},"dPh4aFvI0Qx9X6wyWVjHBg":{"text":"There was nothing good about this Bar.  Except that the bartender was nice.  We went as a ","useful":4,"cool":2},"lNYQzGR0hq27G-z_33MOag":{"text":"Had the shrimp poboy and it was great.  As good as any in NOLA in my opinion.  I like the ","useful":0,"cool":0},"KUiw0uHQTfAqIIly4RYjfQ":{"text":"Do we have the blind leading the blind here?  I am beginning to think so!  Sadly, the owne","useful":5,"cool":2},"eWqzynPAYwwt1tUt2REd-A":{"text":"We came here back in late June during a long weekend visit to New Orleans.  Great po'boys ","useful":1,"cool":0},"CxeH6k36Uo6EGAHCGgDx9Q":{"text":"This \"restaurant\" is a self-service place. It's ONLY for people who don't mind paying FULL","useful":6,"cool":1},"YcIPHSLoSEUj07nGpcK22g":{"text":"Good food, good service!Love to come back for different kind of po boy ,and oysters !","useful":0,"cool":0},"x7UNMuwh6qM1VPbUjWbpJw":{"text":"I'm upgrading Tracey's by a star but not because of the food (average greasy bar food at b","useful":2,"cool":0},"goFa_R7yCv09JecT9cZrbQ":{"text":"Stumbled across this place on accident. Very happy I did. Sandwiches were epic (muffaletta","useful":0,"cool":0},"z-A0LPMOS62NCEC4JIsm-w":{"text":"I agree with previous reviews that the food was extremely slow.  30 minute wait for a po-b","useful":0,"cool":0},"U2BSqEsjPAZHp19aX42cnw":{"text":"RUDE. As they say, one star is too kind. We stopped in because a local friend told us they","useful":0,"cool":0},"hVbVXo3jWpoR9t2oPprPWA":{"text":"Ordered a shrimp poboy and cheese fries. The cheese fries were only covered on the very to","useful":0,"cool":0},"xXhZnckVK1dlyBwhtfkQtA":{"text":"Drinks prices are modest and food is ok.\n\nCame here to watch a game with a group of friend","useful":1,"cool":0},"CrSIA1J9nxVlQ_aJ6kLx4A":{"text":"This place had some amazing Po Boys. The friend shrimp and free oysters both stood out. Th","useful":0,"cool":0},"TX09zx-5mMB5BNTQG2VSfw":{"text":"Group of us went here to watch the SEC Championship game.  Pretty good place to watch a ga","useful":1,"cool":1},"G27Cjp2oWqkMXleI3he35w":{"text":"A great building and if it wasn't for the fact it was 94 degrees, I would have loved to se","useful":0,"cool":0},"rEuZJ-smoWGIznqGxQ3_MQ":{"text":"we happened to be near this place yesterday morning after taking a great ride on a street ","useful":0,"cool":0},"9ONmVF4E2czpp131P-9tQg":{"text":"Bartender was too busy taking shots to serve her customers. Man shucking oysters was so sw","useful":0,"cool":0},"2L2bDMnB71aJPOu6cOM9Og":{"text":"I know that drinking can cause a person to see things differently but I truly love this pl","useful":0,"cool":0},"jqQ4sn2W8SNbdf0qxXbfPw":{"text":"Ah...Tracey's. \n\nIt was the perfect meeting place for everything in terms of location for ","useful":0,"cool":0},"C25SVYubcIo5lEAGtwzEYw":{"text":"The only reason I give this bar one star is because is the only way that I can type. Other","useful":2,"cool":0},"GRiDe9g4j8xMwDyNd5PDNA":{"text":"Had 2 grilled Reuben's w/potato salad, $10 each. It took well over 1/2 hour. The sandwiche","useful":0,"cool":0},"4B9EeKcEKD8FhVCqedb5Wg":{"text":"OK, I've been hearing about Tracey's because WIST-690AM's Sports Hangover show occasionall","useful":2,"cool":0},"lJ_KVkoFEtHkIfGC6yfpxw":{"text":"Tracy's is an \"Irish\" pub in the loosest of senses, although, to its credit, it *is* locat","useful":1,"cool":1},"CWDaZOBjvJ38J6DZfeZ6RA":{"text":"I hate to do this, because I've always loved this place, but after an hour wait for a po b","useful":0,"cool":0},"oVXun_NbQbqYsL1L8ffXVw":{"text":"Catfish is really good. Fries and salad not so much. $4 IPA good. All kinds of sports on m","useful":0,"cool":0},"ohsgZkuoXC09g3g-tXvMVg":{"text":"Cool bar, quite spacious, friendly staff and quick service on their busiest day of the yea","useful":3,"cool":2},"At-lHBzg0onBYFn60LTCyQ":{"text":"Good atmosphere in the Garden District. The po' boy was merely adequate, IMO.","useful":0,"cool":0},"_SYpGLxASTRlxuBJFZYe2w":{"text":"Over and over you here on the radio \"Traceys! Best poboy in New Orleans!\". Or something to","useful":3,"cool":1},"qEmZ09W0hO3OYXZtw2jijA":{"text":"Went there for lunch for my one and only time.  They are not geared up to run a lunch serv","useful":0,"cool":0},"wv9y9tTGPpxrRty-MBnoWg":{"text":"I really enjoyed this bar. The ambiance was rather festive and those umbrellas gave the pl","useful":1,"cool":0},"yFRRpaEHafIZ6Bb0Fe3vIQ":{"text":"I have always wanted this dive bar to turn into something worth visiting. Now, the owner o","useful":0,"cool":0},"vXJpoYvddDb5uZCCj1QeXw":{"text":"Jeff must have heard me re the horribly loud hard rock, as music has been much more \"New O","useful":1,"cool":1},"Mr7pZvIYQfiD8nY43TUwtA":{"text":"Hands down best BBQ Roast Beef poboy in the city.  Prices are decent, good place to watch ","useful":0,"cool":0},"diybol2WJESLKXbX4Df-yw":{"text":"Love this place....definitely a find...great atmosphere great people....\nOur bartender Tom","useful":0,"cool":0},"56Es7CAw5n9a6Df8pE8xhA":{"text":"The crawfish bake: dank. You really have to roll over here and grab the 3 lbs of crawfish ","useful":1,"cool":0},"nqFigY5p4hMwg-fSD0xe1Q":{"text":"We travel in large packs (we are more like penguins than wolves but like penguins that tra","useful":0,"cool":0},"rgOvIk__GodAexF6xcrW3A":{"text":"Sometimes 3 stars on Yelp scares me, but this was 4 stars at least as far as food & servic","useful":1,"cool":1},"AxuaU7JdaTevxorYKXvimQ":{"text":"They must have 30 + TVs in this place.  If you're not a sports fan when you walk in, you w","useful":1,"cool":1},"-88iwhMIf-FV_XYh8k37Fw":{"text":"Really, really horrible service. The sausage po boy lacked any flavor and took 1 hour on a","useful":0,"cool":0},"6kAdDHsQevWZgW7LeP08nw":{"text":"Best bar on magazine !!! Great food and drinks and service is Best!!!Really words can't ca","useful":0,"cool":0},"sby1B_MHwMZyoJgLqBwnrA":{"text":"After eating her for the first time I can definitively end the roast beef debate of Tracey","useful":0,"cool":0},"Kygalx21a7hJ63jEvjvulw":{"text":"Fun sports bar like place that serves great oysters.  We came here after spending the day ","useful":2,"cool":0},"3iUQk1-KtTpOWGuYWjCEMg":{"text":"Walked in and out. Will not deal with a place that only accepts cash and no credit cards.","useful":3,"cool":0},"1u6siche6In3JkANOsIyYA":{"text":"Ok, first off how can a Public House bar not serve a Bloody Mary? Second, how can the bart","useful":0,"cool":0},"H4N87xZnstcnUa3pI0BHUw":{"text":"So here's the skinny on Tracey's: the proprietors of Parasol's down the street had the bui","useful":1,"cool":0},"1_ymKpJKaswV1TrLYvGq_A":{"text":"One of the best places to watch football and eat Po Boys in New Orleans.  BIG place with g","useful":2,"cool":1},"_Ot3DEoVNcylQgYiZbQ5Fg":{"text":"Tracey's is a great New Orleans spot. As others have said, it's a sports bar with lots of ","useful":3,"cool":0},"QZlJ6fjTPSHsxzDZNDiy7w":{"text":"I know this is Channel staple, but not really sure why. Food was not good and the entire r","useful":2,"cool":1},"LUDlpzA8HdHrtUegUAJvFA":{"text":"I used to think that Tracey's has one of the best roast beef PoBoys in town, but not anymo","useful":1,"cool":0},"_jcXnYRV3dGm18QDKT8U4g":{"text":"Open area bar with the beautiful magazine street right outside to let the breeze in. Plent","useful":0,"cool":1},"lfYBwjGGxbTfiP-bLiUdtA":{"text":"Good local bar. Wings are my go to. Catch them on the weekend for crawfish, oysters, the g","useful":0,"cool":0},"B-3pLd6rEGVyJQTfXcwAhw":{"text":"RUDE. As they say, one star is too kind. We stopped in because a local friend told us they","useful":1,"cool":0},"_ojee-lWnXuGxj8tKErmBQ":{"text":"Went on a Saturday night kind of early (between 8 & 10 pm), it wasn't too too crowded, or ","useful":1,"cool":0},"MBxDKd4z27ooiNvEMFCaow":{"text":"I am adding another negative review for the rude and nasty bartender. The food was ok but ","useful":2,"cool":0},"P63BGx2nP-xjEyd6m0pheg":{"text":"One of my favorite bars in all of NO.  Is it because of all the craft beer or fancy cockta","useful":0,"cool":0},"GF8-Al_6f_Gv15RULUc4qg":{"text":"Great divey sports bar in the middle of the garden district. Drinks are cheap and service ","useful":1,"cool":0},"BkA4QAYkhs-zjydw4lfzLA":{"text":"After our tour of the Garden District, our tour guide recommended this place for lunch.  I","useful":1,"cool":0},"7Gbhp9XxyjtjEuDRwiSVEQ":{"text":"Bad food.  Bad service.  \n\nThe grilled cheese was the worst I have ever had.. Piled with u","useful":0,"cool":0},"tej-KJ8imw-gCy7xvivMJQ":{"text":"Holy major letdowns Batman!  For years, I have heard about Parasol's roast beef po-boy  an","useful":0,"cool":1},"EsarWqnwrwFQlK0CpEF48g":{"text":"Bloody Mary was great.  Our bar tender Justin was fantastic and the ownership couldn't be ","useful":0,"cool":0},"HuAKrvG-myMDhUHAIqgfKA":{"text":"I have to say, enough is enough! First, I have eaten here countless times since opening so","useful":1,"cool":0},"V2ktSHFZ3y3t0P9QH2hQsw":{"text":"Mediocre at best... Noone was around to greet u or direct u as to how things run... Kinda ","useful":3,"cool":1},"77KTYb4QaIlneKAj5LUM8g":{"text":"Frustrated, they were out of okra, oysters, crawfish as well as about half the menu! I did","useful":1,"cool":0},"neEZHg37oMEfZakyq2aBLg":{"text":"The best mufalata of all time! That and an Irish sundae is worth the wait.\nBloody Mary's a","useful":0,"cool":0},"Gdqzsi3JZGdMwytRQudhVg":{"text":"Very rude bartender! I don't know why so many businesses hire rude employees here in nola,","useful":0,"cool":0},"nsWpp4Z0nBGBflQy4SWAmw":{"text":"Chill atmosphere and food selection. We enjoyed the oyster bar and friend food platter. Wo","useful":1,"cool":0},"HRTW272qqEvF0uZ5ipWO1w":{"text":"If you're on a leisurely stroll up Magazine and looking for a drink, pass up Tracey's and ","useful":1,"cool":0},"_mAo8RIAd540US90su2DUw":{"text":"I like to day drink on Sundays, and in New Orleans that means football.  So, almost withou","useful":6,"cool":2},"bu-Z4RnhGtNBfnRPM-JDvg":{"text":"Is my first time here,  it really looks like a good Irish,  music is just okay,  beer pric","useful":0,"cool":0},"LfXQ6obfyT0Vorb7DH6I6w":{"text":"I hate this lousy bar. This is a trashy place with terrible service staff. It's a place of","useful":4,"cool":2},"34VZ20kcHs5unyfjhu12zw":{"text":"The absolute best place in New Orleans to watch sports and grab a app-boy. Their roast bee","useful":1,"cool":0},"3klEqwdHQ0Mx02OQgY_o9g":{"text":"A hole in the wall for sure, but a great place to kick back and have a cold beer on this h","useful":0,"cool":0},"k8XIZQbsWZHmxPDZVsJ68Q":{"text":"Same recipe as the famous Parasol's just down the block. The Roast Beef poboy is just as d","useful":1,"cool":1},"STGDt14rPXXXrBZzMepQ5A":{"text":"My friend met his South African bride to be here so this place will always be close to my ","useful":2,"cool":3},"bR85_Kv5IXwADeXlfbcLBw":{"text":"So I guess this place is a hidden gem even though it's on busy Magazine Street. Stopped by","useful":2,"cool":2},"gDS_FcyGMtvHQCo0W36MuA":{"text":"The woman they've got working the register needs to go. She hardly looked at us and aside ","useful":2,"cool":0},"cVHHYtBAAwZduPU4wXBhpA":{"text":"This place can hold a lot of people! We had been told by a local that they had gumbo and r","useful":0,"cool":0},"M7iFrK9PTncKEKHy3XpiMQ":{"text":"This is by far my favorite Oyster Bar in NOLO. Great menu, nothing fancy, but good New Orl","useful":0,"cool":0},"MNokf1JGIgq9pPhFFM4_aw":{"text":"Stopped in here for crawfish last Friday and they were the best I have had so far as for s","useful":0,"cool":1},"GXNe_TEgKFONu45UnksRpg":{"text":"The catfish poboy we ordered had such a tiny piece of catfish I actually laughed when I op","useful":1,"cool":0},"ocXXL3e6NBMxl-cJz8q3Zg":{"text":"This bar is always busy and has a fun vibe. We all stopped by to watch a game and ended up","useful":1,"cool":1},"lCZzq5poOjrHNoFs28cV8w":{"text":"Not a good place to drink or eat for any occasion. So many better options in this wonderfu","useful":4,"cool":0},"fPNftgGh80PpU5iQ9poDIA":{"text":"This is by far my favorite Oyster Bar in NOLA. Great menu, nothing fancy, but good New Orl","useful":0,"cool":0},"lIqxLiCCmk4SQbKj5kruNg":{"text":"FAIL as a bar!  Horrible bar service.  Wife and I sat at the bar for over 15 minutes and N","useful":2,"cool":1},"N8r78808auAYhCaVWeLL-g":{"text":"I wasn't looking for much when I ran across Tracey's, just some air conditioning and a col","useful":0,"cool":0},"cGaw2UAIb8pogkqGpYjLog":{"text":"I give the crawfish boil 5 Stars but the rest of the food was 1 star!! The kids didn't wan","useful":0,"cool":0},"OR3Pah32pWoqxSijcJ4KuA":{"text":"Rude bartender berated my friend for asking to split a tab. This was not an obnoxious circ","useful":1,"cool":0},"dSNZGULWUGQJn2GmKK5ssg":{"text":"What a great spot to stop in and get away from the heat!! The bartender was so friendly an","useful":0,"cool":0},"mZnbnfTvMAiwV3joM4XV5g":{"text":"This restaurant is very confusing...I had to pay three separate people. 1.  oyster 2. Poll","useful":0,"cool":0},"m0oZTSHXlmu2gJnf49AveA":{"text":"Was my go to spot to watch games, but got way too territorial.\n\n \"What? You're saving thos","useful":2,"cool":1},"M0NRNupu8UQgWsaPC6akTg":{"text":"Found by mistake and lucky we did. Very casual fare with laid back cool atmosphere. The fr","useful":0,"cool":0},"-tfikTZumOpbYym44vAIrA":{"text":"It's a real real sports pub, Irish pub, and for the Margarita liver, the bartender rocks h","useful":0,"cool":0},"7DtA42SOu8KY8Y69Ah8dHA":{"text":"No matter how many times I come here the bartender is always rude. Great atmosphere and go","useful":1,"cool":0},"Dm5o1AjkzbvgbPa9KGwJCA":{"text":"I'm seeing a lot of negativity in reviews of Tracey's food, but my first foray into their ","useful":0,"cool":0},"xaSGjwccggx-OYJyo14dTQ":{"text":"Didn't have a great beer selection and no bloody Mary's :/ also out of a lot of other drin","useful":0,"cool":0},"_-mp4ATlzX9p_QsiW654Qw":{"text":"Had a great time at the pub quiz! The host was less than enthusiastic and the frozen irish","useful":4,"cool":1},"OBK4VsprROl5SkFgZl7wqw":{"text":"I stopped by to meet friends on Sunday. The bartender told me it was a 10 minimum. Totally","useful":0,"cool":0},"8Tc1dGG16LKtZEe5a-vBHg":{"text":"This is a great place for soccer, UFC and other sports but so damn smoky! The food isn't b","useful":2,"cool":2},"WF-5ypbhknNvoASiJK4xKQ":{"text":"Went there on Sunday to watch some football at lunch time. No Guinness, no oyster poboys, ","useful":2,"cool":0},"OzxGvrFOdyfdR6-_Pmgykg":{"text":"Remember how everyone felt about Raymond? Thats because everyone didn't know Tracey!!!","useful":0,"cool":0},"Lti-nL9lvQ_SCuG0sZ3Y6Q":{"text":"Here during game but they really did a horrible job.  Service was terrible.  Had to run th","useful":0,"cool":0},"YwCoNEQyEnuy6pY1NtnW0g":{"text":"Our tour guide recommended this place for rice and beans, and where the locals go. We had ","useful":1,"cool":1},"6rb48vdH7yyg-_lJBmLe2g":{"text":"been here through the years. Always had decent drinks for a decent price, but this is far ","useful":4,"cool":1},"djg3m1Wsxl0M0005q3BGVw":{"text":"Overpriced and inedible! My fiancé and I went to this restaurant for lunch. I ordered a gr","useful":1,"cool":0},"Iy3xXgdNmxbXQU8GXJJwJA":{"text":"Never have I been in a bar with 4 other people and been unable to get service from the bar","useful":2,"cool":1},"Yh_7aUhyvjs_fJPNjs6urA":{"text":"Two hands on the paper plates at all times because they will smother you in a heaping pile","useful":0,"cool":0},"GXI_KGTfrtZiiZ03gkfVvQ":{"text":"This is a great place to drink, eat, kill some time, hang out with locals, and just in gen","useful":1,"cool":0},"UnoFlVzSVUu_LyoBvRLdxQ":{"text":"Inexpensive drinks, cheap winds, great atmosphere, good company, good mix of people great ","useful":0,"cool":1},"dIExFQ18Ff-9YYrwDjxJew":{"text":"We tried this place since we saw it on the Food Network's Diners, Drive ins, and Dives. We","useful":0,"cool":0},"AcHXqrEbIeRcA6ajXt7h6g":{"text":"A perfect place to watch the Saints game among die hard fans! We have passed many an after","useful":0,"cool":0},"JF--pk4YrmNMsDHFZhOM7Q":{"text":"81/21 @ 02:55 p.m. White middle aged, rude bartender gave me a tasteless drink. If you don","useful":0,"cool":0},"AlJwXjSiCzRSiEowBvjicQ":{"text":"So disappointed.  We went here on a recommendation that they had delicious roast beef pobo","useful":2,"cool":1},"_0rh68madj2oaDy8X_RxPg":{"text":"Showed up at 8pm. Told us they were out of food on a Thursday night. I have about as much ","useful":0,"cool":0},"u0D-lN0xicpGHY1ei-zmdA":{"text":"This place is great. The crawfish and shrimp po boy were so good. Staff is very friendly a","useful":0,"cool":0},"uYLScVXfI4iUCdYukQaKUw":{"text":"The Burnett girl bar tender with tattoos here is EXTREMELY rude if you are not a local!!! ","useful":0,"cool":0},"yHzdurdz-oKIlH6lJyw-8g":{"text":"Sadly another dive bar that has raised the price of Abita Amber above what I'm going to pa","useful":4,"cool":5},"Pvywv5I6riHeY1hDawKdjg":{"text":"Visiting my friends\nAnd she took me  for lunch\nI order shrimp po boy and fried  okra\nShe o","useful":0,"cool":0},"fIxvEVf_ghnUipzEqqkGiA":{"text":"Stopped at Tracey's Bar on Magazine Street in New Orleans for lunch the other day. The pla","useful":1,"cool":1},"JTPNwS-DvxxE_AI_VBKryg":{"text":"I love the neighborhood feel and the friendly locals seated outside with their Australian ","useful":1,"cool":2},"pSzvCakf6JE0f0EkFC7QjA":{"text":"Stayed with a friend down Magazine and walked over for a beer after a long day in the Quar","useful":1,"cool":0},"Sijp783-WLzkOUYcMdoEnQ":{"text":"Great food, Guinness on tap great atmosphere to watch football! Would definitely come here","useful":0,"cool":0},"ORTQZqewn-RvayUF3FjetQ":{"text":"Tracey's is yet another place that I've been wanting to try.  Last night, I stopped in her","useful":8,"cool":1},"66xPx79vw3wmTcGWDs9LXQ":{"text":"Our walking tour guide Denver suggested Tracey's to us for a quick place to eat after our ","useful":0,"cool":0},"b8W3AKaTrW5EMOCKanI-RA":{"text":"Fantastic crawfish boil, easy walking distance from the garden district - we spent a wonde","useful":0,"cool":0},"jXJzTqnvsiGCnYGViKkVjA":{"text":"We were hungry after a thoroughly fascinating walking tour in the Garden District and Ceme","useful":1,"cool":0},"h3Jk_hzAbKklglRh9YH1CQ":{"text":"Was there today, Jan. 29, 2021 at 11:30am.   We were the only 2 in the restaurant, and the","useful":0,"cool":0},"xjoaJyiGA5vyrZTyCm9oew":{"text":"I was happy to stumble upon this pub on my walk through the garden district. I had some fr","useful":0,"cool":1},"Ns7Fg8iYFAfRo6OFB3NzkA":{"text":"Charming bartender, cheap drinks, great service. Spilled a drink and the bartender replace","useful":0,"cool":0},"NKKVbY133fw5xHwK-lQE_g":{"text":"They lost the ticket for our order.. they don't give refunds. We waited 2 hours plus. The ","useful":4,"cool":0},"qFQFhKak6L0wufGL7XvdDQ":{"text":"They completely disregarded people's health and safety while having a block party during a","useful":0,"cool":0},"TObv4zUZ2nwQMPfwYaBKxg":{"text":"We were doing some sightseeing on Magazine Street and stopped here for a quick snack. The ","useful":0,"cool":0},"yA4p3z2mY0HR96lYIlL5lw":{"text":"Our standby! We come here every time we come to New Orleans. Nice staff with cold beer. Ex","useful":0,"cool":0},"xYSDnACjoz_F9CVu4Llm3Q":{"text":"They treated us well here! Relaxed environment, chill customers. Crawfish boil was yummy! ","useful":1,"cool":0},"-eOcjXLBa7sYNlUTYMt5lw":{"text":"This is my neighborhood bar, and I mostly frequent it when my Chicago born and bred husban","useful":3,"cool":1},"vW8Ctmo8AvZ9Bp0hu6Wucg":{"text":"If you're visiting New Orleans and looking for your local watering hole? Look no further b","useful":0,"cool":0},"L3KtsJIDBiCXLGes7phMLQ":{"text":"I've been here a few times hoping that I will finally have the same experience I had at Pa","useful":1,"cool":0},"Ae53b__Ac-y0vzyO6Fl9Vw":{"text":"Food = 4 stars \nBartender = 0 stars \nI love this bar! They are a laid back dive bar that h","useful":1,"cool":0},"uB4neih21BZIzfjYI2G5hw":{"text":"Great local Irish pub in NOLA!! Crawfish boil was perfect and as always they have some gre","useful":0,"cool":0},"bIbipcH4EzFP26rAGwEHrQ":{"text":"Unfriendly bar staff.  Drink selection is fine. There's a lot of places to get better beer","useful":2,"cool":0},"kcg0l1PhOO2-EmaO3vcjQA":{"text":"This place is fine. It was a convenient stop for us on our long walk from the French distr","useful":1,"cool":0},"wBqKU2X0jGVB3HHbEyEX8w":{"text":"It's been years since I've been here.  Visited last month while in the Irish Channel area ","useful":3,"cool":3},"U7Ve6z8bobKn0wB9Wfnlvw":{"text":"Whether it's to watch a game, trivia, or just a regular night, Tracey's is pretty consiste","useful":2,"cool":1},"pc2grgQT01-D_n8RuKLH4A":{"text":"Great people! Great food! We had the greatest time there sitting around watching the LSU g","useful":0,"cool":0},"0k5NmN6EK8X_yQ55ASbQnQ":{"text":"I visited Traceys this past Saturday. I came into New Orleans from Orlando with a group of","useful":0,"cool":0},"CVKEYiDDG122fvUDhVdGDw":{"text":"Can't miss Tracy's being an \"Irish Pub\", what with the orange, green and white flags billo","useful":1,"cool":1},"xul4S84hHWJ-Yd6O7S9ONQ":{"text":"My husband and I were walking down Magazine, and we decided to stop in to try select crawf","useful":3,"cool":1},"EtWV07RBYhXMfwJS_5_wCw":{"text":"A place on the Simpsons food tour of nola and deservingly so. I love grabbing an alligator","useful":2,"cool":3},"_6FYZj2CIwnS9UPbzLHVYw":{"text":"This review if based strictly on the service of the bartender (a dark haired, miserable wo","useful":0,"cool":0},"Y-dOGddgBeOv9IjRNZFdJA":{"text":"Tracey's used to be my go to place for roast beef poboys.  The last two times I've been in","useful":1,"cool":0},"UPfOnue4eGZLyrZDnKI5ZA":{"text":"For me this is a place to come and have a beer and watch a game but not a fan of the food.","useful":2,"cool":4},"b6qpo3WDHo5_VJG31i5S7Q":{"text":"Great oyster bar!!! Some of the best we have had! Yummy grill and a fabulous bar! What mor","useful":1,"cool":0},"TmLU2w8Bn-z47xvSQWjktQ":{"text":"CHECK YOUR CHARGE RECEIPT!! I gave bar tender $1 and she charged $2 to my card!!!that is i","useful":4,"cool":1},"sruH21nfBeRuuXzc3M9vhg":{"text":"My mom and I were in the Garden District for a walking tour, and we decided to stop in her","useful":1,"cool":0}}