{"VHRgbge-0zdYuFGl2MesSQ":{"text":"Love the food. Carni italanie pizza awesome. Great beer selection. Spedoni superb. Great a","useful":0,"cool":0},"mN93TJSF_L8mIE5xkvG0EQ":{"text":"This place is so good!  There are so many choices that you can't try everything on one vis","useful":2,"cool":0},"s8f5E7Zgiy-k6XCapBPYhA":{"text":"I had the chicken Marsala and it was just amazing.  Best I've had.  My only complaint was ","useful":1,"cool":0},"MigjElhcbqPRegeIcTAqMg":{"text":"Went here today for lunch for their $5.00 pizza since it was their 2 year anniversary.  We","useful":0,"cool":1},"Yzk8Hyf6L9KwfHKjN3LqGQ":{"text":"Great service. Ok food. The ingredients seemed fresh, but the execution was average. Fried","useful":0,"cool":0},"Y9uqkQ46uol_hFerqWbVEw":{"text":"I have to say, the few times I have been in here I was slightly disappointed. However toda","useful":1,"cool":0},"Y8jVzXOAKioE50WDcGwO1g":{"text":"Went here tonight for a date. We split the cauliflower pizza and it was good. Could have u","useful":1,"cool":0},"NShJEPA_HGayYY1FbGFjDg":{"text":"I ate here Thurs and will be going back. The decor is old school Italian with lots of wood","useful":1,"cool":0},"R-Alyd-d-Wa4tG98ja5xfQ":{"text":"We celebrated our tenth anniversary here, our waiter was very nice and the food was very g","useful":0,"cool":0},"6dq7E8dfX8Z_zwuhGv_Nzg":{"text":"Service was decent. I work up the way and thought I would have a bomb pizza. I was wrong. ","useful":1,"cool":0},"3TEvTqc_uB_SbzkaR7e6uw":{"text":"The pizza was ok and the wings were ok, but I will NEVER RETURN TO THIS RESTAURANT BECAUSE","useful":2,"cool":0},"k3X6ks5zKVtBZxhvSvo1uw":{"text":"One star because of the awful service. Female server forgot to put in a pizza order (took ","useful":0,"cool":0},"B4G2EaMTcQtx4NW268lUTg":{"text":"The service was good tonight, it was the food that we're deeming two-star quality. The pri","useful":0,"cool":0},"xlnQ6DUt8gLIeeYGb3MPxQ":{"text":"Awful service. different servers could not explain questions about dishes the menu. They h","useful":1,"cool":0},"2Gl60p7T9rOF07cSwwmYwA":{"text":"Had a great time at $5 pizza Thursday.  I thought the food and coffee were excellent.  Loo","useful":0,"cool":0},"Sm3HCOtJhvaacvb-zWo0KA":{"text":"Went to experience a pleasant evening with my wife, but was very disappointing.  Hostess s","useful":0,"cool":0},"s6n-jcdgZIOgmk0GuOSngQ":{"text":"Amazing pizza great happy hour specials. Always stop here when I come to New Orleans.","useful":0,"cool":0},"xk9Lowu6x2HXF1zRpaiRuw":{"text":"Looking for a place to dine al fresco on a glorious spring Sunday, we grabbed a sidewalk t","useful":1,"cool":1},"WyNl6vtKNeL5S4nL0sAYEQ":{"text":"Husband and I love this Italian place! The atmosphere allows you to either dress up or dre","useful":0,"cool":0},"7h35_hL2jgSCg148iIsTuQ":{"text":"First time in, drive by it all the time. I was feeling a little Italian tonight so we stop","useful":4,"cool":1},"PySMmofatCKqpBNi5eWTHA":{"text":"We had been here for happy hour & pizzas a few times.\n\nJust dropped in for a drink, bar fu","useful":2,"cool":0},"HsmJO0z33lRTMe4o1k3rDA":{"text":"Best pizza in new orleans, wood oven pizza using only amazing ingredients, the happy hour ","useful":0,"cool":0},"pyX72tNfDCH6TeCpJ_FdIQ":{"text":"I'll start by saying that this is one of the few diners on Magazine that has a parking lot","useful":0,"cool":0},"IDV9PpEXKkRLVwq6dj_B-w":{"text":"We came in on a Saturday night during the Champagne Stroll and sat within 10 minutes. We o","useful":1,"cool":1},"50IKJen4n60sSILxelvbcw":{"text":"It tastes like chef boyardee and or ragu u might as well go to Popeyes and get a $5 box fo","useful":0,"cool":0},"rEYh065IzQFDW6eTM7rTvg":{"text":"This is the worst dinner experience I have had in a very long time and I eat out a lot . W","useful":1,"cool":0},"0sv7ynlTEiOkm2oAMQg9aw":{"text":"Amici's great staff and specials have had me coming back for weeks! It's as if the more ti","useful":1,"cool":0},"uL2dnPEhbEMBuVKiaZH1kA":{"text":"I went to this restaurant because it was highly recommended by a friend, and I'm glad I di","useful":0,"cool":0},"XYXsHJ2B1ec6ZVWvoC6eRQ":{"text":"What can I say! The chicken parmigiana is amazing and gone the minute it is put in front o","useful":0,"cool":0},"fWqC7cmYDGOWhbf4uXFoVA":{"text":"Lucked up on their Thursday special which was a bonus to already wonderful food. Pizzas ar","useful":0,"cool":0},"jYqzrMwU8_LHjhQpl-QWBQ":{"text":"After experiencing the Creole/Cajun liz in the French Quarter we felt it was time to try s","useful":1,"cool":0},"lYLZuTlo6HRG4nf0HR_xNw":{"text":"Food is great but $6.50 for a Cane Break thats brewed in Baton Rouge, Thats way over price","useful":0,"cool":0},"c0wz99W-cqgy86NGO10FCQ":{"text":"Charcoal fired pizza carmelizes the toppings really nicely.  Service lacks a bit, but most","useful":0,"cool":0},"nBot81V3pcYQ5YApwRqWbg":{"text":"I visited amici on a Friday night, and it was rather busy. The environment inside was welc","useful":0,"cool":0},"fnJEaWn63PZnlVZHeWgsdw":{"text":"I'm not sure I get the craze about Amici. I've gone a couple times for specials and both t","useful":1,"cool":0},"0cvrSAALkDeqnp8zOogjXQ":{"text":"I had a group visiting me and we came here for some dinner before continuing onto our fun ","useful":6,"cool":4},"s4dYbdVeGzDAw3hoz-kSpg":{"text":"Why is place is busy on a Thursday is beyond me.  Service is frantic but poor.   The three","useful":1,"cool":0},"QPAxHOUE-az6Qq6UaI0WOA":{"text":"Bad service hostess wouldn't give us a table so we had to eat at the bar. The bartender wa","useful":0,"cool":0},"27reZk0OF59LdT9rVQi0Qg":{"text":"The decor is beautiful.  The bartenders were very friendly.  Went for a saints game, they ","useful":0,"cool":0},"fljv-G73oR7PE1yvhRQf0g":{"text":"Very bad service...almost inexistent. Waiter completely ignored us. Had to call the waiter","useful":1,"cool":0},"gEk_Bo42FcPJsgzAYYvk3w":{"text":"We have been there today and the pizza was just delicious!! On top, it was happy hour (btw","useful":1,"cool":1},"02MpfvTj-HuW4ts9jFi8tg":{"text":"Was not impressed.  We went on the eve of Father's Day and tables to the right were all se","useful":0,"cool":0},"i4AFcN2mtyVVsbiOHx8EXg":{"text":"Another great night at Amici!  This is a great spot for a date.  It is warm and inviting. ","useful":2,"cool":2},"snRBHoaXkbYiNU117cMHmA":{"text":"Visited here tonight while on vacation with relatives. Overall, the food was quite good, n","useful":0,"cool":0},"Nr-UW8usBar4nP5RwB3cyg":{"text":"Pizza and pasta great. Excellent service. Would give 5 star but uses too much Fabuloso cle","useful":0,"cool":0},"87Na7Gu02jI2Vypi00uZmQ":{"text":"This restaurant is relatively new so I suggest that you make a reservation, we wanted to g","useful":0,"cool":1},"uNiN6C_SwVgcx_8XJielgg":{"text":"I love this place! You CANNOT beat $5 Pizza Thursday's & daily 2for1 happy hour! Just roun","useful":1,"cool":0},"h9H01xAW26tO4GtihDFWJg":{"text":"The food, drinks, and our waitress were all wonderful.  We got the spinach Alfredo pizza. ","useful":0,"cool":0},"AnwrBYdn7LevFqKkXpG1VQ":{"text":"I went to Amici for an event today and really enjoyed my time there. The service was spect","useful":0,"cool":0},"ztdo2w4RIgIbGz4NJkZWPg":{"text":"Great service and awesome food my girlfriend and I really enjoy came here and take our din","useful":0,"cool":0},"kiWUGgXmPLR1mP-Tc8RrTg":{"text":"The food was definitely worth a return. But the service was almost offensive. With more th","useful":0,"cool":0},"5pqwZp6qBKxHQNUjnoJNiA":{"text":"My husband and I went to Amici today with the buy one get one free coupon they sent us in ","useful":3,"cool":1},"CLEJECxh-EqRS9rt1Q4WOA":{"text":"Ehhh it's ok. Sauce tastes canned pasta is probably dried and not fresh. Would expect more","useful":0,"cool":0},"89mBB1PmQHXokk3XaqXc-g":{"text":"The thin, coal-fired pizza = fantastic; the other entrees = good, but not great. \nTheir wi","useful":0,"cool":0},"I0abuGGaEHJ58IxDQUbwkA":{"text":"I love Amici. I have been to Amici countless times - the bar staff knows me. There is ALMO","useful":1,"cool":0},"HgpyyujTr1fL57-Cpiwxtg":{"text":"I was pleasantly surprised with how good Amici was.  I went there for the first time recen","useful":0,"cool":0},"5uMEhcbznAp85mQI9v-58g":{"text":"Stopped in just for a drink. Person next to us was having a pepperoni pizza that looked an","useful":0,"cool":0},"8oc6XqvUUpz4fOo86nD-iw":{"text":"I got the meatball app. It was good and tasted like good Italian meatballs. The meat pizza","useful":0,"cool":0},"zDf7ItTxdQrD5V-Lp2VEHA":{"text":"THIS is the Amici's cuisine that my family has come to love in the few months we've lived ","useful":0,"cool":0},"BTQ1Kn5qwTDGcIUtsZNfRA":{"text":"Cons:\n- Not all pastas are made in house, so you have to ask your server to clarify which ","useful":0,"cool":0},"fZ9KQOqzsqyZ90KOKJrI9g":{"text":"Any chance the greeter at this place could crack a smile? Felt like asking for a table was","useful":0,"cool":0},"LzMvSRm9OetRdPtsi-OcLg":{"text":"This restaurant must have recently went through a change in ownership and the quality seem","useful":0,"cool":0},"0JFxRpN3kKIP2-RWim9OVw":{"text":"Went here for the first time a week ago. Sat at the bar for a casual night out with friend","useful":0,"cool":0},"7P8thYDO8eSQi8innQ4PFQ":{"text":"Sing the theme from the facts of life to this review:\n\nWell you take the good, you take th","useful":0,"cool":1},"yJnEAgCOLRSJJO1GxpbFeA":{"text":"Come for happy hour!! outdoor seating + half of cocktails - all night on Thursdays (I thin","useful":0,"cool":0},"uVgpZqDcUz4CYmo4lv42jQ":{"text":"Would like to start by saying our server Josh was very nice .. and the ambiance,  air cond","useful":3,"cool":0},"sY2Lv4pkk6rnl9btkd1Q4w":{"text":"Bomb ass happy hour - half prices DELICIOUS coal oven thin crust PIZZA. Best pizza in the ","useful":1,"cool":0},"OV7Alq7MFk45sBNQM2-tdQ":{"text":"The bruschetta was awesome. Which is why I gave it two stars. Our pasta was horrible (broc","useful":0,"cool":0},"cytZjbNco91izrMS3uxomQ":{"text":"Stopped in to Amici on a beautiful night hoping to sit outside.  No such luck, as everyone","useful":2,"cool":1},"OhLxW0YRK6lqDOEIYG5qUQ":{"text":"We totally goofed and didn't make reservations for dinner on our Saturday night in NOLA. A","useful":0,"cool":0},"8CyWUiz9u11E8DkDAJ2ebA":{"text":"Amici ' s has very quickly gone from being our absolute Favorite spot to somewhere way low","useful":0,"cool":0},"EjqN41fJXuPtHlwJPfrR8g":{"text":"I don't have a lot to say.  The pizza isn't bad, it just isn't special.  The atmosphere is","useful":1,"cool":1},"UbY4F7eJ-7VklRSwgR8oLA":{"text":"Very good pizza. The coal burning oven definitely has a different twist than the tradition","useful":0,"cool":0},"HhqLDlcRb5NKAUWzlZHGIw":{"text":"We did we're staying in the Garden District during our visit and we we're looking for some","useful":1,"cool":1},"vAvSjg21swsAHKrFH_X_dQ":{"text":"Good lunch. Nothing particularly special, but it's a big spacious restaurant with a decent","useful":0,"cool":0},"GJhJKSBPxA6Cf2OPWMYPLw":{"text":"I was looking forward to dining here after my parents had gone 2x and said it was really g","useful":2,"cool":1},"qzuE90Eg3pUWh96WwNmfog":{"text":"The dark lighting, red walls and bar make this place so inviting, it could be one of my fa","useful":0,"cool":0},"PhWMQeNaQSeW0FBBb6z67A":{"text":"Love the Wine Wednesday and half price pizza Thursday at Amici. Awesome deals and food for","useful":1,"cool":0},"t8lEk2EpZFGcV9hnAnAKtA":{"text":"We've been four times since Amici opened.  The Veal Milanese can't be beat and the Eggplan","useful":4,"cool":0},"WfH7bG29dP5_MxvGVtplWw":{"text":"Not terrible but certainly not worth going back. \n\nWanted a nice meal. End of a big day at","useful":4,"cool":2},"VLfPr5uL_v8mVZ7TF3KeqQ":{"text":"Amicis used to be my favorite restaurant but the service here is not good. We drove an hou","useful":1,"cool":0},"3N3KysZIvfD2lpDwj16oqg":{"text":"I don't know why I don't think of this place more often.  Solid pizza, spacious and nice d","useful":0,"cool":1},"C4ErwwgSGMtUTrnJA1yQIg":{"text":"My husband and I went out on a Tuesday night to try this place with our 3-year-old.  It wa","useful":1,"cool":0},"djkqq9jveQQGd0ENLMiU1w":{"text":"Typos was mediocre, and the service wasn't. \n\nI dined on a Sunday night with a group of gi","useful":0,"cool":0},"rB8gMXeiVPmvMrUKk7kBBQ":{"text":"Wow. Great meal. Carbing up before the marathon.  Prefect spot. Cheese board is to die for","useful":1,"cool":0},"EF2M0lx59hvH-ogPF-sSjA":{"text":"We have dined at Amici a few times. They have great Italian cuisine. Molto bene. A presto!","useful":0,"cool":0},"bBEFMcnJMifse7MMab-GvQ":{"text":"Uhhhh,  wines good,  if you get it before 25 minutes.  I love being ignored in a city with","useful":1,"cool":0},"R2M-1R2WQDXG2I_DyVGnQA":{"text":"Mediocre and forgettable. Especially on Magazine where there's incredible competition. \nCa","useful":0,"cool":0},"bhWPgJSXN1HX4PH7hNBGNw":{"text":"First review, goes to Amici! \n\nWe arrived during \"happy hour\" which is between 3-6pm. It's","useful":2,"cool":0},"tZufb85RM6kig1RjXU4TdQ":{"text":"Loved the fire grilled chicken wings. Hint of lemon. Perfectly charred. Didn't need any di","useful":0,"cool":0},"ijCITjy0qi7MOJyS4wS4nA":{"text":"Food was good, but not fantastic.  Prices on the menu were decent.  I didn't see anything ","useful":0,"cool":0},"UpwJ-gdukehV-9XcW8Bw1A":{"text":"A girlfriend and I went here for dinner and it's a really nice atmosphere to grab a glass ","useful":0,"cool":0},"YFIFn6rtx0lXI2PPGlHeVg":{"text":"Comically bad service. I was jealous of all the other tables. Waited almost 15 minutes aft","useful":1,"cool":0},"6zJA4ZbRvZmut_XN7tjInw":{"text":"Everything is amazing! Great service, food, and beers! You can't go wrong with the veal pa","useful":0,"cool":0},"tTfqDlqyBuMXgn3lPZd7YQ":{"text":"We had pizza with mozzarella and half ham, it was only $13. It was yummy, see picture. We ","useful":0,"cool":0},"euX-i3AUnoXSwl0O6zarAw":{"text":"BLUF:  Great date place.  Great service, great drinks, great apps, good pizza.\n\nThis place","useful":0,"cool":0},"N2XJEDY3U1e-gBFQG4Uyow":{"text":"It was delicious!  We had Caprese salads and a Margarita pizza with red sauce.  Yummy","useful":0,"cool":0},"4Et3T6taocjZcOu0J3obcQ":{"text":"Great spot on Magazine.. Meatball appetizer is unbelievable(trust me I'm an expert) I have","useful":0,"cool":0},"4sFAnxYTquZmVy-yeBnMNw":{"text":"Colin was great! The pizza was delicious! The wings were hot and tasty. However, the highl","useful":0,"cool":0},"zsmpJ6RpZmH2p6YlCNhqew":{"text":"Excellent food, pizzas where huuuuuuuge - that's lunch sorted for tomorrow. Lovely evening","useful":0,"cool":0},"Z-tKVjWk_yh2urFfI2he8w":{"text":"Good Italian food. Fresh pasta. Great specialty martinis.  Awesome service. A decent wine ","useful":1,"cool":0},"HJjiRxBiYtG0TjTNq5bD1A":{"text":"Shrimp Fra diavolo was delicious.  My husband is allergic to shellfish,beef and pork so as","useful":0,"cool":0},"AKHWUFE6aqANc1nbiCraQg":{"text":"Tried the Coal Fired Magherita Pizza and the Coal Fired Chicken Caesar Salad. Both were de","useful":0,"cool":0},"ZVNriwUWj7dh9nxfhp6RBA":{"text":"Expensive for a pizza joint.  Food is good, but it really isn't that good for the price.","useful":0,"cool":1},"p-jobV2F5jO2dm9ZxJFM5g":{"text":"Great pizza. Once a week (I think Thursdays) they have whole pizzas for $5 dollars (dine i","useful":1,"cool":0},"24G4kDJVZLLKECRInWGvmw":{"text":"Italian restaurants are hard to find in New Orleans so we were excited about trying out Am","useful":0,"cool":0},"jorwRnmC-702yAsdFH3kGA":{"text":"Oh man.\n\nAmici, you used to be so good! I hadn't been in a few years, so Joe and I swung b","useful":2,"cool":0},"RVAHMkk_HhiOSNMiF6YY3Q":{"text":"Well, as a first time experience here I would say this isn't a great start. Service was qu","useful":0,"cool":0},"lWr2s-2ZwY5LEZuhj-5gMg":{"text":"So today was the first time I had their new lunch menu!! Wow!! It was exactly what I was c","useful":0,"cool":0},"lFsJw0Aj3Swe59n4odwQJA":{"text":"Probably some of the worst service I've had in a long time and according to other reviews ","useful":2,"cool":0},"lV9JLRejbz0RBtazLAaGgQ":{"text":"Meh. We went on Christmas Eve.  My son did enjoy his spaghetti and meatballs (not a kids m","useful":0,"cool":0},"ANhujjLcPkeqU_O6t_nB-A":{"text":"Delicious pizza! \nNice atmosphere, but can get kinda loud. Very nice decor and a beautiful","useful":0,"cool":1},"az-irldjdRx8xRRZuXZUHQ":{"text":"Great location! Very pretty decor, and the wait staff were very nice and accommodating. Th","useful":0,"cool":0},"CdG6FNbif0v8-_KmxW5piQ":{"text":"Went here for my birthday. Food was amazing. Had steak.filet was excellent along with the ","useful":0,"cool":0},"lN8mpPsfBPw9p7EbPtOPgg":{"text":"Went here tonight for the first time with some friends and other than a muffuletta in the ","useful":0,"cool":0},"Uoah7SH7UEMwKskcbcP9Ew":{"text":"Visiting NOLA for the first time we did not plan on stopping anywhere for pizza of all thi","useful":0,"cool":0},"jgXM8gyMY8eCH1vF7qmBCg":{"text":"The acoustics are horrid. You can barely hear yourself think. As well, you cannot hear the","useful":0,"cool":0},"yhe35tCpNAHufX6WHYqglg":{"text":"Went to Amici on spur of the moment while in the area.  My friend and I wish we had never ","useful":1,"cool":0},"J6WibT_BTqpXY5EI2_kyxw":{"text":"The food and the service was good, but when my check came, entree that was $12 on the menu","useful":0,"cool":0},"l5LDpg9RBLQ7BhvUv289jg":{"text":"The food is great- I've enjoyed their chicken Parmesan and a few pizzas (the cauliflower p","useful":1,"cool":0},"OyNcJh3-vQK6_24JOwadGw":{"text":"Out of all the choices of restaurants in New Orleans, do not pick this one. On the day we ","useful":0,"cool":0},"w5izQ_358IsHCggz0NigaQ":{"text":"The pizza is delicious and their happy hour is hefty and truly a good deal: half off pizza","useful":0,"cool":0},"MFuYHHNOfGh5wswMKInW9A":{"text":"What a great place to hang with friends eat & drink\nAmazing white clam pizza & coal fried ","useful":1,"cool":0},"Qtu0ma6mYNg71Cm7H018hA":{"text":"The food is good here just so disappointed that the daily happy hour has gone away. Used t","useful":0,"cool":0},"aYyZbnRIYSlEWG5EpkpeSQ":{"text":"Except pizzas, nothing deserves to try. Mussels not fresh and smell stinky. Noodle with 6 ","useful":0,"cool":0},"6nt9hzG66N0RVV67AjDLEQ":{"text":"Went with friends. Place looked classy but we were wrong. The bar side was loud and obviou","useful":0,"cool":0},"wee9qco9Bt9UgCGz3gngCQ":{"text":"Ate here twice already! I am not a huge puzza fan, but this place has pizzas, pastas, sala","useful":3,"cool":1},"MiEAhzGFJbh5Sai4jJ6Ajg":{"text":"My daughter and I stopped here for a late lunch after hours shopping. Ambiance was so so..","useful":0,"cool":0},"Ww19nZNp_A2xAXCrNaRZJA":{"text":"Amici has a really cool environment and I really appreciate the nice people and good vibes","useful":0,"cool":0},"xp-MutDiKNMHBRAXofOqZg":{"text":"Wow what a nice place! We went for the first time during happy hour and I tell ya, that's ","useful":0,"cool":0},"vh1HBH1_vN3GfDztyBAzTw":{"text":"Went to Amici for lunch on a Sunday. We had the lobster ravioli appetizer and cauliflower ","useful":0,"cool":0},"mCF2u6wjMJCB2gELrlpcqg":{"text":"First time here. I like the food. Our waitress is on her 4th day here and I will be surpri","useful":0,"cool":1},"ygf2r80y8NNNdOlhe-VkjQ":{"text":"We love this place for happy hour in particular. Drinks and pizza for half off. The servic","useful":0,"cool":0},"MIuLxsi8F4xyGkRo_K1ffg":{"text":"A love letter, by Alyssa J.\n\nDear Amici,\n\nOn a balmy Thursday night in April, I cozied up ","useful":3,"cool":3},"owfC9vvWdP-Pci_3-RcYog":{"text":"Brought a large group for dinner last week.  Several had raved about Sunday brunch earlier","useful":0,"cool":0},"mfrOnwsFagwZdpHTgx_zJA":{"text":"Recently stopped for lunch based on a referral and was very impressed with the quality of ","useful":0,"cool":0},"QMJXF3MYHEq_BSy3jwp54g":{"text":"This place has a relaxed atmosphere and nice wine list \nAll of which are half off during t","useful":0,"cool":0},"rmeKCtdE2R7oeZ0ngFzIAQ":{"text":"We ended up here because the in-laws didn't want our usual New Orleans haunts- Pizza Delic","useful":1,"cool":0},"NC2C9J1BYSBvBQnuCr03cg":{"text":"Mixed bag of highs and lows here. Ceaser salad-very good (5). Meatball-Ricotta appetizer-a","useful":0,"cool":0},"Nhk9Ee8IXWZ8V_-O1jcbuw":{"text":"Chris the bartender is so awesome! He was so sweet and treated us great on my birthday! So","useful":0,"cool":0},"-NEMoTlQ4QhbfCxpzTUq_w":{"text":"I'm a fan. We went the Friday after they opened and enjoyed the food.  Cheese plate was pr","useful":1,"cool":0},"B1HEpeJKmaWGA4jLguYiHQ":{"text":"Just let me start by saying that I had the best chicken I have ever eaten here, braised in","useful":0,"cool":0},"JLJ1CqbjH87LPXMiMGHr4Q":{"text":"This place is horrible. I will never be back. I can't believe I paid the \"included tip\" so","useful":0,"cool":0},"zTGn2npdtRjPhqM2OFlHDw":{"text":"I had read the other reviews for Amici and was hesitant to try it out. To be fair, I rarel","useful":3,"cool":0},"VIa-QByrWNQRG-2h1IAB0g":{"text":"We were looking for something to eat late Saturday night but was limited to the amount of ","useful":1,"cool":0},"EkC73NqMP6A6B5zM8jmGYg":{"text":"So we used to frequent this restaurant at least twice a month for the Thursday special. Ho","useful":0,"cool":0},"deyLIuiDmxzE9lndlW-FzA":{"text":"Walked in during happy hour on a whim, tired and needing some carbs! \n\nThe waitress/hostes","useful":0,"cool":0},"fzB6UyezjDPWCJG5L4K18w":{"text":"What amazing service from our waiter Byron.Thank you!!! \nHe recognized I was trying to eat","useful":0,"cool":0},"YUMpFgfKLjl8VkXWwVwsYg":{"text":"Very nice atmosphere, fantastic service and delicious food!","useful":0,"cool":0},"WKw1djxw9H0ssyPMkpjaQg":{"text":"Tonight I had my first experience with burrata cheese and I am a huge fan.  It's texture i","useful":1,"cool":0},"u4cI71EPyq6-gSlH4r4pSA":{"text":"Best. Pizza. Ever.....and I live in NYC. My \"Create-Your-Own\" pizza with pepperoni, spinac","useful":1,"cool":1},"sXrtWSLme8s5Av70eV1mjw":{"text":"I love Magazine street and all that encompasses it. I often frequent the block that Amici ","useful":3,"cool":2},"brmHswopVMW6Mbf3FA5bjA":{"text":"I like that this place is walking distance to me. The food is very good and so is the serv","useful":0,"cool":0},"tolk2ecC21EEC2s5Ql1n5w":{"text":"I used to either eat at or order from Amici at least once a week, but it is safe to say th","useful":0,"cool":0},"IyKFdZs03F011swxNFV7eQ":{"text":"Very cute restaurant but can be a little pricey given the portion sizes and service can be","useful":2,"cool":0},"usqs7SdqftjTrnVn_xTCPQ":{"text":"Terrible waiting service! Added a gratitude fee for our group and then they wouldn't allow","useful":2,"cool":0},"4Yjt4DrGYh66bSf9skM9uA":{"text":"Stopped in here the other night for a bite to eat and I was very disappointed in the pizza","useful":2,"cool":1},"KcAKKFmEbT8x1Uv9M9WgTA":{"text":"Gross little modern pizzeria with a shiny interior and a very unwelcoming, faux-fancy chai","useful":0,"cool":0},"3YfOWAs1BaBIDqI679FIgA":{"text":"I wasn't expecting a whole lot, to be honest, I figured it would be roughly on par with th","useful":0,"cool":0},"9ClNe3miUb3diiyqfFKPmA":{"text":"I wasn't totally impressed with this place. The food was ok but I want to give it a second","useful":1,"cool":1},"-m7OZb22gvF48-b3kAprLQ":{"text":"This place is amazing. The best pizza around, but it does not compare to the awesomeness i","useful":0,"cool":0},"uyB2PDZZwr71PSUXWpPXgg":{"text":"Kinda terrible. Super super slow service albeit really friendly. Check out these weird win","useful":0,"cool":0},"Qgv0tnlTA2NoiUiq2ouDig":{"text":"The pizza is the way to go here, mussels are awesome... The lobster n crab meat ravioli is","useful":0,"cool":0},"kOSJDcaKCMtDZ_9_lbBxbw":{"text":"Ordered the broccoli rabe pizza and wings. Delicious! I am a native New Yorker and haven't","useful":0,"cool":1},"CUIRTJdfDu1wiyO_Q9PuNA":{"text":"Amici has had 17 critical health code violations in 2016 (per nola.com). I wish I would ha","useful":0,"cool":0},"RttRwJKbpQ4jZNSLhGvYIQ":{"text":"Happy hour is great! 1/2 off alcoholic beverages and pizza. Mussels are amazing, pizza is ","useful":0,"cool":0},"as8mXr-rBU_ekUnSs2b5mw":{"text":"I had high hopes.\n\nThe lack of great Italian food Uptown is sadly remiss.\n\nThe menu, also ","useful":4,"cool":1},"oMYbDY4dYKGIoPc7iJfp3Q":{"text":"Awesome restaurant! They did a great job with the renovation. The menu has great Italian f","useful":0,"cool":0},"myRyjP-Sf_ZBMiQkP_4fTA":{"text":"While certainly pricey, the food was really good. They were really busy on a Friday lunch,","useful":0,"cool":0},"PakXCasH0Ifp6Awg3W79VQ":{"text":"The service was very high end with two attentive waiters checking on us, but not so much t","useful":2,"cool":1},"s2vU2i-S6iBtTYiNR7scQA":{"text":"This place is terrible. I have been multiple times hoping that it will redeem itself, but ","useful":0,"cool":0},"QXP8sSD2OaafXyveB4a0ag":{"text":"Ate at Amici for the first time the other night.  We got there pretty late on a Friday and","useful":0,"cool":0},"rJdHr8s697TlrxG2zyAZNw":{"text":"We were hankering for Italian on our last trip to NOLA, and Amici was the closest spot we ","useful":0,"cool":0},"fFcRj39QXnJQyc86dTyE-w":{"text":"Just had the worst experience at this establishment. We were a party of four who walked in","useful":1,"cool":0},"TBpDyUrepwI4xQnFn0cvjQ":{"text":"I used to eat in this location frequently when it was Byblos and they have certainly made ","useful":8,"cool":2},"MWl3FC5JLbIylQInOEiPEw":{"text":"Cauliflower pizza freaking awesome! \nBloody Mary- the big one with a sandwich.  So tasty! ","useful":0,"cool":1},"I8wX3gajgJwJq1iGAJ1iaA":{"text":"The tour guide on our \"hop on hop off\" bus recommended trying this place. We were blown aw","useful":0,"cool":0},"SXULOlb0aJJYviwsARjlMw":{"text":"This restaurant is delicious and the staff is wonderful. We had the Arancini appetizer, an","useful":0,"cool":0},"_tpd_7vnY7aG87k2DOv3rg":{"text":"This place seems like it should be nice, but it's actually really not. Many of the menu it","useful":1,"cool":0},"e4xE-FMogz9Zoo2-WZxk6w":{"text":"I have been to Amici twice now and both times have been wonderful! For an appetizer we got","useful":0,"cool":0},"ErLPuv8J2MoFzN9EDi9CPw":{"text":"I would stick to the pizza. What went by looked pretty good. I had the chicken Marsala and","useful":0,"cool":0},"bk-etEIrm6AFLr7eqaE6KQ":{"text":"The food was fabulous and the service was even better! The room is renovated from the prev","useful":1,"cool":0},"WS0dqiuCbp6DIGhwxzbiKg":{"text":"Update: \nAfter a professional and personal apology from the management, I went back for a ","useful":0,"cool":0},"ujGuAkXBzZ8_GroETuz84A":{"text":"If I could give 0 stars I would. I have been to this restaurant multiple times in the past","useful":4,"cool":0},"6aeVbH5pINNV_w_IkB93dA":{"text":"I took my husband here for his birthday a couple nights ago. He ordered some pasta dish wi","useful":1,"cool":0},"LGMPJwdA9eL90EF8F4_QZw":{"text":"Food. Ok. Added toppings to pizza and it was satisfying. Service. Terrible. No clue we wer","useful":1,"cool":1},"OP2dycTy6vVRukzhuHkgtw":{"text":"Great food and great service make for an awesome Sunday Brunch experience. Small brunch me","useful":0,"cool":0},"tiQvGG2cI_pXkVCLm1gn2w":{"text":"I came here with a friend Saturday night.  We ordered rose wine then calamari.  It was fre","useful":3,"cool":2},"DlSIQQSqezR-spe4pmrSDg":{"text":"Amici has some of the best chicken wings I've ever eaten in my life.  Although I've only d","useful":1,"cool":2},"KLjxeQAVbXBTk8beCtf-mQ":{"text":"Food here is delicious! Really enjoyed the spaghetti and Italian sausage. Have the fried O","useful":1,"cool":0},"fCFO9PTfRXt6IE2ivz4eFQ":{"text":"Great Italian place on Magazine St. The ambience is  very nice and eclectic. Had a great h","useful":0,"cool":0},"WUmc1yOfH6WHQMgOQ3V64A":{"text":"Always see pics of delicious food on Instagram, and Amici is in a prime spot on Magazine S","useful":0,"cool":0},"1LSD9lXkVV-CU4sbo7r9AA":{"text":"The service is perfect and the waiters are very friendly. One of the owners of the restaur","useful":0,"cool":0},"Bi4Rari_dQpL4xJQHoC1LQ":{"text":"After another visit to Amici, I am now upgrading them to 5 stars.\n\nThe two star bump comes","useful":1,"cool":0},"I4ZooQqyM0HvNTKIrzWciQ":{"text":"Their food is okay as well as the service, my complaint about this place is that they are ","useful":0,"cool":0},"iVs4qpDNY8bCX91oTYHIKQ":{"text":"My partner and I tried Amici today for the first time because we got coupons in the mail, ","useful":1,"cool":0},"sB_3_pwz8MptPNA6-LGbDg":{"text":"Basics: good food, AWFUL SERVICE. The waitress dropped the lemon for my water on the floor","useful":2,"cool":1},"iO_fZ10Rel12ibdN-K8s8Q":{"text":"Stopped here for lunch after walking around the garden district.  We ordered salads and a ","useful":0,"cool":0},"O5qDP29XFZU2wQ1m5VXrDg":{"text":"I was expecting great things from this place, and it was just... Meh.\nThe pizza (margarita","useful":1,"cool":0},"9ROc30PNj3WsPbqwI7q54A":{"text":"Second birthday in a row my son asks for Italian and we go to Amici. It is always excellen","useful":1,"cool":2},"JonkT61JchfriHLCReaK6w":{"text":"Went here for happy hour on a Wednesday. The restaurant is super cute, nice decor. It wasn","useful":0,"cool":0},"LWtvQjseW8zm1nHEoZGpbA":{"text":"I'll probably not return to this place again. My dad found this place first and he liked i","useful":0,"cool":0},"Tubx_BsM_9pyYnon3zfoyQ":{"text":"Great meal, very lovely waitress although I think she had the impression my friend and I w","useful":1,"cool":1},"A-tUxqcFZEA7LFcR_n2t9A":{"text":"Great spot with great service. Fern is a fantastic bartender/server (good memory, nice to ","useful":1,"cool":0},"I5SKJGp2GR4JiHbwtMaY3w":{"text":"An awesome experience! Loved the pomegranate ginger sparkler -- best drink I have had in a","useful":0,"cool":0},"8-C07gycPNppHrripXQRlQ":{"text":"Stopped by this awesome Italian food restaurant for lunch! Super pretty inside, very clean","useful":0,"cool":0},"Dd4pObaxZ1FRFWC8X0C5EA":{"text":"Drinks are ok. Ordered calamari fritters they were ok, had better. Artichoke pizza was exc","useful":0,"cool":0},"tDxfXOiDSR-X7DH_XDyC8g":{"text":"I am fan, I think their Pizza and Pasta are really good. They give generous portions. And ","useful":0,"cool":0},"5rp52yoJzbofwDxWLuzxwA":{"text":"Had a wonderful night last weekend.  Always come here when I'm in town.\nHad the Carne Ital","useful":0,"cool":0},"CkXaJpg8rvkF5DZWexy-AA":{"text":"Thanks Amici's for wonderful New Years eve dinner.  The service was great and the food was","useful":0,"cool":0},"cuRwzK0pDDLsrEr8PJRcRg":{"text":"I've been to Amici quite a few times. The service is normally decent and the food is tasty","useful":0,"cool":0},"hw0I6ZkwbYjNX_lYEu4zmg":{"text":"The pizza is the best here,cocktails, great selection of beer. Smells like home and not a ","useful":0,"cool":0},"FFEz1IbbWkd59Fi4jaE5CA":{"text":"Not the best greeting when we walked in. We were pretty much ignored for a bit until i fla","useful":0,"cool":0},"lcsugtpYTAJbsMFHE3503g":{"text":"This was the best pizza I have had in awhile. We had the margarita pizza with Shrimp and i","useful":0,"cool":0},"inUDxmwMZGAwqW5TVsCDkA":{"text":"Tried this out with a few friends. Had charbroiled oysters and veal appetizer and them vea","useful":0,"cool":0},"IXfOLuNMr7OphmVihzXxWw":{"text":"Great prices, great drinks and excellent food! As for  Will as your bartendar, you won't b","useful":0,"cool":0},"aMh6FHlblIobGa6u6ZzkSA":{"text":"Don't know what ever one is hating on. Atmosphere is pretty nice so is outside seating. Th","useful":1,"cool":0},"6PNPYj_iXocBJj8pO1WNLg":{"text":"Best Italian place in Nola hands down. Great service and not too expensive. Ask for Paige ","useful":2,"cool":1},"36KBIEpDPc1r6brf5pXSnQ":{"text":"Environment is pleasing inside! Ordered the caprese salad- which was huge and delicious. W","useful":0,"cool":0},"vA0-By3-T5ZFur9dTaywcA":{"text":"Pizza Thursday is an amazing deal. All pizzas on the menu are $5. In any other town this w","useful":0,"cool":0},"Q0BUXSyA2oOuHiWRSDOeig":{"text":"I typically visit Amici once every couple weeks.  The last time, I went with a buddy for h","useful":0,"cool":0},"07ccOlvCcuyksiANgn_qvQ":{"text":"The pizza was great, and the service was even better! They were out of a few things, which","useful":0,"cool":0},"B7UHK3L4UXpZttixrSmluA":{"text":"Well, Amici came close to getting a two star review. The first night we came here we were ","useful":1,"cool":1},"zPYVXho2w32cb_gLA9QtAA":{"text":"The service was very fast and I loved my chicken Parmesan. The portions were quite large a","useful":0,"cool":0},"IL43eOcrm0REbCgT5Vudhw":{"text":"After a second visit to Amici, they lose a star.  I thought there were 3 1/2 after the fir","useful":2,"cool":1},"X3Gd_ikfxZ4Z9XoNbkj36w":{"text":"Had an amazing time here! Erica answered all of our questions, and took great care of us. ","useful":0,"cool":0},"3WBCShZPeMSh4SC5zDjZHg":{"text":"We had a great time here for dinner and drinks. Quick service and our waiter had a great p","useful":0,"cool":0},"4aT14rvczHCfz92HUXM7vQ":{"text":"Once again, this place does Not disappoint. Caprese salad is fresh and the pizza is always","useful":0,"cool":0},"F7mtV4KYuLU8Yp7G_ziNgw":{"text":"Absolutely LOVE this restaurant. Accepts reservations and always supplies timely service. ","useful":0,"cool":0},"14mLwwSSQMqDkLcoUhcDfw":{"text":"Favorite happy hour in the city. \n\nI've never had a bad experience here. The service is ex","useful":5,"cool":0},"qLqNWN9B4vbcER3TNItOtA":{"text":"Good pizza and pasta - pizza is thin crust, Italian style instead of American style pizza.","useful":2,"cool":0},"0QW9Sipaqlzwp0JLU5Xw3A":{"text":"I went there with my wife for the first time on October 26th.  I was excited when I saw th","useful":0,"cool":0},"jHuX0vkN2NCigWx6nW4BSQ":{"text":"I love the chopped salad!! The happy hour here is a great deal and you can't beat the $5.0","useful":4,"cool":2},"oZYgHa1d32jAMgR_aKcPMw":{"text":"Poor service. Being the only table the server had we expected a little more attention but ","useful":0,"cool":0},"W5hXGPbl0pJlrFCMORYqhA":{"text":"Really liked the atmosphere and the pizzas. Great flavorful crust and fresh tasting marina","useful":0,"cool":0},"6rlrLHTR_EUZiV8rGLFwdw":{"text":"Half off wine bottles wednesdays was enough for me but then they throw in the most excelle","useful":0,"cool":0},"afhPTIl-HhNd4PfXnH1afg":{"text":"A little expensive, but the pizza was good (coal-fired oven). 2 for 1 drinks (good, big ma","useful":0,"cool":0},"GVFm7oiB0GmpymV_lR23jA":{"text":"Have been to Amici a couple times - on weekends when places around are crowded.  Huge open","useful":1,"cool":1},"bXdxsqqm-rmZezeqJ82yVg":{"text":"I was a bit skeptical when I first arrived as there were so many mixed reviews online. I d","useful":3,"cool":1},"gDqNBF9abeWwsRbZDyL7pQ":{"text":"Pizza joints are a dime a dozen in America, and it is hard to stand out. You probably don'","useful":5,"cool":1},"ufp_SUF6ztexJdeesREbjg":{"text":"Summary... Good good. Service needs work. We went on martini night.... And they were slamm","useful":0,"cool":0},"ztJuitcIVaa83AtdKeSZng":{"text":"Great Sunday Brunch! Good service! Bottomless mimosas a must! Had a blast! Saints game tod","useful":0,"cool":0},"H7FKE4k2wTUPgyw6ETIN-A":{"text":"I have found a new favorite Italian place and its Amici!  I enjoyed everything about my ex","useful":3,"cool":2},"r3iRhy3nVad7dcxGRDf1wQ":{"text":"Best restaurant and happy hour in the Greater New Orleans area. Ask for Tyler if you are l","useful":1,"cool":0},"-dAvErTzQYuPjIVRYyBM2w":{"text":"This has been an amazing experience! Nicole is personable and fun and the food is also ama","useful":0,"cool":0},"AGN1-xIMlzJkwU7QLtX-sg":{"text":"Very new. Very nicely done! This is a pretty casual Italian joint. They have brick oven pi","useful":1,"cool":0},"9bhrkrkVi_pDSi-sUxzKcQ":{"text":"This place has a nice interior and good service. Our table had sausage Fra Diavolo , a shr","useful":0,"cool":0},"XG16B4O2tliHlsl5x0QEgw":{"text":"My Amici experience was great! I love italian food, and I'm addicted to pizza (so are you,","useful":15,"cool":10},"jkAOTdwv6nqIjWiepUPEuA":{"text":"Wow where do I begin, the only reason that I'm giving the place two stars is because the p","useful":1,"cool":0},"RqNP0YXGDwRJPLikXNsSUw":{"text":"This is an amazing find on Magazine street, central to all the shops. They have happy hour","useful":5,"cool":3},"lq_nJ31vmfhof60_SZ1kEQ":{"text":"What a nice place! I have seen this place many times while passing it on Magazine Street. ","useful":8,"cool":8},"ji8L4YXQmmMYcpB19pCc3g":{"text":"Food was delish, service was...mediocre. Maybe a little less. We always order drinks, appe","useful":1,"cool":1},"0eCHf-4brTiCfKsw380bug":{"text":"Best pizza ever!!!! Sangria is great.  Happy hour 3-6 everyday which includes half off piz","useful":2,"cool":0},"T9e0a9G9zDWvlPkfB7kkKQ":{"text":"Excellent food!  We love the happy hour specials.  The calamari, pizzas, & pastas, are del","useful":1,"cool":1},"1pzP1EDWeScYTc8aUXAukw":{"text":"I usually go on Fridays and the hostesses and waiters are always incredible! Great food an","useful":0,"cool":0},"Ie5qe00pQ45TvjrH_I8XGA":{"text":"OVERPRICED\nNOT COMPETITIVE\nPOOR VALUE\nTOO EXPENSIVE\n\nTHE NUMBERS: a 12\" Carni Italiane (th","useful":7,"cool":3},"MiB3da502ETv_7NClhvfZQ":{"text":"Our service was not great and the food was even worse. The chicken parm was very small yet","useful":0,"cool":0},"cdOJvs1_55f0H4XSicrFNw":{"text":"We only tried one cocktail each because the happy hour ended at 6 and we were on a mission","useful":2,"cool":0},"FP5Addtg50Bf2-b8h64MxQ":{"text":"2.5*\n\nMet some friends at Amici for a late lunch one weekend. Besides the decor (which is ","useful":2,"cool":1},"3Dp7CKB-b2yzXh95SlslTg":{"text":"Let me start off with the positives--\n\n+ Service is great. Our server Jasmine was friendly","useful":2,"cool":0}}