{"YsfiGjkPiMi_JstGt469Zg":{"text":"Cheickine under a brick.  Good\n\nBrussel sprouts.  Good\n\n\nNice environment \n\n\nOverall a ple","useful":1,"cool":0},"AY8DSg5zyRseiDZVFOjUCA":{"text":"AMAZING!! I went here for sunday brunch and was quite pleased with the delicious food!  I ","useful":0,"cool":0},"4uC0wHHBq0q8EUef3jQHYg":{"text":"Firstly, our waiter Larry was refreshingly attentive and knowledgeable. \n\nSecondly, everyt","useful":2,"cool":1},"-m0VmHyZnJpgvONZs70oQQ":{"text":"Banana pecan pancakes were good. Alligator sausage was interesting. It was my first time t","useful":0,"cool":0},"YwS5TGNfEK2Lishzd7bytQ":{"text":"This restaurant is in a quaint little area. Nice and clean with a friendly staff. The food","useful":0,"cool":0},"7UC8g12o1XICBHHaKj5NrA":{"text":"My friend and I drove down to New Orleans from Atlanta. We were rescuing a dog and cat the","useful":0,"cool":0},"F1mulFEH6bFXFJalfYsrBw":{"text":"Wonderful experience. Food was uniquely prepared. Had several apps, with the shrimp and gr","useful":0,"cool":0},"UwK-OmlxxpSKglBVVIidcg":{"text":"Brunch is amazing!!! Price is very reasonable too. I have only gone there for dinner one t","useful":1,"cool":0},"Z_uVgy96YkH3x48hQUFkqg":{"text":"I guess they need to work on their consistency here.  I read other reviews saying how grea","useful":0,"cool":0},"m4_V2y3yWEolsiorYamKVw":{"text":"Holy Moly this place was amazing!!!!!  Hands down the best dinner in NOLA.  The Chicken Un","useful":7,"cool":4},"38Uen2p0zM_JkUBjyun2kA":{"text":"We were greeted and seated immediately. Our tall bearded waiter was kind of a jerk. Barely","useful":0,"cool":0},"CTb6kVHNLrFXA3d05uc8qw":{"text":"Disappointed.  It was not that great.  We had the pork and redfish.  Redfish was dry and f","useful":0,"cool":0},"HULaN8xPiVC8u_OvwoLy3g":{"text":"Maybe I ordered the wrong thing.  \n\nDante's Kitchen is located in an older home that been ","useful":0,"cool":0},"MjlPcjED4VoKlVps57FKlA":{"text":"This place was about a 15 minute drive outside of the touristy French Quarters area. Fortu","useful":3,"cool":2},"gGX8H5f9lmpbJEoaYwUGFg":{"text":"This meal was amazing, hands down my favorite meal of recent months. I loved almost everyt","useful":0,"cool":0},"6MTMxDOCmVKJm9arbt9hnA":{"text":"Great dinner food fresh and delicious. Server friendly, helpful. So happy to enjoy this re","useful":0,"cool":0},"62VAgqOmW8557ujrTaLQRA":{"text":"A group of us had the escargot, beef heart, and ox tail for appetizers. Everything was inc","useful":0,"cool":0},"r0sK2PrBzCg4i2Xuk0hygg":{"text":"We were visiting from DC and wanted to get authentic NOLA food. So glad we chose this plac","useful":0,"cool":0},"2Ib-FtvqvxwILhi2BDSVkw":{"text":"This was my first taste of New Orleans food on my first trip to the city.  I chose this pl","useful":2,"cool":1},"kULpqUC0yYtaAdeJSY16iA":{"text":"Wonderful, wonderful meal.  Just spent three days in New Orleans and, by far, this was the","useful":0,"cool":0},"TVYpgRTMOBigHzDMktbBTw":{"text":"Go here.   \n\nWent with two friends for brunch and we loved it.  Whatever you do, get the B","useful":3,"cool":1},"m-wn-S3H2TQbe6ZuR4C_0g":{"text":"Went during jazzfest to be away from the crowds. We got the redfish, Brussels, green beans","useful":0,"cool":0},"Wi2VXSP7ZO_DUzZ-giNHlA":{"text":"One of the best meals I've had this year. The Chicken Under a Brick and Double Cut Pork Ch","useful":0,"cool":0},"O_cGcdmjhQqv8GMrWMR_Dw":{"text":"I found Dante's kitchen mentioned on a blog, after searching for farm to table restaurants","useful":3,"cool":0},"SYbTlKgjcnDqvnRMrhMv6Q":{"text":"Excellent service and food.  4 of us ate hear for coolinary (yes, I'm late with the review","useful":0,"cool":0},"6no6tnFLsd6MbgGwB-rV2w":{"text":"Went there for brunch recently and anxious to go back. I got the tamales (off menu) - so g","useful":0,"cool":0},"S-ulD7zRlYuuEsRF9k__JA":{"text":"my husband and i ate here when we were in town (my first visit to NOLA) because of all of ","useful":1,"cool":0},"8K3ddAxRZONeYQOuxYk5Yw":{"text":"Dante's was the best dining experience I have had in a very long time. The place is quaint","useful":0,"cool":0},"-rXwKhMA-C6PZ_alHi_RFw":{"text":"Well worth the wait! We went for brunch on Sunday and while the wait was 40 minutes we sat","useful":1,"cool":1},"NWFTGbIUVqIEqTZJntKw5Q":{"text":"The best shrimp and grits in town! Done just do it. The cocktails are on point! The server","useful":1,"cool":1},"Gi8bjlMZ82-nkgg3GSPNqA":{"text":"Incredible food. Ordered the pork tacos and they were delicious!  The bartender makes a me","useful":0,"cool":0},"7cUgkvXSKouCvaH4taFr1A":{"text":"Always good. The brandy milk punch is one of my favorite drinks in New Orleans, and a grea","useful":0,"cool":0},"zYXA8hVXBem-J6Xa7Honuw":{"text":"Had an excellent meal here.  Service was spot-on.  Do not miss the \"chicken under a brick\"","useful":0,"cool":0},"7jH5j8BhOyA_MYoPoTwFPQ":{"text":"My friend brought me here on my visit to NOLA - my favorite thing to eat for breakfast is ","useful":0,"cool":1},"74HoyznqTEzj8eNp_soiuA":{"text":"Cool atmosphere, the service was great. We ordered the Escargot, Redfish with Crab & Citru","useful":0,"cool":0},"0mD9usMQ3vwTfQWACl9T7g":{"text":"Great food, good service, cool ambiance.  Our server was very friendly, professional, and ","useful":0,"cool":0},"hClcLOE0nJcc5Bp5A8cyuw":{"text":"This should be our favorite restaurant in New Orleans. Everything we ate was a culinary ma","useful":0,"cool":0},"IDgV6lZWKhMnS37JpBeqqQ":{"text":"Fantastic location -  just take the street car and stroll a couple of blocks to find it.\nA","useful":0,"cool":0},"hXyGe2TmorUV7GOvmdz8uw":{"text":"Food was ok, service was terrible. Way too understaffed. Two tables sat after us, ate, and","useful":0,"cool":0},"wNeG--ZSxydwWc_hEYP0Tw":{"text":"Food is pretty damn good! Servers could be better though. Everyone seems kinda lost workin","useful":0,"cool":0},"ZwtQjEp0daPQBoM6ga5mVg":{"text":"Great food with local ingredients done up in unique ways. I would have given it 5 stars ha","useful":0,"cool":0},"05ygm-rrdgM_4LcjMBYw6g":{"text":"Sit back and have a drink with friends on the porch while you wait for a table for Sunday ","useful":0,"cool":0},"w3q_Ft9EbeeQ4fbKa1UQ-w":{"text":"Huge disappointment! We've been here before and we're blown away. So decided to bring some","useful":0,"cool":0},"OcK3KNA0Y3_xKoguEtv2Sw":{"text":"This place is amazing - the people, the food, the bar mixology. We were here for brunch - ","useful":0,"cool":0},"EA0Ct2f4xoWKccTWn-XEIg":{"text":"Delicious! One of the best brunch meals we've ever had! I got the steak and eggs, fiancé g","useful":0,"cool":0},"JdUFFKuKOkYtLhgmrPzwkw":{"text":"Prior to Katrina, this was *the* place I'd go to for Sunday brunch. They have a HEAVENLY H","useful":1,"cool":0},"jFcgAu9xJxWdVjZD3l0tNA":{"text":"The best duck that I have ever eaten.  It is delicious!","useful":0,"cool":0},"Ag8alvbSAxuIQcs5j1ImCw":{"text":"One of my New Orleans favorites. Brunch or dinner. Progressive takes on southern cuisine. ","useful":1,"cool":0},"Oi-7iWbZXDSB0Dxrkezi0Q":{"text":"We held a corporate dinner here for a party of fifteen in a room by itself and was a huge ","useful":0,"cool":0},"wSDi56ZL4N28ZTJUSyfnhA":{"text":"Always good food. Creative menu with New Orleans flair and wonderful cocktails. Recommend ","useful":0,"cool":0},"qNOjJ0xjHiZEmaLwl1FdaA":{"text":"I need another star for this place because 5 just doesn't do it. Dante's Kitchen was one o","useful":0,"cool":0},"tS3ZeuIDw7ObaYHZJeFOOg":{"text":"Went for dinner on Jazz fest weekend: Food was great! I particularly loved the shrimp and ","useful":0,"cool":0},"mp05zczURffzMUGnlCFwvQ":{"text":"We had a great meal here with a great group of friends.  The foundation of the meals great","useful":3,"cool":3},"YmMnvI44_DxF70eQqFkNFA":{"text":"while the food was good enough, the service was seriously lacking. we were really looking ","useful":0,"cool":0},"1PmUETZJd2BAHxq4n5G6FQ":{"text":"Very welcoming staff.  The host recommended a fantastic 2000 Valipocella  to enjoy while w","useful":2,"cool":0},"upah5GJHt5gcRJV3k8gdRA":{"text":"If you need a break from the madness of the French Quarter, Dante's Kitchen is the perfect","useful":3,"cool":0},"wVRrSRDWo6hUbD8Phr5Gug":{"text":"I love love love this restaurant!\nWent to Dante's New Year's Day with a date that was in f","useful":0,"cool":0},"lxMra4-NEPpek8WpKI-Vpw":{"text":"Every year I spend the Independence Day holiday in New Orleans with a group of my girls, t","useful":1,"cool":2},"Q4gefhIq_I6buIocE2w-Pg":{"text":"Food was just okay. I started with the biscuits, the mango and passion fruit jam was delic","useful":0,"cool":0},"85G2q-HK4Mm-QXTrL_01CA":{"text":"90% local ingredients.\n\nThe bloody Mary's were great with a lot of horseradish. I loved th","useful":0,"cool":0},"1wzhBZ99GEiodssRVBAVPA":{"text":"Went last night on a slow Monday night.  The food was solid but the service was a bit unev","useful":1,"cool":2},"oDYJNUUpw7XNAVIGxkLGug":{"text":"Gosh.  5+ stars.  I was on vacation when my girlfriend and I went here, and I would recomm","useful":2,"cool":0},"ILkTLs1GOrpm0cB6JTZ-Bw":{"text":"I must have come on a bad day because I was very disappointed. I had heard about Dante's k","useful":0,"cool":0},"RWwWAARr22QcFKthPqxzWQ":{"text":"We were vacationing in New Orleans for a few days and we were planning on going to Jacques","useful":2,"cool":2},"qXzA7l1nPJxwx8hJ5q5asA":{"text":"I've been here for brunch 3 or 4 times. Let me tell you one thing - get there early (there","useful":0,"cool":0},"Tacrhfdipnx2zEU8YVu1Zg":{"text":"This is easily one of the best restaurants in Uptown. My wife and I have come here a coupl","useful":1,"cool":0},"lLvv2AyFw8shYVmRs3FiHw":{"text":"Consistently excellent food and service.  We have mostly eaten breakfast here, but recentl","useful":0,"cool":0},"xM9a09RUCZEuZOCsjRZGcQ":{"text":"I was sadly disappointed tonight.  On previous trips, the meal was absolutely perfect. Ton","useful":2,"cool":0},"a2iW6IqnD3Uto381Qwhr4Q":{"text":"I visited this place over the Thanksgiving holiday with a few friends, and it was phenomen","useful":3,"cool":2},"vJ3gTSnmy0p1sSfty2EpCA":{"text":"My wife and I had dinner at Dante's Kitchen on 11/15/13. We were there to celebrate our 15","useful":0,"cool":0},"em0X7HmKMaNHxJOV-sgolA":{"text":"Beautiful outdoor seating area, friendly but not overbearing service.  My absolute favorit","useful":0,"cool":1},"2lUj8VnI7uGgwcPDcHkPEQ":{"text":"Fun place in a cool spot. Food was overall fine. A bit salty but I think that's normal for","useful":0,"cool":0},"PxqCCGY1fMb_RlZJIwrpFg":{"text":"Dante's Kitchen definitely worth my while to wake up early took public transit from our ho","useful":3,"cool":1},"rb4kkDmswmtKGv3nGm-XjA":{"text":"I'm not sure what the rave is all about with this chicken under the brick thing...  but I ","useful":0,"cool":0},"4ZOO0hhyqvoHT4NJg8cR0Q":{"text":"Wow! A sunny day & Dante's Kitchen on the outside patio. A perfect combination!!\n\nJohn was","useful":2,"cool":0},"fw0joaIEdkXnXc0ehWp9lw":{"text":"The most amazing meal we have ever had!!  Service was fantastic.  Started with the grits (","useful":0,"cool":0},"HhakSSetOUQ5PVRPHmQr2w":{"text":"Excellent place for brunch!  Awesome Bloody Marys, with veggies grown in-house.  Everythin","useful":0,"cool":0},"VYiwYpzEXldDoishp87gKw":{"text":"We had the Shrimp & Grits followed by the Chicken and Crawfish. It was excellent!","useful":0,"cool":0},"5tMuCDb40kTNVsnkkDXsaA":{"text":"I'm not sure if their food is \"Cajun/Creole\", but my boyfriend and I had a great dinner. T","useful":0,"cool":0},"HElbpMuVqy1TVy5Ve9JOIg":{"text":"Overpriced, small menu, great grits but terrible bread pudding. I did not bookmark them an","useful":0,"cool":0},"DfEP89j1mkA8LNcf6Ac2aA":{"text":"We've been here several times for brunch, probably because that's the time that our kids d","useful":0,"cool":0},"_OLA-q4b2nY-jMQZzuMoFQ":{"text":"Dante's Kitchen was the surprise food star of this trip. After all the hype around its nei","useful":0,"cool":0},"C3dxren1eHLH1tQ9SwK1Aw":{"text":"I wish I'd written a review shortly after visiting here, because the details are a little ","useful":1,"cool":2},"19BAQSdGTtfKeyR5SO_lcg":{"text":"I just love the food here.  It is rich but not overwhelming.  The drinks are to die for.  ","useful":0,"cool":0},"J-KRTv_9vdAd_669KahGcg":{"text":"Food is DiVine! Melts in your mouth it's so good. We had the Chicken under Brick and Trois","useful":0,"cool":0},"OMRCtylyEX4E4zQfBWFzOQ":{"text":"What a cute place this is! \n\nLots of brightly colored walls (the color made me a bit nosta","useful":3,"cool":1},"we47cq9reJeOghdmH814gA":{"text":"Very nice, cozy spot in a residential neighborhood near the river in the Carrollton area. ","useful":1,"cool":0},"cvLc_P5I3urY0SHRGl-51w":{"text":"So... Being an native of the Houston I am on the hunt for a bottomless mimosa to rival tha","useful":2,"cool":0},"-KJMVq1IqexTlPQEN2qp8w":{"text":"Dante's is a small and quaint restaurant that serves up southern fare with organic and fre","useful":0,"cool":0},"c0O31VaVXteAeWhUhoogJg":{"text":"An great destination restaurant for tourists who want to escape the French Quarter for an ","useful":0,"cool":0},"EPtTbJxqYSkvpBw96a-Xdw":{"text":"Had Sunday brunch here.. It was amazing! The place always stays packed. If possible, call ","useful":2,"cool":1},"Ev73O1eDf2w22sZ1Aro7gA":{"text":"Fantastic as always! Service is consistently friendly and knowledgeable. Quality of ingred","useful":0,"cool":0},"ASwwbqH1LhSJUs3-QNHMvg":{"text":"This place was amazing!  It's off the beaten path if you're staying in the french quarter ","useful":1,"cool":1},"dRjxrFMSDLJtMRqGqtjh-w":{"text":"Oh Dear God! Make plans to do brunch here. Serious. It's great. We had the debris w poache","useful":0,"cool":0},"l7UUzr_NFwvWoVHVpdYruw":{"text":"I just adore Dante's Kitchen. It's the quintessential uptown restaurant, right by the rive","useful":5,"cool":5},"ORQX4yzvV8Kga2NPhS7X8A":{"text":"This place is a hidden treasure. We stayed at a airbnb and they reco'd this place. Thank G","useful":0,"cool":0},"E6CkUuhS-cNwRpc9U_U75g":{"text":"Came last night for dinner with husband and two year old daughter. we made last second res","useful":0,"cool":0},"V9eoe9rNigQGzlSjN1INSQ":{"text":"We decided to stay away from the over priced and dressy French Quarter restaurants and hea","useful":0,"cool":0},"Dc7Sb5cJZMmbK5qrH-A4Uw":{"text":"I turn to Dante's Kitchen whenever I need a great meal that will impress my friends.  I br","useful":0,"cool":0},"-uBi9x_BhgTQ05759Eg0Lw":{"text":"It pains me to write this update as Dante's was one of my favorites, but the negatives tha","useful":1,"cool":1},"gFVzrfv4Tc52aq386tsjlA":{"text":"Dante's Kitchen is worth the trip out to its location, approximately 10 to 15 minutes outs","useful":5,"cool":3},"pcNfy8DfnFp6P3-r96fKAQ":{"text":"Cute little place, very friendly staff and the food's fantastic. Had the grits with cheese","useful":0,"cool":0},"bFW9xtJzSGFM4pzVznlQAw":{"text":"Dante's is one of may favorite places in the city.  I love how they use local produce with","useful":0,"cool":0},"YlZL6ujbpUjfO3L2SBDnHw":{"text":"Yes Yes Yes!!! \n\nThis was hands down the BEST meal I had during my recent visit to New Orl","useful":2,"cool":2},"fssx4sNjqS_QIsbQRtX1VA":{"text":"I've been here several times and this place is just consistently good.  I usually switch b","useful":0,"cool":0},"zJZrYejrek3gYkle2R_hVQ":{"text":"My best meal in New Orleans was unplanned.  Dante's Kitchen is a bit out of the way from t","useful":1,"cool":0},"ZiBuN9VNzqbPuQxkxcZZkw":{"text":"Absolutely stellar food! We tried the fried green tomatoes, spicy eggplant, chicken under ","useful":0,"cool":0},"VeOMEr_IIpYVXZ8gmlD2NQ":{"text":"Menu: Uninspired $$$ American (there were very few Creole/Cajun dishes) Some meat in some ","useful":1,"cool":0},"VASe2MTd8FSJ0jZWX4DG2A":{"text":"The Molasses Honey Spoonbread was DIVINE!!! I ordered the chicken cooked under a brick it ","useful":0,"cool":0},"8Q4btr4wLSPVWpnSTnvVRw":{"text":"I have been going to Dante's Kitchen for several years.  One thing I can say is that they ","useful":0,"cool":0},"um0ZtjgZazgSx3e4TRpTgQ":{"text":"Went for brunch, my first time in NOLA. Not very vegetarian friendly as much of NOLA seems","useful":1,"cool":0},"Frb4Y0yNiEkmH0W67qgMeg":{"text":"I haven't eaten here for dinner, though I really really wanna. The Fam and I typically go ","useful":0,"cool":0},"DAUBaDdQkfL7ujjzvJu87Q":{"text":"Dante's Kitchen would rank around a 3-4 star for yelp if it wasn't for bad service and bad","useful":1,"cool":0},"El1Fecv7PI8Nk6mEvnk05Q":{"text":"If you have a bad meal in New Orleans, it's your own damn fault.  For a killer brunch, thi","useful":1,"cool":1},"tqOsCURs4DsGFlae3fJqrg":{"text":"Wow, what happened to this restaurant? \nI went for brunch and my eggs were cold, the waitr","useful":1,"cool":0},"MU_LmEho7IVh2XMbeU7jJg":{"text":"I was a fan of the food, not a fan of the ambiance. The actual building itself is so cute,","useful":0,"cool":0},"G7mk-pPUh8WzNxQE6xebqQ":{"text":"FRESH FRESH FRESH and CREATIVE!!\nI had to have the waiter \"translate\" some of the Gourmet ","useful":0,"cool":0},"HvFLElErvT2LwAg-p8iu3A":{"text":"Similar to Jacques Imo's in price and quality.  Usually slightly less crowded and slightly","useful":0,"cool":0},"BDer3xb7qcrqUL8UIUGAPw":{"text":"Came here with a group of six while in town for New Years. Warning, as Philadelphians we a","useful":2,"cool":1},"RDn7iPy-Yel_AKU2h__cqA":{"text":"Came with a big group on Sunday (14 of us) and arrived before 10:30 for brunch (since they","useful":0,"cool":0},"tb8cALEbLMWrgpDh3_BAwA":{"text":"Pizza is good, it's quick, and they have a solid bathroom. Perfect place to stop at while ","useful":0,"cool":0},"y1jQAB01qNBuPCPJ-tzKgQ":{"text":"Why why why do I choose to overindulge on the spirits, get 5 hours of sleep, and then go t","useful":4,"cool":1},"YB8hMc0hQKg5ksuGCULfRg":{"text":"The most delicious meal I've had in a long, long time! Every dish was pure perfection. Bef","useful":1,"cool":1},"h45_Na_8HaRgz5cCLLvlmw":{"text":"You'll like it. Everyone does. I was surprised that they've been open for 10 years because","useful":2,"cool":1},"iY0rjcKSuJqgplc3Qw4oLA":{"text":"I sometimes get frustrated when traveling (especially to food meccas like NOLA) that there","useful":2,"cool":1},"0EdaZM_MaPEo2GRuapQT-w":{"text":"Up until now I had never had a disappointment at Dante's; it has always been one of my fav","useful":2,"cool":1},"GFWQZZgT47Z4Y6OJU0Z4Jg":{"text":"After I discovered this place on Yelp!, we thought it would be fun to try something new fo","useful":0,"cool":0},"BD6saEC9fMm4V5g8xjxy6g":{"text":"We lucked into this restaurant after discovering that the music we'd come for at the Maple","useful":1,"cool":0},"X7Ir3384WGtuXtzttUt96A":{"text":"This was my biggest disappointment of the trip.  It's a small restaurant in uptown that ju","useful":3,"cool":0},"pNftg89_rbSAc5CNOFZv-g":{"text":"Excellent little place for brunch in the Riverbend section of NOLA, located across the str","useful":1,"cool":0},"vkwpUoHrCU3fKl1uFCi2MA":{"text":"Wow. What a disappointing experience! We were so excited based on all the reviews, but had","useful":1,"cool":0},"X-EZPkGCMFRQK8eBpnAw8Q":{"text":"Bad news: No lunch!  Before Katrina I really enjoyed eating lunch here but after Katrina t","useful":1,"cool":1},"rlQZPlGIqHJXTe5wglcLww":{"text":"Food was wonderful and authentic creole.  Appetizers and entrees were just great.  Dessert","useful":0,"cool":0},"bH2fiW3Ji1b8o6OpVoKEwg":{"text":"I made a reservation for myself and the boyfriend a few days ahead of time. We arrived at ","useful":0,"cool":0},"Uq1VzpI8LWMgjkGS9Gi6Hw":{"text":"My husband and I had dinner with two other couples at Dante's last night, and we all enjoy","useful":3,"cool":2},"XAuqxJuseD_i5H-CulbO3w":{"text":"Delicious! Fresh baked everything. The biscuits were perfectly moist, just the right amoun","useful":3,"cool":0},"GQ7Wt_3PmrTExKJciWm6XA":{"text":"Dante's is by FAR the top fine dining spot for my husband and I, which is saying a lot bec","useful":2,"cool":3},"ozioQl0nCHJJpQHrezEP9g":{"text":"Quaint, cozy, and delicious.  I had the brick chicken, or something like that, and it myst","useful":0,"cool":0},"D9HDRHUrSl3QEjyF_OfpNw":{"text":"Dante's is another one of those fresh neighborhood restaurants. I love the concept of Dant","useful":2,"cool":2},"etX288r9jUPZ5mPXwkRqAg":{"text":"We go to Dante's regularly, probably twice a month and it was always great food with great","useful":0,"cool":0},"UrTrk1rkVFhYymo5SLbYqA":{"text":"I've had two amazing brunches here and would happily return. The first time, we arrived ju","useful":1,"cool":1},"LUydW1WtvMJVBh8lSSlxUQ":{"text":"It was six of us for brunch, and we all loved our food. I had the veggie omelette, which w","useful":2,"cool":0},"ktGgF6dn4JzXVDl1dOBypg":{"text":"Everything about this meal was perfect, from the pre-meal Sazarac (Modern, not Classic as ","useful":1,"cool":1},"WWya2jvYqrJjToox3lzwtA":{"text":"Fantastic. I'm a newbie when it comes to New Orleans cuisine but my local friends agreed b","useful":0,"cool":0},"mZbQdeDf0nYf6kUhXSGHLA":{"text":"For our last meal in NO we were going to go to Cooter Browns...closed for a private event;","useful":0,"cool":0},"121Qzv6j5n8zVN_xHOlRbw":{"text":"I went there for lunch and had shrimp and grits and a milk punch. Overall, nothing impress","useful":0,"cool":0},"qypxTPfry-sPidA7tPpvPQ":{"text":"I heard how great the brunch is at Dante's and I should specify that this review is for di","useful":0,"cool":0},"_wjN36vLS-de1DvIrP17Dw":{"text":"If your visit to New Orleans and exploration of the amazing food is limited to the French ","useful":0,"cool":0},"1D8BA4hi_Wrwdt_XxyN8EA":{"text":"We enjoyed a tasty meal at Dante's Kitchen but it's not worth a cab ride out of the French","useful":0,"cool":0},"ZO5tba89IDwGDG-d_OwtrA":{"text":"This was great experience! The food was delicious. Had several apps, with the shrimp and g","useful":3,"cool":1},"GP3mwa-3FdVVCGF7y_2rrw":{"text":"We went on Sunday for brunch and I took the advice of another reviewer and made sure we go","useful":2,"cool":1},"ED0fBRw3I04Okx3A9I_c_w":{"text":"YUM! I'd read reviews on yelp and decided this place needed to be added to the itinerary..","useful":0,"cool":0},"Ia1c9K7CnF3MtSKuGcFqqw":{"text":"This was a good meal.  Our service was truly outstanding, and the food was really good.  O","useful":4,"cool":1},"JPk-xkNynrvnibiKaQvLpw":{"text":"Dante's kitchen is simply awesome!  I had one of the best meals in a LONG time there.   Wh","useful":1,"cool":1},"yYoGaZXkhg_F-csJss9kUQ":{"text":"My dinner party group had a long, wonderful meal here in the back room. It was great for a","useful":3,"cool":1},"q0GZ0CyRU6pSrmTGM-CMBw":{"text":"I'm not really sure what all the hype is about. It was a good meal but I wouldn't go back ","useful":0,"cool":0},"dNYo555AAlE2oW0gNn5EfQ":{"text":"The best meal I had in New Orleans. Amazing place and can't miss if you love food. You rea","useful":0,"cool":0},"HtpJ9xo5l_-yaje8rkUd3Q":{"text":"We came here for brunch and cocktails. My god, it was the best meal of our entire New Orle","useful":2,"cool":0},"mYSdIjUL7ODcck_5HXwmQg":{"text":"We'd loved our dinner at Dante's.  We were visiting New Orleans from out of town and visit","useful":3,"cool":2},"5SjF1OlnoaP5rFXIN2E19g":{"text":"Holy OMG this place is amazing. I've eaten here two or three times, and I'd go back again,","useful":1,"cool":1},"z9_U2sAnz4FzQqv73Z84CQ":{"text":"Very disappointed by this place.  After seeing the great yelp reviews on this restaurant, ","useful":1,"cool":0},"MCvjpJUVZoMFV3JsEB89RA":{"text":"Best bone marrow I've ever had! It comes with the escargot, but it's amazing also! A must ","useful":0,"cool":0},"ZEqF6bok786BownUklM9Vg":{"text":"Loved the food. Unique and delicious. Service was great once we got a table, but had to wa","useful":1,"cool":1},"4806m1iYW5Z5VyE8RD3iJA":{"text":"Crazy expensive BUT perfect in every way. First they have an excellent selection of whine ","useful":0,"cool":0},"bo8hfd9DS1XQWhw7XFKY-w":{"text":"Dante's Kitchen has great food and good cocktails and would have gotten five stars from me","useful":0,"cool":1},"IhXKxyzyoCotUjM0YbAcYA":{"text":"Food and service was amazing! Tyler was genuine, knowledgable, and very attentive. The shr","useful":0,"cool":1},"_bK-UuDPb3RhLoNLEIAlkA":{"text":"As previous reviews have said, you absolutely can't go wrong with anything on the menu at ","useful":1,"cool":2},"3Y7YP9_xFGFpmLF9y_93MQ":{"text":"We read the reviews and expected more. From other reviews we were looking forward to the s","useful":0,"cool":0},"83oO6qlIEcmZKNVD8rlYxA":{"text":"visited dante's during jazz fest 2011. it's my favorite of all the restaurants i tried dur","useful":0,"cool":0},"6bh2FUmxtzcpEURRn4OL-w":{"text":"AND THE BRUNCH LIST JUST GOT LONGER! \n\nWhether you're looking for a fresh mimosa, a spicy ","useful":1,"cool":1},"QBUX-LjH9hCyfCPtMrpLdQ":{"text":"Very cute, semi secret location, mostly locals.  Very good- but this is Nawlin's ya'll, if","useful":1,"cool":1},"ZJSyF6KlSb-aMUfgGv_jYw":{"text":"We tried to go to Jaque Imo's but it was closed on Sunday.  Walked over to Dante's Kitchen","useful":0,"cool":0},"M16a8Scq-b5dARl3Xwjc6A":{"text":"Really good restaurant located in NOLA! We had dinner outside, the service was good and th","useful":0,"cool":0},"P3jXPBJKdYKrEuLpQCHz3w":{"text":"Love this place! We always try new restaurants in New Orleans and leave wishing we were at","useful":1,"cool":0},"JynMK0RYyaFAhAkVoVuPvw":{"text":"We have been to Dante's twice for dinner in the last month, and the word that sums up the ","useful":0,"cool":0},"7a4lAE9DJt4Mx0j2S2qF-g":{"text":"Great food.  Awesome atmosphere.  In an old house so the dining rooms are separate.  Very ","useful":0,"cool":0},"0-Q4HAg1Hz1rPXUjfUEkCA":{"text":"Order the vegetable plate. I know you think I am nuts but its one of the best things in th","useful":1,"cool":0},"8xL83LrEIzbUkEj8sEr50Q":{"text":"Yo. Go here. Wait however long it takes to get a seat. Have the shrimp and grits. ONE OF M","useful":0,"cool":0},"bUzQ7MJ3c1UZlqR4iD3aYg":{"text":"What a great little place for brunch.  The biscuits were amazing.  The Dante Omelet was gr","useful":5,"cool":2},"aTn-qvOVAOU1yHGpkMBMsA":{"text":"The filet mignons is really nice and wonderful. And it's my second time to come here.\nThe ","useful":0,"cool":0},"jLxcYqWnZbkSavHhL4k0cA":{"text":"This is definitely an older-taste restaurant. Under the kids menu, it says \"Pancakes\" but ","useful":0,"cool":0},"AsEgUDCLoHc-onFLSu_fOg":{"text":"5 for Service 3 1/2 for food. Our waiter Tiny made it an unforgettable experience for us e","useful":0,"cool":0},"oF0CxcVl3R5j2rdzsgYLVA":{"text":"Everything about Dante's is fresh & local - the food, the drinks, the staff and even the r","useful":0,"cool":0},"G7-SongIjU0Dn9BOwJiPTg":{"text":"If you want to experience the best bargain in town for fresh ingredients, hand crafted, fr","useful":0,"cool":0},"mF1JYqXo6I-_hUoKo94tOg":{"text":"Comfort food done right. This is what a lot of places in Houston wish they could be. Serio","useful":6,"cool":9},"OOBHTg0XNzVPFcOk9Z8fkA":{"text":"This place is in the same price and genre categories as Emeril's NOLA in the French Quarte","useful":2,"cool":0},"ObINzG3CzKrwcnQde2iIDQ":{"text":"4.5 stars!! Yummy food & comfortable environment. Next time I'm back in NO, I will for sur","useful":1,"cool":0},"C4vKaz8eS_nfP61n0YVuvQ":{"text":"I cannot remember when I ate better than on New Year's Eve at Dante's Kitchen in the Black","useful":3,"cool":2},"b8VzMX9efxC9Ft9G9Lbzuw":{"text":"Great restaurant off the beaten path with an emphasis on local, seasonal food and innovati","useful":0,"cool":1},"6aLpXQZOmY8vslreHKpbTQ":{"text":"A friend suggested this place for dinner and so we joined them there. I had the Chicken Un","useful":1,"cool":0},"6-yFYNVMHdgU-mD8U72NLQ":{"text":"This is a review *only* for brunch and Dante's Kitchen does brunch right! \n\nThere's someth","useful":16,"cool":14},"S8nXlo8UIDyXKpU_asJdXQ":{"text":"Wow. We found this place for Sunday brunch, got a table right away, and we were very pleas","useful":0,"cool":0},"lW2SAQqnyoM8UZqOMNuA7g":{"text":"I became and still am obsessed with this place!.. \n\nThis super colorful and hidden away re","useful":1,"cool":0},"5RPdaNGuiNHg2-K6YbtwKw":{"text":"This place is charming and utilizes locally harvested ingredients, which is always fun! Th","useful":0,"cool":0},"dslpM0yNg0Ppzwgj8fL0DQ":{"text":"I love this place because the food is great, service is exceptional, and the drinks are st","useful":0,"cool":1},"tlFPlO3Zaxx7vJ7J6MEjFg":{"text":"OH.MY.GOD.\n\nCan I just say, you'd think reading all these extremely positive reviews would","useful":7,"cool":1},"m-4L8iSSJMZokIuMpzTqxw":{"text":"This place is awesome!  Located in a, what use to be house, with friendly staff!  There ar","useful":1,"cool":1},"cSA9kmRNvOs6sLiMRx7ijQ":{"text":"We tried to eat the whole city, and Dante was one of our stops. We ordered some shrimp & g","useful":0,"cool":0},"WdWfkMoBoGiOTBOCPAmMIw":{"text":"Wow. This place has it all: knowledgeable  wait staff, locally grown food, delightful wine","useful":0,"cool":0},"otXy3h4AJkMeGvUal50-eQ":{"text":"I really enjoyed Dante's. Our server was very sweet and obvious has a lot of love for food","useful":0,"cool":0},"2vrRz-khUY2wPcxYEfEujg":{"text":"Excellent. There are no other words, well other than I had the best pork chop there that I","useful":0,"cool":0},"aDHBd7p3pd33E1NHG_nhCQ":{"text":"This really was the dinner that never ended.  I have to say that the food would probably b","useful":1,"cool":0},"zTZckLvkKG5FP0Po3MllFw":{"text":"Get the chicken under a brick. Seriously.\n\nBesides the fact that this place is a $25 cab r","useful":2,"cool":0},"Gt1RKHtFVaFUupIVonwX3A":{"text":"Yelp, you did not lead us astray!  We found this place a bit off the beaten-tourist track ","useful":1,"cool":2},"xHfucTgeyLQbPX-fkAEGhA":{"text":"The husband and I traveled to this gem because we knew we wanted a Sunday brunch while in ","useful":1,"cool":0},"nIXW_N1RfN9u35LXkDVVsQ":{"text":"We're never disappointed in Dante's.   It's one of our regular stops when we're in New Orl","useful":0,"cool":0},"X2wIGsnEaCVsmM-8pcrM8g":{"text":"Nothing too fancy, just very high quality food and drinks in a nice environment.  Know tha","useful":0,"cool":0},"lr70RrnqH84amZ6DVkV1hA":{"text":"Off the beaten path but SO WORTH IT!! Our server was fantastic, knowledgeable, and definit","useful":0,"cool":0},"TOTaeTwS7oObprakyUmSug":{"text":"First time and last time. When we first got there the service was great. About 15 minutes ","useful":0,"cool":1},"bPB788UbyLn1grJadhbwQQ":{"text":"The abmiance is nearly as good as the food.  The art and colorful walls of this very clean","useful":0,"cool":0},"-Gcozk8hHfTXyGFjcjPQfg":{"text":"Dante's is an easy five stars.\n\nNOLA is full of restaurants that claim to be the most auth","useful":0,"cool":0},"MgZ7pet8GR9YFVQsDJJkiA":{"text":"It had been a year or more since I'd been to Dante's Kitchen when I first reviewed it on Y","useful":17,"cool":9},"gdeoTspc6uPaDB76JRnwbw":{"text":"We stumbled on this small, out of the way gem after being put on a 2 hour wait list at ano","useful":0,"cool":0},"CVIXJlbQsikFI9XeElGe1g":{"text":"Stumbled on this place after finding out that Brigsten's was closed. Soooo glad we did as ","useful":1,"cool":0},"1Z-mWSSIAKggAbmuwn3tIQ":{"text":"One of my favorite restaurants in New Orleans. I've gone there many times for brunch or di","useful":0,"cool":0},"dvnzKKxRm_9OiSp-SBroDA":{"text":"One of the best meals we ever ate. We had their shrimp and grits, pumpkin soup, pot likka ","useful":2,"cool":0},"mK_YaF23P8DnKl6roM9cyw":{"text":"Food was great. I ordered the breakfast burrito. Meat inside was moist and lots of cheese!","useful":0,"cool":0},"8SGAWy3vOU35Wzpi602nFw":{"text":"Service:  Very attentive, friendly waiter. Food came relatively quickly and was served hot","useful":0,"cool":0},"0__F0ncrYwFd-QAxhUheTQ":{"text":"I've eaten here a couple times now, and I enjoyed the food, but am not a fan of the music ","useful":1,"cool":0},"AZSV_TXFTcxPqNvl9vGxhQ":{"text":"This place is amazing! The best meal I've had in ages. Do not miss the shrimp grits with r","useful":0,"cool":0},"lAz6b2HWQq0DKG6k8FQ0WA":{"text":"My first New Orleans meal and after four years a foodie in NOLA I still hold Dante's in a ","useful":0,"cool":0},"9m-QJRwJPX7_oTM9e7LpOQ":{"text":"My husband and I dined at Dante's one Friday night in November for the first time in a yea","useful":0,"cool":0},"lbjDoG7UCI6uD27RudvPuw":{"text":"Dante's Kitchen became a brunch staple for my friends and I this year.  It is close to our","useful":0,"cool":1},"9YtUT0ATjHb2ztl_GNWtVg":{"text":"The wife says that this was in her top five meals of all time. I don't have a memory to sp","useful":3,"cool":1},"mDPUMXeUPCBzxTopLCaJjA":{"text":"This was really great American food with thought put behind the recipe.   The atmosphere l","useful":0,"cool":0},"GWGe096Q9ebkBbaPiSi9vg":{"text":"Great Food, great flavors, I will go back. Is not a 5 Because of the amount of time it tak","useful":0,"cool":0},"oATscC2XHREgm2bQtHBwpQ":{"text":"Cute restaurant!!\n\nWe happened onto this place after reading several positive reviews on Y","useful":2,"cool":1},"19rhLmZWK9O8WsmC0fZ0bg":{"text":"Wonderful experience. Great atmosphere and terrific food.\nLong time New Orleanian and know","useful":2,"cool":0},"WNXZUClvhXJeYl85riJ1Kw":{"text":"Consistently great. Charming old house, simple but delicious menu, accommodating of Celiac","useful":0,"cool":0},"ekYiFb3cHFYsQteLz7rJWw":{"text":"Great brunch, get there early! Don't miss the bacon sticky buns and the grits are AMAZING.","useful":0,"cool":0},"fwxFLjTOKtqNnYGaBdwrng":{"text":"AMAZING, AMAZING, AMAZING. One of the best brunch spots in New Orleans! There is both indo","useful":0,"cool":0},"GTnPu0o1vwdbQp9ss5llCw":{"text":"This converted old house is home to a fantastic culinary experience. I came here for brunc","useful":3,"cool":4},"VGfa86S1sX6z9xDMbhdJiQ":{"text":"You MUST either begin or end your New Orleans visit at Dante's. You must. Opens at 1030 an","useful":0,"cool":0},"7YSR31qm9oT-UnYTw9yW5w":{"text":"My current favorite restaurant!  Emphasizes \"localvore\" items.  Delicious specialty cockta","useful":0,"cool":0},"6ESvWkpnoypJUWr0NfL7Qw":{"text":"We had high expectations of New Orleanean cuisine, and Dante's Kitchen exceeded them beyon","useful":0,"cool":0},"9cHeNNv-Q1KPOJnk3W67qA":{"text":"I thoroughly enjoyed myself. The order consisted of Salumi- Salame di Calabria, Saucissson","useful":1,"cool":2},"V_2d-O6pf9AJWGb9SVMJ_g":{"text":"Nice little place, good food, but I think the prices are too high for the casual ambience.","useful":0,"cool":0},"clK1g0vaH-KtpfhIU01eNg":{"text":"My favorite restaurant in New Orleans. Perfect brunch spot! I also love that they use loca","useful":0,"cool":0},"spWAKK2QF7z4JlHv-ZJvYg":{"text":"This was a great Brunch.  The grits and shrimp were delicious. The shrimp were so full of ","useful":3,"cool":2},"3CYWyH9X9-tjUSfXLAbgtw":{"text":"Whenever we go it is a different menu generated around what's in season. Very unique and w","useful":0,"cool":0},"K6ivaJaL8mUDEvCPZjJR3g":{"text":"It's been over a year and I still can recall the delicious taste of their Brioche French T","useful":0,"cool":1},"-nScTwapIhFEl0-8VLuY_w":{"text":"Yum! What a cozy, lovely little spot, far off the beaten path of NOLA. A 15+/- cab ride ou","useful":0,"cool":0},"545EYsU4qaWb25_aGgii0w":{"text":"I have been meaning to write a review for this place, but I forgot and was instantly remin","useful":6,"cool":6},"zJqtkewWYXuFLfzBpcL_KA":{"text":"Delicious, simple food. My friend and I both really enjoyed our meal, and Dante's got rave","useful":0,"cool":0},"F8-QF5sGGpoaC2LG41oRkw":{"text":"Great cocktails (many mixed with housemade liqueurs... that you can also taste as a \"fligh","useful":1,"cool":0},"4aT0L3dv3nYnr9EcF2zI2A":{"text":"Worth the wait. Very popular Sunday brunch, the best Bloody Mary (I had regular, extra spi","useful":2,"cool":0},"Vg2EohtQooSkaKvn8TzG5g":{"text":"Make sure you call before you try to come to this place. If they feel they aren't making e","useful":0,"cool":0},"k_0hB4yHBod92hkbOiI9iw":{"text":"Long story short- too small, portions were tiny especially considering the price. Wasn't i","useful":0,"cool":0},"USDhZGdgQT5LvddnnKpahg":{"text":"** 4.5 stars **\n\nAcross the street from wonderful Brigsten's in uptown NOLA, Dante's Kitch","useful":1,"cool":1},"FkMteZKwE_brJkN8l7EPxg":{"text":"Incredible service, food, bar. Best meal in years. Does not get better.","useful":0,"cool":0},"7fM_Kj-K7KZAjITauH2dKQ":{"text":"Went for brunch, wasn't impressed. The food was good, I ordered eggs benedict. I found it ","useful":0,"cool":0},"17rqalN_Xc2No5QIAXwt1w":{"text":"Complimentary warm corn bread served with melt butter is so good! It's the best corn bread","useful":0,"cool":0},"B7b3yDVbODtHqRko3muvIw":{"text":"the service, ambience, and the food were EXCEPTIONAL at dante's kitchen!! The red fish wit","useful":1,"cool":0},"Q0TYiCODp59PdyPkHanV0A":{"text":"Very good service and good. Strongly suggest some French food if you're in town. Very cozy","useful":0,"cool":0},"Dg7DrcE6McJNYADPVWhFEw":{"text":"Absolutely one of my favorite restaurants in New Orleans.  The food reminds me of Jacques-","useful":4,"cool":2},"m4Q6cr6XnEvHMs4QdlvTbw":{"text":"We ate here on a bachelorette party weekend in New Orleans over the summer. It was delicio","useful":1,"cool":0},"pdkfTMh1awcRDoB3B8GL6Q":{"text":"Five star all the way every time. Laid back atmosphere and delicious foods!! Cater to vege","useful":0,"cool":0},"CRCVu9D06TUnznLlc2IJbQ":{"text":"Great food.  Yes the Bar-b-que shrimp hands down wip  Pascal Manales.  Sorry they did not ","useful":0,"cool":0},"s7iAgfxEV8f9upeYfT0Ryw":{"text":"Started off Sunday brunch right with a house made Bloody Mary; my daughter had a Brandy mi","useful":0,"cool":0},"bGdOLfI3Lf70_M74WA9Lng":{"text":"Wildly popular with locals, Dante's Kitchen makes a very favorable impression -- their chi","useful":0,"cool":0},"zXsmA4XrdcbYai-OEUxMmg":{"text":"This is one of our neighborhood spots, how lucky are we! Dantes kitchen is in a cute littl","useful":0,"cool":0},"G4dYLzheFP6BfCyIeWe4Nw":{"text":"Good food. Delivered at a snails pace. Literally unreal. 45 minute wait between starters a","useful":0,"cool":0},"Gb8253tbp_8mLtKN69BIvQ":{"text":"This was a great find.  Like others, we were looking for a creole/cajun restaurant on a Su","useful":0,"cool":0},"IYtXyA8lIvYAqJKViZNWHA":{"text":"Service was good, most the food was good, but the lamb, the most expensive thing on the me","useful":0,"cool":0},"Qsg1nIe3vbtkhxP8662caw":{"text":"Went for brunch during Mardi Gras. Really tasty menu but the service was pretty poor.","useful":0,"cool":0},"Yj6gfBBp6GQwVmJ-7n-f7g":{"text":"I had an outstanding dinner at Dante's Kitchen to celebrate my graduation. The food was ex","useful":0,"cool":1},"lr8odWh1SXr38kFOEfGeDA":{"text":"Superb, superb, superb.  Local ingredients.  Seasonal.  I.e. what you get today may not be","useful":0,"cool":0},"OFlfLUHNg9jRQblih5jWeA":{"text":"I've had several wonderful meals at Dantes.  The local ingredient board on arrival sets th","useful":0,"cool":0},"Od5AzhFp7O25Ge8SMVF3Gw":{"text":"Simply put, one of the best meals I've ever had. Too bad my date and I could only get one ","useful":1,"cool":1},"-PjqbQLMKB4-R3hbN1d_kA":{"text":"The food and service was great ! I had the shrimp and grits and it was phenomenal! Also th","useful":0,"cool":0},"weLT8J3SccJZvgTEtHEI6Q":{"text":"One of our favorite brunch spots in NOLA. We had a party of 9 so there was a small wait. W","useful":0,"cool":0},"7uiIf8t6HN_bDmKQ3tztsg":{"text":"I had the chicken under a brick and it was extremely delicious. The cornbread pudding esqu","useful":2,"cool":0},"EGyw3ChdXn5bTVCUNnyOfw":{"text":"I've been to Dante's Kitchen before and thought it was wonderful but was really disappoint","useful":1,"cool":0},"V8ToqUESsmSjaGOl1qXZJg":{"text":"An excellent meal and excellent ambiance. I know its a destination restaurant, but it was ","useful":0,"cool":0},"F_gftNmJpOWboqOXbJJkeQ":{"text":"I do agree with the other reviews that the Molasses Spoon Bread is very good.  The shrimp ","useful":1,"cool":1},"rYkDC9p9I1SFE5CDyHhIjg":{"text":"Went for brunch and my meal was so good.  I had the corned beef hash which was great, but ","useful":1,"cool":0},"3RLcxG_a8TTmws6MXAG3Bg":{"text":"If you are looking to get out of the overly touristy areas of NOLA and see where some of t","useful":0,"cool":0},"5403hXCUi01DEsLO5VcAVA":{"text":"Intimately set inside an older home, this place is a gem.  My husband and I arrived 30 min","useful":0,"cool":0},"5fyMe55JTtiachFw4SA0Iw":{"text":"Atmosphere was very nice.  We sat outside on the patio and enjoyed it very much.  Food was","useful":0,"cool":0},"0WnPJL2O-5e-D0Xwjbzqfg":{"text":"One of my favorite places to go for brunch in New Orleans.   The eggs benedict over corned","useful":0,"cool":0},"_WWYRObq0nvW8CFIOv_WXQ":{"text":"I cannot say enough nice things about this place. The food was absolutely fantastic, proba","useful":0,"cool":0},"91VmaiNxO3AtbillFtIY-w":{"text":"Thank u yelp.   This is a find.  The place is in a resudential neighborhood an old house w","useful":1,"cool":0},"25Y1zcH29ZkK4WLrQUOXAQ":{"text":"Nothing more than exquisite.  It's an old style home. There are some unusual things on the","useful":0,"cool":0},"meye74hWK5ojR0kkEQx7DQ":{"text":"A friendly staff, home-like atmosphere, and sizable portions give this place popularity. I","useful":1,"cool":0},"r1I05B3D5tLHNsbvYgY2nA":{"text":"Yet another 5 star review for Dante's kitchen....We visited with friends from Chicago and ","useful":1,"cool":0},"ymqrDNwm4_dDRy7OlIAmPw":{"text":"I had dinner here last weekend.  We made reservation for 8:30, but didn't get seated until","useful":0,"cool":1},"6UsPT0YBPVa1lisDDS4WUA":{"text":"We had to ask what some of the cheeses on the menu were. They were great.\nWe had the beet ","useful":1,"cool":0},"v7EVi2TP3seoCP5Oli6R4A":{"text":"Service and food were fantastic! Everyone was a delight.. Our meals were made to order wit","useful":0,"cool":0},"yLTdnWRxr2QzOGOvYPbf7g":{"text":"Came here for brunch on a Sunday.  The place is small and located in the middle of nowhere","useful":3,"cool":2},"iao4WQqG7tp72M1RwW9VQg":{"text":"Dante's was probably my favorite restaurant in New Orleans. The shrimp and grits are insan","useful":4,"cool":3},"0NkRHp8jdQEwblUK5uno8g":{"text":"What happens when you slow-braise a pork butt steak for five hours? Exactly. \nThe food in ","useful":1,"cool":1},"OVuVYu4AnRmFDRgFMkuM4A":{"text":"One of my favorite places to eat in NOLA. This place is located in an old house that lets ","useful":0,"cool":0},"Je7fVngZqV_WOjGBCo5jWA":{"text":"Fun. Delicious. Homey. Vegetarian friendly. Amazing punch. Nice waiter. Very satisfying. B","useful":0,"cool":0},"mvG3DKOYOT0Zzr1BSRg0tA":{"text":"Unbelievable service. I went for dinner for two and had one of the best dinners of my life","useful":0,"cool":0},"BZ47vbuXBhdBh5kEBpGEwg":{"text":"Everyone goes on about the dinners, but there's more to this menu of 100% foodly perfectio","useful":2,"cool":3},"YZw4r9pyubYXWTpmN2bKVA":{"text":"A vegetarian dish that doesn't taste like a menu after thought?!?! The bubbly and beer was","useful":0,"cool":0},"Xi80Rblj-e6RH2vlBWt-GQ":{"text":"I've eaten here a few times already but its been more than a year since my last vist.  Its","useful":2,"cool":0},"Pb6tjX36PVasIi6FFWualQ":{"text":"I went to Dante's Kitchen with an open mind. I don't tend to try venison, turtle, escargo ","useful":0,"cool":0},"1nL8HWmVvONa-EhT_siPGA":{"text":"This is a nice brunch spot. It's a cute little restaurant in uptown with a pretty garden a","useful":0,"cool":0},"f6MD3a02Gk6FpMedqEfsaA":{"text":"I go for the sunday brunch! It is soooo good and very fresh. The service is a little spott","useful":1,"cool":1},"Ku36Wg3Lzryh3TMS7NXIfw":{"text":"This was my favorite meal during a 4-day stay in New Orleans.\nIt's a bit of a trip - about","useful":0,"cool":0},"8TJXjRmHTWwPaRTqBAkp8A":{"text":"Saturday evening, 6:00 out on the patio. Dinner for two \n\nPatio is nice, cozy. There were ","useful":3,"cool":1},"fAYYVboqDN37dhKrG2qAtg":{"text":"One of our top meals in New Orleans. If you're thinking about Brigstens next door skip it ","useful":0,"cool":0},"ug89qoMeOzOXg3wTQOsUeA":{"text":"I was in New Orleans for a conference and needed a reservation on short notice to take cli","useful":0,"cool":0},"-ggSVOEOuxK6jm8moagR8A":{"text":"It was my job to plan a great dining experience for my party of 6 while in New Orleans for","useful":0,"cool":0},"L85La6qHYNEqwym4uPsSfw":{"text":"The food was amazing and the service was even better! Went here for brunch and our server ","useful":0,"cool":0},"c9LE1IMeiMlWzaC_Vwrxnw":{"text":"The food is somewhat very salty to my taste but it was still good.\nThe servers were friend","useful":0,"cool":0},"K8kGBV8ht5hapapf5XOflA":{"text":"This restaurant was amazing. I ended up here after being turned away from Commander's Pala","useful":1,"cool":0},"fEVHfXsR2wMTvPcSh2J7nQ":{"text":"I cannot comment on the food because the reception we received was so cold and off putting","useful":0,"cool":0},"ZbVeOCGGkuPrTU_4xRn5qw":{"text":"Finally went to Dante's Kitchen after hearing lots of rave reviews. Upon arrival, the atmo","useful":2,"cool":0},"rpPEyVvv4GxLY4UM5otlRA":{"text":"I have been eating there for years.   Even though it is a simple dish the redfish on e hal","useful":0,"cool":0},"BwmHlmpnWQLx0LOya7Bc_w":{"text":"Man, I really hate to give this place a bad review.  It showed so much promise based on th","useful":3,"cool":1},"3p0cGuK1eSNYgDTNlyKWew":{"text":"Oh man...I LOVE this place! I'd been there about 5 years ago and with all the places in NO","useful":2,"cool":2},"BbUCUXV4ygu_DbJz-avBEA":{"text":"Fabulous cocktails. Excellent breakfast...from the biscuits to the bread pudding french to","useful":1,"cool":1},"Z3o3WQVVZ4hrF_ZLlCYP6Q":{"text":"Super excellent tasty food enjoyed at a great table outside so just a bit of a shame about","useful":0,"cool":0},"qgcNBLsgqUD196MUwNM-1w":{"text":"A magical dining experience. One of the very best meals I've ever had. We started with the","useful":0,"cool":1},"c4VN1UFiYGAsLObHJDUgJA":{"text":"Best New Orleans meal I've had. Authentic cuisine and great atmosphere. Was recommended by","useful":0,"cool":0},"8tOp7fKO9zuLoAfFV2SEuw":{"text":"Dante's Kitchen was a wonderful experience!  It is further out if you are staying in the f","useful":0,"cool":0},"LZKuIy6KsatPZVNz6t3Atw":{"text":"The atmosphere was hippy homey.    90%was organic and locally sourced which is a plus.    ","useful":0,"cool":0},"10Xvu3vvGvJ94q2PMNbnXg":{"text":"We ended up here for brunch because I wanted to get out of the French Quarter. As we walke","useful":0,"cool":0},"XvJPgctx-4ftECmfE-WYKg":{"text":"WOW.  \n\nWhen visiting my brother in New Orleans he took my husband and I here along with h","useful":2,"cool":1},"ty6VNqrqKxI3P2sRLGdg5g":{"text":"This is my absolute favorite brunch place in the world !!! Was introduced to the place in ","useful":0,"cool":0},"66pVgA0A-O3R1ib8JQ1GcQ":{"text":"I'd actually give it a 4.5 if I could.  A smaller restaurant with a great ambiance.  Seems","useful":2,"cool":0},"Xq0feV3KFSFETeAi280OeQ":{"text":"I've been going to Dante's Kitchen about once a year for 15 years--birthdays, Valentine's,","useful":1,"cool":1},"ljjrRm491_LpRWCIVlseSg":{"text":"My dining partners and I had the cheese board, the escargot, amberjack, duck breast and tr","useful":0,"cool":0},"Xl1YovcXF4VWSEKdYtyyqg":{"text":"Seriuosly, the absolute best meal I've had in the city, if not my life! The chicken under ","useful":0,"cool":0},"amlr0tcd10pmjPBz-1ab9Q":{"text":"We stumbled upon Dante's Kitchen on accident. We tried to eat at Jacques Imos, but they we","useful":2,"cool":0},"Ocym9MW6SVsek07vqqjTjw":{"text":"We went on a Sunday afternoon and had to wait about 20 mins. Once we got inside, took abou","useful":0,"cool":0},"hOFrGcGNxYVjFXDyHi3U8A":{"text":"We had brunch here this past Sunday and it was incredible. We started off with the bacon s","useful":0,"cool":0},"oxzQ3MOwtUDeuQSwsSLq_Q":{"text":"Decent food. Crap service. It was Mother's Day and we had our child with us and they treat","useful":3,"cool":0},"WgPw8PmHNmrT48n6EyeAdw":{"text":"During my last night for the month of March, BF and I had our nice little date night at Da","useful":3,"cool":0},"nAvfYwaKC2nGffB_XAAmGQ":{"text":"I had been wanting to try this place for years and finally made it there. From start to fi","useful":2,"cool":2},"7VVY7UQx2pPOwL3DXx9I5A":{"text":"Unlike many restaurants, Dante's is consistently excellent.  I've never had an \"off\" meal ","useful":1,"cool":1},"jQGADsjEQoPwp_B6DntK8g":{"text":"We were walking the area trying to find a place to eat some authentic food while in the Ne","useful":0,"cool":0},"9ietYrBxysZFBjmGht-mgA":{"text":"Great atmosphere! Very cozy makes you feel like your in someone's kitchen. I ordered the T","useful":2,"cool":3},"w6HW_qimzfFP_5YPhP1yXw":{"text":"Dante's Kitchen has an amazing menu.  It  is my favorite kind-of menu these days filled wi","useful":1,"cool":0},"Pg_CiPVYQhshKnsF---_Jw":{"text":"Fantastic seafood, and solid bar (with house -made liquor). Highly recommended.","useful":0,"cool":0},"JirodVDRMDo-7vw7y8Oc5A":{"text":"Had a great brunch here a couple months ago. Really chill and casual but the food was outs","useful":0,"cool":0},"AWjWH5wrzOSIALOvw19G7A":{"text":"I have to tell you I would give them a 4.5 if I could.  I'm very stingy with my stars, but","useful":0,"cool":0},"2L5hvPhHeAh5N0JAHd0zSA":{"text":"Dante's is fabulous! \nI've been here three times and everything I ate was absolutely delic","useful":1,"cool":0},"p4P-L6tW1NrjHA2xxJgRsQ":{"text":"LOVED THIS PLACE! \nIt's very cute and cozy, candle lit spaces. The food was wonderful. The","useful":0,"cool":0},"lJkXrtx1Zlax06pvW0pumg":{"text":"This the most amazing place that I been to, to date in New Orleans for brunch... Out of th","useful":0,"cool":2},"XG9U4Ar_oDB2Cxk7LGK1mg":{"text":"This was my second favorite restaurant in New Orleans (commanders was first). The outdoor ","useful":1,"cool":0},"GEP1wjG1qp0k2anMohHhCg":{"text":"Went in December for the third time. Always an amazing experience! Wonderful food, drinks,","useful":0,"cool":0},"y2xiX5msasxXQ0_UAOslRQ":{"text":"The enjoyment triangle--factors that surround the enjoyment of good food--include 1) Servi","useful":1,"cool":1},"4hccR3uj8KZGY3V5oI3Xqw":{"text":"Brunch menu was very heavy--no light options. I have heard good things, so we decided to t","useful":0,"cool":0},"qZ8Sfovkn_8ubV0leQPC5Q":{"text":"My birthday brunch at Dante's Kitchen was absolutely one of the highlights of my trip to N","useful":1,"cool":1},"-7wYzNjaNEXkt9bIpl7SlQ":{"text":"I took my family here for mother's day and we thoroughly enjoyed our first Dante's experie","useful":2,"cool":1},"EqMs-dcpq54tJDKrQ3b6Ag":{"text":"A fabulous meal. We had the escargot with bone marrow and seafood pot as a starter. Both w","useful":1,"cool":0},"_iZEb9sTTqw0C2oWuFRHJw":{"text":"Dante's Kitchen was our first dinner out in New Orleans on our recent visit. Four of us we","useful":0,"cool":0},"-cyRXHl0lfq8Cm7mqKD6YQ":{"text":"We went expecting traditional New Orleans creole cooking.  This is more of a hipster joint","useful":0,"cool":0},"A2TRDuV8HBRU2CyJztWcdw":{"text":"I save Dante's Kitchen for special occasions due to the prices. When I do go, though, I lo","useful":0,"cool":0},"izkswIrT0yGry_dLMDbycw":{"text":"I was down for Jazz Fest last year. I wanted southern food and this Boston boy got his dos","useful":0,"cool":0},"5c50b-p7doOC_DDVsOEfOw":{"text":"Delicious food, friendly service and great atmosphere!!  They have a good selection of sma","useful":0,"cool":0},"q6HCMhJwNs984iaN20R7kQ":{"text":"Absolutely love this place. I came for dinner and had the chicken under a brick and my mom","useful":1,"cool":0},"wopuUoKUSevxDS7S6naD1A":{"text":"The food was ok. Not the best. Very small portions for a lot of money. We were still hungr","useful":0,"cool":0},"4bah7jvgkGfT4BrNv1E-fQ":{"text":"Worth the trip! Starting with the molasses hot bread and butter, you will love the flavors","useful":0,"cool":0},"8zkyhLqXCIq7s96_RUj1yg":{"text":"My boyfriend and I came here for restaurant week and we will be back to try more of their ","useful":0,"cool":0},"LAlBwgsyBMYU1KVTomXi9g":{"text":"Very inovative menu and delicious food. They have a pretty good wine list too! One of my f","useful":1,"cool":1},"dVk4B46wf48svtxmneoRpg":{"text":"I LOVE this place.  I have a friend with a house Uptown, and thanks to him I have gotten t","useful":1,"cool":0},"fE3tpzqTNOykH--dkvizwQ":{"text":"I would move to New Orleans in a heartbeat if I could find an income that could support me","useful":0,"cool":0},"TWszM0dsN2Te53QQS7H9eQ":{"text":"This was supposed to be Dante's Kitchen, but was instead a popup called sasafras. Everyone","useful":0,"cool":0},"pIsUKgiU5-1nyBvITEZqjA":{"text":"Really let down on the Bloody Mary.  Ordered a \"spicy\" & a \"hottie\" both were okay at best","useful":0,"cool":0},"q77N9HGCML47xE_0mv0ppQ":{"text":"My wife and I are no strangers to New Orleans restaurants. We believe in the \"star deflati","useful":0,"cool":0},"-YH-iyiMeWb7rKcwAGqUFw":{"text":"I love Dante's. \n\nI've been here for both brunch and dinner many times and have never been","useful":0,"cool":0},"KMto-BggpoNqjbdzM4H77g":{"text":"Good food and service. There were some very interesting looking fruit infused home made co","useful":0,"cool":0},"TNeHyfGl64Y55Z6yTfZQkA":{"text":"I gave Dantes a one star rating based on the cost, flavor of the food and portion size. We","useful":0,"cool":0},"XGzb4wjm_V9C-_Cb8i-q5w":{"text":"Quaint setting, challenging parking, good service, clean. Now, the food. Best shrimp and g","useful":0,"cool":0},"dWFND0Dilrt3T-xatJQjKw":{"text":"Excellent brunch!  House made biscuits and preserves are better than my grandma's, nearly ","useful":1,"cool":0},"1iXHhyZ7h44tZwZjMTKkmg":{"text":"i ordered the seafood dish (mahi mahi was the fish selection that night), and i wanted to ","useful":2,"cool":1},"ZStMWyd6eAXm0hIp5S4V7A":{"text":"This restaurant and Commander's Palace are my top two favorite restaurants in NOLA!","useful":0,"cool":0},"eghApf_MfKg7ZsdWn_Anew":{"text":"I want Dante's to be my last meal on earth. \n\nWe were searching for a nice place to eat on","useful":1,"cool":0},"hvZ7CzVcP26bADuPbSsb9w":{"text":"Simply fantastic food, served in a casual atmosphere.  Just go, and get ready for some ser","useful":0,"cool":0},"CkodJpp_hYI1HgLHKV-zCw":{"text":"Easily one of my favorite brunch spots in the city!  Be prepared to wait if you come for b","useful":0,"cool":0},"cdTr2163mGwvkTSuamKEpg":{"text":"My brunch experiences here have been insanely positive, but dinner has been quite a bust t","useful":2,"cool":0},"IwBu4zcuZTqv8JJWlMUQnQ":{"text":"EXCELLENT. Best food in New Orleans! Escargots were amazing. Don't leave without trying on","useful":2,"cool":2},"c6J7Efid3kz0SUpcT5G7_Q":{"text":"oh so goood. I started off with a strawberry mojito -- heaven. Apps were better than the e","useful":1,"cool":0},"Wv6A9YH0lh-kKhU2l3ksXQ":{"text":"Not cheap but at least the food was good. MY wife loved her crab and corn soup. I had a go","useful":0,"cool":0},"fA4hcHSQzv53ABLZzqaOoQ":{"text":"The best place I ate during my stay in New Orleans. Definitley make reservations since it'","useful":4,"cool":3},"QtEFCpukaPc76Ziti08JJQ":{"text":"Very good meal. The wedge salad is a must. Corn and crab soup also very good. I could have","useful":0,"cool":0},"j0RwzdL8-Ak1f2lQFbmnaA":{"text":"This food is practically crack!  I wouldn't be surprised to find someone blowing the chef ","useful":2,"cool":3},"mfRUbADW1aJ9246oanW0aQ":{"text":"Ok with potential to be better.  Shrimp and grits: room temperature grits.  Shrimp were ta","useful":0,"cool":0},"nJX8qs8xVrv4pKG59mCQRA":{"text":"Some of the best shrimp and grits I have had in the city.  A staple brunch option but get ","useful":6,"cool":3},"QF8UDWkdJ70omRlmSBbtkQ":{"text":"Food was good, not great. Atmosphere was fantastic (we ate on the patio). Service was grea","useful":0,"cool":0},"eq1NJIXiy14eDCU_Kap1uQ":{"text":"Took my parents here during their visit to the city, and we were not disappointed!  After ","useful":0,"cool":0},"RCvxgFMLjWRpY_6uHaW77A":{"text":"Dante's was recommended by a local friend and it was not disappointing! For a drink I trie","useful":0,"cool":0},"VAnomfhjP7ClhugYN5DBLA":{"text":"Definitely in my top 5 favorite restaurants in New Orleans. I came here on a Saturday nigh","useful":0,"cool":0},"Rb03mekYXCKiTCc5MQ_jmw":{"text":"I came there because of the reviews and The chicken under a brick. OMG some of the best ch","useful":0,"cool":0},"jviVFwNPSPEfz6g5nTRT8w":{"text":"We came here to celebrate my son's graduation from Tulane.   This was a great way to celeb","useful":1,"cool":1},"Ax9QehwqBMZZ5oQagjx5RQ":{"text":"Friendly faces, wonderful food.  We had brunch, I had the debris on the biscuit with the p","useful":0,"cool":1},"OPEg-jcxD2gTagKxt8ld_A":{"text":"OMG! the mimosas...the mocha & cranberry breads...AMAZING!! The shrimp & grits dish had gr","useful":1,"cool":0},"uigqjK9uVsuTl09kKM6o1A":{"text":"Updated: \nWe've now had brunch at Dante's several times. It's still my favorite brunch in ","useful":0,"cool":0},"AdqikWS2iRiHdukAomg7gQ":{"text":"Very conflicted writing this review because I visited this spot two years ago and the food","useful":1,"cool":0},"9OUcA1Vmh7PvYnzs8oY_6A":{"text":"Delicious! The veggie omelet had the freshest vegetables ever, and steak and eggs were coo","useful":0,"cool":0},"jTs3GFdL7B62OlSkBSIkCQ":{"text":"Food 5/5\n\nI absolutely love this place.  Dinner was so good.  Next time I am in New Orlean","useful":0,"cool":1},"VGh5IyxQRxGMNYw0wKi5Zg":{"text":"Went to this place on Mother's Day and it was awesome... they offer so many unique choices","useful":0,"cool":0},"93A62iQ1MxMr4uHv90cdDg":{"text":"One of my favorites. \nShrimp n' grits are amazing, as well as the spoon bread. \n\nIn genera","useful":1,"cool":0},"rTf8M6IPYvm_a-qBn5K8Iw":{"text":"Went with a somewhat rowdy crowd of 14 for our bachelor/bachelorette weekend bash, and had","useful":0,"cool":0},"dckGx5midkebmIYgk3lOLg":{"text":"We were greeted and seated immediately. Our tall bearded waiter was kind of a jerk. Barely","useful":0,"cool":0},"CRn-BJ8pm8tGpP8lgXfphg":{"text":"I was pleasantly surprised... well not totally surprised, given all the great comments and","useful":0,"cool":0},"lnA9qISJnZMjBds9V-8yqw":{"text":"Overall, a pretty solid hit and I would definitely return to Dante's Kitchen on a future t","useful":3,"cool":0},"30DQf-vOngHKETIS7li4CA":{"text":"Amazing brunch! The shrimp and grits are so good! Highly suggest getting a Spicy Mary if B","useful":0,"cool":0},"iRBQ3WKnyqtZAHbtdQ826A":{"text":"This place is amazing!  It is in an old shotgun house which gives it such a nice homey fee","useful":0,"cool":0},"XaHwxjgVoIK62LBrAk83mg":{"text":"I've only been here for the Sunday brunch, but let me tell you, it was the best brunch I'v","useful":1,"cool":1},"cRK5E46lqCdQ14Y3WeT0nw":{"text":"The most amazing brunch I have ever had, anywhere! 90% of the ingredients are organic and ","useful":1,"cool":2},"a6xkcA5YDk5IcF8-id4W7Q":{"text":"As I mentioned earlier when reviewing Clancy's - I love a restaurant where I can find park","useful":1,"cool":0},"rX9VIDMmXKI3WuL4pimMWQ":{"text":"They were close here. We first went to Dooky Chase's. Closed. Then all the way over the Ja","useful":1,"cool":0},"AjwgOhFjCysN_6qTkbRRCA":{"text":"Amazing, amazing, amazing.\n\nVisiting New Orleans and looking for good food (i.e. not in th","useful":0,"cool":1},"TQzQb4YHEGMdY0ZgZ51Zjg":{"text":"One of the best Sunday brunches I have ever had. Was a bit crowded when we arrived so had ","useful":0,"cool":0},"gWVyEd6PrMdgKaFnTMvxoQ":{"text":"In A Word: Excellent!  We went for brunch! Best poached eggs I ever had!  Service was outs","useful":0,"cool":1},"d59YtgOzDpmFfyAfRzlXZA":{"text":"Super nice.  Funky little house on a corner lot, converted to a restaurant.  Service was c","useful":0,"cool":0},"wpf0laSKvJzzH-mzKEUaCA":{"text":"Sunday brunch here is absolutely amazing. \n\nWhen ordering, we were faced with the unique p","useful":0,"cool":0},"XQMEhFqrU00WivEJA7NQuw":{"text":"Absolutely delicious, we tried 4 or 5 different dishes and everything was perfect. We love","useful":0,"cool":0},"RMbzBAF-IceyRhb6iZqigQ":{"text":"Cool neighborhood spot. Interesting and fresh menu without taking itself too seriously. Th","useful":0,"cool":0},"kA4Zq24K1BoFG0MppVwWaw":{"text":"So, in case you haven't heard, Bacon Cinnamon Rolls are a thing, and they live at Dante's.","useful":1,"cool":1},"YTScboGdH9CVYg9lGi3_Yg":{"text":"Nominated pastry chef-menu disappoints.\n\nAs other reviews found, the Shrimp and Grits was ","useful":1,"cool":1},"Ldqsb3Y1hsw5SRliuKZIJQ":{"text":"Wonderful!  The food and the service were excellent. We will return. I recommend the Chick","useful":0,"cool":0},"wB9L5PlHuuYXt8zFmjzprQ":{"text":"DANG!!! NOW THAT'S WHAT I'M TALKING ABOUT!! ohhh soooo good!!! took my honey out here for ","useful":6,"cool":7},"rygjKJns9CI8OKwhqeCQrA":{"text":"After some debate and scrolling around on the Yelp app on our phones we found ourselves at","useful":2,"cool":1},"oUMdQMgkRJvVEHkW96kHRg":{"text":"The restaurant is in a home which makes it cozy and inviting.  The food was fantastic!  I ","useful":0,"cool":0},"-bwbhqxtiPTkxc_pOfJWGg":{"text":"I have to give this restaurant 1 star because the entree I ordered was terrible.  The redf","useful":0,"cool":0},"c0Izs655ASsVXMIoh2RrHA":{"text":"5 stars for food, 2 stars for service. \n\nHad a reservation for this past Friday night with","useful":1,"cool":0},"P_YUA2nkc3mtZlzox_TvNg":{"text":"Easily a five star review! Off the beaten path, worth the schlep to get there... sitting o","useful":1,"cool":3},"xutaFG-sU6vOZ6DjFcC9FQ":{"text":"Dante's is an excellent restaurant. Our family for years has enjoyed the dinner menu and a","useful":0,"cool":0},"8lp9zj2juvFlMnP0cjAJ_g":{"text":"I was just in New Orleans for a conference and someone in our group suggested we go here a","useful":0,"cool":0},"16vCRgi2gCmieKfgMpyOGg":{"text":"Loved it for dinner - scallops were great and so was dessert!\n\nBrunch made me a little les","useful":0,"cool":0},"FxHPLRJS2vRMUm7Sfz1xCQ":{"text":"appetizer I tried the escargots, which is inside a bone, with bone marrow., very delicious","useful":0,"cool":1},"WMFwuLFdnH63sWtq2MyMmw":{"text":"Five Star all the way!  We arrived after 8:00 P.M. on a Friday night, and were seated imme","useful":0,"cool":0},"30X26rKxtllnRsWAhETIfw":{"text":"Great service.  Amazing food especially the chicken and rabbit stew.  Nice quaint atmosphe","useful":0,"cool":0},"6iBUm44DvMsM3RGtnOLsdA":{"text":"New Orleans is unique in that restaurants that would be stellar in most cities come off as","useful":0,"cool":0},"DC7QLs4bmKyps4Nk81V7FQ":{"text":"What a great place. They handily accommodated our large group in a separate room, so we ne","useful":0,"cool":0},"hb3vdvi0qWJ9AzMoIwVcRg":{"text":"Ended up here b/c Jacque Imo's was closed.  It is very cozy and trendy.  The menu changes ","useful":2,"cool":1},"l2Xp29MQY-vUCNMeRfaVgw":{"text":"Biscuits were good. Service was garbage. Food came out lukewarm, as did the coffee. Crab o","useful":1,"cool":0},"ZLY0oJYPbfZo5VgJB5_5DQ":{"text":"From the very first moment I laid eyes on this place I knew I could be in trouble.  Friend","useful":2,"cool":1},"oTBp_5CCBxB5_x3UmmWsTw":{"text":"Dante's is tucked away in an overgrown building that resembles a home. We actually walked ","useful":0,"cool":0},"OSp86IyHciluh-qPy7y8zw":{"text":"Another place that is not near the hustle and bustle that most stick to while visiting NOL","useful":5,"cool":3},"wC74mOotWqN4UIb4zqUb5w":{"text":"Hands down, the best restaurant inNew Orleans. We live to eat, and this city surely provid","useful":1,"cool":0},"Iz_CTzl8KAGcXK0iaybv1w":{"text":"My parents took me here for my birthday dinner on a Saturday night. The Riverbend location","useful":1,"cool":1},"rRRuwYjSJRfqAIuGOVY6Og":{"text":"Cute little place in the quiet side of town that was prefect for brunch!  It was recommend","useful":0,"cool":0},"1KXD6ItY_2QxTE-cAU_v4g":{"text":"Excellent.  Been here several times for both dinner and brunch.  Highly recommend the brun","useful":0,"cool":0},"oyQLT6x9Z9uABHupxyunlQ":{"text":"One of the worst dining experiences we have had in New Orleans. The hostess/owner is robot","useful":0,"cool":0},"CrbjMhH89FxkNMbdzDfyhQ":{"text":"I was on a Bachelor party with 15 friends last year and for our BIG meal we left the Cryst","useful":2,"cool":0},"4DWNHP4DGlxyLpC02FBZ0w":{"text":"Hands down, the Trois Mignons has to be the best dish anywhere for a carnivore. Three file","useful":7,"cool":4},"c5iReDQyYebQtGPEsDbkiA":{"text":"We made a reservation for dinner, and was seated within 5 minutes. Service is super slow. ","useful":0,"cool":0},"xaULirVxaMqssL_zf1OPiQ":{"text":"My friends and I came out here for brunch and we were seated outside in the horrible humid","useful":1,"cool":1},"wCNcrF1N3nQxxPgjDXOcFw":{"text":"My husband and I had dinner here a couple years ago and have been looking for the opportun","useful":0,"cool":0},"_g_DxsSilyls_L4ljOIfNg":{"text":"Arrived at 10am for a Sunday brunch....had time specific plans for the afternoon and didn'","useful":0,"cool":0},"aGtssHEbDxrzZdoXpqh_4Q":{"text":"One of the best New Orleans restaurants! It's located in the uptown area - not in the tour","useful":2,"cool":3},"JDH0Bvx7YNCfT48aHd9FOw":{"text":"The best place I have visited during my stay. We went to many restaurants during our stay ","useful":1,"cool":0},"521kw_APB2AuvxjvBWVWgw":{"text":"Dante's was great as always! We were seated a little late (which was a bigger deal for my ","useful":0,"cool":0},"JL2qstPF1kpt1IL9vppxDw":{"text":"I am incredibly confused by my experience here last night. I had heard good things about t","useful":2,"cool":0},"spGR45JISqX2FPLWJQBz-w":{"text":"This has been one of my favorite places to get a well constructed and beautifully executed","useful":0,"cool":0},"yqO8ZbQ--bDnHctFIvf96Q":{"text":"Dang..! This place is good. The pork was some of the best I've ever had. \nEveryone's dish ","useful":3,"cool":3},"HQSGDC_GIJZ_gwQO7v8lUQ":{"text":"THE BEST RESTAURANT IN NEW ORLEANS !!\nyou must try the chicken roasted under a brick and t","useful":1,"cool":0},"qrPlSjhCgFOWW5HWrCcoGg":{"text":"It's a little far out from the French Quarter, if you're there visiting, but totally worth","useful":2,"cool":1},"mY8YAGabPOSV0I2HzVSBSA":{"text":"Pretty good food, lovely and friendly hostess. Our server was the worst. He made the exper","useful":0,"cool":0},"QQa6fOw-jRAJ49uSnGJGfA":{"text":"UPDATE\n\nTook my mother the Dante's Kitchen after raving about it so much. She ordered the ","useful":0,"cool":0},"0oMcH3XoEWXIHlkxWqrrdA":{"text":"Neat little place with attentive, if not slightly hurried service.  Reasonably priced wine","useful":0,"cool":0},"VXSTT5Ks0wRi100kU4t9rg":{"text":"Good food and fantastic service.\n\nHad a friend who got sick from cab ride and staff was so","useful":0,"cool":0},"XS6iIspc9Jtv1hqQGL5itA":{"text":"It's seems so rare that I am surprised by restaurants in New Orleans anymore.  So imagine ","useful":2,"cool":3},"N81cB-vbcbqbarIQueq6MA":{"text":"This is a great little restaurant, the atmosphere reminds me a lot of places in Austin.  T","useful":0,"cool":0},"dBRczVPjdIqXzjqPlk7YWw":{"text":"Ambiance is great, went out of my way to come here on many recommendations. Ended up here ","useful":0,"cool":0},"u7zKe5kAvySU25I3z6HuEg":{"text":"The food and service is always excellent.  I've had much of what's on the menu and it's al","useful":0,"cool":0},"r5Pypc3_0Vg0XEuQy65COg":{"text":"I had heard such great things about this place, but I was not impressed. Good food but not","useful":0,"cool":0},"oOpMuDz3NzJHL04dewNchQ":{"text":"If you plan to eat out...  Eat here!!!!  This place is amazing.  The cocktails are all uni","useful":1,"cool":0},"k7l4h-dk6QYs2LZmJwq6HQ":{"text":"Terrific little neighborhood gem! I love this place!! I've probably been there 20 times or","useful":2,"cool":1},"qI4ZZcjVizx-5sS-cvrTkA":{"text":"Let me start out by saying that the ambiance and service at this place was simply amazing.","useful":0,"cool":0},"XE1Hg2ehDq2Ldoi-jCsFkw":{"text":"Excellent. Way off the beaten path...you'll need a car or a taxi to get there if you're st","useful":0,"cool":0},"_MSyNWBBLq3W5E86KZNlcA":{"text":"not feeling the hype..i would expect better reviews from my fellow n'awlinians... \nthe com","useful":2,"cool":2},"_8KQ1g5BMFzzEsLTpyRXYg":{"text":"I LOVE this place for brunch. WE go often. But you must show up at like 10:50am on Sunday ","useful":0,"cool":0},"mHDRm3SpV9vdYGKnXkMyrw":{"text":"This is exactly the kind of place I wanted to go while in town this year. Insanely creativ","useful":5,"cool":3},"HxSlsGnSWzNrZAb01RdViw":{"text":"Hell yeah, this place is classy and the food is stunning. Tinkling creole piano tunes. Sun","useful":2,"cool":2},"fM8-zQ3yipvhL1HCMMy-eA":{"text":"I have eaten here many times and the most recent visit was a big expensive disappointment.","useful":1,"cool":0},"iMckV7oxlRm39vluvSE2_Q":{"text":"Dante's Kitchen is SOOOOO amazing. Not your typical menu - you are supposed to go for 3-4 ","useful":1,"cool":0},"X0EKMnD_ab_qsZYBfi7X_w":{"text":"This place didn't answer the phone at 4:30 PM on a Saturday when we called to make reserva","useful":0,"cool":0},"mHjxdgqcmDv5kQVBXe9Rrg":{"text":"Dante's Kitchen offers  gourmet food packaged up down-home style, literally. The flame fue","useful":5,"cool":0},"bAX9XPRCO9E2fkv1t7iDIw":{"text":"We were redirected at Dick and Jenny's, as they had an hour wait...so, we had no idea how ","useful":0,"cool":0},"fpC96lo1T3auxcGGMC5kEA":{"text":"We trekked here from Frenchmen for NYE dinner, and are very glad we made the trip.  The re","useful":1,"cool":0},"ALcSslpTkQ-XpaxzqNtRYw":{"text":"i'll tell you exactly what i told the staff at dante's:  my bf and i are new yorkers who t","useful":1,"cool":1},"-mFgwIpScy_2mO_fWAOVCg":{"text":"All I can say is WOW!! From the time I got to Dante's Kitchen to the end, it was fantastic","useful":3,"cool":1},"61qnpjAmP5n6PcFUDyUu5g":{"text":"The brunch is amazing. Get there early if you want to beat the crowd and make sure to orde","useful":2,"cool":2},"DPI9K4A7wdOLrIvD4gH48Q":{"text":"What a find. Nice and close to the St Charles street car. Great atmosphere in a NO convert","useful":2,"cool":1},"_7znMDWZE_GnhZcGvXj_2g":{"text":"What a great brunch place!  The service was some of the absolute BEST -- and we ALL know h","useful":1,"cool":2},"JlnFXm3xlA9GsVonP1aBTQ":{"text":"Dante's is perfectly pitched.  Decor, setting, attitude, bar and food/drink all merge into","useful":4,"cool":5},"CmWQ9tr-bTah6jIMaE12tg":{"text":"Dined here last night and WOW. Just WOW. To think we were originally going to go to Jacque","useful":7,"cool":4},"mBxFskKSRQrqIK-hf3wV4w":{"text":"Extraordinary. I have made two trips to New Orleans from Biloxi just to eat dinner here. I","useful":0,"cool":1},"lxt-7RjFcoU8u8F3SEVvLA":{"text":"BAUCE. I've only been for brunch and had the banana nut panclocks (movie reference) and ba","useful":1,"cool":1},"pSBHFpu0U6KLtLF5sx6AIQ":{"text":"They had us at their spoon bread, so delicious and what a cute presentation, simultaneousl","useful":1,"cool":0},"33FYSqv5ZZgB8086V7ngQw":{"text":"omg that brunch is bomb\n\nit ain't cheep, so make sure you got paid, but daaaaaamn its good","useful":0,"cool":0},"HfJHOOEvXr58QjPMWqMDxQ":{"text":"I love New Orleans ands I have eaten all over the town, but my last visit at Jazz Fest I w","useful":0,"cool":0},"u19Y7NZrZEmMk3jSnB4SBQ":{"text":"I went for brunch and quite honestly I believe I enjoyed everything about my experience. \n","useful":1,"cool":2},"a6xGJmt0_3KX3jpdosanRw":{"text":"Outstanding food. While New Orleans has lots of great traditional restaurants, there is al","useful":1,"cool":1},"0UEVXKLDyaUXzJasv_3B4g":{"text":"GRITS! If you like them this is definitely the place to get them. Great, friendly staff an","useful":1,"cool":0},"BsEePRaJ3L3u_nceGWhZeQ":{"text":"I have to say that even though we were staying downtown and had to take a 15 minute taxi r","useful":0,"cool":0},"l-xJZ8bk3MvLnfhVIbCz9A":{"text":"This place ROCKED!  Loved every dish we had!  The service was great  and I loved the atmos","useful":1,"cool":0},"tEDKpMib_NG1qjrcz6ImrA":{"text":"If this restaurant wasn't on the freakin moon it would get more stars. Of course, that's n","useful":0,"cool":1},"CI5hgQjwCytcEGi_uVPQbA":{"text":"One of the best meals I've had in a long time, SF places included.  Our food was phenomena","useful":0,"cool":0},"L3QViPHs4H-YvJCvx06VtQ":{"text":"Came here excited because of the reviews.  We picked Dante's Kitchen over Emeril's for the","useful":0,"cool":0},"2g0uVf0J_6bqh3KBt5PZaA":{"text":"Great food. Great ambiance. We could take our time and enjoy. Loved the wine selection and","useful":0,"cool":0},"BkZn-56Gi8qHUAUUA9bFgA":{"text":"Superb.  Impeccably cooked seafood, interesting dishes, delicious drinks, and nice bourbon","useful":0,"cool":0},"CLIv-al9VmwXs5GLmPecPQ":{"text":"So after having eaten at 3 more restaurants in NOLA with good reviews, I just wanted to up","useful":1,"cool":1},"X5z2qQoVj__u_JoTByPOhA":{"text":"Memories are a bit hazy but I remember really enjoying the seafood dishes.\n\nNicely spiced ","useful":0,"cool":0},"9mtNw8UTiNR8dnuMetbuPg":{"text":"I live around the corner and eat here all the time. I have never been disappointed for bru","useful":0,"cool":0},"ZKZdRnTi1vx2T3ta_A-LRA":{"text":"Amazing food.  We started with some drinks at the bar which entails on the freshest ingred","useful":0,"cool":0},"takSCo0gJC2oYNLMXBc9-w":{"text":"I love this place because every dish is so unique, and you can tell they're all hand-made.","useful":1,"cool":0},"yGgGI7JkMSYiZxDLfh12gQ":{"text":"I wish I could give this place more stars! Delicious food. Had the trois mingnon, chicken ","useful":1,"cool":0},"Epu9m3w2JqzCnptQXxtidw":{"text":"Dante's Kitchen is a quaint restaurant in the Riverbend of New Orleans.  The art and decor","useful":1,"cool":0},"a3W6LY7E5gCzewjE6QUKdg":{"text":"My most recent trip to Dante's was to have brunch with a bunch of Yelpers. It was an incre","useful":2,"cool":3},"fa4rF7tBNxuxi3b_reBlqQ":{"text":"While i note comments from other reviewers about small portions, this has never been my ex","useful":1,"cool":1},"UWHPxMeRzFrFFngLINVxBw":{"text":"Great ambience and delightful food. Fun drinks-- pimms cup and something with mango infuse","useful":1,"cool":0},"C_HsRswBNH3qLNpqEDKWvg":{"text":"This is one of my Absolute Favorite places to eat in NOLA, and thats saying ALOT. Food is ","useful":3,"cool":2},"saOEAD6MjF434-04IODGJA":{"text":"Incredible!  Very wonderful burrito!  Excellent quality food.  Great Saturday brunch.  Our","useful":0,"cool":0},"KmGTAoYEWoPAhl3Y_WJ92A":{"text":"We came for brunch yesterday and it was wonderful!  I had the steak and eggs and I thought","useful":1,"cool":1},"cbpgojhIFOVK0UkWnMjXVQ":{"text":"Simply outstanding meal and great service.  Started with a couple of orange peel infused v","useful":2,"cool":2},"731K3x1dcavreRC5lk559w":{"text":"The wife and I drove here straight from the airport for brunch. We got there just as they ","useful":2,"cool":1},"Cc9vAEJCdxS6RJ6aJnQQ5A":{"text":"I've eaten at this restaurant on nearly a half dozen occasions at this point. Consistently","useful":1,"cool":0},"yZQWPHZTF030Ia2KsOxNkA":{"text":"I forgot to review Dante's after our brunch last week.. oops! It was my first time there, ","useful":2,"cool":2},"bPyf_3n1Bk7Kwoi5jTHksg":{"text":"This place has such a cozy feel when you walk in. The place is usually packed and they'll ","useful":0,"cool":1},"NT7ME-4dhycsBwpVKNalOw":{"text":"I visited Dante's based upon the great yelp reviews that I read prior to my trip to New Or","useful":2,"cool":1},"NFcRLq2WvUn7wWdKI-D2rg":{"text":"Overall not that impressed. The brick chicken was excellent. As we're the side of potatoes","useful":2,"cool":1},"-dscVp1U9VdOxcCyeXR2QA":{"text":"Off the beaten path as we were brought here by a friend of a friend who is a local.  The f","useful":0,"cool":0},"N8E3wo_3yae5f60iTwuAYQ":{"text":"I love this place. A few years ago my wife was offered a job in New Orleans, and we came d","useful":0,"cool":0},"C-vA-t4rzY87Hm-g0WdDGQ":{"text":"This place definitely lives up to the hype.  On a recent trip to New Orleans, we wanted to","useful":3,"cool":3},"V6AsUiPckSWpEByMif4AeA":{"text":"We came here for an amazing breakfast late on a Saturday morning. We enjoyed a short wait ","useful":0,"cool":0},"myXSf4hVYjUqv-twD_448A":{"text":"I know a restaurant is fabulous when I'm still thinking and talking about it a week after ","useful":2,"cool":3},"Tpy96Vl_YPk-MBVDcEXJIA":{"text":"One of the best meals and dining experiences in NOLA...at least for me.  Service is s a bi","useful":0,"cool":0},"aYfWOAWrjhXhiNvbn_PRqg":{"text":"i love restaurants located in houses. like, if there's such thing as a fetish for that the","useful":2,"cool":0},"yyWX6DL0jmtjqlwE9uKZ4A":{"text":"I ended up trying this place for the first time on my birthday thanks to Jacque-Imoff's be","useful":9,"cool":7},"7PJQguJxFfJX6PEyNR01eg":{"text":"Dante's has one of the best brunches in town, and is also one of the best ways to gain wei","useful":1,"cool":0},"hrcK0XPhHUpQ7o8XQZcp5g":{"text":"most of the Food was wonderful! Tasty..high end menu, but overall experience was a 3\n.\nChe","useful":2,"cool":1},"dF5m0emDhP9ZqqASLS89jg":{"text":"Superb food; the shrimp & grit appetizer is amazingly tasty anf huge; four big prawns and ","useful":0,"cool":0},"TT3rEiwQsEFnfL8J_-SO2A":{"text":"A special meal with excellent service and fresh innovative food.  We had appetizer shrimp ","useful":1,"cool":0},"lfccXNcvqP3U6SbEiGV-1Q":{"text":"I had not been to Dante's Kitchen in about 5 years and was looking forward to early dinner","useful":0,"cool":0},"YJH-Kc4F1YoztHsGMQQGxw":{"text":"I'm currently hating myself for not coming here first during my trip to NOLA.  Cuz if I di","useful":0,"cool":1},"sdO0OE2LAwgbeKyi4qvb8Q":{"text":"Banana pecan pancakes were so good! Get there before 10:30 so you can be in line before th","useful":0,"cool":0},"JLzsjKd7-9ELEaluzymdwQ":{"text":"One of my all-time favorites in New Orleans. This is an easy-to-miss restaurant (in a cove","useful":2,"cool":1},"o2PiI03hPBGJ6kAbl-GK8w":{"text":"You really can't go wrong with anything you order at Dante's. It's perfect for out of town","useful":3,"cool":0},"FOaOnO2DugBXquNG97MWBQ":{"text":"Visited Dante's Kitchen on 3/4/2011 after reading wonderful reviews.  WOW is all I can say","useful":2,"cool":2},"_H8LNonfEhoSzAQXWt1VUA":{"text":"Loved the alligator dish! It had a sweet and lightly pickled jam to the biscuit like sandw","useful":0,"cool":0},"1f0WJxIY2s49XuFrA_kykA":{"text":"The restaurant is definitely a place to try. We ordered and shared some of the meals and t","useful":0,"cool":0},"qdeBUG36CgnU0Z8F4eChrQ":{"text":"This is one of my most favorite brunch spots uptown. \nDuring satsuma season, the satsuma-m","useful":1,"cool":1},"SPjstJ_DwWLK_q0EYiBc3Q":{"text":"So I haven't written in quite a long time but coming to Dante's Kitchen has inspired me to","useful":3,"cool":3},"xevUAHMjy91U80b94WEqVA":{"text":"Another restaurant keeping New Orleans on the map for great food. It is a bit pricey, but ","useful":0,"cool":0},"XWAma5ELEItXY3VUCOwMQA":{"text":"Yum. This place is awesome!\nWe started with the escargot with basil, vermouth and goat che","useful":1,"cool":1},"VD-02a70k98gppk8Yo6N_g":{"text":"My group went to Dante's Kitchen when we were in town for Mardi Gras and it turned out to ","useful":0,"cool":0},"Zf9MCMyXesLE9F4iVhq45g":{"text":"Disappointing, The quality and the quantity of the food are not in sync with the prices.","useful":0,"cool":0},"jVQLQ_EJS5Lv5DDh7JqnzQ":{"text":"One of my favorite brunches ever! So glad we found this spot. We lucked out and didn't hav","useful":1,"cool":0},"n5XEUvt4u_8vWZnme_SQ8g":{"text":"One of my favorite uptown restaurants.  It is located in a small house with both indoor an","useful":1,"cool":0},"XmZ4quOf-2gex0r_kwNWxA":{"text":"An experience to behold. A patio party for your tastebuds.  Just go here. It's delicious, ","useful":0,"cool":0},"nixCwxLn5BKhY1Vtq_4a1w":{"text":"Off the beaten path but worth the 15 to 20 minute cab ride from the French quarter.\n\nThis ","useful":9,"cool":8},"xZxuhvV6nKxMtAg_iddt8A":{"text":"I have been to Dante's a few times for brunch and years ago for lunch. This review is of t","useful":10,"cool":8},"oWkaSNzsPfPEv73asMlXew":{"text":"Located in a white house, with a courtyard surrounded by flowers and lush greenery at the ","useful":2,"cool":3},"QBUFj_B6BH3QKzZpYHJz5w":{"text":"Hands down my favorite brunch in New Orleans.  I have been there about ten times and I sti","useful":0,"cool":0},"ZWQiRHRxNv1ZZUQjl7iyYQ":{"text":"Dante's Kitchen, A small restaurant off Carrollton Aveune where the river bends. There's n","useful":1,"cool":0},"nPwcBU9XKfFZKFI1QOjRgg":{"text":"I usually don't bother writing reviews for places that already have over 300 reviews becau","useful":3,"cool":3},"IETZK4-2nZkFJ6ixsydHHw":{"text":"A bit overrated and over priced. Chicken under a brick was delicious but everything else w","useful":0,"cool":0},"o-HRagu1x1lCz1khrmJlrg":{"text":"I have mixed feelings about dinner here tonight.  There's good and bad, and I'm disappoint","useful":5,"cool":0},"8BXJP8rmC9cbC1SjiydDMw":{"text":"A TEN EVERY TIME! This is absolutely my favorite restaurant in the city.  What I love?  Th","useful":0,"cool":0},"LvLrRilu-CWLWVfUbQZjrQ":{"text":"Love Love Love this restaurant.  When visiting new orleans, we wanted to go somewhere \"off","useful":2,"cool":0},"TZOIBqVSnaOSOWT50xbk3g":{"text":"Horrible. I cannot believe this place has such high reviews. Only redeeming qualities are ","useful":1,"cool":0},"D5Y5Z5W4Uwef1JO7W8exiQ":{"text":"Tucked away on a quiet little street. If you're coming from downtown/ French quarter ask t","useful":0,"cool":0},"ETZYisFpY_m62e57-t3yWA":{"text":"If you don't already live there:\n\n1) Go to New Orleans - It is a truly magical city and th","useful":8,"cool":5},"e1LyH0T22N9Ve_1Ajpvuxg":{"text":"meh...so underwhelming!  got the eggs Benedict  and veggie omelet.severely underseasoned! ","useful":0,"cool":0},"FTnliQPNFNCX_UtsyF73tg":{"text":"Amazing meal! Totally worth venturing out of the French quarter while on a quick getaway w","useful":0,"cool":0},"4QceCxf0PVvdLJwfywR-vA":{"text":"Ordered red fish and it was OK. Maybe I expected too much from all the high ravings or may","useful":1,"cool":1},"_XgmMoaxML07t6lQusqttw":{"text":"HOLY CANNOLI!!! Best meal. The food!!!!! The ambience!!!! The service!!! The music!!!!! It","useful":0,"cool":0},"au8M4MDDEPWcbvOSE6ePUw":{"text":"The best brunch in the city! I've lived in New Orleans for two years and have gone to brun","useful":0,"cool":0},"P7rZ-BYMBTuPCJL7lItUDA":{"text":"Dante's Kitchen is a laid-back little place in New Orlean's river-bend, tucked back at a s","useful":2,"cool":2},"pU-HX-Ilj9O2mD3-ZiK6mA":{"text":"Seriously, without a doubt the BEST shrimp & grits I've had in NOLA. By a MILE! Oh and the","useful":0,"cool":0},"20Vv3qXaUV30lqS3dBJvGw":{"text":"I drove like hell to get there before 10:30 closing. I smiled as  I walked in @ 955 only t","useful":0,"cool":0},"VgOf5NdNi5w42szkRY98Ug":{"text":"Holy Cow.\n\nSteak & Eggs.\n\nBiscuits & Gravy.\n\nFreshly Squeezed Juice.\n\nMimosas.\n\nGreat Serv","useful":0,"cool":0},"mQjPXc9LVsMmKQkcXi9zOw":{"text":"Classic and sooooo delicious New Orleans cuisine. The ambiance is eclectic and inviting; a","useful":0,"cool":0},"UDY5Gy_CK5-bv12Eq72Ghg":{"text":"Must go if you are in New Orleans!!  I have never had such good grits, the shrimp & grits ","useful":0,"cool":0},"sIvzMi5_N0Jt7leCaUoP7A":{"text":"Dante's Kitchen is a really special place for a dinner with your couple and even for small","useful":0,"cool":0},"9-E1yvTzPu9fiXTOItR5BA":{"text":"Consistently one of the best and most charming restaurants in New Orleans. I love that Dan","useful":1,"cool":1},"L9HhCgOHzwVJXEVtkLVVBg":{"text":"The place is downright cool and in a part of New Orleans that most tourists would not othe","useful":1,"cool":1},"zi6-b-pqwzUu87MzHgiUmg":{"text":"I think I split the difference with a lot of the reviewers. It appears there's a lot of di","useful":0,"cool":0},"Lf0JVtMRK55reO__Cdh_gA":{"text":"My buddies have been talking this place up since their first meal as 1L's, so when I came ","useful":2,"cool":1},"tsE5JTeT_TcClpsAr4AJJQ":{"text":"I brought my wife here for her birthday and I'm so glad I did. I wanted to bring her somew","useful":7,"cool":3},"QxzAwpIj6HoOmnQxXp_f6w":{"text":"Delicious Bloody Mary. Although portions are smaller than other brunch places, the plates ","useful":1,"cool":0},"wByatdusICFl8TLJas1zCQ":{"text":"Best brunch I've had in New Orleans...is it because its the only brunch I've had in New Or","useful":0,"cool":0},"GwnZEqpKUTH1UCk1Uy-8Mg":{"text":"Delicious and cozy. Diverse menu that is always changing.  Very creative and thoughtful in","useful":1,"cool":1},"OOq24E95-7PRxKxtx_mRrA":{"text":"If you need to get out of the fried New Orleans row if the French Quarter, go here! It is ","useful":0,"cool":0},"RXGYqNwvkbZZ3ybBIqA0aA":{"text":"Excellent local farm to table restaurant. I had the duck cassoulet which was just a tab bi","useful":0,"cool":0},"G7eWMwGY7N8t0ZGF8u-iuA":{"text":"I went a long long time ago for a fantastic brunch, so when I needed to find a place for a","useful":0,"cool":0},"ahU1sq4NCBUZiwBkNHtX1w":{"text":"So  I had brunch here last Sunday.   We started off with the home made biscuits with home ","useful":0,"cool":0},"aB5HC2PvEltyPimcVlyYnQ":{"text":"A warm welcome from Carina, an on-point server that was there when we needed him but gave ","useful":0,"cool":0},"v4GfhAhT_NOxTLio8WNftw":{"text":"Went there last week for dinner.  Very interesting and creative menu - I guess you would c","useful":0,"cool":0},"z3VdIeK6drmaHkXXzkClYQ":{"text":"We had a great dining experience at Dante's Kitchen.  Its a very small place with a nice (","useful":0,"cool":1},"F8m8O7HQFWzIRIF1UwXP3A":{"text":"This is one of my favorite breakfast joints in New Orleans.  The debris, i think, is the b","useful":0,"cool":0},"8asllMQ9Jy_1H4DgVyIXhA":{"text":"the food was ehhhhh... for the money its so not worth it. i ate here about 3 days ago and ","useful":3,"cool":0},"ybRY_qIXO4eNvUexva3vrw":{"text":"After taking the streetcar ALL the way uptown to Jacques-Imos, only to find it CLOSED for ","useful":2,"cool":4},"FHUL87I6_Ry_-LcFn40nuQ":{"text":"One day my friends and I decided to go to brunch and we have heard about Dante's Kitchen f","useful":0,"cool":0},"VkB1qvuaab8knspcY1kQwA":{"text":"I can not say enough good things about this restaurant.  I went a couple of weeks ago with","useful":2,"cool":1},"nmI3UaR-iGhHvQnwNOW1Dg":{"text":"Of all the places I ate at in New Orleans, Dante's Kitchen was my favorite!\n\nWe came here ","useful":3,"cool":2},"3gXvh4GHCBI86km50dN_4Q":{"text":"It's been 6 months since I returned from my trip to Nola and what sticks out most about my","useful":7,"cool":6},"IjjnbiYMTfcSQiVl4v1kFw":{"text":"Very tasty. Barq's root beer sweet potatoes were surprising. I didn't think i'd like them,","useful":0,"cool":0},"bPyiQ5UxTgDAb0Ubf1lTSg":{"text":"Jonesing for the best brunch you could ever have? This is the only place to go.\n\nThere's a","useful":0,"cool":0},"EJcQaiCyu_m90Bq9cKk4_A":{"text":"lived it up here!  Amazing food, great staff, definitely not cheap, but it's locally sourc","useful":0,"cool":0},"rTiWyScc8D0Z60G2J9k0ng":{"text":"Excellent food served hot. Started with escargot. Ended with Banana Foster Cake. Drinks ca","useful":1,"cool":0},"eo_67jfEgguak5UH9NXhdg":{"text":"When you stop in, Dante's looks a bit like a home that's having a garden party.\n\nAfter inq","useful":2,"cool":5},"326SmjnqUsesu-hmUX1ceA":{"text":"Went to Dante's this past weekend on a trip to NOLA, and had a wonderful dinner. As other ","useful":0,"cool":0},"sfTAoaAugA_mPJ0GOfsidQ":{"text":"In about as many weeks, I had but two disappointing meals in NOLA. Sadly, Dante's was one ","useful":4,"cool":3},"HHQh1aPVFaDM246xVL8yRQ":{"text":"The duck with grits could possibly be the best brunch dish in Louisiana. Great atmosphere ","useful":0,"cool":0},"itJJZjozcxnqUqlfbPklZw":{"text":"If this place really does serve breakfast I'm going to be in heaven. I went there for a sm","useful":1,"cool":0},"jVsNKav1zUk8F5-GV07Lgg":{"text":"Wow!  One of the best bites of chicken I've ever put in my face!  The Chicken Roasted unde","useful":2,"cool":0},"6vnicIYxPxeUF17yzk6ovg":{"text":"Great brunch. Love the alligator sausage. Shrimp and grits. Bread pudding French toast wit","useful":0,"cool":0},"F2CKrnnhI-kd74miN6GU2Q":{"text":"Another outstanding meal at our favorite New Orleans gem.  The plate of homemade charcuter","useful":1,"cool":1},"cjscVZI8BveQ7Jo0XrT7jQ":{"text":"The train ride off St. Charles was scenic even at night and a great way to get here.   Its","useful":9,"cool":3},"8Z_vQ0XR00_a3y1IEiBJ3A":{"text":"Everything people say about this place is accurate - excellent food, great atmosphere, and","useful":0,"cool":0},"tCsu2TzHNE5XnzPfPFYpJg":{"text":"4.5 stars - here's the breakdown! \n\nAmbiance - 5 stars. \nDante's kitchen is ADORABLE. I lo","useful":0,"cool":1},"vXeyouW8dVI-j1DdFbBhNQ":{"text":"A friend and I just had a nice meal at Dante's Kitchen over Mardi Gras. A small restaurant","useful":0,"cool":0},"SaqzR5xD0Y3MmR1BekVCiA":{"text":"This place has been on my radar for a few years and until now I have never had the opportu","useful":1,"cool":1},"yajda7155rVuEBMad46OVA":{"text":"Snails with bone marrow?  Color me sold.  It was deliciously decadent.","useful":1,"cool":0},"8WCS1MWKS7vq-E6cTw_U2A":{"text":"Returned to this restaurant from a long absence that had memories of a good time in the pa","useful":5,"cool":2},"dSiOwc0q5g_rz_LyepsKdg":{"text":"Holy sweet molasses bread!  \n\nA little bit of a trek from the CBD and French Quarter but o","useful":0,"cool":1},"0iRTrs69xBoCZYmCo15tSQ":{"text":"Very good restaurant.  Creative and well prepared vegetarian options.  Seafood and small g","useful":0,"cool":0},"PqdK9iqGMt8Wysu22OQW5A":{"text":"What a wonderful hidden treasure.  Fantastic service food and all around great dining.","useful":0,"cool":0},"dR6saImq4SxQ_O1Ud3GEQg":{"text":"I mean they just do it right.\n\nTheir mussels broth should not be missed. Order it, and swe","useful":2,"cool":0},"e1x8l-U63_hCN0K_o-tEHw":{"text":"Ok, seriously. How can the food be so so so fabulous EVERY time I return? My buddies and I","useful":8,"cool":7},"Q6hVuISrBWxdCpndcz5o9Q":{"text":"We hadn't been here in a while but the food and service were as good as I remember!  Had t","useful":0,"cool":0},"CAkl9m5mYo5PO_JJEN7lNw":{"text":"Love this place for both brunch and dinner! Today we came for brunch and had the steak and","useful":0,"cool":0},"jrTevosfxBfL8H97SWt_6g":{"text":"Just plain amazing. Food tasted great, was interesting and well executed. The restuarant h","useful":0,"cool":0},"UkL40D0-0llSrhNAl4r_pA":{"text":"The first time I came to Dante's Kitchen was back in 2011. It was delicious. And still is.","useful":3,"cool":1},"DMWjSo1b4ChuYOaCxqg1YA":{"text":"Food was fabulous!!! I wonder if they have a garden in the back to grow their own vegetabl","useful":0,"cool":0},"0G-aNKWqAh4jqmjioIfHOw":{"text":"Wow.   Worth the wait-- though i wish there was more space to wait inside considering it w","useful":4,"cool":3},"Sqd9rGxGN56rPLnx0fkUNg":{"text":"This place is like Louisiana style meets New American, in a cozy cute little restaurant aw","useful":3,"cool":0},"z4AZ2GDfFBuncwKpZM4-bA":{"text":"Wow I think I died and went to heaven!  I had the special, and that it was .... fellow foo","useful":4,"cool":1},"axoXir39p62dZemkaTYDEA":{"text":"Wow.  That's all you need to read.  Go on to the next review....\n\nOkay, if you want justif","useful":1,"cool":2},"K76x_xFnO5VKGdvZo_IeQg":{"text":"Doesn't get better than Dante's Kitchen.  The ambiance of this place (it's an old house) s","useful":4,"cool":2},"KgayOmLDdpe4o3cnQYpk0A":{"text":"We went to Dante's kitchen as a party of five last Saturday. The food was good, but the se","useful":0,"cool":0},"dDKc0x9lf6GTUZGupD-r4g":{"text":"Enjoyed Sunday brunch for my sister's birthday at Dante's. Food was quite delicious. Our s","useful":1,"cool":1},"VlBukEL8MRVMOe0D-Xzg2A":{"text":"One of the top 5 meals I've ever had and one of my new New Orleans favorites. (Realized I ","useful":1,"cool":1},"YzNu1Iwf2Z2W88KJ-kCyTA":{"text":"This is one of the reasons I work out. So when I come back home I can put on about 10 lbs ","useful":0,"cool":0},"gSVNWU2g0mTDrygQ72tbQQ":{"text":"I have to say I came back here after four years with high hopes. The menu does not read as","useful":3,"cool":2},"zn6HSCsXz4__N2WxTTwbRw":{"text":"Fun and funky little place. Had an excellent dinner one night, and a killer brunch on anot","useful":2,"cool":1},"WS7oRnOVXUJCfyTznjh07w":{"text":"Extremely disappointing experience.\nSaturday Brunch.\n\nWe'd always wanted to try this place","useful":5,"cool":1},"O-8re5G2_YuFGTYH1nkUJQ":{"text":"A fine meal in the garden outside. Dante's is a cool little place tucked into the edge of ","useful":4,"cool":2},"4j20NijtSB4awINEQcNvcQ":{"text":"Brunch is outstanding - I had a fluffy omelette with delicious melty cheddar, potatoes, an","useful":1,"cool":1},"XG4BUbupS4oEPBgwmwAjGg":{"text":"Went here for dinner since Brigtsen's was full. Bae and I both ordered from the Coolinary ","useful":3,"cool":0},"iY8zsXOCOftHRf4xVEPrTA":{"text":"Review high points: Get the chicken under the brick and cauliflower soup. Skip the brussel","useful":2,"cool":0},"dEx_f-LftVlLlBRqynNlTA":{"text":"This place was such a surprise.  This is not where we were even going.  It was a second ch","useful":0,"cool":0},"K0v_gP7DWnlW_LcovXX7aw":{"text":"Went to Dante's Kitchen for my son's birthday with a party of 6. The food was excellent, b","useful":0,"cool":0},"S2E3TynqHEJalFV5R6QI0w":{"text":"The food experience at Dante's is legit. The dining experience (for me) was a bit off. The","useful":14,"cool":5},"xPt_SpVLyR2kCBlV6OUIpg":{"text":"I took the lady friend here last week(Dec 20) for her annual b-day dinner.  She chose the ","useful":4,"cool":1},"dAiqYK_Ftf05y3DYE1M2kQ":{"text":"The first place I ever had escargot and I ate TONS of it. I love the small house feel of t","useful":1,"cool":0},"UqqsLva3opicQIzCTBaVlQ":{"text":"3.5 stars.\n\nYes, very cute neighborhood restaurant. Food-wise, solid, but not the best  NO","useful":5,"cool":5},"trhfwfpMfZv3Bj6CQDNbKw":{"text":"Came here for brunch and it's just as deliciously satisfying as any meal I've had here.  D","useful":4,"cool":4},"bd5lzg0HGFqwQGbIem9VNQ":{"text":"Jazzfest weekend came for breakfast. Would recommend coming at opening to be seated quickl","useful":5,"cool":4},"jFGP_nzAqXkmxn5nOHh1GQ":{"text":"Wow, Wow, Wow!!! Great unique food. We came for a bachelor part with 11 people from Califo","useful":0,"cool":0},"VilUTXFFKgM3z67HkOvfYw":{"text":"( The following review is a script for the animated short video that can be found at http:","useful":7,"cool":12},"YSbljjINlVubf15Uv5G3yQ":{"text":"Been reviewing restaurants from our trip while eating here.... so we are discussing lots o","useful":0,"cool":0},"R7PPARAGkXf74gom2oe8Ow":{"text":"From the cozy atmosphere to the accomodating staff, our evening here rocked. I liked the v","useful":5,"cool":3},"Z_4ZYhmTfthND2x8-Z9KQg":{"text":"Start with the wine list.  It is eclectic to say the least, but amazingly balanced, someth","useful":0,"cool":0},"XaRVXX1Ypwj-owx8UVMPnw":{"text":"Dante's Kitchen, oh how I wanted to love you...alas it wasn't meant to be.  Fellow Yelpers","useful":1,"cool":0},"uyArcMcEw2I-g2_zz6-ngw":{"text":"Really wanted to like this place, but it just wasn't what I had hoped. My friends and I go","useful":5,"cool":2}}