{"QGNJ6DQoc4E3MnkWNxZIZA":{"text":"Funrock'n has an almost endless selection of costume accessories and random collectibles. ","useful":2,"cool":0},"q4kH-0vxJmk7Y0HNoJV9gw":{"text":"I ordered a custom tshirt from Rhonda here and she more than delivered. I am so pumped abo","useful":0,"cool":0},"pd9hWo2jgOVnjf0ixhvlGA":{"text":"Great assortment of fun things. We came for the lunch boxes but so much more. There is a l","useful":0,"cool":0},"hbpjjIcEsBnN3sCx-hN9kw":{"text":"Fun store to browse through....a little difficult with kids...but do-able.....especially s","useful":0,"cool":0},"PE6FGodeEp5_u0LRMn1XuQ":{"text":"Absolutely terrible experience. Charging $30 per print on a $30 shirt and then giving me i","useful":0,"cool":0},"V0imr4Yv8pKAxMwLcSQEKw":{"text":"I have visited this place quite a few times to have custom shirts made. Needed a shirt las","useful":1,"cool":1},"kwqC3-0ewDxoaZsz5D45Gw":{"text":"The first thing they did was make us check our shopping bag.  My giant purse was ok, but m","useful":0,"cool":0},"wX5iNiBmAr9LMBqNPZw3Pg":{"text":"This is an awesome, awesome shop. They have some of each kind of kitsch imaginable, and an","useful":1,"cool":2},"fNqaeFGTw4bv8nJ5z0uCLw":{"text":"Located just off the intersection of Eighth St and Magazine St is this wonderfuly kooky st","useful":1,"cool":0},"9z3sO3psj9KfDAzHchNcaQ":{"text":"Great selection of humorous gifts. However, the day I visited the workers ruined the exper","useful":0,"cool":0},"eq8Bhyp_iD08xw6_tty3og":{"text":"I was passing by and one the workers outside drew me in! The staff is super nice. I bought","useful":0,"cool":0},"sm-3SlCTzZrQ5U-FaWHdEA":{"text":"I'd been pining after one of their NOLA heart iron-on t-shirts for weeks when I finally bo","useful":1,"cool":0},"fEq9DQFZDLIPSKsP2VOrwQ":{"text":"Bootsy's Funrock'n is such a fun store! I absolutely love it! You can find all types of ne","useful":2,"cool":0},"wOIqP9lQ67Vtq6fC1ksDoA":{"text":"I'm not really sure how I don't have a review of this store; I think Yelp likes to keep me","useful":4,"cool":2},"04cOxUaNGZSGKcegOySuxA":{"text":"Always friendly staff.\nAlways affordable gag gifts, seasonal goods and leg wear. \nA great ","useful":3,"cool":2},"FWqaUwrTYNivZOZzMs345A":{"text":"This place is like an instant party! You can find anything and everything you could ever w","useful":5,"cool":1},"vml3Sb_qWOho-ZY9sgs-zA":{"text":"What a fun little shop! We were on Magazine St recently and stopped in to check this place","useful":0,"cool":0},"ThI1N91BWPz7oag9wDGT7Q":{"text":"This store is AWESOME!  Have you ever gotten one of those gift catalogs in the mail full o","useful":5,"cool":3},"IVGXcBI3tZcPDoRON1nroA":{"text":"Cute stuff but nothing you can't find elsewhere on the street or in the city or even anoth","useful":0,"cool":0},"xLl6kkzRANsPodXHIn__oA":{"text":"I live down the street from funrock'n, but hadn't actually stepped in until the day before","useful":0,"cool":0},"BuLIN3jMJB3x47WMOZdbJA":{"text":"Went into the store and was stopped by a girl saying she wanted to check our bags. I compl","useful":1,"cool":0},"RS4nAlIUp_9xxPNrPnFs9Q":{"text":"This store embodies my childhood and most of my adult humor. This is a great place to get ","useful":2,"cool":1},"WbIgA8k3GrupjbNtttpR4g":{"text":"Delightful little shop with loads of fun gifts. The employees are great too, and they even","useful":0,"cool":0},"ZrkPyROH9lG0DFiH3ZIPoQ":{"text":"SO since the last time I went in there, they've moved the clothing side across the street ","useful":3,"cool":1}}