{"XnjMx9vSuIXcHeyjwJZg-A":{"text":"It's promising but the mall just get in some more stores!  By the size of it, I expected a","useful":0,"cool":0},"yioGzHbZwHO87MsVa-zqgw":{"text":"The theater is a great little place, typically one of the few places in the city where you","useful":0,"cool":1},"4IvyKS8BqHvVTo15okf4qw":{"text":"Park at the garage here, validated tickets for 2 hrs or less - $2.00!!!!!!!!\n\nSaks here is","useful":0,"cool":0},"1Q3MVVoOO1y0gArHt1L5RQ":{"text":"If you would not like your car stolen then I would steer clear of this mall.  My car was s","useful":0,"cool":0},"9ReswKDMbRX-hMAPWxLi3w":{"text":"A place to shop as a nonstandard local point of interest if you need a departure from booz","useful":4,"cool":3},"SHC6S4tOKzCh_HOGabLZbg":{"text":"This is an upscale mall near the French Quarter. It's not gigantic, but they have some hig","useful":1,"cool":0},"aHtrJIo5l8QRAp167g0oMQ":{"text":"It's a nice little mall with some upscale stores in it. I did some window shopping and I w","useful":0,"cool":0},"o83q_I1MUQmR6tT_jlqwSw":{"text":"Smaller shopping mall on the Canal Street border of French Quarter.  Small but some good u","useful":2,"cool":3},"JmZWpGMIZtX7pCqRXuPQ2w":{"text":"The stores are pretty upscale here, but love to look anyway. Its a good place to park down","useful":0,"cool":0},"UFe0loONiWbia7jN2PtK3A":{"text":"Have you ever been to a mall and walked around only to find that most of the stores are no","useful":0,"cool":0},"eEh7e-1AuEr3Vr8b6DTG3w":{"text":"Awesome shopping this mall is great and has every store I love to shop at the parking is v","useful":1,"cool":1},"Hdn1JDln4U7emwsO0vdYMw":{"text":"Nice place to browse some expensive shops and escape the heat. Even have a movie theatre l","useful":2,"cool":0},"dQ9izEhgtpzC0GPuZkkjJA":{"text":"Nordstrom Rack- cashier was in such a hurry (Ashley H) that she didn't get my info to add ","useful":0,"cool":0},"iVzQO0zr1e5fLN9jZjn5cg":{"text":"I love shopping at Canal Place. They have a good food court. A awesome Movie Theatre. The ","useful":4,"cool":2},"I3wbTxfjCekxDerNmeht7w":{"text":"This is the only mall in this area other than the outlet. Surprisingly it's smaller than i","useful":3,"cool":1},"oBgib3emAuZP8eH4ln-7mw":{"text":"The parking here is ridiculous! Do not lose your ticket or you will be forced to pay an ou","useful":2,"cool":0},"nkqSjC8vkhkSGxyg4mtkvg":{"text":"This mall is smaller than it looks with less stores than other malls this size. What I lik","useful":0,"cool":0},"-Zv92PZ3_OArqwLWITh15w":{"text":"This place has changed over the years. There are a handful of high-end stores but it still","useful":0,"cool":0},"GuzrGA7MFOrEiRNe8Znjdw":{"text":"We mainly strolled through Canal Place on our way to the Insectarium.\n\nIt seems most of th","useful":0,"cool":0},"mpm_c4j6tWtS1__AxzkriA":{"text":"Looking to do some shopping and I was not impressed by this indoor mall at all.   I spent ","useful":2,"cool":1},"CERpvthH6ibDS88dAgYfCg":{"text":"I spent three hours walking around the French Quarter and CBD trying to find working wifi.","useful":0,"cool":0},"fR7jHAB_xdOFymFWsbLi3g":{"text":"This place should be burned to the ground. First of all the canal place parking garage ele","useful":0,"cool":0},"jnCoWtX0N2eNSk13cge6VQ":{"text":"High end shopping in New Orleans. While this mall seems to cater to tourists, it does have","useful":0,"cool":0},"KUQeWdkwbHFfDEOTU2j6Cg":{"text":"If you drive an SUV or large vehicle, be careful where you park. The parking spaces are ti","useful":0,"cool":0},"-0OdKeX0zIqXbCJtLmjTJw":{"text":"The best thing that Canal place has to offer (in my opinion) is the theater. Saks isn't te","useful":1,"cool":0},"e0GuADXckteaVbEu73-dqg":{"text":"The food court on the 3rd floor is probably the worst I've seen in any mall I've been to! ","useful":0,"cool":0},"qD4Tzw_r-lIPWkb8BV__ow":{"text":"super tiny mall with like 4 stores in it. would have been nice to have other stores. but p","useful":0,"cool":0},"YIcaiDXPekGknHXUzJ73Mg":{"text":"Great stores, small food court, but enjoyable. Close to the train and next to the aquarium","useful":0,"cool":0},"rrDyP7oEdyUG4LZtYqTsDg":{"text":"This is Nolas expensive downtown mall.  \"upscale\" sort of, but then there is also the new ","useful":1,"cool":0},"R7NYxu8qUSc23-b7nbITwg":{"text":"This mall is good I mean it's smaller I think it's a good Choice but the small selection o","useful":1,"cool":1},"fB7WS48YngGOu_t6J52reg":{"text":"Great place to walk around, catch a bathroom brake and some AC but to shop here you better","useful":0,"cool":0},"h4ovL1_W6DBjHCx5RK3Wow":{"text":"This is a small upscale mall. The Saks store is quite large and seems to dominate the enti","useful":2,"cool":1},"n2NKc2HtAvLIr5wXjOTdvA":{"text":"This is my favorite mall by far. Its classy and the stores are amazing. Of course your cre","useful":0,"cool":0},"5s4jjMNGTMQFdpuaQXGk7A":{"text":"My Ratings:\nQuality - 4 Stars\nLocation - 4 Stars \nEntertainment - 4 Stars\n\nMy Opinion/Stor","useful":1,"cool":0},"9AL_FkOn-FCdXvivjwjmFw":{"text":"High-end shopping at your fingertips.  Saks, Anthropology, BCBG, Aveda, BrooksBrothers, am","useful":0,"cool":0},"Q7TJHnRrtk7LXlkjXRvTkA":{"text":"Pretty cool place. We had a mega bitchy baby so we didn't get to do much other than run th","useful":1,"cool":0},"u0NQ2zfnKIdQMFIpvwnfaA":{"text":"Canal Place is downtown's upscale shopping center where you can shop at places like Saks o","useful":1,"cool":1},"5whcgT77l4XKPwB7TXQLtw":{"text":"Not much hers. All high end stores with the Westin Hotel attached. A regal theater on the ","useful":0,"cool":0},"La-VDO-85sXHcB-2s-O2uQ":{"text":"I stayed at the Westin around the corner from here and was pleased with the proximity to t","useful":1,"cool":0},"pIUvGehA_tfrmlIQ5FmFAw":{"text":"Outrageous parking fees making it totally not worth it for locals. Hot, slow elevators, fo","useful":0,"cool":0},"7BtjAGk6FiSB9MVqLEKf8w":{"text":"I was excited to pop in here because it's right next to Harrah's and I thought \"Ooh, shopp","useful":1,"cool":1},"B_TjF2QG3S3Uo1bky3gBzA":{"text":"This is a really high end mall. There were several stores that I was not familiar with but","useful":0,"cool":0},"n09c0_U2fr6Q9kvIx3i8DQ":{"text":"Small but mighty. This plaza offers a handful of awesome shops sure to burn a whole in you","useful":36,"cool":35},"jNDLOee8IiYFSZ38Ody-VA":{"text":"Nice stores but not what I would normally shop at.","useful":0,"cool":0},"2dUGo3WwOfGca4wvjruD4w":{"text":"A very nice upscale mall on the edge of the FQ.  OK, upscale for NOLA.  \n\nIt has Saks, Pot","useful":2,"cool":0},"HqaBSzMPxZQaz4vsWmxhAw":{"text":"Very nice and upscale shopping mall with a theater at the 3rd floor. They have a Starbucks","useful":0,"cool":0},"cDYORZhOJVxQIivUfNEwqw":{"text":"This is a pretty nice looking mall but that's the only nice thing I can really say about i","useful":0,"cool":0},"RGvo8z1vof8zONGZFunmnQ":{"text":"I went there yesterday and I love this mall. It is upper end mall with Michael Kors, Coach","useful":1,"cool":0},"Bukl7zKnwMG5qNg4FkOiCA":{"text":"This mall is nice but because of the high priced stores it caused it to seem out of place.","useful":0,"cool":0},"eRqsa6GX7BTJMyauEBDnQQ":{"text":"It has a Saks.....and that is about it.  The Riverwalk has a better view and better food -","useful":4,"cool":2},"ytP6K42SXTXmR3jdlcDlnA":{"text":"I am glad this place exists in New Orleans.  Sure it's not very aligned to the New Orleans","useful":0,"cool":0},"WVIbHFPY3aNJhS5tLVWyiA":{"text":"Super high end shopping mall at the end of Canal Street.  Not a big mall because the store","useful":1,"cool":0},"WqrliKfaLeRtqNXoDtx2yw":{"text":"I enjoy spending lazy shopping days at The Shops. There are mostly high end stores: Tiffan","useful":0,"cool":0},"VPnsPmTKcRe62utjCsxqvA":{"text":"i wandered into banana republic to see what was on sale (turns out, quite a bit).\n\ni saw a","useful":0,"cool":0},"bND2yxcG4_AyamauPirTag":{"text":"Popped in here to get out of the rain. Lots of high-end shops. So, for me, it was good for","useful":1,"cool":0},"Hb2IJnNN3hTG__C1v_x9Yg":{"text":"The Shops at Canal is a nice middle-to-upper end mall right across from Harrah's Casino. I","useful":5,"cool":4},"v--sxMSnwVcHilQaHQ8Vag":{"text":"Nice high end mall to walk around in for a bit, and the glass elevator is fun for kids! Ar","useful":0,"cool":0},"ZdOfwca3DK2SbyoE7v3v3w":{"text":"If the Shops on Canal Place were a man....it would be the finest mo fo low down in this to","useful":3,"cool":2},"ke8Y-HNy5pgGJTRwQUFBKw":{"text":"Beautiful place to shop.  The stores are \"higher end\" so very expensive.  It was nice just","useful":0,"cool":0},"AOvkg8E00lUQYWMSqgnScQ":{"text":"This is where most of the better quality national stores in New Orleans are to be found.  ","useful":4,"cool":1},"3ysBoSMNFVUbJAb0axwvQA":{"text":"A nice clean multiple story mall that really isn't that large or offers you nothing from o","useful":2,"cool":1},"3filcSp-ZRsOJZFaNgO_1A":{"text":"Stopped by here for a quick pit stop. This is a mall with two levels. They also have a was","useful":1,"cool":0},"pIKvp_UyLhX1QVo54y_D3A":{"text":"DON'T USE PARKING GARAGE I left my parking ticket in the movies  so they charged me 40.00 ","useful":1,"cool":0},"g_RUo_PZdxBGxJgQ91Smfw":{"text":"Mall is nice but my experience was ruined by an incredibly rude concierge at the front des","useful":1,"cool":0},"070AwydKIdu9o5hKGEJJ5g":{"text":"I agree with Jeremy S. The best thing about Canal Place is the movie theater. However, the","useful":3,"cool":1},"3ExLyZnnvSDfipExDa39YA":{"text":"So festive this time of year! Has some of my fave stores here. So excited for the Louis Vu","useful":0,"cool":0},"axbpC0nMrv-j6LgP7HxvBQ":{"text":"Visited the Canal Place mall for the last 3 Thursdays for their Winter Wellness Series!  I","useful":0,"cool":0},"9pkoD3s_Jw824IugAztEfw":{"text":"Upscale, ritzy, high-end.\n\nThe perfect place to go Window Shopping.","useful":0,"cool":1},"CzaNjgcnE6_UjhzC8GMXFQ":{"text":"I only went there for the Starbucks which wasnt that good. Anyways....Mall is small with m","useful":0,"cool":0},"emC69XSSX2h8O2d_Dmv1uw":{"text":"I left this mall feeling inferior and small.  Security discreetly following me around.  Ze","useful":3,"cool":0},"YHZkA7G5-FwC1hAY9HxzFw":{"text":"I'm definitely a fan of Canal Place.  I was saddened by the period of time in which the sh","useful":1,"cool":0},"LUyC_7inOYVEvuyS__9nPA":{"text":"I love the window shopping at this place. I am too cheap to actually spend money anywhere ","useful":1,"cool":0},"ptH6blpv0qQVWHtBpjJjSQ":{"text":"Canal Place is an upscale mall located in the heart of downtown New Orleans.  Stores like ","useful":12,"cool":12},"ROXoMsgbIiZ6T0cSZv-nBw":{"text":"Compared to the rest of the shopping malls in the New Orleans Metro area, Canal Place woul","useful":6,"cool":1},"Z7My7CnUr8wuVCo3JicEJQ":{"text":"This is an upscale mall at the foot of Canal Street that has an almost deserted look insid","useful":16,"cool":15},"89jcw7fCZILct-R_79l7nw":{"text":"This is a terrible place to take your girlfriend if she has any sort of shopping addiction","useful":10,"cool":6},"lMA_PUIfkb-tPG1zBJVACw":{"text":"Great place for window shopping, especially if you are trying to waste a little time waiti","useful":2,"cool":2},"-Jwpj7_0xZvObK_3B93cnQ":{"text":"If you're used to major shopping malls, you should re-calibrate your expectations because ","useful":1,"cool":1},"Tyfm9a1BBIMAo3-9rXUxBw":{"text":"Loved shopping here!! Favorite spot was the greenery room! Relaxing and great spot for pho","useful":0,"cool":0},"XWLRyfhltQtU7zw7AWctLw":{"text":"The old Canal Place theatre was incredible. And the best thing about this mall - a fact th","useful":6,"cool":1},"SxmpThQTcF9Chw3lpUYNyg":{"text":"It was ok not really impressed at all, but if you want to sit and rest. It's very basic. I","useful":0,"cool":0},"xuvgzPqull4ixyWlwfoBNg":{"text":"Whether it's Saks, Louis Vuitton, or a stop at the Starbucks or a fundraiser I end up at C","useful":0,"cool":0},"swBihM6WoLZn8GVci_xTtw":{"text":"Did anyone else local know that Canal Place has one of the biggest Christmas Trees in the ","useful":0,"cool":0},"Iylw87jILnPVJfXaGT0FWg":{"text":"Bunch of overpriced stores, but at least the AC is cold for getting off the streets on hot","useful":3,"cool":3},"vksE6B7MF-AglO-WLudrOA":{"text":"I come here to park. Best price for a lot and it's indoors, super-safe!","useful":0,"cool":0},"zOGcU9618uIIpFCurQz85g":{"text":"The Canal Place is full of upscale shopping. We popped in for just a few moments when retu","useful":6,"cool":3},"IwGAi1kFWgVyzYPjqeBiEQ":{"text":"High end cold soulless shops.  Almost no seating (benches) for the weary shopper. You can ","useful":1,"cool":0},"UZPoQBlkG7RzEGjQapR5hQ":{"text":"tiffanys, saks, and starbucks.. i could spend all day here!","useful":0,"cool":0},"iv3Joh5NunyUJjBcCGoLAA":{"text":"A bit of a high end mall. Clean on the inside, and provides several options for the shoppi","useful":0,"cool":0},"nr62oSh5r6vSdxIFJUTpdA":{"text":"Love strolling through this Mall every time we are in NOLA. I usually have to stop in the ","useful":1,"cool":0},"De4qacblofbDuEFshMo9sw":{"text":"This is an upscale mall with stores like Louis Vuitton, Saks and many others. The mall was","useful":4,"cool":3},"8VPoP4XPrl6tqeVpalT4tg":{"text":"It's just a shopping center, similar to ones you can find in just about every city nowaday","useful":2,"cool":0},"kyAK_rVLLTU-zuQ4D-wSLw":{"text":"Simple small mall. It has a few mid-higher end stores. I just stopped by for a quick visit","useful":23,"cool":13},"T58gcZGE-Sy_KY0oOq8JMA":{"text":"Love that all the staff are wearing mask and practicing social distance through out the ma","useful":0,"cool":0},"jXoDHoaWZU1RIjwWVNuI0g":{"text":"\" Too Many High End Stores \"\n\nWe walked from the French Quarter to a medium size shopping ","useful":0,"cool":0},"vXNPe12DTjoTseuJ5wq7vg":{"text":"For a high end mall the elevators for the parking garage are horribly slow and broken more","useful":0,"cool":0},"GO7Vmmmu1m_YG9als8keqg":{"text":"Three levels of stores to shop at, connected to the Westin Hotel in downtown.\n\nI came by h","useful":2,"cool":0},"cp5X4OCl0qxpQpYvJeRhwQ":{"text":"Super quiet place across from the Harrah's casino.   I love to take morning walks and this","useful":1,"cool":2},"Y3x4X_NHx3aeBwhB2lVHsg":{"text":"Nice selection of great designer stores, friendly and knowledgeable people and a very enjo","useful":1,"cool":1},"VwoLzkGNBimyivXd85IRfA":{"text":"Canal Place is the closest mall by the aquarium and Harrah's. It gives the impression of b","useful":2,"cool":0},"sk9iZyUQBkR3m2msd-YPPQ":{"text":"This place is more useful for loitering than it is anything else, because it's so scant. F","useful":4,"cool":2},"O5PolFFjOzxcu1gKmfcOqg":{"text":"If it's high-end products and services you want, and you're in New Orleans, congratulation","useful":5,"cool":5},"ee7kQyP_2FG4XC5NqvU3cQ":{"text":"It's a mall. Just like many others. There is a good mix of high end shopping (Saks, Tiffan","useful":1,"cool":0},"hauiQR6zXQERv0HAnGWwKQ":{"text":"Saks\nLouis in saks\nMichael Kors\nAveda\nBanana Republic\nBCBG\n\nsketchy rape city bathrooms on","useful":3,"cool":2},"tuMEE3fbiMPRk1nLGf4hVg":{"text":"Each time I am in New Orleans I visit the shops in Canal Place.  I am more interested in h","useful":0,"cool":0},"alU5Cb74JA6sN9_1fD-zIA":{"text":"Once upon a time, back in my Brooks Brothers days, I worked in an office on the 23rd floor","useful":7,"cool":5},"OZt8OL2JOvdjr5SbU-SfLw":{"text":"Don't waste your time coming here. Go to the Riverwalk(down the street) if you actually le","useful":2,"cool":0},"K8_xA7jirkBISxN91chVqA":{"text":"You have come to one of the most interesting cities in the world, yet you need to pick up ","useful":2,"cool":0},"sYjgeFcEgseXaPHCWZkHyA":{"text":"Sometimes for fun I will watch the abandoned mall series on YouTube. \n\nEssentially a guy w","useful":1,"cool":0},"cht9BqJvNj53ALzRfBx74Q":{"text":"I stayed at the Westin and decided to come down and shop. There is a nice variety of store","useful":1,"cool":2},"p_dTNLCgFqYI83tzmseZ5Q":{"text":"Most women can relate to this, but when I'm in another city I always feel like I have to b","useful":0,"cool":0},"ORvlhf2XN-6Oc4yRS6yoKA":{"text":"If you want someone to help you shop the store and recommend things without being pushy, I","useful":1,"cool":0}}