{"mMpRWRMFCVCQNoM7ZMGtkQ":{"text":"Stein's is, by far, one of my favorite sandwich joints in town. They have a fantastic sele","useful":8,"cool":6},"GZsJSu9VRDmgAw9nR8GmkQ":{"text":"Everything is delicious! I recommend pre-ordering over the phone if you go around lunch ti","useful":0,"cool":0},"cx1fgz9TBrMevyUREvUWEA":{"text":"Gooooooood frakin food! The sandwiches coming out of this place are nothing short of amazi","useful":0,"cool":0},"X5EJTb2ENaWE7uZhgLoenw":{"text":"Stein's is great and honestly, i've only ever had a bagel there. They have the best bagels","useful":0,"cool":0},"6rP1fZej9UXa1_BcVnuiXQ":{"text":"The only Philly Cheese in New Orleans that is the authentic Philly you get from Geno's in ","useful":2,"cool":1},"KTgNNaqHOrzBDJdyFjbjeA":{"text":"Best deli in New Orleans hands down.  The meats are imported from Italy.  Prices are good.","useful":0,"cool":0},"RUVGvgx4OkAzkXoLF_hdcA":{"text":"Love this place and stop in once or twice a week for their vegetarian sandwich on ciabatta","useful":1,"cool":1},"22O75uGSYlaEJdfoJjU07g":{"text":"Maybe the sandwiches are good.  I made the mistake of ordimg a knish.  So awful I spit it ","useful":1,"cool":1},"IgaTKUm04Zi10aM3aa61ZA":{"text":"Stein's is always an interesting experience. Maybe it's the smell of funk and pastrami in ","useful":1,"cool":1},"aI5HbjqXyk0UEygWDFT15Q":{"text":"Had the corned beef special - one of the best sandwiches I've ever had. Would definitely s","useful":0,"cool":0},"VdLn6BsdYnZarbr7ExGsTw":{"text":"Lehaim friends! If your here try the Loxes or the Reuben like any good yeladim would! Also","useful":0,"cool":0},"6ebciGEUsMWqzV731Xb0hQ":{"text":"Been to Stein's 3 or 4 times over the years and went back again yesterday for some sandwic","useful":1,"cool":0},"V35Ko0EnfMYbBRQRD6EtLA":{"text":"A great New York Deli a little pricey but well worth it. Kind of an eclectic atmosphere an","useful":0,"cool":0},"mU88yiNJSG5Cd6xAJEklRA":{"text":"Service was quick. We had Reuben sandwiches and White Bean stew. The corned beef was seaso","useful":0,"cool":0},"rWpknx9o4OLUKr-z0Zp5cA":{"text":"This is a must stop for me in the Irish Channel of New Orleans. Steins is legit! Amazing s","useful":0,"cool":0},"AIPze5Wq7-lio2tCm875og":{"text":"Best Reuben Sandwich I've ever had....Wish they had a larger dining area.","useful":0,"cool":0},"2MK8-1jp4KiNi0ajnKjNAA":{"text":"One of the things people tell me when they visit NOLA that stick out to them is the genera","useful":0,"cool":0},"_TRP7xF94ADunVvLpUXJnQ":{"text":"Some have said the owner is rude but I couldn't disagree more.  He opened the store for me","useful":0,"cool":0},"TQ5Cu1OXE-qddlH1bixJLg":{"text":"I wish I could try every sandwich and have the bagel cream cheese and smoked salmon at lea","useful":0,"cool":0},"VoGOon5WD4stEf-yevg5bg":{"text":"Stein's is a good ol deli packed with treasures like pickles, candy, beer, and wine. Rugel","useful":7,"cool":2},"Gjd7aYw4R3ldB2tfg7j-oQ":{"text":"Another great visit to Stein's. This is a must visit every time we come home to NOLA.  The","useful":0,"cool":0},"G9c_ehIp5dYb8qYQqwAw2Q":{"text":"As a Philly native, I love the spirit of this place! The food is legit deli style fare. My","useful":1,"cool":0},"_DuPF4OH2pAmNapN2K4xfQ":{"text":"Best sandwich to graze my lips thus far in my years on this beautiful planet of ours.  Ord","useful":0,"cool":0},"kMAkm0ab-5Wtcg-s3g6hcQ":{"text":"Not much on atmosphere but the food was excellent. We had the \"Sam\" which was hot pastrami","useful":0,"cool":0},"j0u01weCYIiNM6J1nTj-nA":{"text":"Best Deli in Town!!!\n\nIt brings me back to Canters back home in LA.  The meats and breads ","useful":0,"cool":0},"KZ5TLjm8g2VloAjNs5JBwg":{"text":"I just want to say this is what service is supposed to be like. Mike at the deli was extre","useful":0,"cool":0},"VJMb_IVD2o_wNf3XrMCx8w":{"text":"Dan and his crew are awesome in every way.  They always treat me like a king and I'm just ","useful":0,"cool":0},"-1jZdixRQvzfIAjBDmze9w":{"text":"Oh god, I love Stein's. And in theory, I shouldn't because it has a lot of things that nor","useful":2,"cool":0},"OfBmPcOzUojCVHIyMr8M1g":{"text":"Really liked Stein's. It has a nice busy vibe, the food is great. Finally found decent bag","useful":1,"cool":0},"YGczadoYhWdj56ZufOycVw":{"text":"Truly a reason for my continued existence. Their bagels are by far the best in New Orleans","useful":0,"cool":0},"bIZe6ahZBg8Wr38Aa7afdw":{"text":"This is very cool and unique place right off Magazine Street next to the Donut Shop. It ha","useful":0,"cool":0},"5UDwfx9lUXB4DikmSCBVrg":{"text":"Great Ruben and Italian!   Very authentic sub shop.   Highly recommend if your in the mood","useful":0,"cool":0},"WjEUH4NnPrCF1SI48vdK3Q":{"text":"I wouldn't call this place a New York deli by any means!!! how do you screw up a Ruben? no","useful":1,"cool":0},"gvM_VmSa89a6LPwXVIDALA":{"text":"I love this place. As soon as you walk in the smell hits you and you get hungry. I found t","useful":0,"cool":0},"9s0hhVsrYCUr-VVAu1oLrA":{"text":"I'm from the East Coast originally, so Stein's feels just like the sorts of places that I ","useful":0,"cool":0},"bdHb-Ab2_rIDF7DXFMODCg":{"text":"Great sandwiches, they're pretty quick with service awesome beer selection in the back. My","useful":0,"cool":0},"ZvFIErCEx4V7vBJwc-S5Ow":{"text":"Place is cool.  I had a breakfast sandwich which was good. My husband had the SAM which wa","useful":0,"cool":0},"W4hmWCZJuWYoRy7PtthC_A":{"text":"This is a Fantastic place to eat!!! The Racheal is one of my favorite sandwiches!!  Great ","useful":0,"cool":0},"TmV4tFSGO3yAVu01T1yI1g":{"text":"Possibly the BEST beer selection in the city. They have everything. The sandwiches are wel","useful":0,"cool":0},"PdYafxotdKW7-8NkfYNYZA":{"text":"Dan asked me what kind of meat and sauces I was looking for, so I went on a whim and order","useful":0,"cool":0},"7NMyItmbVGHBbtIt_ABwxQ":{"text":"delicious turkey sandwich would have had the corned beef but I was almost in a meat coma a","useful":0,"cool":0},"Mh-Caa9rCxaitWKUctOsMQ":{"text":"This one place I can guarantee that we will be visiting again when we come back into town.","useful":1,"cool":1},"9nInGnfd8kpZzNOxrRJffw":{"text":"A funky- slightly dirty...Jewish and Italian deli that actually has really great sandwiche","useful":0,"cool":0},"O6QcxmDd7K6OJc4plF8Smw":{"text":"Makes me hungry just typing bout it.\n\nStein's wins my award for Best Sandwich in New Orlea","useful":4,"cool":0},"IJ8YQQZ8be7KKXCIbAMZ7w":{"text":"As far as delis are concerned Stein's is the best in the city. As far as beer selection is","useful":0,"cool":0},"B9ofTT0HyF9kqvHDm08Oxg":{"text":"Good sandwiches with good quality of foods. However it's expansive.\nI don't remember the n","useful":0,"cool":0},"DCqQEbqksEyqP_wnl9FWsQ":{"text":"Delicious Pastrami.  \nJust recently had a catering order with Deli Platter, Smoked Fish Pl","useful":0,"cool":0},"narqWE6PbcVKEVGz9pm3Yw":{"text":"Best bagels in town! Authentic Jewish Deli in Nola! Crowded but worth it! Much better coff","useful":0,"cool":0},"_061XoQyb_9c2PRquQt0sQ":{"text":"I love this place for its New Orleans vibe and New York style deli Sammie's. Go with a big","useful":3,"cool":1},"ML3Vc8zhF8juK8eC1JMknQ":{"text":"I have only ever had the bagels. I'm from NY and eventually need to get my hands on some b","useful":2,"cool":0},"Pk1B3GbozpLG8TX6peW2ZA":{"text":"Fan-friggin-tastic sandwiches! Customer service and cleanliness leave something to be desi","useful":1,"cool":1},"NtIHW5stFWfZedTHGciwig":{"text":"Best bagels in all of New Orleans. I'm from New York so I can say that. Also the people wh","useful":0,"cool":0},"XMGsibGLlCc3AMCUN8jrqA":{"text":"Cute, small and homey old fashioned feel. Have never eaten inside just take out. Hear the ","useful":0,"cool":0},"K9INmstJB-P2gnDymZhDlg":{"text":"My favorite sandwich shop in New Orleans! I recommend this place to anyone but in particul","useful":0,"cool":0},"SP4NLlCLKQvZo90IU_G05Q":{"text":"My home away from home. Dan and Andre are the best! The deli meat is amazing. My favorite ","useful":0,"cool":1},"bu5oPByq5n6i1ia1kgzAhA":{"text":"Dan and his crew are awesome in every way.  They always treat me like a king and I'm just ","useful":0,"cool":0},"GzeBpHxoDD27dHUunYlqmw":{"text":"After making a few trips here to get some of my fave West Coast beers, I finally had a cha","useful":2,"cool":1},"3dUGBr2WC-D-SbIxOgqZ4g":{"text":"Such an awesome place, their sandwiches are delicious!  I love prosciutto and have had alm","useful":0,"cool":0},"Cs7athiQMrJyunQ-356UBw":{"text":"Delicious and busy deli at all hours of the day. I had a Hot pastrami with Swiss cheese, g","useful":1,"cool":1},"swng9pk5lIdrt540xOHyIA":{"text":"If you're looking for a New York style Deli in the heart of New Orleans you've found it. T","useful":0,"cool":0},"E1eORmE7ZSr6Wazs68I4_Q":{"text":"Being from new York I appreciate a good deli and this one is on point.  Had a bunch of fri","useful":0,"cool":0},"q97YBfjuD1BYL7gigmp4eA":{"text":"Went to Stein's last week based on the Ratebeer recommendation and scored a bunch of outst","useful":1,"cool":0},"jdkfzLISMSYtiVCFM-QQiw":{"text":"This place is the shit.\n\nEverything I miss about NYC bundled up into one hip, dirty, crowd","useful":6,"cool":5},"SLZ2PdybYXSigeLxHW-fTw":{"text":"I loved this place.  I got a turkey sandwich that was so big I couldn't finish despite how","useful":1,"cool":1},"E07kEiZ2eLBZl7Gl7zURtg":{"text":"Stein's has phenomenal sandwiches. My girlfriend brought home a sandwich one day, but it b","useful":0,"cool":0},"3ahjWVNXL7pSIZoAfXVI9A":{"text":"I went to Stein's post-night out in NOLA searching for something to satisfy my hunger but ","useful":3,"cool":2},"aa15YMXkSmFZRiZFx5i83Q":{"text":"Great lunch there this week. Original corn beef and kraut was excellent. The beef was lean","useful":0,"cool":0},"rCtrmDXnI8koMMXQIGDwiQ":{"text":"4.5/5 stars. Very busy on a Sunday during the day - means it must be good! Lots of options","useful":2,"cool":0},"rBsAaXS23P9OvPa8kh_rcA":{"text":"I had my first pastrami sandwich at katz deli in new york city. my palette instantly fell ","useful":1,"cool":1},"sTL4uo_L8Fvsq3FvQAaVHg":{"text":"The pastromi sandwhich is amazing and all of the funny signs and posters on the wall keep ","useful":0,"cool":0},"nkeFPH6tFXB97oWhAQv9UA":{"text":"Tried the Rachel and it was very good.  Served with 2 pickle spears...perfect for the crun","useful":0,"cool":0},"0-pdL70BPJhP2UImeC9xNA":{"text":"Ahhhh It is ok but the cost is too much for what you get on average.  This is certainly no","useful":5,"cool":3},"MrxPGZGqhSGQd9uPJYit9g":{"text":"Never disappointed, my FAV deli!  The Lox bagel is so good.  This place is one of the reas","useful":0,"cool":0},"UoAOsS0kptmwUEcVZzf9zw":{"text":"The deli is small, so you may want to get your order to go.  I felt rushed to order, but I","useful":0,"cool":1},"AUsYMellzecPyM5pojx6Ww":{"text":"Stein's is the only legit deli in town and as a Northerner, I was so happy to find it.  I ","useful":2,"cool":0},"NhFssTjQifwBQEcG7At3qg":{"text":"Stein's rocks. The bagels are great. I love the bagel cream cheese red onion and lox sandw","useful":1,"cool":1},"vSqxFjwxCrMs9hVOKWI1dw":{"text":"Bad service, but a pretty good sandwich. They're trying to imitate a New York deli like Ka","useful":2,"cool":1},"erK49TD15p9QrzvcBrFCsQ":{"text":"Stein's. Every time I go in here I think \"...what IS this place?!\" Amazing LEGIT bagels an","useful":0,"cool":0},"NNsWuuj04rXfAAWiesXKnA":{"text":"I finally made a visit to Stein Deli and talk about a great sandwich. I went with a TCM, w","useful":3,"cool":1},"sdqy5CWx-jS2JGi5-f8DoA":{"text":"Is a sandwich worth $11? Why, yes! Turns out it is! After sadly shuffling away when the do","useful":2,"cool":1},"JPBUBl4ehJib3K-BcDG_3w":{"text":"Stein's is a nice mix of deli with tables, good deli meats to buy and lots of micro beers ","useful":1,"cool":0},"vUOA2Kq0V4PwD1E7ZtCoCw":{"text":"Best place to get a bagel and specialty cream cheese. The sun-dried or over-dried tomatoe ","useful":0,"cool":0},"Mw64_3YIUFvjfPlrtJS6DA":{"text":"A hole in the wall, and it seems that this is the way they want to remain, but their sandw","useful":0,"cool":0},"tunyrjtMO2ONM4d-3pazww":{"text":"I truly enjoyed the prosciutto and fresh mozzerella sandwich.  The bread was fresh and the","useful":0,"cool":0},"k1vbDsaZDs16jxhSJMepIA":{"text":"BLUF:  Most go sandwich shop.  Out of this world.\n\nThere are not many deli's in New Orlean","useful":1,"cool":0},"BNn0I4VVJnhDF8PBhBycDg":{"text":"Easiest review ever. I've been to Stein's about 100 times. Every single thing they make is","useful":1,"cool":1},"hFCJSkEZnd-126JucpLNSQ":{"text":"Yep, the Veggie sandwich, though not vegan (which I'm not, BTW), was tasty I appreciate th","useful":1,"cool":0},"IMuh6bI56w0Vijh9qudNhw":{"text":"Quick and delicious breakfast here this morning! I ordered a basic egg and cheese on a gar","useful":0,"cool":0},"klMOww5bo_pmual4lkXKVQ":{"text":"One of my most favorite places for a tasty & affordable sandwiches. They have their own pa","useful":0,"cool":0},"hLXg-cRZn98p3ep6KsqANQ":{"text":"Cant say enough good about this place. From the funny signs telling the hippies to calm do","useful":0,"cool":0},"yI8r6Peds2gvIxid3Ywjlg":{"text":"Get the Fernando! The pancetta and fresh pesto is a killer combination. The bread was warm","useful":0,"cool":0},"s-hxieRh8d1fInaeB9CueQ":{"text":"One of the best sandwiches place in town.\n\nI had a kelly sandwich--sliced apple with uncoo","useful":1,"cool":0},"7Ij6YKdrfT4zhON5OiatJQ":{"text":"The food, the people, the layout, the environment, it just all works! If you know me perso","useful":0,"cool":0},"8BE0f_t31w73e7aiuo4uXQ":{"text":"Love this place. No nonsense, great food.. and a great beer selection. I haven't had their","useful":1,"cool":0},"vA2PJioiifi4zSAcd-r4Dg":{"text":"Stumbled into this gem. Bursting at the seams with locals who love a good sandwich. Both o","useful":0,"cool":0},"zYZmMVvYxT0w98w9xMtg6A":{"text":"God I love this place... the sandwich industry Is a hard one to really make you remember t","useful":0,"cool":0},"fGOCSl5poFf_7_TS4hpBbQ":{"text":"Always a must go to every time I'm in New Orleans. Great sandwiches, bagels/Jewish deli. A","useful":0,"cool":0},"r_-ePjc5tvBgj8i8InS2Dg":{"text":"Dan Stein's Matzo Ball soup is awesome and was a hit last night at a non traditional Seder","useful":0,"cool":0},"fS7TN3s2plB0qXa_Xij5Iw":{"text":"Ok.   I built this place up cause previously when ever i went the place was closed and bec","useful":1,"cool":1},"9Mmrr8rVKqEimTjqeWZ52Q":{"text":"This place is the traditional Jewish deli. Just like something you would find up in NY. Th","useful":0,"cool":0},"esAwcuI_xmAnwA8MtsM8gg":{"text":"I just randomly walked in off the street after finding most of the restaurants in the area","useful":1,"cool":0},"sNhFq2L2EEmnd0X0t9LbsQ":{"text":"This is a real gem. They've got excellent bagels and sandwiches, plus a few practical groc","useful":0,"cool":0},"IzFFfDCRDel_qrmxLFVQmw":{"text":"My husband and I come here almost daily and we are always made to feel welcome. The owner,","useful":0,"cool":0},"NponOZOgPi7uAo0l0MnukQ":{"text":"Not only do they have great food (like the Fernando and the matzo ball soup) but they have","useful":0,"cool":0},"wkmDnfVxrsFexwxsk0nNLg":{"text":"My friend insisted we come here and I didn't really understand the hype, it's a sandwich/b","useful":0,"cool":0},"YOFm7Ws17fUp2QzUDNrebw":{"text":"Simply the BEST RUBEN EVER!!!! 6-STARS\n\nYes it's crowded. That's ok the Reuben was delicio","useful":0,"cool":0},"lTvh4rZqjTdZHZnAjiIORw":{"text":"The sandwiches we got were both really good. There was a long line and the place was prett","useful":2,"cool":3},"jlQWeBJdB2r-whNdTWt9qw":{"text":"The only genuine Jewish deli I know of in New Orleans and therefore a total winner in my b","useful":0,"cool":0},"HhdThD4SpThZ45F4kI1nsw":{"text":"I had high expectations from all the positive reviews, but the not-so-friendly attitude I ","useful":1,"cool":1},"X4xDXnjMegwhSK-zxL6riw":{"text":"love this place! and its walking distance from home.  whoop whoop. my favorite day is sund","useful":0,"cool":0},"dj0WS3OnE6OHc9Fbw0jQEA":{"text":"I love bagels. I'm originally from the northeast where people would give their right arms ","useful":0,"cool":0},"zykvoORdmNOP4Tkp9LfYoQ":{"text":"I love muffulettas. This place has a terrible one. \n\nFun decor and nice people though.","useful":0,"cool":0},"Ihf_7PMFw6nEkErAyzm8IA":{"text":"Of course we were going to come to Stein's being that it was basically the only place to b","useful":0,"cool":0},"ovwWiS-k0CysUew7i7bwRg":{"text":"I would put this place in one of the top 5 delis I've ever been to and delis are some of m","useful":0,"cool":0},"_0cDx1rAGiGt2_GLe19vsw":{"text":"It seems they are always in pissy mood here (the employees)- but I deal with it because it","useful":2,"cool":0},"jr9Hp7XKwZXP2XBkiZiWaA":{"text":"I was sooooooo happy to find this place. Late afternoon and was really trying hard to find","useful":0,"cool":0},"y1ad20x4QvmnueYinBy1kg":{"text":"Went for a bagel and cream cheese. If you've ever lived in NY then you know better. I wasn","useful":0,"cool":0},"zFCXBTuZ1xmoyVxPFw08Pg":{"text":"If this is a four star Deli I'm afraid to eat at three or, God forbid, two star. The $13.0","useful":2,"cool":1},"_KSZsuLQXsCYogFp9U6ClQ":{"text":"Super tasty. If you're looking for a good sandwich get it here. Reminiscent of a good jewi","useful":0,"cool":0},"5-RiBn0Wumba_IHWVcdx0A":{"text":"In a city full of po'boys, Steins has your sandwich cravings covered.  Bless the cold cut ","useful":0,"cool":0},"VYwqooikRJXf8kYNEp7XoQ":{"text":"first badass thing about Stein's is that it is around the corner from our house.  we walke","useful":2,"cool":1},"nq7iNtB64Mg5nrrLPM5m1g":{"text":"I have been living in New Orleans for a couple years now and I have been absolutely cravin","useful":1,"cool":0},"iseejks-gnF-6GOLNeGRHw":{"text":"The sandwiches and bagels are so damn good. Pickles come with every sandwich and those are","useful":0,"cool":0},"gGHs3cEQFgNsOtPAArGIvA":{"text":"This is the kind of place where you want to put in the time and become a regular.\n\nSure, y","useful":5,"cool":2},"VdefqMkY35b5K306kN8HXg":{"text":"Try the Meat and Cheese tray. It was Awesome.\n\nBLT bagel with avocado. Out of this world.\n","useful":0,"cool":0},"JI0e_E8KCCeJ2-FMfipKww":{"text":"Solid all around deli. \n\nFor being so popular, they were fairly fast and the wait was well","useful":0,"cool":0},"ySPvxw7z5EO-gLQV16Ecsg":{"text":"My goal in life is to get Dan to like me. Dan if your reading this, I swear I'm cool!","useful":0,"cool":0},"cDknzCGz1RUt3VQJjDpb_g":{"text":"Just had the veggie sandwich! One of the best I've had!!! And the pickles on the side were","useful":0,"cool":0},"jdhyOArLtwadC_lwnr2kiw":{"text":"Stein's is the bain of my existence.  I moved nearby two years ago and every time I try to","useful":0,"cool":0},"n7pDVsB-twnr5Zmqq9AE3Q":{"text":"A stop every morning I am in New Orleans. Bagels are the best I have had outside of NYC. G","useful":0,"cool":0},"26dk2yLC2qMNfe5ZNstUUg":{"text":"Stein's is the king of deli's in New Orleans. From the great quality meat and cheese, to t","useful":0,"cool":0},"qlizKEryQfL_YEOQrYq7dg":{"text":"Best coffee in New Orleans and quite possibly--ever. I absolutely love everything about th","useful":0,"cool":0},"Nb7K9stQGPxDk2j3DvOEfA":{"text":"Adhere to your hours listed, we set aside a time to come when your hours show you are open","useful":0,"cool":0},"NQNpKCbUs_-c6DhhRdJvag":{"text":"Wow! Double Wow, this place is beer paradise! Lots of hard to find Belgian's, De Struise, ","useful":0,"cool":0},"ClTjxq1cGCjB87o8gnKVUw":{"text":"Absolutely delicious, I'm in love! We came for lunch and gawked at their menu; Everything ","useful":0,"cool":0},"Vn3UL9CPKAkZA9Icr3pnLA":{"text":"I know I live in New Orleans and there is a boiling pot of different foods to have, but th","useful":0,"cool":0},"L3ePnoTehFhvEsc_851SUg":{"text":"I'm a regular at Stein's and though I was previously gung ho ape shit about it it seems to","useful":3,"cool":2},"P2R0TIMS9udd0TshJgAvsg":{"text":"Somewhat pricey, but dee-lish. Corned. Beef. Special. TRY IT!\n\nAwesome grocery, drink, sid","useful":0,"cool":0},"ajWsSzpOfeNBwucpaNPBzQ":{"text":"I'm from NY so of course I had to check this place out. They have some NY deli staples but","useful":0,"cool":0},"xoMyXcM3zJ9zT_IzcVfeOA":{"text":"After living in NOLA for 2 years I finally made it to Stein's and I must say I was not let","useful":0,"cool":0},"ipMOk9U9Dauhx4r2yb-PBg":{"text":"The Robert. Oh my gosh. \n\nRun to Stein's right now and buy The Robert. That is, if you lik","useful":5,"cool":3},"HmSpEQ7ZQfC32g5sk7FFsQ":{"text":"I can't believe I have been living here 2 years without ever eating here until now!  As a ","useful":1,"cool":0},"2w-a9fCkhmz6NPNzIuNM7w":{"text":"My favorite place in NOLA ate there 5 times in two weeks. Great beer selection. Great musi","useful":0,"cool":0},"hsQ5e-MNSJLEzOHSUOEfUw":{"text":"Stein's is my favorite place to go on Saturdays. They have amazing bagels, good coffee, an","useful":0,"cool":0},"w0vONQsgh8OxeqP3F9CLKg":{"text":"Can't believe that I haven't heard of this place in the 3 years I've lived in this city. S","useful":0,"cool":0},"IAxpedMKkLaED1FuOXltgA":{"text":"Simple and amazing! Steins is an awesome old school deli. When you walk in you're in a gro","useful":0,"cool":0},"YizAS6bcRuF7CQpTBou_1Q":{"text":"Walked in here and felt like I was in a New York deli. Cool place, cool vibe, and deliciou","useful":0,"cool":0},"-GSdX0_fFgcGLuTvYnXSOw":{"text":"This is the only thing that slightly resembles a Jewish delicatessen in Orleans Parish. Da","useful":1,"cool":0},"JNXeDlzr0z9_qm6z6hs2Dg":{"text":"This is a must go to deli in New Orleans. They have the best gourmet sandwiches and select","useful":0,"cool":0},"dtIGsfHhFg_-INQIJX-twA":{"text":"In the heart of the Garden District, this industrial specialty market is a CANNOT MISS. We","useful":0,"cool":0},"xjDg0z7_mg4oCRSF3guhIA":{"text":"A smiley and jolly staff for the win! The owner is the sweetest! \nHands down the MOST CONS","useful":0,"cool":0},"-U9i8omQhu_PP1TmsBqNmg":{"text":"The pastrami sandwich is sooooooo delicious and the service is great.  Very personable peo","useful":0,"cool":0},"HJXG_B9SYYpdbcbNkXIufw":{"text":"There's no need to be a jerk to look like a New Yorker. Maybe the person who runs this pla","useful":0,"cool":1},"hU0394VxYRxE7ALjWTqajw":{"text":"Finally got me some deliciousness from Stein's. I had been here once before for a Hush Sup","useful":1,"cool":0},"RNdZCVP2Sr___-I7tYJM3A":{"text":"Great food and awesome craft beer selection for this area. Highly recommend checking them ","useful":0,"cool":0},"B2m_jFRlCo0FkR_mrfUCzA":{"text":"Ok this place is rough and unique as it gets.  Sandwich is like nothing on earth.  The pas","useful":0,"cool":0},"0HmriJCimholanvnLkLSgg":{"text":"love this place.  over the top selection of beers, and sandwiches...  I've never been disa","useful":0,"cool":0},"ekvYzalmtzbzmLdbNJP_Zw":{"text":"So much potential! I was excited to try this place based on the great reviews. I loved the","useful":0,"cool":0},"kkGwE7eRemARMnqxnR_0-w":{"text":"New Yorker by birth so I know delis, like my whole life already. Reuben and all the variat","useful":0,"cool":0},"JBBfi2L5ee2OAmNFBpTQtA":{"text":"Wanted to like Stein's.  Went there one rainy day only to be verbally abused by the suppos","useful":11,"cool":3},"JkxMCXztTAB9GLNeUNgFow":{"text":"Mmm. House made foccacia that crumbled as I sank my teeth into a turkey pesto sandwich? Su","useful":0,"cool":0},"N-og5OM6pf9kQypmkpFKBw":{"text":"Amazing sandwich place. Go here at least once a week. One of the guys making the sandwiche","useful":0,"cool":0},"3bgVohZOL2hd34xOJ3yWbg":{"text":"The best non poboy sandwich in New Orleans by far, the only place that is on the same tier","useful":0,"cool":0},"u2s0sN3Mfb4dherYG1GKEA":{"text":"My increasing addiction to Stein's has become a problem.... a serious problem involving de","useful":0,"cool":0},"S-XqIg2aCEMIk0J16GKsXA":{"text":"This neighborhood gem has become increasingly popular since it was written up in the Lagni","useful":1,"cool":1},"McqegbJtW9O2mQ6nltkvDg":{"text":"My rating here is based on the service, and honestly I thought about dropping it another f","useful":1,"cool":1},"uxwpvEDLM_S5zQ6Qik8_Qw":{"text":"This place is rough around the edges and the staff have that NY attitude, but that gives t","useful":0,"cool":0},"5NxcUntcjEbpvCoxpUk-9Q":{"text":"Let's talk about sandwiches. Sandwiches and I are cool. I'd invite them to my party, howev","useful":12,"cool":9},"bTvS5Rzn-i7v5QYqARjfDw":{"text":"Had the best iced coffee of my life here today. This place was recommended to us out of to","useful":1,"cool":1},"yx6DGWnkfXVnNHy2J33LqA":{"text":"We fell in love with this place immediately, the sandwiches, salads and the homemade salad","useful":0,"cool":0},"C650THjH7y0K0Ll8xJAxQw":{"text":"Best Bagels in New Orleans-for sure!! Everything Bagel-scooped out, toasted with butter! S","useful":0,"cool":0},"CBy96n2WPCUY4zIwSdhTCA":{"text":"Went here and got the corned beef special!! Yum yum. They are very busy and the line was p","useful":0,"cool":0},"qL3GwEXhVzlws16rl6ReDA":{"text":"It's cramped and you might have to sit next to a perfect stranger!  I love that aspect.\n\nQ","useful":2,"cool":2},"RQX4jCj23leWIpVSnf2SgA":{"text":"There are countless places like this in NO and they are all consistently amazing.  The san","useful":0,"cool":0},"L7wdQEsIkXX6i-YgxCLbuQ":{"text":"We ventured here on a local tip from our coffee truck barista... it's their usual hangout ","useful":1,"cool":0},"bcFqg3s4F4BFszpoWF2hWw":{"text":"We stopped in prior to going to the airport and heading home.\n\nTheir beef tongue and chopp","useful":0,"cool":0},"wQepdsZV21n8tymJ338qpA":{"text":"Great sandwiches here...at least the two that I have had.  I have dreams about the Tuscan ","useful":1,"cool":1},"JKh3L2Pp6yXFA9rBlCiBJQ":{"text":"Just had the Reuben, amazing flavors, tender meat, so filling.","useful":0,"cool":0},"J2ncZSEHuLOVQGmHf_rw2g":{"text":"It took longer than it should have for me to find this place, but better late than never. ","useful":0,"cool":0},"4AMnK3_MSz8drWt76JjK5A":{"text":"Its about time I updated my review since I have been here a couple of time since my last r","useful":2,"cool":0},"uq7oEi0OdFRx_PwfmkeG6A":{"text":"I love sandwiches!!! Especially ones where most of the ingredients are made in house! I ca","useful":1,"cool":1},"9NRX2phcguOLota6Qtd5lQ":{"text":"People forever shit on Stein's for the rude and sarcastic workers, but honestly, that's th","useful":4,"cool":2},"WuAhCLxQW4hle7SG03XvqQ":{"text":"My taste of where I grew when while on vacation. Not only only was the Lox and Bagel spot ","useful":0,"cool":0},"SvX_TSCZR17jsjXY_HO3rQ":{"text":"Whether you are a Jew looking for some food of your people, or a gentile in need of a good","useful":0,"cool":0},"ZGuVMdab5xR-_kTLguS-aA":{"text":"5, 5, 5, 5, 5 stars all around. Love this place. You walk in and you are immediately ready","useful":0,"cool":0},"JTpYZ9UBejD_bNSdAL4d-A":{"text":"I'm an old Jewish man from New Jersey. Well, not that old that I have a daughter at Tulane","useful":0,"cool":0},"1eO40-Ce_WrwtpI3pf1Blg":{"text":"Stein's is my little oasis of Philadelphia, my little Phils paradise, my little Jewish del","useful":4,"cool":3},"AebseItwQAXQoKRKKOLNaQ":{"text":"AMAZING sandwiches. Perfect place to grab a sandwich for lunch and love every bite. Great ","useful":0,"cool":0},"hW54UNRt39khmNyrJsgpMQ":{"text":"Absolutely amazing! I'm addicted to the Foxy and The Rachel, but they start with awesome m","useful":0,"cool":0},"OjaIWsfr99Y6S2GPPkmzDg":{"text":"The staff can be a bit particular, and the prices aren't low, but the food is delicious. T","useful":2,"cool":0},"AbWBlCtHx_Pyd0d2rmmn7w":{"text":"Best non-poboy sandwich shop in Nola, Stein's is one of the most authentic Jewish-style de","useful":1,"cool":1},"PR24h-NsQb2LY4Wl1tHJwg":{"text":"This is the best deli in New Orleans , period. Fresh and quality products, all the special","useful":0,"cool":0},"ejhpcOhsS9WRUWdsk_4ClQ":{"text":"The first time I tried to eat at Stein's was a sunny Saturday afternoon. The place was pac","useful":3,"cool":3},"A1wM6UNRORGtWhOHSmFtfQ":{"text":"Loved my breakfast bagel here....so darn great i have a new favorite breakfast spot.  Than","useful":0,"cool":0},"841RuBUGhycCHB5YLgDpWw":{"text":"Absolutely delicious. I had the Rachel for lunch and I can't wait to go back and have it a","useful":1,"cool":0},"4EhoDz4CZ89FZkiLmfg5AQ":{"text":"The place was packed and I ended up smelling like the kitchen, but my sammich was well mad","useful":5,"cool":3},"JpjIeJbE-321jtC5EMraRg":{"text":"Stein's is an exciting place to visit. Oogling over the meat and cheese is a must; it's li","useful":1,"cool":2},"YLmePxqRAZR0X_o1NKsDkw":{"text":"BAGELS. Stein's and Laurel Street Bakery are the only places I've found to get real bagels","useful":2,"cool":1},"1fn4cgffzTqvAtTszQXNkA":{"text":"The bagels are great here, but that is all I have had so far. The only negative I can thin","useful":0,"cool":0},"ebjru9_ud_HUnmOkvJDosA":{"text":"Amazing deli for sandwiches or bagels. Too many choices but you can't go wrong with any of","useful":1,"cool":0},"AFb8BSTsH7YodCCd6U133Q":{"text":"Best deli in town. I'd marry their sandwiches if I could. All the meats, cheeses, and brea","useful":0,"cool":0},"tGjzHbwlf7Gm2AsrVzlAaA":{"text":"Best spot on Magazine St!  I eat there almost every day.\n\nThe daily specials are amazing. ","useful":0,"cool":0},"Y4-1aG639pznosPN7KCBWQ":{"text":"Okay...I went to this place because I found out they serve Italian beefs which I haven't h","useful":0,"cool":0},"44oqU912fFd68Z_ff8H8tg":{"text":"I had the Rachel.  Quite simply one of the best (if not the best) Reuben/pastrami sandwich","useful":0,"cool":0},"LRmXzOd_M3DRq3k8M9DfpA":{"text":"Bagels are great, and for the most part so are the sandwiches.  Muffuletta left something ","useful":0,"cool":0},"74PfjAfyis3RiyJ4frWdlQ":{"text":"In love with steins. This place always always always makes the list when I'm in NOLA. Whic","useful":0,"cool":0},"05A5KdVuZBvkA4MHuqZGkQ":{"text":"Whomever swears that you can only get a good deli sandwich in New York City should be shot","useful":12,"cool":10},"JeE2qK1laAqDkR-7VsgZLA":{"text":"I can't wait to go back to NOLA and eat here again.  He had the Italian hoagie and I had t","useful":0,"cool":0},"VZtLX4zoNJqzNyVN9BEZeA":{"text":"Can't believe I haven't written a review on Stein's yet.  We used to live on Stein's when ","useful":2,"cool":1},"eKbxAVOB8Le-mel7fIC4Uw":{"text":"Went there yesterday for the first time.  I could sit here and wax on about how the place ","useful":6,"cool":1},"3bZoQhWyhaFTU3Sf2JPWYg":{"text":"Stein's is a hidden gem.  When you first walk in, you are hit with a strange smoked meat s","useful":0,"cool":0},"0fa9xAT0nlWkKStoKG0abw":{"text":"Sometimes, all you want is a damn good sandwich. Stein's always delivers. It's not an amaz","useful":0,"cool":0},"cXI2zYl2fTyKUR4q-mri-A":{"text":"Dan Stein is king! You can't really go wrong here. My top picks: Everything Bagel with egg","useful":0,"cool":0},"Evq71-ghxYxbu9fuvf1l2g":{"text":"I don't think Rachel below me has ever visited north of the Mason-Dixie line. Stein is fro","useful":1,"cool":0},"LGmOR2Q_OZC351BUGGjsMQ":{"text":"I love this place! Everything on the menu is to die for but I love going here for the half","useful":0,"cool":0},"e3lAmZzlXIoW7Ik5MVSrYg":{"text":"Stein's is simply the best.\n\nGenuine \"sandwich\" shops are few and far between in a city th","useful":1,"cool":1},"KM9hEAJ7k3Xa_o8hmVeDsA":{"text":"I always stop in Stein's when in town for breakfast and get the egg, cheese, and tomato sa","useful":0,"cool":0},"ZUpJByL9DwNgJgBbvQKWsQ":{"text":"Steins is a surprisingly delicious diamond in the rough. In passing it seems inconspicuous","useful":0,"cool":0},"kgsgZyTpyr_hMYUe4DFIpw":{"text":"Sunday morning lust for salt and alcohol placed me at Steins Deli for the first time.  I w","useful":1,"cool":1},"MyiPQDCJBniCHEFFF3ZE6Q":{"text":"I don't mean to be too pushy but bottom line - if you don't go here while you're visiting,","useful":0,"cool":0},"8PAJ03UrPRJ1rqCd-3_GHQ":{"text":"This place is alright the sandwiches are great but the service is poor. I did think the ba","useful":0,"cool":0},"6YWn79T0jbU_wUmQtUQU9A":{"text":"Oh MAN. this place is incredible. Freshest sammys, giant portions, the beer selection in t","useful":0,"cool":0},"Q4nHFV3-KCTbmhuRutP9sA":{"text":"I've heard a bunch of great things about this deli so today I decided to grab some quick t","useful":1,"cool":1},"DcB1Rf5TU2id2sWOxxbnYg":{"text":"i wanted to like this place b/c other people i know rave about it but then again i dont li","useful":1,"cool":0},"N3sIiSCPUVOBy6ssRDm4UA":{"text":"Someone brought me here knowing I was a vegetarian. He was a vegetarian too, so there was ","useful":0,"cool":1},"EDWZIBmxxm48twIaDEmf6w":{"text":"Get somebody to answer the phone who can take a to-go order without being an asshole. Luck","useful":0,"cool":0},"SDmfFnIY-sM_7JW-eV1rGg":{"text":"Casual, comfortable atmosphere. Dan & Andre are personable, welcoming and always make me f","useful":0,"cool":0},"1RzgzLwzAKJFGqrU8MG65g":{"text":"Their Ruben Sandwich ties for \"Best Thing I Ate While in NO.\" I usually never eat cows or ","useful":1,"cool":0},"PnZNJfY_iTbm9Ptb-He3HQ":{"text":"Best Ruben sandwich I've ever had...better that those I have eaten in NYC. Not as much mea","useful":0,"cool":0},"VepoK3_RrE105iBYAuFbfw":{"text":"Although the food was OK (my sandwich did not match the board's description), the guy behi","useful":1,"cool":0},"MzT77MfJPcAMNFiiYx1BlQ":{"text":"Great deli, ordered the tongue special. Loaded with thin slices of tender tongue, slaw, ch","useful":0,"cool":0},"DR4hnNpJd3cFyVHYEPlbFA":{"text":"I wont go anywhere else for pastrami ever again! This place has amazing sandwiches and alw","useful":0,"cool":0},"j9WLAG_cXcN8CjdHfCp-Mg":{"text":"Great sammies and a really chill vibe. Feels like Brooklyn in here.\n\nNice selection of chi","useful":0,"cool":0},"MrTLm-WTApqwpAOnTsaaiA":{"text":"These guys rock this thing called a Sammich!!","useful":0,"cool":0},"UUIFPly-luZ8X9J7wpT27Q":{"text":"A taste of home for transplanted Northeasterners! The bagels taste like you bought them in","useful":0,"cool":0},"IYTPVKSOsmtpYoh-VikyjA":{"text":"Stein's staff definitely has a \"we were cool before it was cool\" attitude. Maybe some peop","useful":1,"cool":0},"vSbsElqiWIEtDjTIUrNhww":{"text":"If you're looking for the best non-Po'boy sandwich spot in New Orleans, just stop here. Th","useful":0,"cool":0},"Tk5q3K3P8-HQiaNy0qseYg":{"text":"What a change. Have not been in several years as I hated the cramped area and getting yell","useful":0,"cool":0},"0BlkqejYZqn09s0ROvuYRw":{"text":"If you're looking for that great sandwich place in nola go here! I love there Reuben it is","useful":0,"cool":0},"phyb4u-vDSGEZtvjV2tE9A":{"text":"Italian beef sandwiches, bench seating, one of the best bottled beer selections I've seen ","useful":0,"cool":0},"QHhQDck1GoCZnXnWGsmiRQ":{"text":"The beer selection here is top-notch for New Orleans.  Whenever I'm in town I try to find ","useful":0,"cool":0},"Tqj7LxN-ccj1Cv2eFmZ2EQ":{"text":"They had me at \"specialty meats and cheeses\". Steins is an authentic Jewish-Italian deli &","useful":0,"cool":0},"TdG74c1Pcu_N6lh45aK7fA":{"text":"What more can you say about this place that hasn't been said already? Sam sandwich is ridi","useful":0,"cool":0},"ZArgmmJwz9ru1qpk8MymsA":{"text":"At steins I always get the jewish standards I grew up with and I am never disappointed!  T","useful":0,"cool":0},"gsAZGFTWLjCvuGgC2CWo-Q":{"text":"If I lived in New Orleans, this would be a stop for sandwich craving days! Ample selection","useful":0,"cool":0},"qzjM8vNlGPGYXZrvFQjmXQ":{"text":"One of the best sandwich places in New Orleans. Everything I have had has been delicious..","useful":0,"cool":0},"ewVCLLGJLJVjbMa2WJaAnQ":{"text":"Best lox and cream cheese bagel outside of Philly or NYC.  Great bagels!  I love Dan.  Kee","useful":0,"cool":0},"T8QKfnTHV8aWBW99AJI1_Q":{"text":"Two words: Le, Git.\n\nCranking delicious no-bulls!t sandwiches.  Skip Subway; Stein's is yo","useful":0,"cool":0},"BGtOFLjLpHKEkr59IF0y7A":{"text":"Nothing short or amazing!!! I ordered the Vegetarian on Ciabatta with no cheese! I'm full ","useful":1,"cool":1},"7ETN6AsOICQHpMY61PnMpg":{"text":"The best Reuben I've ever eaten!!\nGot a Reuben and a Rachel (a Reuben with pastrami instea","useful":1,"cool":0},"d-2kwCorcawfxOjZLKnvHA":{"text":"Real East Coast style deli with THE best sandwiches! Get here now. Plus cashier guy has Br","useful":0,"cool":0},"jp0rb0Y6KvCxwXrErMC_Qw":{"text":"Oy vey!  A real Jewish east coast deli (Philly to be exact) in NOLA!!!!  Finally!!!  Had t","useful":0,"cool":0},"Co6meZiWujB7ySfEZqbylg":{"text":"Mmmm. Tasty Rueben (I substituted turkey for the corned beef). The sandwich was huge and p","useful":0,"cool":0},"wsC5evhRaNeO62rqciNIfQ":{"text":"I usually don't leave reviews, but this place was THAT good. Everyone I come here I'm neve","useful":0,"cool":0},"0dSGQksPYoCOWFWdIxhYDQ":{"text":"Yum!!!  Love this place.  Everything on the menu is delish but my favorite is the Tuscan P","useful":0,"cool":0},"blPdTSjEXYqoQ5xY0zgvNg":{"text":"Sandwiches are just sooooo good. Loved the pastrami. Love the freshness of the meats. Bage","useful":1,"cool":1},"F0CeMtRo6SVTaMTHn4WGbA":{"text":"Coming from New York where delis are just something we take for granite. Steins is a littl","useful":3,"cool":1},"xL3rCi5OoWt88b3ZaxldVg":{"text":"Just had lunch at Stein's for the first time today. Great sandwich. The customer service l","useful":1,"cool":1},"Udkbp2kUzUKxtlUNNfOP9w":{"text":"I am a HUGE fan of this place, always a bit of a wait if it is lunch time but it is surely","useful":0,"cool":0},"EP4a3C3qtmWAnfeQRZ6R3Q":{"text":"Stein's made the Yankee kids happy with bagels and the Yankee grownups happy with knishes ","useful":0,"cool":0},"vvOjqKFEEV3XI_cVvQX-2w":{"text":"People are friggin crazy.  They come up to me and say \"Smoky, you're leaking feces on the ","useful":4,"cool":3},"C_tk16lNO3jblJ_Qp4fo9w":{"text":"It's not very New Orlean-ian but Steins makes my life in New Orleans much better.  They ha","useful":0,"cool":1},"kiH7aIVmDc5GVG8beux_BA":{"text":"Had Stein's a few months ago and must have gotten amnesia, because I decided to go back to","useful":0,"cool":0},"wb_kubL93lQ33rsVj3L1dQ":{"text":"This place is awesome the staff is cool and food is great plus good selection of beer","useful":0,"cool":0},"C_lh-llR5VVW0yzVV1gN1w":{"text":"Thank you, Gods of New Orleans, for giving me Stein's and their delicious, life giving bag","useful":0,"cool":0},"iOVfgpkjtX8YR6-4tWKG4Q":{"text":"So happy that we have a Jewish deli in town, and a BOMB one at that.  Bagel sandwiches are","useful":1,"cool":1},"rSa7bHDousowqCIumbmrfQ":{"text":"Yeah the sammiches are good but who cares when there is SO MUCH GOOD BEER?  Have you ever ","useful":4,"cool":3},"3WzQYxta1vohr0cMD69nBw":{"text":"New York deli with great character classic for NOLA.  The Reuben was amazing!  Highly reco","useful":0,"cool":0},"-d0rN3q8s8gcLApxjyaWyg":{"text":"This place is amazing. It was packed when we went in, but we still didn't even have to wai","useful":0,"cool":0},"uBtfOa-Mo3bbRVjQJ4Iy7w":{"text":"The corned beef with coleslaw is incredible.  Wow.  I can't stop thinking about it.  The I","useful":4,"cool":2},"qcLyN1c8engnkJSEi-X6Ng":{"text":"I heard good things about Stein's over the past couple months. I finally had the chance to","useful":0,"cool":1},"ZYTQlSEGpPs26KNUwUgx_A":{"text":"Amazing pastrami! I had the Chicago Italian beef, and it was good, but next time I'll stic","useful":0,"cool":0},"tDkCkSbaQL5QEEZCMbFv5Q":{"text":"Amazing sandwiches of all types, and you pay for it ($9 approx). They sell bagels and othe","useful":0,"cool":0},"PqdNp4dQ-dI0Yx14_GkHog":{"text":"Found this place on accident while going on a recommendation for the place next door. I or","useful":0,"cool":0},"iVV-bI5-AnRIj9Rfk_g7AQ":{"text":"Great deli. My favorite spot for a sandwich. The food comes out fast. If you like beer the","useful":0,"cool":0},"Pv_8ZCOylrmGZePhwbR4Nw":{"text":"I used to live one block away from here between First and Philip several years ago but for","useful":1,"cool":1},"AAn80BAifmJ62dNoroidMA":{"text":"Great beer selection, unique atmosphere.  It can be crowded, and you'll wait in line, but ","useful":0,"cool":0},"a8kfMGpa54mFTp5UjjRM0A":{"text":"Great bagels. Ruben is great.  But, I have to have the Bagle with lox, purple onion, caper","useful":0,"cool":0},"S9Yqz1w6iQDQAOh1NNvTAA":{"text":"One of the few places that I've been to in New Orleans that serves an amazing Reuben sandw","useful":0,"cool":0},"uzGlhIAHu7VC2DWgo96ygg":{"text":"Tired of po-boys?  Want a change?  Go to  Stein's!  It is a great place for deli-type sand","useful":1,"cool":0},"cKM5nfDrHjfuSuApRXUbbQ":{"text":"My review will be simple. Stein's is the absolute best place to get bagels and New York st","useful":0,"cool":1},"J5qQ6FIHaUMP6u9zZ35c-w":{"text":"Had the vegetarian panini. It was delicious, and my friend's Reuben was awesome as well. 5","useful":0,"cool":0},"7QkWn8ia9FDASunc5K45Lg":{"text":"Po' Boys are good when you buy em from Guy's or Crabby Jacks, but Stein's is a next level ","useful":3,"cool":0},"aUrY_xo6G6VZdfsR1VbEvQ":{"text":"Hands down the best bagel you can buy. Try it with the lox (smoked salmon) and you won't b","useful":0,"cool":0},"7U6p9V1LeWDF8HthtF6HQQ":{"text":"it felt like you were eating in a grocery store. there's not really a lot of places to sit","useful":0,"cool":0},"TsjYzEtoKg9hqdlobTR7kQ":{"text":"Omnomnom! Hot pastrami with Swiss cheese, grilled onions, and mustard on marble rye. It's ","useful":0,"cool":0},"0OY3xPnNIaEg9BArZdBCkg":{"text":"My husband and I love New York sandwiches. We were glad we found Stein's because it's the ","useful":0,"cool":0},"49NSEHqldbaisZShagXJbA":{"text":"We went to Stein's on a Friday afternoon and even though it was around lunchtime it wasn't","useful":1,"cool":1},"LIw5W0CiTAHinTbrmpWm_g":{"text":"Good sandwiches in authentic deli atmosphere. Crowded, good smells, weird options. Pastram","useful":0,"cool":0},"XIQ7woZfv2lC6DzcN3ISBA":{"text":"Stein's is the real deal.  \n\nI grew up in Noo Yawk and lived in Philly for three years, so","useful":0,"cool":0},"kom2KDrrQhoNbht75gZaiQ":{"text":"very good.  Too economical for 5 stars, but in its league, it is a 5 star keeper.  Its not","useful":0,"cool":0},"vykdBSERtuEcUpTeLoCo6g":{"text":"Freaking delicious. Words can't describe how mouthwatering these deli sandwiches are. I go","useful":0,"cool":0},"GHmyVsdfHEe6jV3lJeonTw":{"text":"Fantastic food. You truly can't go wrong with any of the sandwiches. Small inside and can ","useful":0,"cool":0},"EpDXdszlDB9awWZyUTPH2g":{"text":"What a great sandwich joint on Magazine.  It's got great deli appeal and great sandwiches ","useful":0,"cool":0},"JHvserjEXmOBwNZgjkegYg":{"text":"Oh, Stein's. If I could enjoy a Rachel with mustard instead of whatever dressing you use, ","useful":0,"cool":0},"FTLuuA-ctU-ZnvFgxbnGiA":{"text":"Came here the other morning to grab a half dozen bagels for a pre-grad breakfast and was g","useful":0,"cool":0},"J7c7tYlKLukPhvL6XY5N3g":{"text":"The best deli I personally have ever been to in my life. Delicious potato salad, insanely ","useful":0,"cool":0},"SGpGVMMvdx84gGhI6idR5w":{"text":"My favorite place to get bagels in New Orleans! Food is great, service is great and I neve","useful":0,"cool":0},"jMU6B645HCC76el67J3ADw":{"text":"We accidentally walked in, looking to buy a cold drink.\n\nand ended up sitting there for ha","useful":0,"cool":0},"fQ3y1XkODC38TmqN42moMw":{"text":"This place is delish. I usually get the Reuben or the Meatball Sub.  The guys behind the c","useful":0,"cool":0},"cziii3Ln3Zod6ZOJAgQxjQ":{"text":"Goodness gracious this place is delicious. It's a shame the sandwiches are a little small ","useful":0,"cool":0},"sfc-p44z6UNGR9CG_lJnNA":{"text":"Absolutely delicious Reuben. Wednesday's special was more similar to New York-style where ","useful":0,"cool":0},"18n47DN9F1vHIDSvVNRiaQ":{"text":"Went for a late lunch ona Sat.  Ordered a hot Pastrami on rye.  Great sandwich only compai","useful":0,"cool":0},"mMOgytQy-k7YnzErFakrJw":{"text":"Breakfast. Lunch. Sandwich. Bread. Meat. Cheese. Deliciousness.\n\nAn interesting thing happ","useful":0,"cool":0},"MvRk-j8tG4Irk_U8gUKO-A":{"text":"I enjoyed every aspect of my dining experience at Stein's, y'all.\n\nThe Reuben was tasty as","useful":0,"cool":0},"3oJJVZTL68B7DhYJaDlu1g":{"text":"Good bagels,  great sandwiches and probably the best beer spot in NoLa.  The beer storeroo","useful":0,"cool":0},"ZhAkaVGmzapf_Ri-thNGuA":{"text":"My life was incomplete before I took my first bite of a Robert sandwich from Stein's.\n\nPLU","useful":1,"cool":0},"zNOaHEieq9pDD9refJKYPQ":{"text":"This is a nice little place to stop for lunch if you are down on Magazine.  They have an i","useful":2,"cool":0},"gEYEr7bW4-cQoK1BN2YhTA":{"text":"I love a really good dive.\n\nSTAFF- All business, not rude, not polite.\nFOOD- Great Sandwic","useful":0,"cool":0},"_B7jrvSWz9ebas3ydnlJPg":{"text":"This place is delicious. Granted, I only get one thing when I go (Bacon, egg and cheese ba","useful":0,"cool":1},"JfXB96nitTaNqovpsdojHA":{"text":"I didn't order food here. The interior was bit random. They got a shelves of beers in fron","useful":0,"cool":0},"po3qgg_j2OFrYln1UYDB3A":{"text":"My mouth just waters thinking about this place. \n\nThe first time I walked in, I was overwh","useful":1,"cool":1},"sxp_Ad2MUG6itvB8Y7lRVw":{"text":"Best deli sandwich in New Orleans! Our group had four different sandwiches (including a mu","useful":0,"cool":0},"eQmPbp3N8rms7VG43Ch61w":{"text":"Yes, yes.  Another five star review.  I just don't have time to review bad places.\n\nIf you","useful":2,"cool":0},"nE3Vt_OXztLlkHf6-YlA_w":{"text":"Sandwiches are always full of flavor and the house made pickles pack a puckering punch. I ","useful":0,"cool":0},"3QlyLVBEEIkJ5D0GOCRT_Q":{"text":"I was out and about in the NO getting my exercise in and walked by Stein's. I remember see","useful":1,"cool":1},"HHX_H4Pcb0AMHs4IGCf11w":{"text":"I fucking love steins. Best bagels breakfast in the world AND they are super funny. The co","useful":0,"cool":0},"zmc0lKE5IChSwRR1POnhSA":{"text":"Bagels: 10/10\nFinding the beer room: 4/10\nBeing in the beer room: 10/10\n\nThe bottom line: ","useful":1,"cool":0},"ZgbwEB1_sX5jBK7AMGMiVg":{"text":"Love going here with family or friends!  Fantastic Northeastern deli. The Fancy Schmancy C","useful":0,"cool":0},"9jIIBs6fBDRvEKDdscCXFg":{"text":"Coming from philadelphia, I appreciate how quickly this place takes orders and makes the f","useful":0,"cool":0},"MNBVzJDFklzlNspzvch5vQ":{"text":"This place speaks for itself. So I won't say anything but..\n\nRachel. Marble rye. You won't","useful":0,"cool":0},"CSwraLRHyeHutHD09SVw6Q":{"text":"This place is as popular as it always is for a reason. The quality of food/meat is extraor","useful":0,"cool":0},"BBwnNWmYU0cRbVSAzqKhqg":{"text":"What an awesome sandwich shop!  My family and I stopped in at Stein's just as we were abou","useful":0,"cool":0},"Z4uuYTlSq0vGV9M5dvXuig":{"text":"Awesome place. Incredible sandwiches and a truly impressive beer selection. It was very hu","useful":2,"cool":1},"mflSkYo8EY68uKu4iuZqXQ":{"text":"I'm really nuts about some of the sandwiches here.  I would fight you for the Italian hero","useful":0,"cool":0},"p1sxYVyNSoYhkW8ElohAwg":{"text":"Best bagels in NOLA. They have some of the best spreads and toppings anyone can ask for. T","useful":0,"cool":0},"-7lsAsT5hGzd6snotCAGLw":{"text":"I love this place for so many reasons. Not only is it the best place to buy beer in New Or","useful":0,"cool":0},"Z5l8Y4U9w22Ml4AHZWS2XA":{"text":"OK, let me start with..Have you ever seen the Seinfeld episode with the soup nazi?  This p","useful":1,"cool":0},"KnBiTnddQZkPZlzFTjTvhQ":{"text":"Honestly, this place is amazing. The grumpy bearded sandwich makers to the guy that's alwa","useful":0,"cool":0},"quXt0R5AkEnhLHMmNuvzsA":{"text":"Vegetarian sandwich on ciabatta. Iced coffee. Black and white cookie. That is all.","useful":2,"cool":2},"I81qNI82PZHRDOunl_lyXg":{"text":"I've never lived in NYC nor am I an expert on delis whether Jewish or Italian (but man am ","useful":0,"cool":0},"iM_cc0RbQrsU-z-RLROSMQ":{"text":"Yum! The panini de hippie is delicious! This is one of the vegetarian items (I'm not even ","useful":0,"cool":0},"PgYg9VKyCGiRDU_ntO_-tA":{"text":"Love this place!\nAn array of gourmet meats and cheeses, and a mouth watering list of sandw","useful":0,"cool":0},"fjPr-6wy_3zgZmKnYyk4WA":{"text":"This place was delicious!!!  My boyfriend and I are from Minneapolis, and we were searchin","useful":1,"cool":1},"icBlDufMMtLKPhDEqNmpgQ":{"text":"Stein's is not what you would expect in New Orleans, a truly amazing deli. The one and onl","useful":0,"cool":0},"3FCvodUfpWhcFwDIkvVAoA":{"text":"Got the caprese sandwich (tomatoes, mozzarella, basil on a hoagie roll w/ balsamic vinegar","useful":0,"cool":0},"rah4YlBQ8o2A26Z0qbsV3g":{"text":"Definitely one of the best sandwiches I've ever had. Got the Rachel (Rueben with hot pastr","useful":1,"cool":0},"dA8kSjrMGjetZD3v7L-qhw":{"text":"Great place if you're looking for a great bagel. The bagel has never failed to impress me,","useful":0,"cool":0},"IHN_Ij1iEsp4BU2BzeH50Q":{"text":"My daughter said her turkey panini was possibly the best sandwich she's ever had. My tuna ","useful":0,"cool":0},"GebcldVlWvCY0LzHyUK0OA":{"text":"One of the best sandwiches I've ever had. I got the hot pastrami with provolone cheese and","useful":0,"cool":0},"3ugjHMVSiaMUoGU-9E1zoA":{"text":"Brilliant! Ruben is the best in New Orleans! Atmosphere is a little cramped, but it is a l","useful":0,"cool":0},"mRlnvxhhMju6aHh2Eb1Yrw":{"text":"I wish I could review the sandwiches here because this seems to be the place to get a grea","useful":1,"cool":1},"dhL4G2pcVaqYz5sr4Qn5sA":{"text":"Great sandwiches. This place is good, we will go back.\n\nI did feel the inside needs more o","useful":0,"cool":0},"Oty42IkKzLSkJMcKVJJsbQ":{"text":"Very busy and popular, so you'll have to wait a bit. Very casual but fantastic sandwiches.","useful":0,"cool":0},"ZYlYDhC1_b-XsRvg5pxaUA":{"text":"Tons of good beer and a solid Jewish deli with a menu full of delicious sandwiches? I'm so","useful":1,"cool":1},"QWoDczABWmLOsIz9kM3BLQ":{"text":"Small sandwich shop that looks like it knows what the business is. But the real treasure i","useful":0,"cool":0},"tWYrF1SzTrCJkX-5f29RXg":{"text":"Steins Deli is a great alternative to poboy shops.  If you're looking for a poboy this pla","useful":1,"cool":1},"kEP6mhaEn932M4pAm_ekFA":{"text":"I've only been here twice, and I had the same sandwich both times. It was very exciting go","useful":1,"cool":0},"iFqnITJmeqMptg-R05qAFA":{"text":"The best deli sandwiches in New Orleans.  Everything I've had here is great.  I recommend ","useful":0,"cool":0},"-5YRPjCmli-s1xBMxct64g":{"text":"Can't say enough good things about the bagel n cream cheese and capers n red onions n smok","useful":2,"cool":0},"JhRRz-3bj3f1vCGKg1YLWA":{"text":"The Rachel is the best sandwich I have had in recent memory. Feels a little odd eating at ","useful":0,"cool":0},"Rx18kWA6lPUB-ozU6QbmkQ":{"text":"This jersey girl gives this a five star review\n\nGot an egg and cheese on a pumpernickel ba","useful":0,"cool":0},"zCGMYFQPDfGDm4QDutRpgg":{"text":"Great sandwiches, bagels, beer, cheese, and things you can buy and take home and cook. The","useful":3,"cool":0},"qlM3itYV8nsQebut5lfAYw":{"text":"Tried this deli after some coworkers of ours had eaten here. We ordered the Sam and hot Co","useful":0,"cool":0},"2sYxYgYOuSsWttAGqzayEA":{"text":"Came in randomly after an Uber rec and holy crap... glad we changed up our lunch plans for","useful":0,"cool":0},"_nrGMBrCgDRVkzugAjTDyQ":{"text":"Great food, smaller crowded place, friendly staff. Lots of beverage/beer choices to pick f","useful":0,"cool":0},"dXQ41ru9SqEQQftmhWYzYw":{"text":"The food is great, I've never been to New York, but this is what I'd imagine a New York de","useful":0,"cool":0},"qUCzsgAVZDZpahRsCL6E6A":{"text":"I heart Stein's! Everything I have had here is super delish! Tasty breads, great selection","useful":0,"cool":0},"onAh0slPwPXHHFgUKZ4OCQ":{"text":"This was a hole in the wall. Very small, limited seating and from the looks of it, I will ","useful":0,"cool":1},"dKvnMdHUAEBUPpEcpjBOdA":{"text":"Ok, It was tasty but my wife and I were on a muffaletta mission on our trip to NOLA. I hat","useful":0,"cool":0},"mOv0F7y8QT0PAUXR9V3Nww":{"text":"GREAT FOOD I RECOMMEND TO ANYONE WITH A MOUTH! I frequent here about once a week for the g","useful":0,"cool":0},"dQIdcjXMR-Mlx9dTxeZYuQ":{"text":"Really awesome little deli with funky atmosphere and very \"local\" feel.\n\nInsanely amazing ","useful":1,"cool":0},"CfzJRp56bhgaKLYEd7gmkA":{"text":"So happy I found you Steins! I had the reuben sandwich which completely transported me bac","useful":0,"cool":1},"R_qj4HobUKoP2zO32W6Avw":{"text":"All time favorite Jewish deli!!! They have the most amazing pastrami and Philly cheesestea","useful":1,"cool":1},"2h9txt4aNKd4NYjEh5bm8A":{"text":"I went to stein's to find beers not available in my area. \n\nStein's = Most impressive beer","useful":0,"cool":0},"kxX2hBmq3tltDoyKDmD_3w":{"text":"I have not enjoyed a Pastrami sandwich more since I had spent that year in New York City! ","useful":1,"cool":0},"2-NN4l5gWufqoofeVIY90w":{"text":"Drove across town to check out Steins for the first time. I was not disappointed. The bage","useful":0,"cool":0},"vWA_SvzNZQCCWYZp1ujQ3Q":{"text":"Damn, what a beer selection (tons of imports).  I was tempted to try some out, but it was ","useful":0,"cool":0},"fpKRYh6x6RoEg72d1_jSWw":{"text":"Tastiest breakfast I experienced in Nawlins! I ordered the egg, cheese, tomato on a garlic","useful":1,"cool":0},"MjaC6Fl_v3jU0YspmCd1-Q":{"text":"Hungry at 3pm on a Thursday: Stein's Deli! No line, hardly any wait for fresh made sandwic","useful":1,"cool":0},"I5DMvl-LyKdSL4n6SRt3IQ":{"text":"Service = 1.5 stars\nValue = 3 stars\nFood = 4.5 stars\n\nI had the \"ECT\" -- it is the cheapes","useful":1,"cool":0},"c7kWmJcT1WDLonSET79tgA":{"text":"If i'm stuck on what to eat for lunch, I'm heading to Stein's for a S.A.F sandwich or a ba","useful":1,"cool":1},"CWHbWz_NApqndDc62QBK_w":{"text":"Overall I love this place, its sandwiches and grumpy face owner Dan ;-). \n\nLast night my f","useful":0,"cool":0},"ketoFzDuuSMpM7v1bjbTNg":{"text":"I had been trying to figure out what review #600 would be, and when I decided to go to Ste","useful":9,"cool":7},"8xOIUPsDEOLK8bOx148RSQ":{"text":"Great NY style deli, great beer and Tastykakes, what more is there to say. This place gets","useful":2,"cool":0},"pV245jV5o_HOmkw643v_Fg":{"text":"Not that I haven't already found a place for bagels in New Orleans, but this New York-y de","useful":3,"cool":3},"mivlXYde1j5Fti13PUiucQ":{"text":"Stein's makes wonderful sandwiches. The ingredients are all top notch and fresh and the br","useful":7,"cool":4},"VGizij20-ZzE2VP5rJYfFg":{"text":"Just heard from a friend that she got sick from this place.","useful":0,"cool":0},"d24T9XzDiAIPMxntqXusug":{"text":"New Orleans has great sandwich shops. Turkey and the Wolf is the one that you probably hav","useful":0,"cool":0},"ZWPBVWdm2aJDGMEEiUZ_CA":{"text":"I love this little deli! Went to the District thinking a coffee shop would have bagels but","useful":1,"cool":0},"7VZVSshe7p3YbnbzL3ArvA":{"text":"Authentic, quality New York style deli with a bonus that the owner is also a beer connoiss","useful":0,"cool":0},"gwhxqtT3vNKaHh0NLDw0Fw":{"text":"So good. I had the Cuban sandwich which I think was a special that day. It was amazing. It","useful":0,"cool":0},"FeFnWtZL0zd4VcKDsidjSw":{"text":"My preamble... Service is the key for my ultimate return to an eatery. With that said, If ","useful":0,"cool":0},"dbtJEKBZDjOH8x3gilTiSw":{"text":"Stein's is run by a Philadelphia transplant to New Orleans.  The shop has a small grocery ","useful":0,"cool":0},"GF4_ovTB2Z896GfbFxtfIg":{"text":"I've walked past this place a hundred times and never once thought to have lunch here. I'm","useful":1,"cool":0},"swI8VW_tgNQkE6CAvyI63w":{"text":"This place is awesome. I try to make it here for lunch every time I'm in town for work. Th","useful":0,"cool":0},"YZzi2gN9C-cYACAIbpjbYw":{"text":"This was a location we selected for lunch because we were in the neighborhood.  The place ","useful":3,"cool":2},"tWFj2AZBnoRzmZNv00l--w":{"text":"For me, choosing a favorite Stein's sandwich is like playing favorites between my children","useful":0,"cool":0},"_hOsRHB6Fb8Iln10UJ0Cfw":{"text":"I love living within five blocks of Stein's... my waistline, less so.  The Tuscan panini i","useful":0,"cool":1},"TL1HPDEMyIJqcPKDpsNFKg":{"text":"Bagels...mmm...yummy. \n\nStein's gets five stars because I really think this is as good as ","useful":0,"cool":0},"ubQVTw1gSUUzHFcnQFsY-w":{"text":"Good sandwiches and excellent community style management. \n\nThe owner Dan and staff are al","useful":8,"cool":4},"-irUhKrtdMv6bHC8L2PQzg":{"text":"Just do yourself a flavor and get it the Rachel. Seriously. It's the best Sammy I've ever ","useful":0,"cool":0},"Yad22rooEfBVv8gApMsfkg":{"text":"Had a delicious Ruben (they let me get a smaller portion of meat for cheaper) and some tom","useful":0,"cool":0},"VF94a177G-mdBo4qEmb01Q":{"text":"I've been wanting to check this place out forever, because if there are two things I love,","useful":0,"cool":0},"ICu0R4HJguJ2QKamlE_ZaQ":{"text":"Do your self a favor and call your sandwich in for take out. While it might be one of the ","useful":1,"cool":1},"f7nN_4TgdIImmzg0YFCuCA":{"text":"I don't do this lightly but I had to give Stein's the full 5 stars. \n\nI've known Dan (the ","useful":0,"cool":0},"jGrs4nUK3hOebBH4Iu9OMA":{"text":"The Muphaletta was amazing! Lovely deli.\nThe layout of the space is a little tight, but th","useful":0,"cool":0},"BF6P6LUQmkdE-qW_LwAdIA":{"text":"Love this place! The Rachael is delicious. God serves fast. Also I enjoyed watching the gu","useful":0,"cool":0},"PW0i2HyjbrvzVMbuTzXomg":{"text":"It's perfect. When in the big easy it's a must. Enuff said. Except wish we had one in lala","useful":4,"cool":4},"2Ihmz-mwpV9L26cwcdh2vg":{"text":"We've been long time fans of Stein's Deli, the Reuben is a classic and delicious, and we a","useful":0,"cool":0},"a2O7dGJyKdVeELIsekMEEg":{"text":"Best bagels in town and an owner willing to accommodate at the drop of a dime.  Thank you ","useful":0,"cool":0},"3UpnYLJUgsoxwFq-zWYT0Q":{"text":"Our MUST STOP place whenever we visit New Orleans. Get the Rachel. You can't go wrong. \n\nI","useful":0,"cool":1},"7qRtpl8apf7SaPZFtNpDkw":{"text":"We had this delivered to our hotel. Everything tasted great. The muffuletta was salty.","useful":0,"cool":0},"E3AL8v9TCRPrxgC3tbcO4Q":{"text":"Stopping by Stein's is like taking a cheap trip to Philadelphia for me. Everything from th","useful":2,"cool":4},"WvXIjsHvnUbRoSZkMuTg3A":{"text":"I never thought I would be in the middle of New Orleans, eating a gluten free bagel with l","useful":1,"cool":2},"V0JAbNgZBJAH__8pPqTmmQ":{"text":"Great deli.  Owner knows what he is doing.  Even though he's a Philly dude, it reminds me ","useful":0,"cool":0},"fLhAaykPlN1fKVgUTGpUKg":{"text":"Came to and thought Reuben sandwich.  We said unseeded rye.  Came with Marble rye.  And sa","useful":0,"cool":0},"RAyOiQANhWyGkX7VArwpNg":{"text":"It's Stein's. What am I gonna say that hasn't been said a billion times already? Come in h","useful":4,"cool":3},"Hu8j4v9L8e0aqSjBfsGozg":{"text":"LOVE LOVE LOVE- Who doesn't love a good Jewish style deli? The place is old and looks like","useful":0,"cool":0},"2HZrlCFalI0nuANxCB5bnw":{"text":"Stein's is great.\n\nI am a fan of well made sandwiches. Always on the quest for a good sand","useful":5,"cool":2},"pIyZcyBDK3tEwnLPxLWjVw":{"text":"Generous portions n inexpensive.  Traditional NYC deli in NOLA!  Best bagels, cream cheese","useful":0,"cool":0},"ZFX1cYaX2glfth0cbK_xUg":{"text":"The best sandwiches ever.. I grew up in Chicago eating Italian beef sandwiches and Steins ","useful":0,"cool":0},"qqkurkQnZPR3jXblfwI76g":{"text":"I like stein. Good. Meatball sub. Good. Dan Stein, good. I don't like Regis. Bad. I miss A","useful":0,"cool":0},"0kSQn0pZRtXXTHySPOQYcw":{"text":"Summing up the other reviewers: the food is fantastic (we had the Fernando and beef tongue","useful":0,"cool":0},"EdIAOWCdnla2WIJqmU9ZGQ":{"text":"The cornbeef special is awesome.  A generous portion.   The variety of bitters was a nice ","useful":0,"cool":0},"KUrh03sbLiREoR1LwU-l-Q":{"text":"It's the kind of place I usually love. No chain, cool staff and clientele, etc., but I did","useful":0,"cool":0},"DCjnTLwBeaFz72FDajJ5YA":{"text":"Delicious breakfast sandwiches, worth waiting in line and enduring the hectic shop for. Th","useful":0,"cool":0},"XTV9tfZ6O_ay1yt7-1Xatw":{"text":"This review is a long time coming, but me and my wife really enjoyed our sandwiches at thi","useful":0,"cool":0},"NuqEbD9oz1Z5pphOd6OJNQ":{"text":"Best sandwich shop I've come across in the country! The craft beer selection is incredible","useful":0,"cool":0},"DqwpkPdNPKBfYeqZYi5AQw":{"text":"I'm sure much has been written on The Sam. I'll try now to add to the acculumated knowledg","useful":1,"cool":1},"spVx9haQukPZ2Kayxgyfdg":{"text":"Good food but very crowded seating feel...Soup in plastic to go container and wasn't very ","useful":0,"cool":0},"fwhOpgnIYbbrlYuprj5CbA":{"text":"Went for the first time today and absolutely loved it.  I am still thinking about my Ruebe","useful":0,"cool":0},"KZAy3E6zDLLD4xJBAzHGsQ":{"text":"I never thought a deli would become my New Orleans must eat restaurant, but it has. I can'","useful":0,"cool":0},"3ahaFlPPD_YNeINVSQ9yGA":{"text":"The best sandwich shop in New Orleans without a doubt. My favorite sandwich on the menu is","useful":0,"cool":0},"4zTv4vui2NOmboV-gSNqTQ":{"text":"There's a reason they get almost all 4 and 5 stars.. Any review with less is about someone","useful":0,"cool":0},"xC9_FLCgranf4YUtRZK6Mg":{"text":"As a sandwich snob from the Northeast and having traveled throughout, you can count on Ste","useful":0,"cool":0},"KffGt0hFifyaYQLqQ_U9Zg":{"text":"I had lunch here while visiting New Orleans recently.  They have quite a selection of meat","useful":0,"cool":0},"pEVsPOQ9n5G-DXXtt0b2cw":{"text":"3/5 solid deli\n\ni like stein's' (is that how you place a possessive apostrophe when a word","useful":2,"cool":1},"CApS-MZ_UZ0EFbJHWDvoJg":{"text":"This place has its own personality and great food. We were waiting for a long time because","useful":0,"cool":0},"nxgPbrnlDpYtJi6gYpuWeA":{"text":"Oh dear god yes! This place is amazing \nFood quality is great, atmosphere is fun and their","useful":0,"cool":2},"jpUlKeQU0Y_4HQM3Mbv8WA":{"text":"The place is the bomb.com! Great selection of sodas and craft beers. We crave a good New Y","useful":0,"cool":0},"oPmunfCWf6YLgnHoWgZj4A":{"text":"I love Stein's. Best beer selection I've seen in town (check the back rooms), good coffee ","useful":0,"cool":1},"YCtSfC8m_D2XtVeUYYD0Eg":{"text":"Love this deli. Reminds me of home and their bagels are pretty awesome too! Oh, and they h","useful":0,"cool":0},"gncq6WK2haBWWkNL0yg-jw":{"text":"Top flight. Just walk I'm a look.... one will quickly realize it's all about the great foo","useful":0,"cool":0},"NfeX3UZPhqZ0fpsOczOszQ":{"text":"I had the prosciutto and pesto ciabatta sandwich, crab chips, chocloate rugelach, and a ki","useful":0,"cool":0},"qt2KJ21fUR1pOYCz8YYDww":{"text":"The Sam at Steins, best sandwich in town!\nHot Pastrami, Swiss on rye with coleslaw and Rus","useful":0,"cool":0},"Sa7pkzENg4Fp2EhFzx2KuQ":{"text":"The San sandwich is one of my favorite sandwiches in the city. I would give them 5 stars b","useful":0,"cool":2},"rew74_wDWWg5diMOwGh3Gg":{"text":"Old school joint with great sandwiches and a huge selection of drinks. I would come here a","useful":0,"cool":0},"7SncRZNrq43ZLJOHPSS1Yw":{"text":"Was in town in June for a trade show and ran into this place by accident!  And bo6 am I gl","useful":0,"cool":0},"ISix99n91jqx2TdfAfCBag":{"text":"I recently contacted Stein's for a catering event. They really went above and beyond to ma","useful":0,"cool":0},"7vbJB4qRmPacMC6WyOdyjw":{"text":"My favorite deli in town. The sandwiches here are to die for. My go-to sandwich is the Rac","useful":0,"cool":0},"hioaIp_T6LP0kQSHs0DMgw":{"text":"Deli delicious.  Local, family style, counter service, cafeteria-ish/bbq-ish seating.  Pan","useful":1,"cool":1},"r8yn_-p4iM9aeTpCMf8qWQ":{"text":"This was a welcome surprise - super legit Jewish deli food out of a small space that feels","useful":0,"cool":0},"bAkYA5uNmG0aVK1KH3gtgg":{"text":"By far my favorite and most \"close to home\" deli! \n\nI'm a born and raised Jersey girl who ","useful":1,"cool":1},"Mtwb5QUClLV93pgZgXRiDw":{"text":"I recently moved to New Orleans from Pennsylvania and have been desperately searching for ","useful":0,"cool":0},"2T5-UM50MJWlU-RoAyP1FQ":{"text":"Stein's, what the hell happened?  Haven't been in for a while, but have always loved the R","useful":1,"cool":2},"QaTr4xj1QKPWuoqhS5HrlQ":{"text":"Had a great experience here. Bagels were exceptional. But the staff made this a good trip.","useful":2,"cool":3},"r5K36ig5c6kVD7BToh-daw":{"text":"Delicous sandwich shop! Awesome stop for some lunch! I get the turkey panini or Cuban! Als","useful":0,"cool":0},"hh-pPJuJO46NtZtkNL-IwQ":{"text":"New to NOLA, this place was recommended by people who work on Magazine street. Their sandw","useful":0,"cool":0},"fIHJ6RN5mIf1H81rbgcLTA":{"text":"Nov 2019\nTried a Sunday special of Italian Meatball Sub, and wow!! Is this a flavor packed","useful":1,"cool":1},"vhyJ3uebElbUzLMXQ6C6iA":{"text":"Stein's Market is a great place to enjoy breakfast, lunch, or pop in for a few drinks to g","useful":0,"cool":1},"DZyebuPMOVCzHq2ntLrxGg":{"text":"Writing from the perspective of a Jew weaned on Katz's and Carnegie and Russ & Daughters w","useful":4,"cool":1},"wwyN3GagdCoKEKlI7xSz_Q":{"text":"The hot pastrami is my favorite. Good sandwiches and bagels. Also the snacks are awesome t","useful":0,"cool":0},"oTK-9E8zjHkFNaDDAO9oyg":{"text":"Rachel was delish!  From someone that has eaten a few good sandwiches, I was very happy wi","useful":0,"cool":0},"F3Pe0WQjJTrbnzOjQjkakA":{"text":"Well worth stopping in. We considered ourselves lucky to have lunched here. Everything is ","useful":0,"cool":0},"XDbC7Vhgk17j3BdZqDmfdg":{"text":"DRINKS GALORE\n\nStopped by to grab some water and was impressed by the large selection of c","useful":3,"cool":3},"70v7e-aG6lB6VGPvaXUB3Q":{"text":"Coming from Philadelphia, seeing the pork roll egg and cheese on a bagel was pure happines","useful":0,"cool":0},"3xx5p4HsJz9g8yEqL-EUrQ":{"text":"OMG sooo good! The Rachel on marbled rye is by far my favorite sandwich, but you honestly ","useful":0,"cool":0},"LyuAhfk2Nd4ylar8O7B_Sg":{"text":"I have to say that I am a little biased when it comes to Stein's since the owner is one of","useful":0,"cool":0},"L6yxfSeENm5p9xUxp8iNGA":{"text":"Wow. Just so good. If you're in the mood for an awesome deli sandwich, you have to check o","useful":0,"cool":0},"03KKblvpJY8-mFSSZr9Ukg":{"text":"Stein's is a narrow and crowded Deli that regardless how careful and polite you are, you w","useful":3,"cool":1},"nHQcxC8tOyOPp4Ps0pVxqw":{"text":"Old style deli with great looking sandwiches.  I had an Italian hoagie.  Just great. \nI'll","useful":1,"cool":0},"EVi2obJHSDbyF0vQctMINA":{"text":"The beer shop is average and unattended. You're required to help yourself with no offer fo","useful":0,"cool":0},"NW76faTzB9N_LndOMPDiPQ":{"text":"Cute little deli right off of Market St in New Orleans. I had been told that their schtick","useful":2,"cool":2},"aaj_TITmJzpHHHhwtYvR2g":{"text":"Sandwich heaven! Had the Robert to go, very happy with my decision!","useful":0,"cool":0},"TGISNUXMZqWaGqgEsm2KSQ":{"text":"Good sandwiches. Great depending on what you get. No frills vibe. Go to a cooler, grab a d","useful":0,"cool":0},"S2nUWiEJaXXSb0t3fymUKA":{"text":"A trip back to NYC. Simple and max taste. No need to say more. Plenty of seating. Recommen","useful":0,"cool":0},"Bw3MT1PiHtW5vufSMu_21A":{"text":"Lol great sandwich joint. This pace is pretty legit and they seem to be serious beer snobs","useful":1,"cool":1},"kmzMIGO_lKc2ds0VW-cSKQ":{"text":"It's not clear on their website that you need to call ahead to place an order so when I wa","useful":1,"cool":1},"Fz4CcBR56ilJ8jCv1lavPA":{"text":"Stopped through one afternoon for some sandwiches, called in the order and it was ready as","useful":1,"cool":1},"fG39mYMa9w2q01YXJsqGdQ":{"text":"I had been to Steins Deli about 3 years ago and recently someone i knew wanted to try it o","useful":1,"cool":0},"NoI0tNSmY_xMiOvXUgLjZw":{"text":"I'm from New Jersey and my mom approves of this place. All the staples + ideal atmosphere ","useful":0,"cool":0},"Pza4z2Tp5ZGWp1Cbs77SwQ":{"text":"The people, the food - just exceptional. What I admire most  is how they are keeping every","useful":0,"cool":0},"5IBnkAE4HQoPaH1LUH853Q":{"text":"This rating is for the muffuletta sandwich. Might b a bit u fair to rate this place on tha","useful":1,"cool":0},"ENbuZYE1puYpjOiV1cFWJg":{"text":"Don't go here alone! You'll want to take a friend so you can eat half of two different san","useful":0,"cool":0},"dFgfkszRUhD7px340tQ-UA":{"text":"Old-school New York deli crossed with a funkier New Orleans thing. Can't do much better th","useful":0,"cool":0},"g22Mrq-P9Y94Df3v0bd18A":{"text":"I love the beer selection.  Been several times, just to load up on stuff I can't get in Te","useful":1,"cool":2},"O-wSo0VgEahbvcv4WVKiWg":{"text":"My favorite deli in the city, pretty NY authentic. I honestly had a hard time writing this","useful":1,"cool":0},"PiK93xydMMUTHzs1ws0rSw":{"text":"The place was packed so slow service was understandable.  Friendly staff.  Unfortunately, ","useful":1,"cool":0},"c2pe9J2K_tovHtQq2h8qOQ":{"text":"Stein's Deli is the shit. Great quality food that is consistent every time. Solid deli atm","useful":0,"cool":0},"0JAcE5AVYmF9pTK4wIVX1A":{"text":"I got the BLT. It was amazing. I like the atmosphere and vibe you got walking through the ","useful":0,"cool":0},"Q7HdUZpaiDZ_7DBa3EDq8Q":{"text":"Stein's is definitely a cult favorite in New Orleans. I have friends who go here almost ev","useful":1,"cool":1},"wN8HUfEsKZn2gnefi919TQ":{"text":"While the Old Fart (with Swiss and Russian dressing) remains my go-to, I also have some ot","useful":0,"cool":0},"cb5DqTh19VT4M8a_SBbdqA":{"text":"I'm tempted to write a negative review for 2 reasons:\n\n1. It might scare some tourists off","useful":0,"cool":0},"V7ed0Zfj_PHKj02kCMYEyg":{"text":"Don't let the iconic Stein frown fool you, there's nothing but love here. Incredible hard ","useful":1,"cool":0},"K24GEu-050HxnlyfIV_KPQ":{"text":"If you are looking for a great deli meal this is it !! Pastrami corned beef nova bagel mat","useful":0,"cool":0},"K4RYhJEbwZAc9wWH4TjGnA":{"text":"Friends, yall already know this place has bomb sandwiches based on the other reviews so I'","useful":3,"cool":2},"xxUvDIJOHj20kywXJh-6Ng":{"text":"I had the most amazing turkey sandwich that I have EVER had in my entire life.  Full discl","useful":0,"cool":0},"G9Yrho8qRxN-OM6eZ-KKMQ":{"text":"Found out they don't lease the parking lot anymore, but it's a public (pay) lot. Or street","useful":0,"cool":0},"i6j9v4nfmFPyeKfOiuJwEw":{"text":"I am continually mystified by the conventional wisdom that Stein's is AMAZING. Don't get m","useful":1,"cool":0},"K64xkbts9ItWKsmw9J2j7g":{"text":"Why is it so hard to find a good Ruben sandwich in New Orleans or Metairie? Stein's has on","useful":1,"cool":0},"9o2Ou0frCPOq8cSBK-hdDw":{"text":"Great sanwhiches overall, but be wary of the steak and peppers. It's literally steak and s","useful":0,"cool":0},"RzoxCLEHItNo91m1EY0RIg":{"text":"We actually went here to go to the donut shop(next door) I am so glad we didn't! Be patien","useful":0,"cool":0},"2wb8ihDrqqmBDRfmGA1uew":{"text":"Steins has top notch ingredients. I have never been disappointed. Staff works hard to get ","useful":0,"cool":1},"wkA-cQN4fj0Rhr8iEkP-Wg":{"text":"I was bemoaning the lack of decent local bagels to a friend in California and she took it ","useful":0,"cool":1},"x9LcdVUSZms47Mb4onHitQ":{"text":"Starving for a quick sandwich but want more than just Subway? Come to Steins!  I was on my","useful":1,"cool":0},"BKx1h3gqYNumVjDmUK34sA":{"text":"Called two numbers no answer for food orders no dining in and no shade to wait in! Don't b","useful":0,"cool":0},"T146e5JYyHhDlKA04xwfTw":{"text":"Pretty average experience. Guy behind the counter couldn't bother to look up when I was or","useful":0,"cool":0},"17Ge0jA99SLghwWTprRghA":{"text":"I'm so happy steins is in NOLA.  Sometimes I need a sandwich. We're not talking the basic ","useful":3,"cool":3},"FwTIUzTp5pxQt1yUFSDAxQ":{"text":"Incredibly rude staff. Haven't even sat down to eat my food before needing to leave a revi","useful":4,"cool":0},"EwWnDrW8sAVPsSdocFQGcg":{"text":"A great little laid-back lunch spot.\n\nI'd been craving a tuna melt and Stein's did not dis","useful":2,"cool":1},"Ju9hpYfWm-3I13vu5D-cEg":{"text":"Whether it's and early morning bagel or a sandwich with pickles and a beer on the side Ste","useful":0,"cool":0},"FxhHGw5iZDvGTaAiyZnVuQ":{"text":"Rude staff. Took forever. I got the Fernando that has three ingredients and they forgot th","useful":0,"cool":0},"HeUqBbUF1DtZ-o3mzVhzgQ":{"text":"I had the Italian Hogie. As a transplant from upstate New York, used to great \"submarine s","useful":0,"cool":0},"kwlozQePlUQ_JHZyyQm2qw":{"text":"A review by a certified beer geek. \nThis review is based purely off of their bottle shop i","useful":1,"cool":1},"z5SarzHqbMAE5bMkcdSUTg":{"text":"Oh. My. Goodness. Y'all don't even understand. I will attempt to explain to you why you sh","useful":13,"cool":8},"ganW_7i7eegUc35V_dI01A":{"text":"Love this place!! \n\nI went here several years ago for a Reuben sandwich, fell in love with","useful":3,"cool":3},"bGhdLx23v26wyaa5AoJIsw":{"text":"Wow. O. Wow.  Listened to a podcast and it told me to go here.. I am like do we got to a J","useful":0,"cool":0},"b7HgWOgF1ixa0Fin5JNucg":{"text":"Got a legit Pastrami on Rye w/ mustard and provolone on a Sunday afternoon. Sandwich hit t","useful":2,"cool":2},"UDgSGkGoOnyaRsPHjigpIA":{"text":"Boyfriend offered to pick up sandwiches from here and I wasn't going to decline! It was my","useful":1,"cool":0},"ZbOQf5dsPMFnsaB_f5Y6oA":{"text":"Decent food, horrific customer service. Get ready to be ridiculed, belittled, and cursed o","useful":2,"cool":0},"hDrn0TJBIf_doiItmDul8A":{"text":"This deli is very fantastic, with excellent sandwich choices. Hasn2 vegetarian sandwich ch","useful":0,"cool":0},"PwpOKYzivq7PRKzrqZLKxA":{"text":"Definitively overpriced but good execution of a traditional reuben. \n\nI ordered the classi","useful":2,"cool":1},"O1mwoldrOKbrp33cjylq-g":{"text":"Delicious sandwiches, super fresh ingredients, and now I can check off breakfast from the ","useful":2,"cool":0},"ClMtEipnw5rG28SSxGY44w":{"text":"Hot damn! It's rare I find a sandwich shop that speaks to my soul, but Stein's nails it! \n","useful":6,"cool":1},"UeaNl_QnWIaI1hkOJNSD6w":{"text":"I'm not a New Orleans local. I went to this city with a big group (80 people). I use Yelp ","useful":2,"cool":0},"ctdXPEKU0VzrFw7LYnBkwQ":{"text":"\"JU-SION\" deli: top quality Italian, local and Jewish sandwiches and sides;\nQUIXOTIC: mix ","useful":3,"cool":1},"MvuT8rBW_OvD0EFVLILeVA":{"text":"A favorite for sandwiches but equally as great for wines and imported dry goods like pasta","useful":1,"cool":0},"-jmLyLDsCV-nETubhqvoSg":{"text":"Are you kidding?   This place is amazing.  Matzo ball soup, chopped liver, cel-ray soda.  ","useful":0,"cool":0},"SGogHlUrGcYvze5pCao-Zw":{"text":"We went to Stein's Deli for lunch on Saturday 10/13/12.  I like the fact that we have what","useful":1,"cool":1},"dXcjWBMj3YN-B88HAGwiWg":{"text":"Stein's Deli is hands down the most DELICOUS deli I have ever been to! Fresh hot bagels, h","useful":0,"cool":0},"v0GSS3SorHU37hXPDdF9BA":{"text":"The food was just okay but the crabby grouchy counter guy is like something from, \"Seinfel","useful":3,"cool":0},"QRMHsO0Cv6YFddKpjXqjdA":{"text":"AlwYs stop here when I'm NOL. best sandwiches one can experience - breakfast and lunch.","useful":0,"cool":0},"mDJRvsO95IkdE0Ncf0lVeQ":{"text":"Best deli sammies in New Orleans area, hands down. Tuesdays is the Philly cheesesteak spec","useful":3,"cool":1},"Pf7MHs6Qi2X5y7fyiDi1ug":{"text":"The service here is horrible. I have dietary restrictions and asked to swap one thing. The","useful":3,"cool":0},"M2n4nCcDVOwymNIl6wleFA":{"text":"This place is awesome! They have Taylor Ham which usually you can only find in NY or NJ. T","useful":0,"cool":0},"qBNc-BN26k0KiltV-Q4Xuw":{"text":"The counter help goes out of their way to have an attitude. May be it is part of their sht","useful":1,"cool":0},"7oZc8zl5lqr7Tk5x5KiVAw":{"text":"The best bagel and lox in the city! Bagels from NYC, homemade cream cheese, and the freshe","useful":1,"cool":2},"yEI5W6mjpveEEw6qL07H_w":{"text":"Yasss!! This place is amazing. I had the everything bagel with chive cream cheese. Oh my i","useful":0,"cool":0},"guMhTOYu_ok82qn2Cjyv8w":{"text":"This place was rude to my wife on the phone and mother-in-law. It was our first time going","useful":1,"cool":0},"cID6N3jjOU-hfG3CLasbxw":{"text":"Genuinely confused why everyone thinks Stein's has good bagels? The bagels are mediocre AN","useful":5,"cool":3},"VRX5qj9ZPuwP7FUI_derqQ":{"text":"My husband & I were here for only a day. We researched lunch options and due to reviews an","useful":1,"cool":0},"UfMw84sf4omi8TBilDEVlQ":{"text":"Delicious food! Great customer service! Always a packed house but they move the line quick","useful":0,"cool":0},"nb5Q7k9KlGR_XYe1e84J-w":{"text":"First bagel I've had since moving out of San Francisco over a year ago and it delivered Or","useful":0,"cool":0},"64Zt7k8sLg3NrFnpgPeCIQ":{"text":"I've had their bagel with lox on everything bagel and it's really really good. I've also h","useful":0,"cool":0},"YUiC_s_YdspOjylLpdbKYA":{"text":"this place is not dirty, it is filthy. The people who work there are rude and trying very ","useful":6,"cool":1},"x-NSBM9aZYolW1RKbw9f4Q":{"text":"Hands down the absolute best Ruben Special I've ever had the pleasure of eating. What make","useful":0,"cool":0},"Wd9_r8tnwy1PnJJdECkndA":{"text":"You really can't go wrong here, especially since it is the only real deli in new Orleans p","useful":0,"cool":0},"7jaSmAWj1CyKXLP91QQzww":{"text":"Best sandwiches ever!!\nWe came from out of town and stopped in before going home. Took abo","useful":1,"cool":0},"JMS6zn4eaH9BR65y337mKg":{"text":"Oh what a wonderful way to end my N.O. trip. Before I got back on the road to head back ho","useful":4,"cool":4},"z2tHlHdn93v9a9Kpupxq5g":{"text":"The counter staff are rude and the sandwiches aren't as good as the ones I had in New York","useful":3,"cool":0},"G3dnicy-GxzrJrjKwcULWQ":{"text":"This is hands down the best pastrami I've ever had in my life. Best sandwiches, best servi","useful":0,"cool":0},"GpTPM-Xz0sOMBW4gcDLaCg":{"text":"Jersey Girl on diet...........  REALLY wanted the Fernando, but savored the Gaspacho and a","useful":0,"cool":0},"K8vaslB1_l2qfJHujfWqwg":{"text":"Hipster/superhero nerd ambiance. They are know to give a bit attitude but don't take it th","useful":1,"cool":0},"m9k6hMAtmCCHevV_QMUuUQ":{"text":"Best bagels in the entire metro area - I have searched 4 different parishes for bagels - S","useful":1,"cool":1},"j3bfWNhTtSu0Nlt0wva_dw":{"text":"Can't lie the food was good. However the employees - not so much. If you're into the 'cool","useful":4,"cool":0},"NX9jTvgRFJiUdHoJC5OX_A":{"text":"Best spot for a sandwich in city! I found out about this place randomly through an article","useful":0,"cool":0},"l5fIbRmDHThJ6EGxYNY74A":{"text":"We ordered the \"Rachel\".  It comes on rye bread with pastrami, Swiss cheese, sauerkraut, a","useful":1,"cool":1},"FgNtSDiiEOlN4L0VuN8fgQ":{"text":"Love the atmosphere (including the guys at the counter who are a tad abrupt when taking yo","useful":0,"cool":0},"0zZGNtDaVoNo7UHmbDu6nQ":{"text":"This is one of those places you could walk past dozens of times and never give it a second","useful":0,"cool":0},"Rh7pX0FJoegCWsc0S6g-aw":{"text":"Best Italian sandwiches I've ever had outside of Italy. Everything is fresh and high quali","useful":0,"cool":0},"Sb3euQ0nbhDmW9LXhBGsQw":{"text":"Love steins. It's fast, great bagels, great covid precautions! I go to steins around once ","useful":0,"cool":0},"7P1iwXG_jjAD3hwI95gAPg":{"text":"Taylor Ham, Egg & Cheese!!!!!!! Their THEC's are amazing. Service and staff are wonderful.","useful":0,"cool":0},"jMdrbCw5LT93jsZoS0yYlg":{"text":"A family member recommended this deli for killer sandwiches, specifically pastrami. We had","useful":0,"cool":0},"7_FzF73ljTDrN_Mm1O5UXg":{"text":"As a sandwich lover, I'm embarrassed to say it's taken me this long to hit up Stein's. Wal","useful":0,"cool":0},"RSacZTO1NGgCMFPLhgpafw":{"text":"This is one of the local favorite, and we were in the garden district on a tour, decided t","useful":1,"cool":1},"jNetvgKSDkXGM01qsSdeWQ":{"text":"So so so delish. Best place to get a sandwich in New Orleans. Feels similar to an old Ital","useful":0,"cool":0},"Ku11SRQNXLUxcIIeLf2cPg":{"text":"Grabbed a couple sammies for lunch and they were great. Menu has something for everyone an","useful":0,"cool":0},"PRJdED4mMA1NW84h21xSbQ":{"text":"We love the food at this little hole in the wall place.  We've had the bagel and lox, the ","useful":1,"cool":1},"cdhUdoUduwE-RnZXuMd3vw":{"text":"Heard good things about steins but based on my experience I won't be back. When I entered ","useful":2,"cool":1},"hzoTEDtmtG6ykROW3KQtsQ":{"text":"Decent food. Respond when the jerk with red hair and a beard doesn't work there anymore an","useful":1,"cool":0},"uoclvneLWFyyrTC0aw1NpQ":{"text":"First visit to NOLA with my GF, we stopped here on our last full day in the city. \nThe man","useful":0,"cool":0},"9M9rapW8WzZCm3SKfA6QjA":{"text":"Two words: Old Fart. \n\nThis sandwich -- which consists of thinly-sliced beef tongue, chopp","useful":0,"cool":0},"uqMKRgAL5xpLIpXwkE-B-w":{"text":"As always, Stein's makes a great sandwich which for me today was the Rachel. Delicious wit","useful":1,"cool":1},"gONKZfP6IQLZf7hbqHOfwg":{"text":"A one of a kind deli.  Great sandwiches.  Great atmosphere.  A true gem in the heart of Ne","useful":0,"cool":0},"CWWiBrxKLaeH6h41zKX7vQ":{"text":"Order online and pick up best smoked salmon bagel  and iced coffee. Minimum line outside c","useful":2,"cool":0},"84tHYsW-v2HonlyeV_ckvg":{"text":"Let me start out by saying the service is so rude it's genuinely humorous and an ongoing j","useful":1,"cool":0},"XS3fS7beA7UwUSN8Wh1J7w":{"text":"I used to drive by this place all the time without ever noticing it before. It's tucked be","useful":3,"cool":2},"2IS6GJm5kTDJThfdykW-LQ":{"text":"Well, I'll make this short and sweet this time. Mediocre deli with extremely rude staff.","useful":4,"cool":1},"4np_xqK-JuObnCQH2NOlCw":{"text":"My family and I came here for breakfast before the saints game. This place was excellent a","useful":0,"cool":0},"y8lzarNzeJT2xfAzYpoLRQ":{"text":"The rudeness, I'm starting to believe, is a part of the New York experience they go for. T","useful":1,"cool":3},"Y3RAzpknlFTmBUsKNGOmyA":{"text":"One of our forever go-tos for a great sandwich. Dining in (pre-covid) had a hole in the wa","useful":0,"cool":0},"TuD2MKECSYDY-TDHkJKn0w":{"text":"I ate at Stein's with co workers and fell in love. The meat is quality and the food is abs","useful":1,"cool":0},"qlwNBC6e6irvlB0ha8PTZA":{"text":"It's a deli. Nothing more nothing less. No frills. Awesome sandwiches made to order. Great","useful":0,"cool":0},"Jvu-ztN6Lwy7FBJzol-MRQ":{"text":"As a delivery driver I come in a lot to pick up orders. \nWell I DID.. Now when I get an or","useful":2,"cool":0},"LCKo0y7PWf57xUIy81kE5w":{"text":"Ordered the Kelly and the roll was burnt on top. So disappointed by the laziness and lack ","useful":0,"cool":0},"1Re8UPVyJ4a-kb92UAKlcg":{"text":"Writing a review although I've only walked in. \n\nSmells awesome. Tons O' Beer. Tons O' Win","useful":0,"cool":0},"etZW7XqWytgp0uxdmkwIJw":{"text":"Just amazing service and people. Best sandwiches/ deli you will ever find anywhere in not ","useful":0,"cool":0},"DKNfQjaCS0YThQm3glOm2A":{"text":"Stein's is, hands down, the best deli in the city. It's so good that I can't even venture ","useful":0,"cool":0},"9ymk5GxYUhmj6t11vEOiCQ":{"text":"They have the most delicious (big size) bagels I've ever had. I had the cinnamon and raisi","useful":1,"cool":1},"ALtlDS4gIqW9OQnlbRbFQg":{"text":"Y'all...their sandwiches are FIRE. No matter which one you get, you're going to like it. M","useful":1,"cool":0},"uivw6F7xS1WUem5TIhkm4Q":{"text":"Frequented Stein's for my entire college career and I don't believe a week went by without","useful":0,"cool":0},"dl7KdgRF7xQ65i0UMvv7Sg":{"text":"From the east coast, and was so pleasantly surprised to find a local, authentic Jewish del","useful":0,"cool":0},"FkHVRQcBnqxRwysl-t-Xew":{"text":"This was our final stop in NOLA and it was SO worth it! I personally LOVE a great bagel an","useful":0,"cool":0},"edGupb03OUlj1N-rf9uNRQ":{"text":"Hmmm. People rave about their sandwiches from here and overall I'm underwhelmed. Maybe it'","useful":1,"cool":0},"st9zdC8gro3AMYxbG8yyzQ":{"text":"Another staple in NOLA is Stein's Market and Deli. The market looks rough, there is no par","useful":2,"cool":1},"H0VqlWYyAEaMZLPBcZCmPA":{"text":"Growing up in NYC, we are totally spoiled with deli sandwiches. We like em a certain way o","useful":1,"cool":1},"Q0EVdkpcl3A44-D4p3YoEw":{"text":"Very good local place for sandwiches! You order up at the counter and they do have a good ","useful":0,"cool":1},"L31qOItwVryzl-waV7NNxQ":{"text":"I realize I didn't upvote my review after doing hurricane relief for hurricane Harvey. Fou","useful":1,"cool":1},"9F5AUf7VTakl6TBhU8BYeg":{"text":"I have the Italian hoagie which was absolutely amazing they toasted the bread just a littl","useful":0,"cool":1},"yQ9eEUGy7DmiNx1dOxemyg":{"text":"Great sandwich shop & also has a coffee shop inside now! Awesome stop for some lunch! I ge","useful":1,"cool":2},"SU7wEfiNUJRBoBk3UpgMsg":{"text":"I've been hearing about this place since I arrived in NOLA and finally got the chance to t","useful":1,"cool":0},"ccSdHsRDg_hRuTmI-8Z5wQ":{"text":"my parents, in from out of town to help us move one weekend, found stein's.  \nthis neighbo","useful":1,"cool":1},"CsRJwFZjt6q0GijOZwbhGA":{"text":"Y'all i'm not kidding when I tell you that everything at this deli is amazing, the everyth","useful":0,"cool":0},"eIya64rjXzmEk2789XLTSw":{"text":"I had the Reuben...corned beef was very chewy and fatty. Service was okay, nothing to writ","useful":1,"cool":0},"AtXQRjil99nUNBr5yerJsw":{"text":"I love Steins! My favorite sandwich in the city and a dope market too! Check out the beer ","useful":0,"cool":0},"NV_QBCGpuL5E1mdT_jWkrg":{"text":"A shop of many wonders! This New Orleans staple is not only a great spot for food, but als","useful":1,"cool":0},"L5aK7XMvAY52Tnc0ZsBGZw":{"text":"The roast beef was perfect! The sandwiches were big on fresh bread with unique toppings th","useful":0,"cool":1},"2zCvFBpQxlryVLOwbghU_Q":{"text":"So good ! The atmosphere is sort of strange with the owners personality but it works and t","useful":0,"cool":0},"Ye0I2iKJCXf867LXBGHDSw":{"text":"We just got a sandwich, chips and a can of pizza sauce to go. The food was amazing as alwa","useful":1,"cool":1},"t8lqayJNguy1DyrFQtkObQ":{"text":"Average at best. I was disappointed in the roast beef. Being from the area and raised on p","useful":1,"cool":0},"yxGNbUJ5qYi6EzqXQljOsw":{"text":"Great service, great people. I've literally never had a bad sandwich here, either. Highly ","useful":0,"cool":0},"Vi-hvg1oQ7GC6c2RqE0nMQ":{"text":"Stein's has the best bagels in New Orleans, easily. Not to mention, their sandwiches will ","useful":1,"cool":1},"AzMuBh6-DZQf4CHGv3qB6w":{"text":"My God, I have never had such an AMAZING sandwich! Thank you, Stein's Deli \n\nDecided to gr","useful":2,"cool":2},"HeN_0WjcWTY2ouX1DXQDjg":{"text":"Saw so many great reviews, so I was extra excited to try Stein's Deli. But knew instantly ","useful":3,"cool":0},"qxQwiqdA_wBgRc2bWj4YaQ":{"text":"I order an everything bagel with lox, cream cheese, tomato, and onion.\n\nIndifferent faux-h","useful":2,"cool":1},"MJVrsvT_l66WncKMqDG4LQ":{"text":"Sandwiches and drink options are pretty good. I've been here only a couple of times for lu","useful":0,"cool":0},"yFnyZ0QP6oM55x-vdpKN6w":{"text":"I've always loved Stein's Deli particularly their BLT. I usually order it on a hoagie roll","useful":1,"cool":0},"DyAIGaMEufyONC0fk6kNZw":{"text":"When I think of a Deli, this place fits.  Big hunks of many different types of meat?  chec","useful":1,"cool":1},"97EhjOR_lBjbah4eaaqyNg":{"text":"This place is hard to love. Filthy is understated , chaotic certainly applies, zero curb a","useful":0,"cool":0},"UJmLQTIgy_WI999LwdcGhg":{"text":"Basically it tastes like a sandwich my grandma used to make for me but didn't charge me $1","useful":2,"cool":0},"gt3WLKgr8C7ZjopsDdVKXg":{"text":"Stein's is a hoppin' locals spot in an up and coming location on Magazine. They have a vas","useful":4,"cool":2},"urdr4MPA_Bbd3unGjTLMxQ":{"text":"I'm a lox and bagel all day girl and I've been meaning to grab one from Steins for quite a","useful":1,"cool":1},"WxkHCDEpqY_rTR1e93WtzA":{"text":"Have been looking for a good Jewish deli, some guys I work with told me this was the place","useful":2,"cool":0},"POGzvkozxsWNTrwPGII4Tg":{"text":"Not many places in the city like Stein's. Maybe it's not a Carnegie or Katz's but still qu","useful":1,"cool":1},"bGl2y1i4No3MFzl1kbxwQA":{"text":"Get the Reuben Sandwich... that's it. That's all I have to say. It's all you need to know.","useful":2,"cool":3},"cEc29zw4w7cvlkUM44TWTA":{"text":"Have you ever wanted to kill yourself because you didn't discover a place until after you ","useful":1,"cool":1},"E1KiAcrp_HrT8iaUzP1hbg":{"text":"To borrow a phrase, Stein's got the meats.  I met a group of friends here before attacking","useful":1,"cool":1},"Bl4x7HNd2IQCoRlB0eDH-g":{"text":"The food here is amazing. We tried a bagel with smoked salmon, capers, and cream cheese. I","useful":3,"cool":2},"4wsO3NDg4xF8ibQog823WQ":{"text":"I love Stein's. It's a no frills, no fuss kind of place, and is just what you need when yo","useful":2,"cool":3}}