{"ejMlNwkx4DUoRUONYpNZmA":{"text":"This place has such a fun atmosphere. My friends and I stopped by for dessert the other ni","useful":0,"cool":0},"jBORUKPouuhveDx0J_WTiQ":{"text":"Cute little shop.   Brunch is a must try.   The cakes are must try too.  The staffs are fu","useful":0,"cool":0},"2SK6mLoq-p9OuWTfiN3UwA":{"text":"The vibe, music, friendly faces, and the FLITRY CAKE! This place was such a treat. Perfect","useful":0,"cool":0},"yTAcQyNlKO2gwXHv8CV-Wg":{"text":"Love the idea of having books in this bar! It's so generous and fun. We plan to both borro","useful":1,"cool":0},"UOnId8Y89Q7UMVRCBfUCiA":{"text":"It's my first time here. A friend recommended it to me while i was visiting NOLA.  The sta","useful":1,"cool":0},"84aKC-_N420xPHIe_44D7Q":{"text":"I don't typically have a sweet tooth but when I crave dessert it's pretty serious. I found","useful":0,"cool":0},"cSSBF-dreXQLbwgmj-sRog":{"text":"I came Monday night to try out this place since I was craving for dessert. I ordered the r","useful":1,"cool":0},"b68-fbZnrXCC1TUXYz2sgg":{"text":"Jordan, Faith, and Joe were amazing, and I LOVED the happy hour food. The current German h","useful":0,"cool":0},"MP4GOhYzNbY5DxuPuYiU2A":{"text":"I only had a piece of cake (the wedding rainbow surprise) so I can't comment on the other ","useful":3,"cool":2},"Mp0dbMYw524iqSig2nyAxw":{"text":"I've been wanting to come here for quite a while and I'm so glad that I finally made the t","useful":0,"cool":1},"PgvESBQ1GmHATOC5jLd1cQ":{"text":"What a great way to end an evening!  We were greeted at the door and seated very quickly, ","useful":0,"cool":0},"YhYjZHUlB4so4ySIhDTrAg":{"text":"What a fantastic place! The atmosphere is chill and relaxed. There are shelves of games an","useful":1,"cool":1},"wMsjKV0wmY55dVxfT2nUeg":{"text":"I only had a piece of cake, and my first dolberge cake at that! I found it to be everythin","useful":1,"cool":0},"OR_3ni7u4Wwz4KWR25VyRw":{"text":"Rose was simply amazing. She was attentive to our arrival and made us feel welcome. I aske","useful":0,"cool":0},"nRz7EruC2s1B8vYwR2319w":{"text":"Awesome new place in the old Eleven 79 space - it's  a strange little corner next to the r","useful":0,"cool":0},"NEoVp1db18Alwy2r1Q9lzA":{"text":"This place is amazing! The dessert is to die for. I had the bananas foster bread pudding a","useful":0,"cool":0},"FR71cI5NTO14gANay0xnzQ":{"text":"Reminded me of a bar I used to go to with my wife when we were dating back in Gainesville.","useful":1,"cool":0},"tTPXRqMTyiF2D25MIgZcKw":{"text":"Great service...very friendly.  Yummy dessert and we also has coffee with Bailey's.  #win","useful":0,"cool":0},"DnQh9wR1s-X-ZFHqxkAWLg":{"text":"What is there not to love about Bakery Bar? Great space with a friendly staff, creative dr","useful":0,"cool":0},"r3c8JdQgua-OlJePYICmEA":{"text":"Update: \n\nSo, since my initial visit, I've had the rainbow, salted caramel, strawberry, an","useful":1,"cool":1},"1LjX41dIi_y7cGV6lr1syw":{"text":"Delightful atmosphere, delicious cake, and downright neighborly staff!","useful":0,"cool":0},"QM6UszDvpZkxMdYafv9lVg":{"text":"Came for brunch and it was amazing! Everything Bagel aioli is just a brilliant idea which ","useful":0,"cool":0},"xY4Fj0YSInZx5ewX5fGDyQ":{"text":"It was a little too trendy and cool for me. It was packed and very loud. I walked in and w","useful":0,"cool":0},"wiG8AqdGspqNoK5aimVkhg":{"text":"Good idea of combining alcohol and dessert, my two favorite things. I really enjoyed the w","useful":0,"cool":0},"ZPb51Z1qjXKAeHukGmGfUg":{"text":"Red Velvet Doberge Cake is so good!  Also try the Key Lime sampler.  Cookies are cold and ","useful":0,"cool":0},"ky8GZdM-b21v5_W4vswMcw":{"text":"Bakery bar is awesome for sweetooths and boardgamers like me! Although it's street parking","useful":5,"cool":2},"xelJQh69HneOTnw_kcdfMA":{"text":"Little, hidden bar, but worth stopping at. Had breakfast here and loved it. Great service ","useful":0,"cool":0},"C9RWe15HMg16cCk5LA7Viw":{"text":"Ohhhh this place has not disappointed me yet! After a second visit, I feel it's time for a","useful":1,"cool":0},"OwqhLaTEFQQsllLNQikrxQ":{"text":"Wonderful atmosphere- when you come in there's books, board games, a fully stocked bar, an","useful":0,"cool":0},"2G7kUl7T8BpIu5j8bjStUg":{"text":"We only stopped here on a Saturday afternoon for a  treat (the cakes were super tasty). Wi","useful":0,"cool":0},"S6KnF5h00dfhat_XdA9Fbg":{"text":"I love this place. The shrimp & grits waffle with black bean syrup was a really different ","useful":0,"cool":0},"9MtkwJeYtu1dd65TsS3KlQ":{"text":"A confectionary sensation!! Our family visited the Bakery Bar yesterday, and from the time","useful":0,"cool":0},"U8ntztSmeJq84GJUbcR44A":{"text":"Debbie Does Doberge has a new location that is open late and slings some amazing desserts.","useful":8,"cool":7},"8D1It_HHbzDz4sqmA2Umqg":{"text":"Enjoyed the desserts although I don't have much of a sweet tooth.  Convenient for a quick ","useful":0,"cool":0},"1KeOTjr4RvhlF92WTytePA":{"text":"My wife and I just moved from New Orleans, and visited bakery bar on our last night in tow","useful":0,"cool":0},"9u9IOlO_ByeQO6YXXmacnA":{"text":"Home of the doberge rainbow cakes! It was so yummy, the rainbow one tasted like almond cak","useful":2,"cool":2},"kHt_LS9ZmHD_6ZbnIZoxCA":{"text":"Holy cow this place is unbelievable! I had the breakfast board and my wife had the Brussel","useful":1,"cool":1},"_msGyRvMKVSossF9eKicQg":{"text":"I saw a local ad for doberge king cake and was excited to try something traditional with a","useful":0,"cool":0},"IvMJ3oZLLQO_UcIDf7OJFw":{"text":"Nice people, cool vibe, tasty food!  I only got to stay for a quick snack, but it was real","useful":0,"cool":0},"Xgd4aB6FU6kDcs9FTXpprA":{"text":"Absolutely wonderful!!! The atmosphere was warm and inviting and the rainbow cake was yumm","useful":0,"cool":0},"6Ju-hHlhNLRQL8ejw65IyA":{"text":"I have to say that if baby angels made cakes and pastries this is what it would taste like","useful":1,"cool":0},"JPEruGUZB5Yt7OkJUTsQ_w":{"text":"This place should be packed. They marry NOLA traditions with modern day gourmet approaches","useful":0,"cool":0},"7tZl1TvxKVB5DfDVGqOSbg":{"text":"Cool spot. Unique. The cake we had to be honest was prettier than it tasted. Don't get me ","useful":0,"cool":0},"CVoz26PRS_Tn3qICuzjS4Q":{"text":"Very disappointed. We have come here before and we're very impressed with service and food","useful":0,"cool":0},"yd-Ttp-eZ0zLrurtnlL6bA":{"text":"The best desserts in town! $3 martinis during happy hour? Need I say more?! Ok, I will...T","useful":0,"cool":0},"7a8vs45NVZsVJH3n6-icnQ":{"text":"Bakery Bar is a cute hipster bakery and bar. I didn't drink anything, but had a slice of t","useful":1,"cool":2},"idm0cSpjwcYY7lFBiNG47g":{"text":"This was one place open late on a Sunday in our (adopted) neighborhood. By the time we got","useful":0,"cool":0},"tPvdL9b2Btcb9ui6wPdY6Q":{"text":"Was in search of a midday sweet break. Low and behold, Bakery Bar was a short walk away fr","useful":2,"cool":1},"HOIf8c4nBIDCu7_WjpDhaQ":{"text":"Love the ambiance here! This wasn't apart of our original plan for the day but we wanted t","useful":0,"cool":0},"LFhMAFZ1HvGLqXNDWhy68A":{"text":"I love this place! The doberge is the best and the assortment of flavors always exceeds my","useful":0,"cool":0},"Gof6IqDfUHrkSv2E780Pqw":{"text":"Bakery Bar is a true diamond in the rough. Nestled between the interstate off ramp downtow","useful":8,"cool":6},"R4rDg5SKP5JDW6ObBnWScA":{"text":"Omg!!! Such a cool spot. Looks like everything around it is being gentrified. That street ","useful":0,"cool":0},"3sBYfQrR8VRF9L_2BFoF-A":{"text":"Had the best waiter...don't remember his name but he had on a sweet Ricky Martin shirt and","useful":0,"cool":0},"PI6y2HE3nbLS_RFwPty9_A":{"text":"If I could marry a bakery, it would be this one.... this. was. perfect! Quick tidbit/clari","useful":0,"cool":0},"dy_c8rQu0a46QcWgNFBClg":{"text":"We were very lucky to snag some seats at the bar on a busy Saturday night. Service was fas","useful":1,"cool":1},"SUHbnL7txwwLY5i4OboqXQ":{"text":"I had my first trip to Bakery Bar Saturday night with a group of friends. We came for some","useful":0,"cool":0},"0uL504sKXLfJCVUR95WSfg":{"text":"My boyfriend and I went today and it was amazing. We order 3 petit fours and a chocolate b","useful":0,"cool":0},"z2xrsh3dD2hwZwY3fBSDLA":{"text":"Had the rainbow and maple blueberry cake. And OMG, they were both delicious!! The rainbow ","useful":1,"cool":0},"EotrvrqNhkwtQCRDBzd0Qw":{"text":"Delicious customer service, tasty libations, positive vibes and beautiful cakes! Tried my ","useful":1,"cool":0},"QxtZ0noCkwamyaOtmpenbA":{"text":"4/5 let them eat gay cake!!\n\ni don't know what occasion you bring out the doberge, but for","useful":7,"cool":8},"Ihlpo_gjNijSx20V9PMOCQ":{"text":"I had a bite of the blueberry maple bacon cake and it tasted like the most perfect blueber","useful":0,"cool":0},"RIiquv9AxepdFv1yOn4gdA":{"text":"Yes, yes and yes. Cocktails an cake seriously cannot be beat. The staff was so sweet, the ","useful":0,"cool":0},"6z_cX63iR9IVGDvrFV5FcQ":{"text":"This is such a cute little place.. Desserts....board games.. Coffee and wine.. U got me!! ","useful":0,"cool":0},"VXUKZo2O01388HK0lF1llg":{"text":"I'm so sad that the dough bites have changed!  Was looking forward to going to grab a doze","useful":0,"cool":0},"JKMiV4uBJ5pqvX5gKIHzYg":{"text":"Cute idea - not very impressed by the application.\n\nThey have some of your favorite cake f","useful":0,"cool":0},"2BVuV5yEJ0yZQeDZuaK7Hw":{"text":"Very friendly staff in a small and casual setting that is not too crowded. The baked goods","useful":0,"cool":0},"xKydlGg4cq7kQKBKYI6KsQ":{"text":"A Bakery in a Bar!?!  Yes, my fellow imbibers, it is, and it is spectacular! \nWith a corne","useful":0,"cool":0},"0dfu-0SWadtInMHH8CGmHA":{"text":"A bar that serves desserts and sweet craft cocktails? Count me in! Backers Bar came up as ","useful":1,"cool":1},"apPZc5rOw7Lz7sT9gKIx7g":{"text":"The breakfast we had there was outstanding! The cakes were great too. Nice servers. Overal","useful":0,"cool":0},"kzIyhWGn0xkC-PrQsGsk7g":{"text":"Cozy! \n\nWe came in for a nightcap. We'd heard great things about the desserts and from the","useful":0,"cool":0},"qqSvMsyN_fa0ujVHDH7IWQ":{"text":"Awesome place! The desserts were delicious and i love the addition of the board games. \nPo","useful":0,"cool":0},"x_OOgnlmC5mcgXKESLfb8g":{"text":"Pleasantly surprised. Nice place, good drinks at a reasonable price. I would go back.","useful":0,"cool":2},"8Y3DDK9HhUqEBewdHHKLcg":{"text":"Amazing. It's everything I wished for in a bar- cool people, great cocktails, incredible d","useful":0,"cool":0},"_q4hKj5hm5C2bfAMKvTTZQ":{"text":"What a great find tonight. Stumbled upon this place doing a Yelp search for desserts while","useful":0,"cool":0},"tYGBydDAEOOcEHhA38SLCg":{"text":"Such a fun concept and great late night idea! Delicious dessert and drinks. I got the red ","useful":0,"cool":0},"ClkoSsqI5csGqIiZpCNmCQ":{"text":"Rate hey super yummy and love love love their fried pies do yourself a favor if you feel l","useful":0,"cool":0},"GSD8kBucMx0QS1p-0FRP1A":{"text":"Delicious. Fabulous. Wonderful. Best cake I have EVER had. Nothing compares to this heaven","useful":0,"cool":0},"tvi1dm9EVQ0_ymiWjwR6Uw":{"text":"Fantastic! This is the place to enjoy a soul-soothing craft cocktail and maybe a super del","useful":0,"cool":0},"mx3xcrjZjL-3TzOOqQI10Q":{"text":"We were on vacation and I saw this place on Yelp and had to check it out . It was literall","useful":0,"cool":0},"Phb29vRHIMP4UG94YqHLBw":{"text":"Such a sweet setup. Bakery bar is great midday on a Saturday. Order a slice of doberge cak","useful":1,"cool":0},"wvadhOHoN-Ew9kP73q4P9A":{"text":"My saving grace!\n  This is a great little gem, Dany was helpful, friendly, fast, and very ","useful":1,"cool":1},"_QlJ6PLfF1Mn91uGTrAKkw":{"text":"Awsome staff, Charles was very pleasant and made me feel welcomed and wanting to come back","useful":0,"cool":0},"x_muIuNWpN-u403kCHvTRQ":{"text":"Very enjoyable, drinks were good, workers are friendly, and plate full of cheese/meat. Wha","useful":0,"cool":0},"I4kx-ZnyyMpd8mdVqAj0Gg":{"text":"I have been to the Bakery Bar several times in the evening and was thoroughly impressed wi","useful":0,"cool":0},"EpdNUuTWffYpf9-gudfS7A":{"text":"One of my favorite places I've gone to in New Orleans. They have a bar, desserts, coffee, ","useful":0,"cool":0},"kz5ClSca-Nwx2aNIjG8oHg":{"text":"We stopped for happy hour! $3 martinis. We added a slice of cake. Cake may been a bit too ","useful":1,"cool":1},"mK4QGOVHxkKqziavvNS2Yw":{"text":"This place is so nice. The staff, atmosphere,  service - all great. Can't wait to go back.","useful":0,"cool":0},"HDUoRkxpoNvAsnX1Uy3qnA":{"text":"Five stars for the friendly service.  Five stars for a great cup of coffee.  And, five sta","useful":0,"cool":0},"C2FtgEjYZXGcXzhih2Tubw":{"text":"Great place to grab dessert and a drink, we didn't try anything but dessert. We had the le","useful":1,"cool":1},"omlLBoWPudFOEGhXtfvBtQ":{"text":"Awesome place! Was busy on a Friday night but the bartender Vincent did a great job. Good ","useful":0,"cool":0},"fZbdR5Ds6ahst0lbcdRfLg":{"text":"Yum! Tucked away inconspicuously from the arts district, is the bakery bar, which is exact","useful":0,"cool":0},"SvlwQ5QzOXWaREGyF03fsQ":{"text":"5 stars for their amazing BBQ shrimp and grits, 2-3 stars for the desserts we tried. In ad","useful":3,"cool":1},"QlLmgxvUlLYmgevzeBqcaQ":{"text":"Hit or miss: very cute decor, but quite small. We tried the Irish coffee, and a spiced ora","useful":0,"cool":0},"9SkCbfFXNCqTTjPK8RFsfg":{"text":"This was the absolute cutest little brunch spot I wound up at for my birthday with a few f","useful":1,"cool":1},"SuHZR2iSIy_woYLWbhR_CQ":{"text":"This place was very cute and intimate inside, the outside is very misleading! Definitely t","useful":0,"cool":0},"j0mtxZ-SQesLFyrWiDwp2w":{"text":"Pastry was decorative and the inside is warm and homey. Love the touch of bookshelves, boo","useful":1,"cool":0},"cXxyeYvUeu7KJNtN7xnp8A":{"text":"The cake we had was ridiculously good! As were the cocktails. I'd go back just for the cak","useful":0,"cool":0},"dTEubJxpYOhAVUiNCc7Wpw":{"text":"This place is all I need. Cocktails, sweets, and games. I love that is equally approachabl","useful":0,"cool":0},"nQ3h8ONzypeOTFB4vs4qPA":{"text":"Hate to give this quaint and friendly staffed place a 4. Just an off night I think or a mi","useful":0,"cool":0},"0P3UuGW_k05RmqhlvMIfBg":{"text":"Very friendly staff in a small and casual setting that is not too crowded. The baked goods","useful":0,"cool":0},"GlxCxlw4qwnRn_74faCbeg":{"text":"It's a bakery, yes you can buy baked goods, and a bar, yes you can sit down and order a co","useful":3,"cool":3},"rmAaHNfu-SNIM52dWOMA3w":{"text":"Nice place to enjoy a cocktail, coffee or a light snack. The coffee martini drink is reall","useful":0,"cool":0},"wr2FcUe3_bGTJ7RgtBpSIw":{"text":"We were searching for dessert late at night on a weekday and ran across this place. They h","useful":0,"cool":0},"oQKaLqYfQdzd7j1DwLK6Vw":{"text":"This place is very interesting. \n\nGreat cakes, but what makes it interesting is the fact t","useful":0,"cool":0},"RrwagbMEvV7TLRg6DXMm3A":{"text":"I didn't have much expectations when my wife said we were going here because it's somethin","useful":0,"cool":0},"cTLjy6dII3-QD1-bhmh2Sw":{"text":"I love this place, it is so nostalgic. Very relaxing and family friendly. Great hangout sp","useful":0,"cool":0},"wAbpawUoXQhVbF84RmMVqg":{"text":"We went to the Bakery Bar after Luna Fete to cap off an all-ages night out. The desserts, ","useful":0,"cool":0},"Mno6vlfkqJGYIRPV1mbD8A":{"text":"Located in a remote(ish) part of New Orleans, this place is a hidden gem. Inside you'll fi","useful":0,"cool":0},"U9Til0p0xxP397VKy4rQSg":{"text":"Wow!  This is fantastic!  A bar with a bakery that is open late! \n\nI was out late after a ","useful":0,"cool":0},"2xFvBYbP_i7VNxe3X7OVvw":{"text":"I think I would have loved this if I hadn't been so darned full or at the end of our vacat","useful":0,"cool":0},"79afiF00Xzf8N_-KPkSTvA":{"text":"I ate and drank here in August. What a fun little place. The walk in and to the left is th","useful":1,"cool":0},"fEJZyzbF1rY7tdfOGsu7wQ":{"text":"Amazing doberge cakes. I love so many it's hard to choose and I wind up spending $60 on sl","useful":1,"cool":1},"bCMEdmvnYXWs_EjiIcAkeQ":{"text":"Such a cute place! We thoroughly enjoyed our drinks at Bakery Bar. We had the Starlight Ki","useful":0,"cool":0},"zFgNXACEOL2Iajmknxog2A":{"text":"This place is a sweet place of respite in a city that seemingly never sleeps. They serve t","useful":0,"cool":0},"ndAMuvkyJ1BnWtpAodYPdw":{"text":"I frequent BB pretty regularly as it is the closest bar to my apartment. It's a great spot","useful":3,"cool":4},"NUavwQwk5gS7zACPot3C1w":{"text":"A few friends and I went recently for happy hour and the place was poppin'. I had a gin ma","useful":0,"cool":0},"UWgJTg7LBIbWr4DMPvgZTw":{"text":"Incredible concept here! A bar and amazing desserts all in one place. We stopped by after ","useful":3,"cool":1},"E18gRIfZKZa8HPIQZForhQ":{"text":"First time and will be back!  Great atmosphere, diverse drink selection, friendly staff, g","useful":0,"cool":0},"X0YsaUx_KkyG6xw3_N_luQ":{"text":"My aunt always says \"Eat dessert first\". If you live by that, or If you just need to satis","useful":1,"cool":2},"7zfMkEXb29KRhCyY-pTv0Q":{"text":"The bartender made great recommendations. Nice cakes in the case but don't be afraid to or","useful":0,"cool":0},"gfqMGekB7VNZXmpSFy6YDw":{"text":"Yes, yes and yes. Cocktails an cake seriously cannot be beat. The staff was so sweet, the ","useful":1,"cool":1},"bQnwiuuWi19QJGaWUkgMGw":{"text":"So I don't drink alcohol.  BUT still worth an afternoon visit.  Why? The bakery case-- sal","useful":1,"cool":0},"A429UgrxadKF2QQD7pE3JQ":{"text":"I was so excited to come here, that I may have hurried through dinner quickly in hopes to ","useful":0,"cool":0},"YcNdfuMEt_4T0UbuGJ_UbQ":{"text":"Love it. Very attentive staff, especially Kily ( if misspelled sorry).  The gimlet was per","useful":0,"cool":0},"yVkYZ-EmdPKYpSZnZXRujA":{"text":"Loved this place! The atmosphere is a wonderful cross better an old fashioned library and ","useful":1,"cool":0},"I_fcljTUQx78VFNmKxUJsA":{"text":"This is the perfect coffee & dessert place after a date night or a chill night out with fr","useful":0,"cool":0},"RpKc0Yi1e3kKRe9la1EgTQ":{"text":"Amazing deserts staff was very accommodating and helpful didn't have a chance to have thei","useful":0,"cool":0},"GexaaGOmz6ovm3tYlc8u8A":{"text":"I had the pimento cheese sandwich with a mimosa, and me and my boyfriend shared a slice of","useful":0,"cool":0},"rIAQ8YsSW4Lty9Z299MWWA":{"text":"What a great place!  I recall coming to Eleven79, and had a fantastic meal then. My experi","useful":1,"cool":1},"UevBDg3A5wbOJnmj3RXgwA":{"text":"Great spot. Not in the Quarter which is a plus. The beer and cocktail list is amazing. Sta","useful":0,"cool":0},"daAVbxOL7_AiAtsE0hr-XQ":{"text":"Came here after dinner to get a little dessert to go. \n\nLocation - You may feel like you'r","useful":0,"cool":0},"Dyphkvc9fzTIkY64Jtel1g":{"text":"I've always wanted to stop by here, and just never had the chance. Stopped in around lunch","useful":0,"cool":0},"DldSfDES1hYFk6-d7zZP4Q":{"text":"Definitely one of the best breakfast sandwiches I've ever had! The Pullman bread was so bu","useful":3,"cool":2},"mcF_AxXSbNv7DtQr8PE0JA":{"text":"I was very pleased with my Lemon V's Wedding Cake Doberge in my words  Very moist and tast","useful":0,"cool":0},"OFAqjOnye0z_0tHYxkbs-A":{"text":"I have a huge sweet tooth, and I LOVE the bakery bar. The space inside feels very inviting","useful":0,"cool":0},"bQ7Z9bPpvtDQjr1tb4tmXA":{"text":"I have been anxious to try Bakery Bar eversince it opened. I'm glad I had the opportunity ","useful":0,"cool":1},"ll_ILfmwKISpfLZtyq9XEA":{"text":"Dessert and drinks to die for... brunch is a must. Fun atmosphere with board games to play","useful":0,"cool":0},"uri1f20qH7w25hz0azzHIQ":{"text":"Great place! Really good food and drinks. Great coffee and no line! It was a pleasure and ","useful":0,"cool":0},"yMf_RwhGCt1h_R_V4adV4w":{"text":"After attending a Yelp event at the WWII museum, I found myself craving the one thing that","useful":4,"cool":4},"-DkdSg5GtBECUgGbHORZsw":{"text":"I really like the laid back atmosphere and the concept of Bakery Bar. You can play games, ","useful":0,"cool":0},"9mIt9OoP2MI3mKNZtHM2-Q":{"text":"I've been here a couple times and I have to say that this is the SPOT. They're open until ","useful":1,"cool":1},"RpBF1YPEBOIGygcNphrKxg":{"text":"Best desserts I've had in a long time!! Will be back!! Highly recommend! Had the creme brû","useful":0,"cool":0},"hr3_4BKTO43ZvlO4TtLQ1g":{"text":"The carrot cake bite was the most delicious by far. We had the strawberry bite and red vel","useful":0,"cool":0},"2KcrAtL9cZJp4xlmypbcUA":{"text":"Starlight Kiss sounds to be a light refreshment... it's anything but. Oh, this isn't me co","useful":0,"cool":0},"KWe2kebZGtynXijH0RJaUQ":{"text":"I had a meeting, so naturally I suggested this place because meetings are always better wi","useful":10,"cool":7},"baf8gvPZ-5tequaIKcfzEQ":{"text":"I forgot to review the Bakery Bar. But it was awesome , very relaxed atmosphere. I had a b","useful":0,"cool":0},"8wot3BiOKk4Uan9ExPTm5g":{"text":"Charming place for cocktails and breakfast. Although they are open till midnight! Woohoo. ","useful":4,"cool":4},"5IKJisl3z0mlPUZf7I23bw":{"text":"Stopped her after a late night dinner and was not disappointed! While their late night sna","useful":1,"cool":0},"EQOCMN4-Pm6lx9WnoBl7ag":{"text":"This is some of the best New Orleans has to offer. The drinks are strong, and the do-bites","useful":3,"cool":1},"Uej938PplDtVgd9H_AkD8w":{"text":"There's not much not to love about a place that has a ton of desserts and booze right? \n\nI","useful":0,"cool":0},"glSNhlaJ1UduU14pUQuMoA":{"text":"Great cocktail bar. Seasonal drinks are creative and delicious. Good place to hang out in ","useful":0,"cool":0},"b6aZZZtq7P4O3d1xyjraiw":{"text":"This was my first time at the Bakery Bar and it did not disappoint. There's quite the vari","useful":0,"cool":0},"2T_dg3yy7r-9d5-LQJzrcA":{"text":"Cake was good, frosting was a little too dense. Drinks were very strong. Fun atmosphere. C","useful":0,"cool":0},"ZmCn-L0wv7UydGs8v5mJLQ":{"text":"My friday started really well with a stop at Truck Stop Coffee in the morning and was aski","useful":0,"cool":0},"ltRMPtFFdvrZVizuMo2SIw":{"text":"I love the bakery bar! I always get the vanilla doberge brûlée and have tried the chocolat","useful":0,"cool":0},"a5cjqqShMKv9dLYe6njhrQ":{"text":"Walked in with my family for the first time eager to purchase some baked goods and see the","useful":1,"cool":0},"NjP8fw7jexx4EfuWIwR5gg":{"text":"All's I had was the absinthe frappe. Wow! Totally knocked me on my ass. Very tasty an dece","useful":0,"cool":0},"2O1dabNHaCtSANkxplZJfA":{"text":"WOW.  Do yourself a favor and get you a whole box of the chocolate raspberry petit fours. ","useful":0,"cool":0},"eaN0dviqVzC36O7DgvFhVA":{"text":"The treats are not only delicious, but gorgeous! I don't understand the people leaving rev","useful":2,"cool":1},"4CoprdXU0Ti8wlUlZwYEgA":{"text":"Good cocktails and delicious deserts but damn this place is in the middle of nowhere. It i","useful":0,"cool":0},"ilHeZkSJcQUp-YPoFFsQ9A":{"text":"Super place. Brand new and great. Cheese and charcuterie plate was fantastic. The sweets a","useful":0,"cool":1},"5GKiua8TQjT4QdaO8JKoyg":{"text":"The Bakery Bar is a deceptively beautiful sight to lay your eyes upon. The old-fashioned i","useful":2,"cool":0},"yDdnTxl_1O7CVl6xqdZHgQ":{"text":"The best invention since (insert your favorite thing here).  Seriously, this is THE best c","useful":2,"cool":0},"_xXTybGYzklHtU7dEh9mbg":{"text":"Very friendly staff in a small and casual setting that is not too crowded. The baked goods","useful":1,"cool":1},"XMMMP7BMbHnSenDMsbeyWw":{"text":"A bar plus small bites to nosh on and scrumptious desserts...all set in an intimate yet tr","useful":2,"cool":1},"VJpJ_ZNlfRVLyEOaFzE9xg":{"text":"the cake and other sweet items are amazing, Charlotte McGhee and Chuck Mary have done a br","useful":0,"cool":0},"5W7a9lqXlYsOzzV3SK0SGw":{"text":"Loooooved visiting this fun desert and cocktail spot! We came in after a (mediocre) dinner","useful":1,"cool":0},"e66-b1kY7Hdi5m4tIQz-Lg":{"text":"I had the vanilla cake creme brûlée and my boyfriend had the bananas foster bread pudding.","useful":0,"cool":0},"ritPySxqFS1UF7tfIGXbtA":{"text":"Came to New Orleans for my birthday.  The night before we left, we decided to end on a goo","useful":0,"cool":0},"WX4Yr_z1pem4-Wx8b7iCug":{"text":"Baked goods, savory snacks, alcohol, boardgames. GET IT. They often sell out of the cakes,","useful":1,"cool":1},"8cfMaauBpzKMqv5GMEsuQg":{"text":"My first visit to The Bakery Bar was amazing. I tried the S'mores Doberge Cake and the Van","useful":2,"cool":1},"iMDQHJYgztrmlgx121Y8mQ":{"text":"Came here with my fiancee' after getting pizza from Wood a few blocks away.  We wanted des","useful":1,"cool":1},"qwar6ImX3Sq39AIexFjBbA":{"text":"Stopped in with my family for doberge cake and a glass of rose'. The bartender, atmosphere","useful":0,"cool":0},"YGH7ucwkSmhMdUJ6PDCZQQ":{"text":"Really cool place! Alcohol, desserts, & board games. They also gave us free milk & cookies","useful":2,"cool":1},"bHGKTSaffvYxIKi-sGhb1A":{"text":"Absolutely loved the atmosphere! So many great options for drinks, food, and dessert. Our ","useful":0,"cool":0},"jIUbXsAuMOIkRZErP7KQRg":{"text":"This was the most moist cake I've ever eaten. However, I didn't like the pudding in the la","useful":0,"cool":0},"lyjUUJgKRk7AvuUUHH5ybg":{"text":"One of the newer joints in town Bakery Bar hails themselves as being a great after dinner ","useful":3,"cool":4},"Bpy8zRYDoMCsrX4RM3eUNw":{"text":"I go to big red bar all the time. When I go I typically get just cake. Every now and then ","useful":0,"cool":0},"jkxfENERdvwQq6eygsabZw":{"text":"A unique bar concept near downtown New Orleans by the I-10 overpass. A bit sketchy of an a","useful":3,"cool":2},"GKvZm4MMZHWD7OFNLol5dw":{"text":"This is a great place to meet friends for dessert or cocktails or both. The staff is super","useful":0,"cool":0},"qjQiKE5TUcxUksIdfMag-Q":{"text":"This place is great!  If you're in the Lower Garden District of New Orleans, you HAVE to c","useful":0,"cool":0},"TyK0xsnvVQQbLr9ukZVNCw":{"text":"Hours are not as advertised. Arrived at 10:25 pm on Wednesday, March 1 and they are closed","useful":0,"cool":0},"COYRoa8V2vc9R-dPX-txeg":{"text":"OMGreatness took some friends from Houston here on a whim Monday because another place was","useful":0,"cool":0},"yXQZmt99-bUc5LDdeyyWWA":{"text":"Very nice little place. Decided to check it out for some desert. Had the banana foster bre","useful":1,"cool":1},"fBcRos7VQOKWH6zHfPGwow":{"text":"You MUST get a slice of doberge cake. \nI recommend the\n peanut butter & strawberry, \nturtl","useful":4,"cool":1},"ct8SU3BFZzAal5GSxgZ_6A":{"text":"Great little bar with a great selection of cakes. Had the carrot cake was very good. Stays","useful":0,"cool":0},"25Qlr0w947NYnnZZR5Z7Lg":{"text":"The cake is so moist and simply delicious. Came here on a late night to grab a piece of bi","useful":1,"cool":0},"Hg0u4aCUzfK5ZDKzxgwmaA":{"text":"UPDATE: I have been contacted and offered a gift card to make up for the money wasted on t","useful":1,"cool":1},"dv_627Yf_SxRcOa-cYCsww":{"text":"The Doberge cakes are to DIE FOR! I had the Wedding Cake and the yellow one with some sort","useful":0,"cool":0},"KS8IgVRCgwWlfQQE2BOq2g":{"text":"I had heard good things about Bakery Bar, but it wasn't quite what I expected. My cocktail","useful":1,"cool":1},"pzuRjtepmMxvHrknk1hJdg":{"text":"It's a great place for something sweet, but their drinks were not good. And one of the cak","useful":0,"cool":0},"ZE1mUpYRivCbLfo26ZQfCA":{"text":"This review is just for the doberge cake and almond cake pop to go. We were in the neighbo","useful":8,"cool":3},"anhwQOYADxMndPg74AvZNw":{"text":"Really moist delicious cake. They serve a variety of dishes. Awesome place to chill. Wide ","useful":0,"cool":0},"3ij5DWYj3TEclhyQQOeItQ":{"text":"It was wonderful.  We tried 3 different desserts that were so amazing.  Beignets with peac","useful":0,"cool":0},"eGdRR5_PLJFleyhEKo5JTQ":{"text":"We came here as a stop on my New Orleans trip. It was a cute little hipster bar with a gre","useful":0,"cool":0},"-2If9jigVxDgHpE_18ondQ":{"text":"Really moist delicious cake. They serve a variety of dishes. Awesome place to chill. Wide ","useful":0,"cool":0},"uQfVadLeU2c9e_gIrdGlQw":{"text":"Oh my goodness! I had some DELICIOUS cauliflower hummus and an amazing slice of red velvet","useful":0,"cool":0},"FcS-BY_-TrjxPgFAFXc1Ig":{"text":"I came across this place prior to our trip and made a mental note that we should stop here","useful":3,"cool":2},"LB7qiWdgRgd8oTZRynJBzA":{"text":"Delicious and very welcoming. We didnt enjoy the walk from Cochon, but definitely satisfie","useful":0,"cool":0},"MHn9to4LfKUcKcuPhm82SQ":{"text":"very good cake and beignets. but the service is horrible my friends and i waited 30 minute","useful":0,"cool":0},"BR5Kw0fM9Y2O9kNrSnqU5Q":{"text":"We came in town from Pensacola to visit a hand full of craft bars in New Orleans and the b","useful":0,"cool":0},"AkP3xwRHGrM2t5SKU7zSgQ":{"text":"What an innovative and delicious piece of heaven!! The beignets with lemon creme were amaz","useful":0,"cool":0},"7wPaf5eG1lDmMMDmUdFxTw":{"text":"I came to New Orleans during Mardi Gras. I am not a big tourist fan. I don't like going to","useful":2,"cool":0},"xEHJarGON1tsmOY4_UNoUg":{"text":"After our meal at Toups Meatery, we really wanted a good desert and drinks place to finish","useful":0,"cool":2},"o5qZelDRQaLdZJXlNm41AQ":{"text":"We had impromptu birthday celebration and service was ok not great. Could not accommodate ","useful":0,"cool":0},"w42RTbFsk-XrsqK6_IrfaQ":{"text":"Great last brunch in Nola.  Friends and I stopped on our way out of town and found it to b","useful":0,"cool":0},"8BNui4L8PhFNbie4lg73dw":{"text":"Recently tried it this week and it had pretty good desserts. It has a very calm atmosphere","useful":0,"cool":0},"lD1H8erS_kjOcbODBzp6RA":{"text":"Came here for the dessert which was excellent. Had two different slices of doberge cake-- ","useful":2,"cool":1},"8MQM11cORal2qg5wSKtt_g":{"text":"Cute place that serves alcoholic drink and cakes.  There's a full bar selection.  Differen","useful":1,"cool":2},"_2VrTZSkD1EduWOjDWT0SQ":{"text":"How could you go wrong with a bar and baked goods?!!  Fabulous drinks and biscuits and goo","useful":0,"cool":0},"_wfuDwGAnhLsG5cAO-2fPw":{"text":"Great desserts, drinks and service!  Ended a date night here and it did not disappoint. We","useful":0,"cool":0},"87YIB-kpMSf1jY4xZqeRYg":{"text":"When Debbie Does Doberge opened Bakery Bar, it was everything I could ever want: delicious","useful":0,"cool":0},"ESdDGZkToyk3OlSCgIm87g":{"text":"Great vibe, deserts, cocktails, music and very attentive staff. \nThey have a full liquor b","useful":0,"cool":0},"zv4Jzb3lO9lwj8Oqw7UP3g":{"text":"Unique place . Very relaxing and quite . Hubby and I had a great time . After our Dinner o","useful":0,"cool":1},"tproyXhmkbXg2sKdcotQnw":{"text":"Cute place a bit in the outskirts but worth the craft cocktails and cake! The 7 layer cake","useful":1,"cool":0},"dwd-hFpj5AfzzQZfMynl9w":{"text":"Bar, bakery, game night all in one. They have their own cocktails. I had something similar","useful":2,"cool":1},"RGxPVsRz3kthCwZ2iZP5Hw":{"text":"I've never been more impressed with a place that just opened up. Usually I avoid new resta","useful":3,"cool":0},"UWEtTTeSEndSiEFoFDMRug":{"text":"Such a fantastic and cute little bakery! Definitely a bougee one and one that my friends a","useful":0,"cool":0},"V8oJ_Q_vbRFRicmlHEmGOg":{"text":"Yum! This is a cool bar, has an old school library feel and the cakes are incredible and r","useful":1,"cool":0},"lbKfzfppsjxLvmB2mnDFIQ":{"text":"In love with the beignets and cake from this place! We stumbled upon this place from all t","useful":0,"cool":0},"YjLQV-MUTHacmRhpDZFjAA":{"text":"OMYGOSH BEST RED VELVET CAKE I HAVE EVER HAD IN MY LIFE, soooooo moist and pleases my tast","useful":0,"cool":0},"06VRijR-yO9v_sXe_O7B9A":{"text":"I don't know how my fellow traveler found this place but I'm so glad she did. I have never","useful":4,"cool":2},"JhqAj1oHywat9ryx8uMAvQ":{"text":"Horrible experience. After we were seated, waiter took our drink order and let us review t","useful":1,"cool":0},"LxVSOvEJ8shvDTzLILM6cA":{"text":"This place looked great on paper. The milk and cookies beignets seemed like such a good id","useful":1,"cool":0},"ovhERSK2BfwYkCgGgFuQJA":{"text":"Really cool idea. Desserts and wine, champagne, etc.... awesome looking desserts might I a","useful":1,"cool":1},"SnfxuQZz56VayZpqoTJxxA":{"text":"Baked goods plus bar plus food= \"It's Friday Friday! I love it\n\nSo I got the Siren Song: s","useful":2,"cool":1},"IC9h28LlUszykKtQpvHDwg":{"text":"The best invention since (insert your favorite thing here).  Seriously, this is THE best c","useful":0,"cool":1},"X1XJkKip4VyjApcBhki2og":{"text":"That was the best 5000 calories I've ever had incredible extremely tasty and all the flavo","useful":0,"cool":0},"0f6uH63rH5K_6FmBMCCEnw":{"text":"Love, love, love bakery bar. I've been coming here since they've open their doors. \nI don'","useful":1,"cool":0},"2E-btajT_ybzS46R5Wqu7w":{"text":"I've been meaning to check this place out on a date but....no dates came along so I took s","useful":1,"cool":0},"KhYulU28fftlxIRCR6EXQA":{"text":"This was my first time at Bakery Bar and I wasn't sure exactly what to expect, but its nam","useful":2,"cool":2},"7O2GcHAt_syEjoZGPf589A":{"text":"Such a unique and wonderful place\n\nI've never been to a bakery that's also a bar, was a gr","useful":0,"cool":0},"FECEAHvdCFHZYOs77zFLnw":{"text":"The Doberge cakes are to DIE FOR! I had the Wedding Cake and the yellow one with some sort","useful":0,"cool":0},"sK15gxFmFx9IGL8ce5K2ug":{"text":"His place is fabulous the cakes are delicious and the brunch is amazing this will be my ne","useful":0,"cool":0},"CCf2cXGdgk4SVEx3SHWMpw":{"text":"It's a bakery in a bar so how could that be anything but magical... The bartenders are alw","useful":1,"cool":0},"uS9VSFmrCsjydGpesfPCTQ":{"text":"\"The femme bar complement to Barrel Proof's butch whisky bar.\" The atmosphere in this plac","useful":1,"cool":0},"fq40rdvGlOi_p2TsI3kPCw":{"text":"Hidden gem close to Mardi Gras World.  Eccentric apothic drinks and a quirky spin on some ","useful":0,"cool":0},"O2pkjltlm6KWad95Wf9I1Q":{"text":"location really isnt great but the staff were really friendlly but at 7pm i was literally ","useful":1,"cool":0},"GXIEaHDYNunZhvHyq6lN7A":{"text":"We had a lovely experience at this restaurant. The WB&J sandwich is to die for. It could b","useful":0,"cool":0},"bdhw0kIBQ2ljPa3q8sfsMg":{"text":"Hello Deliciousness! Fast, courteous service. Our group tried a few items,\nJalapeño Mac n ","useful":0,"cool":0},"s4HDIC9iQ1Mu7iSP3_ynOg":{"text":"Fabulous churro cake ball and salty balls! Love the flavor and the ambience! Great for a c","useful":0,"cool":0},"EBhPnUfwIY8_-vKkvJx8IA":{"text":"The Rock-It Pop Mai Tai was great! If you're going for the food, then you really need a sw","useful":1,"cool":0},"yU-zyBy-6Pv5g3l5sgsSOg":{"text":"(If possible I would give 0 stars). This was by far the worst restaurant/ dessert. I order","useful":0,"cool":0},"ve6p3T0pWzLPPga_OgXDtw":{"text":"My boyfriend and I went last night and tried their new menu for the first time - I got the","useful":0,"cool":0},"W0e6SGLNOmBT_-HZI5_NQA":{"text":"If don't already know Google 'Doberge Cake' then 'Debbie does Doberge'. \n\nI drove past thi","useful":16,"cool":8},"ydf1WH4VM9UlHG-UvyKAUQ":{"text":"This is a rustic trendy bakery and coffee bar that also has brunch.\n\nI tried a piece of sw","useful":2,"cool":1},"-Lw5o-RgQdZX1uA0tyFqLg":{"text":"Cheyenne, cheyenne, cheyenne. Best bartender around! Came in on a Sunday night for a late ","useful":0,"cool":0},"pZu_OQKC_dcws3desN3IIQ":{"text":"Brought my boyfriend here for his birthday. He requested good food with great dessert and ","useful":0,"cool":0},"QSvXz8OCZ-sUyW6FLQydKQ":{"text":"My husband & I had high hopes for this place but were somewhat disappointed. Presentation ","useful":0,"cool":0},"STvRi8mlQwJ8A9amW-Jv3Q":{"text":"Cake qas great, loved the key lime pie.  Service was good.  Nice little place for some des","useful":0,"cool":0},"1WA4C0DZK0gczTgU1RePYA":{"text":"This place came recommended by a friend, so when I arrived I was expecting more of a bar w","useful":2,"cool":1},"lioGHTHcKVCQn2_ec7DxVQ":{"text":"For a quiet place with scrumptious treats and some booze, the Bakery Bar is where it's at.","useful":0,"cool":0},"ebM0uOil5Jcl4nwZ2uMApQ":{"text":"From the second you walk in, you're greeted! The space feels like an old library with a ve","useful":0,"cool":1},"syRvyjNySc9b58B0aVj4Hw":{"text":"PSA: they no longer have games here!\n\nDoberge cake/slices from Debbie Does Doberge. \n\nChoc","useful":1,"cool":0},"CL1iTNKsdYyTKYOMn4_s7Q":{"text":"I am visiting New Orleans on business and was really looking forward to going there. I had","useful":0,"cool":0},"Ys2YJOExVIk6CMN_-ts5ng":{"text":"When I heard the concept, I thought this is my ideal bar. Who doesn't want baked goods whi","useful":22,"cool":17},"YSvfxItulSQNA3UKjmNTKA":{"text":"I love the concept of a bakery and a bar together, but this is trying to hard and neither ","useful":1,"cool":0},"otOKbdel2N6GIfjInjjQ5A":{"text":"Just ate the key lime pie and wedding cake. Ate it too fast to even take a picture. Y'all.","useful":0,"cool":1},"LKpL2Lm_IeJ6cgLxJV-Now":{"text":"Really loved the way they decorated the inside but the dessert wasn't as great as I was ho","useful":0,"cool":0},"xRuyzbmMsxCMPCf9sQvX6w":{"text":"What a fun place to hangout! The vibes of bakery bar, and the friendly staff was fantastic","useful":2,"cool":1},"97RmwWh453rfvwqsT3B88w":{"text":"Wow! These cakes are amazing! Highly recommend the wedding cake- almond heaven! Dare I say","useful":0,"cool":0},"LB0G7L3kW_9PDQB7TWCZoQ":{"text":"Came here last night after dinner for drinks and dessert which did not disappoint. The res","useful":0,"cool":1},"AEAY3O1Qj0tJHvPVOhqYOw":{"text":"Nice atmosphere. Good music. Doberge cake was delicious. A little pricey, for 2 slices of ","useful":0,"cool":0},"zokySfs37c-MmvJ4BaYHFA":{"text":"Items Selected:\nSweet Potato Pie Doberge Slice\nTurtle Doberge Slice\nRainbow Wedding Cake D","useful":6,"cool":6},"7uQuUjkpLWZz1TMYP6xySQ":{"text":"OMG. A friend who understands my dessert cravings brought me here when I was visiting NOLA","useful":0,"cool":0},"x9ZXDZms-fdi-m4GDt7tYw":{"text":"Bakery bar had such a nice ambience, and it's definitely a great place for games and drink","useful":1,"cool":1},"F90ZE9BtEWtO5-ePosMW1w":{"text":"Love the ambiance and the fact that it is open until midnight!! There is a spin on each me","useful":0,"cool":0},"S9-nwF01mYnoXWFVK8AXHw":{"text":"I stopped here on my visit to New Orleans and left so disappointed. I have never dealt wit","useful":0,"cool":0},"sbC57MESwhUTlO3DoYUqYA":{"text":"So disappointing. We came from Los Angeles and made a point to stop here because last time","useful":1,"cool":0},"V7Xcj0s5S1pJ7nbJoPGJyg":{"text":"Love this place! The staff is awesome and friendly, the venue is charming, but the food! W","useful":0,"cool":0},"-n2WmCnUAAzx9Z2eEFu2IA":{"text":"Tried to hit up the Bakery Bar last night \nThe atmosphere was chill, really good drink men","useful":0,"cool":0},"EW3V8GTn4TwHJAN1bV3xlw":{"text":"Awesome little spot for dessert and drinks. I got some petit fours and a glass of wine and","useful":1,"cool":0},"6BcbwrzPE2ZyzeBVGLT3Hw":{"text":"I've been a big fan of this place for some time, but after an unpleasant experience I feel","useful":2,"cool":0},"djZpkQMoBF3HSZuO53XA_g":{"text":"Great, unique restaurant. I had the rainbow wedding cake, and it was delicious, although w","useful":0,"cool":0},"0LwrfXIbQhLUXb9WsyJGGg":{"text":"Love this place! It's always hard trying to find a good dessert place that's open late! Pl","useful":3,"cool":1},"OMhKKdpV4hzl0ama_EVRzQ":{"text":"I love their service! Their food was very good but the cake was okay. I brought it home to","useful":0,"cool":0},"SRwXOfNLnqCOcqL9jlcImw":{"text":"This place is really nice, I love the laid back ambiance of the place, My bf and I came he","useful":0,"cool":0},"IMbs0z-agtUxdr3K_61qLA":{"text":"I'm married to someone whose two favorite things may be dessert and drinks.  This place is","useful":3,"cool":1},"iP3qLpxjBIL-cmuiiLzzbw":{"text":"Headed here the other night for dessert and a quick drink. There's a couple quirky things ","useful":2,"cool":0},"Se1tSJLixBUsxeFyNrcpGA":{"text":"My girlfriends and I visited The Bakery Bar this Saturday for the first time to celebrate ","useful":0,"cool":0},"FRgfVW-7cBSzUtkvbU6o5A":{"text":"This place was everything. I want them to \nmake my wedding cake whenever I get married one","useful":0,"cool":0},"ryArdUy7ESy5rHAvX2I7XQ":{"text":"Popped in for a dessert after dinner and was pleasantly surprised by the buzzing atmospher","useful":0,"cool":1},"8VFIrdykM6nKLWiA-KbClQ":{"text":"Chilled atmosphere. Definitely a nice place for conversations over drinks and desserts. Th","useful":2,"cool":0},"uDJgwWK0nXLYv8dH_nmTgw":{"text":"Can I give Bakery Bar SIX stars?! My friend and I walked a few miles in the 90-degree heat","useful":0,"cool":0},"7dAkt8Py7cw13lClDtdqaw":{"text":"The sweet tooth kid in me raves at the mere thought of Bakery Bar. I'm so glad I found it ","useful":0,"cool":0},"37db-SwU1dBluLo2HG9Rhg":{"text":"The staffs are so friendly. We only there for take out cake and they were so helpful and p","useful":0,"cool":0},"777_InZV9KrPAMySCI2kVg":{"text":"Amazing ambiance and delicious food with phenomenal presentation. We tried the TRASH fries","useful":0,"cool":0},"YnpAd2a1v4Q2wrmgIfphwQ":{"text":"My niece brought back sumptuous goodies back to Los Angeles and I am in heaven!!! The tast","useful":0,"cool":0},"5D7OhVzot6l6TSrsb5ASQg":{"text":"Oh. My. Gosh. I'm so glad I found this place on Yelp! This place is amazing!\n\nWe got a sli","useful":0,"cool":0},"M1fNL3__tuoQjFJPVokIOg":{"text":"The desserts are pretty decent but everything is overshadowed by how rude the staff is. I ","useful":1,"cool":0},"dxsll09I31VmQBK98LFNEw":{"text":"Bakery bar really wasn't what I was expecting.  I was expecting a cute bar with couches an","useful":2,"cool":0},"hQF4p8xCNecF8cgcMWSiEg":{"text":"Ok this is more bar than bakery and I thought I was coming to a bakery case of grand  magn","useful":0,"cool":0},"6GfQQGW1PeuLgtoC9TpihQ":{"text":"Desserts are amazing! Drinks are eh. \n\nCame here as a family for a sugary \"lunch\" while on","useful":0,"cool":0},"Oi5fFC45-Ojtjke5dAtz5Q":{"text":"Amazing Doberge! Walked in and ordered 3 slices to go to share with friends. Got the Mardi","useful":0,"cool":0},"10GFyviAZIvjEmDAGtjz1g":{"text":"Traveling on my birthday and was looking for a slice of birthday cake, later in the evenin","useful":0,"cool":1},"Vo7bKU2JucBL8Vx9Guv5gw":{"text":"A couple friends and I went here for brunch on a Sunday a few weeks back. We realized upon","useful":0,"cool":0},"JS-FtzONnMYrSyZR3dfkLA":{"text":"I have been wanting this from the moment I seen it on social media! I absolutely love dobe","useful":0,"cool":0},"ZHuStg4e5DCJhrZ6KOf5bA":{"text":"Very good presentation but decent taste. I would come back if my guest wanted to come here","useful":1,"cool":0},"SUXiaqkEq7nUfiivRr9Vtw":{"text":"We bring people from out of town to this unsuspecting dessert Mecca!  Usually will sit dow","useful":0,"cool":0},"bOVKk6iSiu2CP5Jx5k-9Rw":{"text":"First impression of this place, very few lights. It's a nice place to get dessert after a ","useful":1,"cool":0},"xJT9MNklCGi1rk1IC1uiCw":{"text":"Loved the desserts here and cocktails! Only negative is they don't have board games anymor","useful":0,"cool":0},"y0fPtT7nIf_noNCd3V2aYQ":{"text":"I have to be honest. The staff was super friendly and the location is very nice. I just di","useful":1,"cool":0},"D0978zdSrAxP6PQ5BCh9KA":{"text":"We tried to stop by for dessert, but ran into issue after issue. First of all, there were ","useful":2,"cool":0},"do5_prHLtAhl5V3ptvcl9g":{"text":"This place is a gem! Not in the greatest of areas but the beignets were a delightful flavo","useful":0,"cool":0},"3cx5t6Z_ZvFgNs1uKDGOuw":{"text":"Huge disappointment. The one upside was the staff was really nice. I was really excited to","useful":0,"cool":0},"egdaT6AiaifIf2CXkCLsow":{"text":"I have been trying to visit Bakery Bar for months. Finally, I met a friend here that I met","useful":0,"cool":0},"G1Jgs4MRPwKk_WRILzflxQ":{"text":"Space ambiance atmosphere. This is the place. Beignets, churro chunks, gelato, Still can't","useful":1,"cool":0},"THdgScpcFUGBl_5SGO1Nqg":{"text":"Food was a 5 star but the service was a -1 star. \nFound this on Facebook and couldn't wait","useful":0,"cool":0},"b1ua-OXWQMflZngx4PNp1g":{"text":"Everything was delicious will definitely go here again when I visit again!!!!food was too ","useful":0,"cool":0},"54x1JNwOi1JP4MI3q_HL4A":{"text":"First, I'll start with the ambience. Perfect! Especially when you want to devour a whole W","useful":0,"cool":0},"dtQVgVfeUyX-BespujhtMw":{"text":"Such a wonderful little spot. Known for their doberge cake, but literally everything here ","useful":2,"cool":2},"W3shSZQ_hHbJT4wrRlm9hw":{"text":"DELICIOUS! I can't imagine a sweeter, friendlier, or more hip bar than Bakery Bar. The una","useful":1,"cool":1},"VK0QkplcGx5-DxzKtyqTcg":{"text":"Came on a Friday night only to find they were \"closed for remodeling\" and would re-open to","useful":0,"cool":0},"SEB-x73rHewIkz3LXEj46A":{"text":"Came here one night to try the rainbow layer cake but unfortunately they didn't have it so","useful":0,"cool":0},"WbYIlIegutBFtkv8MBFheQ":{"text":"I have been wanting to come to this place.  We walked there.  Was hoping to get a drink an","useful":0,"cool":0},"EmVuL4Y2voQQEICIEGTR2A":{"text":"This was a very unique experience.  Starting with the welcome at the door, I loved the wel","useful":1,"cool":0},"gj1nvdKNB-S1mu4iRHDNig":{"text":"I have been frequenting bakery bar for a couple years now. I loved it when it was initiall","useful":0,"cool":1},"anIPnbmnO8zLxDkYk-MDMA":{"text":"I had no idea what to expect with the almond wedding  cake, all I knew is that it was beau","useful":0,"cool":0},"8NQAeC3qBe1lT6gDAarEeQ":{"text":"5 star staff and service! They were all so lovely and attentive. 2 stars because the petit","useful":0,"cool":0},"8rJsDHu59WQyrcyXGFthng":{"text":"Their doberge cakes are easily the one of the best cakes I've had, I tried the cinnamon ro","useful":0,"cool":1},"LpChgF2ud2ZN_m7sx8V5yQ":{"text":"Awesome setting. \n\nWe split few cakes, coffee. The place is excellent for chilling with fr","useful":0,"cool":0},"FkxvP4TV-rACXPQMyB6LEQ":{"text":"LOVE me some Bakery Bar! I go here way too often, but I love sweets and this is one of the","useful":1,"cool":0},"YIlmOoSApFcEFBwkwPR4XQ":{"text":"I saw this bar on a video by Refinery29 and had to try out their famous doberge cakes! We ","useful":3,"cool":1},"ABwT8s0YTgEOsg5-wxVx3g":{"text":"Cake + booze. Great combo.\n\nFor a non-local without a car, the walk from bus station to Ba","useful":1,"cool":2},"1fTvQl6SaxChm_1gTrUgRA":{"text":"I loved loved loved the Bakery Bar! It's a nice cozy spot with a very friendly atmosphere.","useful":0,"cool":0},"wW_J68TEXDw14sM7pyAuQw":{"text":"Service: 5 Stars - We had the sweetest servers!  Super friendly and gave us some great rec","useful":2,"cool":2},"yAxIoezVQGQcBLhMHtpvfw":{"text":"Amazing bar and dessert bar! Great low lite bar off the beaten path in New Orleans. Great ","useful":1,"cool":2},"IMaxvWJNazRx-2Wa9l0iSw":{"text":"Went during happy hour and it was OK. We had 2 drinks 2 desserts . Both desserts tasted of","useful":1,"cool":0},"HnDq70QesVXe9hR-s3XzYA":{"text":"Love this fun, flirty spot that caters to the sweet side and the fun side(drinks). Love th","useful":0,"cool":1},"Yiozn2ckQgEaLmYylv_0Lg":{"text":"it's a bakery with a bar! or a bar with a bakery...\n\ntried the rainbow cake because it was","useful":1,"cool":1},"Ls8PyVCQRiu3eDEFR-aY5A":{"text":"Doberge Cake....DOBERGE CAKE!!!!\n\nLight....fluffy....moist....creamy pudding layers.\n\nNot ","useful":1,"cool":2},"4_cB3cyl2wIP9jetTGS3rQ":{"text":"Went here on a late night mission around 11:30pm on a Saturday night. \nAt this time, the k","useful":1,"cool":0},"tqEOs8C1sDVyKbEJKjhFOQ":{"text":"Great, fun place for dinner, especially desserts and drinks. Sandwiches were amazing thoug","useful":0,"cool":0},"6KglRMnPVbxSvosZ551YYA":{"text":"Waited 20 minutes to be acknowledged.  Nobody ever spoke with me but the bartender looked ","useful":1,"cool":0},"Qy6pVF12-uaS6VaM8PUwHA":{"text":"So I went to happy hour with a few friends. All I need to say is king cake beignets were a","useful":1,"cool":0},"j12xG2Akoo50xNJsqeg_AQ":{"text":"Nice atmosphere that is welcoming to all ages.  Gets a bit noisy but it's all in the spiri","useful":0,"cool":0},"19FiEAJD54dzv2BzFxJkEg":{"text":"This was a great after dinner spot. The drinks are decadent but strong and the desserts we","useful":2,"cool":0},"eCYe8yNtYaLuE2_2x2oucg":{"text":"While driving up St Charles I just happened to search for a place to get coffee and desser","useful":0,"cool":0},"Z8LpjRtSnTKp7VqaUJCGFQ":{"text":"One of my favorite places I visited in NOLA! Get some cake for sure, but we split some oth","useful":0,"cool":0},"8MC2rFX3iIkkvM2j7FkFTA":{"text":"Such a nice change to have a bar dedicated to sweets. Shared the Johnny Appleseed and a co","useful":0,"cool":0},"M51M7Ym0GLr92gq8yh_9Fg":{"text":"I came here with a friend a couple of weeks back and tried the rainbow and strawberry dobe","useful":0,"cool":0},"jwHCh76_tZ8WEBePyTzwsg":{"text":"Always the spot to go after dinner! I love the dobites! They had a fig goat cheese that di","useful":0,"cool":0},"Eunmrfs1WdWArdbDwbJJ7g":{"text":"Came here after we had dinner at another place. The waiter there recommended we come here ","useful":0,"cool":1},"4F2pVOcvOXp7X1K4Dkea8A":{"text":"Let me start off by saying the doberge cakes are always delicious and that is why we go th","useful":0,"cool":0},"Nyvpz87fD2-zTnMIzNQebQ":{"text":"Bakery Bar has it all- booze, amazing bar food, and the exceptional desserts by Debbie Doe","useful":2,"cool":2},"BAhDNjBZwG7FpUPo1kG81A":{"text":"Most delicious and aesthetically pleasing doberge cake slice I've ever eaten. Stop in and ","useful":4,"cool":3},"8v-zEdsoa4v630l2D6xbTw":{"text":"I didn't have a clue what Doberge cake is but who can pass up a bar with sweets! It seems,","useful":3,"cool":4},"3dIC7auEjmMNhj00ontQCA":{"text":"I've only been to Bakery Bar twice, but it's such a cool spot. There aren't many places th","useful":1,"cool":1},"X12YGYCQm94EENUka5ji4Q":{"text":"My boyfriend and I came to Bakery Bar while visiting New Orleans and we were not disappoin","useful":0,"cool":0},"efhCCRhsVZ_tyftXeP84dQ":{"text":"One of my favorites when I'm in town! They have savory food and desserts. I've had their t","useful":2,"cool":1},"7LmYSXx5KJe2YptnKu5j8w":{"text":"Came here for drinks and dessert with friends so can only judge on that. Service was good,","useful":1,"cool":0},"FdZWfVM6HYlconmYswXx7Q":{"text":"This newly opened confection located the very edge of the Lower Garden District is gonna m","useful":13,"cool":9},"xa3Mk8K-bTTcOAeF4WyGQw":{"text":"I love the concept of Bakery Bar- drinks and desserts! But the execution left a lot to be ","useful":1,"cool":0},"tv47pVj3zjeKGwkSUJRlTQ":{"text":"We only did take out because it was late but the Lemon cake is delicious, just the right a","useful":0,"cool":0},"L5H5-syRBbj_fwwh34ZWYw":{"text":"Amazing drinks! Food is great, love how they named the plates. \nValhalla burger was juicy,","useful":1,"cool":0},"qIoJqb-xOpb2NQS9nlOpbA":{"text":"Came for the doberge cake. I had the the blueberry lemon & rainbow. The blueberry lemon wa","useful":0,"cool":0},"zU84Ap-p4fA1LES0669xpQ":{"text":"NOT WORTH YOUR TIME OR MONEY! After two tries, I can safely say food and service are disap","useful":1,"cool":0},"1TH_qigPvJPvbMHERJn8gg":{"text":"Yes a wonderful bar with great cocktails and a delicious bakery that offers awesome cakes ","useful":0,"cool":1},"3op3eq8w4hHMpDcfN6UA1A":{"text":"What can be better than a combination of dessert and alcohol? I loved this place. It might","useful":5,"cool":4},"npp2epV3kV20vXwtWIBzfg":{"text":"Great little spot, albeit a bit unassuming from the outside. Located just beneath a busy u","useful":2,"cool":2},"gJqP9rf7q1D6F3NKw1eWUw":{"text":"Three of us went the Bakery Bar to check out the deserts. Had the chocolate martini, coffe","useful":0,"cool":0},"ZAAcHadcLEHHYL4hTKvxyg":{"text":"Best lemon doberge I have ever had. I am from New Orleans an had every \"best doberge\" and ","useful":1,"cool":0},"iTwuZ_jDX_7X_gjeu8UJ_A":{"text":"Their brunch will surprise you. Don't miss Love this place. Great people, great place to h","useful":1,"cool":1},"v-S2j3Mx9PAi14MNr5Yvqg":{"text":"If you love cake then this is the place for you!!! The Doberge cake is to die for with so ","useful":0,"cool":0},"5KEfugIYqUxsK33WAv6d4Q":{"text":"Hands down the best bread pudding I've ever eaten. While on a weekend visit, we stumbled u","useful":2,"cool":0},"lUWgCDj7PZiMVr9u76MFbg":{"text":"Absolutely loved our experience at Bakery Bar. We decided to come here after dinner at Coc","useful":0,"cool":0},"L6VVUlWp-meiERFH0UDgRQ":{"text":"Their brunch will surprise you. Don't miss it. \n\nLove this place. Great people, great plac","useful":1,"cool":1},"cCKQwxhz3sqg91UX5vj_kg":{"text":"I'm giving the Bakery Bar only two stars because of their staff, selections, and prices. \n","useful":4,"cool":0},"fjaNRSdbrKBsgxrbDop6zA":{"text":"Originally went here to get the chocolate chip beignets. They're no longer on the menu. Bu","useful":0,"cool":0},"dazXNR11lIyBQHt7lovBLw":{"text":"Everything here is delicious. The coffee old fashioneds are the best in town. The food is ","useful":0,"cool":0},"zFJVWGi5sUiNG5-6dLic0w":{"text":"Joe was so cute apparently the previous menu was \"based on childhood and now they're movin","useful":0,"cool":0},"UOEFsW13U2J76S4gyb1h6g":{"text":"The bananas foster bread pudding is my absolute favorite! I love coming here after a nice ","useful":1,"cool":0},"wdoMfR9X4SZmL0lccDVt4w":{"text":"Maybe I didn't get the right thing, or I just don't like doberge cakes -- I just wasn't bl","useful":1,"cool":0},"ncOGTla98U59GFBqdistpQ":{"text":"Amazing service and drinks despite the lazy Sunday morning. Person in our group went on a ","useful":0,"cool":0},"Ilm-umxt63LdFjAjZDXMQQ":{"text":"super sweet, friendly & interactive staff! we had the brunch special with brisket & poache","useful":0,"cool":0},"UeW-g2_aSqzX098KL7w7CA":{"text":"Amazing find off yelp. Cute place, great service, great food and drinks. The food was beau","useful":0,"cool":0},"2cILkoRt32BOH0bKni3BCw":{"text":"Good spot to chill enjoy savory or sweet with a good cocktail \nTell a friend or bring 1","useful":0,"cool":0},"AGVBb_6GUXA9PEjV1R3AOQ":{"text":"After hearing great things about Bakery Bar, I decided to give it a try one night with a f","useful":4,"cool":0},"pfnOA_DDtCCUpifwFqOU7A":{"text":"I've always loved bakery bar for their doberge cakes but I recently went in for their burg","useful":1,"cool":1},"qE6L8tw4M8FWMWaVbpcL6A":{"text":"My daughter and I were hearing great things about Bakery Bar, so finally we made our way t","useful":11,"cool":10},"8epEht20wDGfa4QM4tvDKg":{"text":"LOVE me some Bakery Bar! I go here way too often, but I love sweets and this is one of the","useful":0,"cool":1},"tLthuV1lLK9RHxbWMTfNNA":{"text":"Nom nom gimme some! Doberge bites, cake slices, Drinks here are so good. I love coming her","useful":1,"cool":0},"tjuVObML_KG0aHoRhYbtEw":{"text":"I have been searching for a place for a relaxing place that served dessert and drinks.  Th","useful":0,"cool":1},"FYGoQh2ANYber0ODRnhc5Q":{"text":"We went to the Bakery Bar while visiting NOLA from Kansas for dessert one afternoon. The r","useful":0,"cool":0},"jW1CfIZc0CmauhWQxjNygA":{"text":"Awesome! Seemed like the ultimate \"millennial\" experience, in a good way. \n\nChill and comf","useful":0,"cool":0},"Cz_hXadLPZRmTCx40YgPWg":{"text":"+ plus: Probably the most delicious Lemon Doberge cake we have tried in the New Orleans ar","useful":0,"cool":0},"VFnybPApuilqM-TxrnVfcg":{"text":"Love, Love our neighborhood bar. We did brunch this weekend and it was amazing. \n\nFun plac","useful":0,"cool":0},"2G8pDDBCZsq2KGxAW_d1_A":{"text":"Came to Bakery Bar to get some drinks before heading over to dinner at Cochon. Convenientl","useful":4,"cool":4},"rT09Mz-7TkHd7oMsD51wag":{"text":"Great food. Very unique menu with focus on booze and desserts, but even the food options w","useful":0,"cool":1},"FpJqaDts3THLNRA50yNgrg":{"text":"The name of this place is in the correct order. It's a bakery with a bar.  I assumed it wa","useful":3,"cool":1},"unOjWdqqDfgjVK-ePHDqug":{"text":"I have eaten at Bakery Bar multiple times for dessert only.  Recently, Shari V and I sat d","useful":1,"cool":1},"5ICoezyrdboYQ7233QbbOA":{"text":"We stopped in here for dessert and were looking for the king cake beignets that were menti","useful":10,"cool":11},"ijLggxvbToC3_eBNcQFuAw":{"text":"Can I give Bakery Bar SIX stars?! My friend and I walked a few miles in the 90-degree heat","useful":0,"cool":1},"zr7Qvs00SNh_yl2_9m8mGw":{"text":"A friend recommended us to come here to try their layered cakes. So we did. We had the Ore","useful":1,"cool":1},"OrsSuzdp15BbkcYGE_w12A":{"text":"Great desserts in an unassuming place. We really enjoyed all the special king cake  variat","useful":0,"cool":0},"bfQVG6ByjDkTE2Wsw3fgVA":{"text":"I stumbled upon this place by accident the first day I moved to town and I'm so glad that ","useful":0,"cool":0},"0jZPY6Sjzl4tHtqJ9yfG7A":{"text":"This is my favorite low-key chill, date spot. Almost feels like im in a speak easy. Vibbbb","useful":2,"cool":3},"PQmxsaM_deeO4JLwxcrBzA":{"text":"Great little spot, albeit a bit unassuming from the outside. Located just beneath a busy u","useful":1,"cool":0},"izEIzX9YIC7aCMcpu0ZhKg":{"text":"The cake bites were good and priced decently. I am giving them four stars for the lack of ","useful":0,"cool":0},"wdJwmhvF1Dj2EEr_gJAPHg":{"text":"Drove all the way from the Northshore after seeing their Lunar New Year dessert on social ","useful":2,"cool":0},"lJA4Po_IiBYrAZ2KuRf4-A":{"text":"If there's any sign that needs to be up at Bakery Bar, it's \"why wash down your slice of c","useful":0,"cool":0},"i2nZZqhFbo5nk3u1ssGZCQ":{"text":"I've never heard of the Doberge cake until a yelper from New Orleans recommended this plac","useful":1,"cool":1},"l-EDVrhcYzWZ2sjDQphTiA":{"text":"Came in Saturday at 8:00 pm for a burger, drinks and desserts. Been there for takeout seve","useful":0,"cool":0},"13kZghWgMUNXyARQsVdbCA":{"text":"I came here due to all the great reviews, but left feeling very underwhelmed. The doberge ","useful":1,"cool":0},"pjKNFYnD_6bg7U1wM7jGyg":{"text":"Food isn't worth over an hour wait and almost comically terrible wait staff. Our party of ","useful":0,"cool":0},"6NxXtQ0ql6IgWauW7lwR7g":{"text":"After all the photos of beautiful slices of cakes on my Instagram feed, I had to try this ","useful":2,"cool":1},"pDc1QD_c20XEf3_K21KbBA":{"text":"Bakery Bar is the spot to come for doberge, and they've also got a solid collection of coc","useful":6,"cool":0},"mfQt7CH8lIYUGACnhMBgZA":{"text":"Bakery bar is my favorite dessert hideaway. I go at least 4 times a month and every time I","useful":0,"cool":1},"Xqtrqy2hUxjUomGJXJbENw":{"text":"This place is magic. Seriously. Somehow our group of 6 came by twice with enough luck to b","useful":1,"cool":0},"LP2lEsNtlF46Auq7tLKuJQ":{"text":"Dark\nMysterious \nHip\nCocktails\nDesserts \nBooks\nEye Candy\nFashion\nMovers\nShakers\nTartines \n","useful":11,"cool":9},"oSFky0-7zLX-pvcAQUiANA":{"text":"Walked in spur of the moment and started dancing and singing to the music with the bartend","useful":0,"cool":0},"StszJj34ukEuHqSIwyvzTw":{"text":"We just stopped in for desert based on pictures of the cakes. While we thoroughly enjoyed ","useful":0,"cool":0},"LZZD2_TqVrt3AZW79j4VVw":{"text":"Cold , stale, expensive cake from display. I spent 36$ and ate a piece of a cake. Will not","useful":3,"cool":1},"ghpgsUSu3ZRh4EUltwdIEQ":{"text":"Bakery Bar has been on my list of places to go for months. I was in the area (during rush ","useful":2,"cool":1},"PRP0NbiCgqrd-A7ro31O9w":{"text":"My fiance and I have been fans of DDD for a looooong time so we were thrilled to hear abou","useful":2,"cool":2},"uZFk-7fRaWs-6hPHoNwYXg":{"text":"Bakery bar is bomb.com!! Go enjoy some trash fries, dessert, and AMAZING cocktails ASAP!!!","useful":0,"cool":0},"IzVhH05nc-6GpoK8ENesNA":{"text":"One word:  heavenly\n\nI've had this place on my list of places to try out and I was not dis","useful":2,"cool":1},"1SIuiegexuxiCmRhvACGGQ":{"text":"Had a drink here for a spontaneous date and got the Chocolate Martini. It was absolutely a","useful":0,"cool":1},"ZXe-qmnkmLqWq7Jz8eR4Dg":{"text":"Visited for their desserts!  The Chocolate Chip Cookie Beignets we're the bomb!  Cafe Du M","useful":0,"cool":0},"HCP7zR72evszPFLiRXrsYA":{"text":"This is my favorite dessert place I love it the cakes so delicious I had the beignets omg ","useful":0,"cool":0},"R_z6aAMoxT5WVZCoYA7HeA":{"text":"My sister was dying to try this place out with me and we both had high expectations and th","useful":4,"cool":0},"wEdU624XWOa5SZ8iAFuG0w":{"text":"Visiting NoLa with coworkers for a convention. We rented a beautiful Air BnB home to host ","useful":2,"cool":0},"TL9R_SV6aiOTyt6GmZeMSA":{"text":"Here's the thing: You have some of the BEST Doberge cake in the City coupled with signatur","useful":1,"cool":1},"E8XQ4AhMm3i3dcFz2uO9lg":{"text":"I was so happy to wander by and saunter into this place with some friends one night in New","useful":2,"cool":0},"7TwAhT0uFEqYGWTScvsfVQ":{"text":"I really love this place and I wish there was a version in Washington DC. It is basically ","useful":4,"cool":2},"jF9STPMgCY0wDWpOYOp5qw":{"text":"Came and tried their cake bites (red velvet and sprinkles), cakes (salted caramel and thin","useful":1,"cool":0},"tvyFc_uFILdX6FTprTyAFw":{"text":"Omg the red velvet cake is a must try!!!! I'm definitely going back to try the lemon. Drin","useful":0,"cool":0},"F0hbhB_7jSXqruTTj6qlIA":{"text":"When i get that sweet tooth feeling, i found this place! Its a nice little cafe/bar that h","useful":1,"cool":0},"oo0aS5KmtryILfvy07ofrw":{"text":"Brunch with the family was amazing. Again we love this place. Food service and setting is ","useful":0,"cool":0},"A22CBMz9L3-leHdzKiHK5A":{"text":"This bar is amazing both in theory and execution! The concept of cutesy desserts and cockt","useful":2,"cool":2},"F-LlDVPvlRQXIKUhIgeC-A":{"text":"First time here, WILL NOT BE THE LAST!! Great food, great atmosphere, great staff!! Had th","useful":0,"cool":0},"Y-_02bt1K73_6xgXaoVSPw":{"text":"On our recent \"foodie tour\" of NOLA, we were recommended by a server at Amelie to eat our ","useful":3,"cool":3},"n8sVJ747vObaLKhL6LIlhQ":{"text":"We came just when they were opening. Staffs were friendly and helpful in choosing the cake","useful":5,"cool":6},"VljmDyEmK94WF_wwR_F0Ow":{"text":"I had been wanting to come here for a while now and finally made it the other day. I had a","useful":3,"cool":3},"KHWX-4RVUMIEfS_Wya2QwA":{"text":"Had some time to kill before stilt-walking again in Endymion so I went to get a cocktail a","useful":2,"cool":2},"V5aMR2h8yq4nqhTgK2Um4A":{"text":"Idk if I worked this place up in my head so much that when I got there I was kind of disap","useful":3,"cool":0},"s8ZXA4Uo_l6GNxWvtekmWQ":{"text":"There's not many places that you can go to get dessert and whiskey, but this place is.  Ba","useful":1,"cool":0},"bNjftAscQD1JKktcQS27-w":{"text":"I can't believe it took me so long to check this place out! I came here for drinks and des","useful":5,"cool":2},"IU9ZTJ4NdmvGnub5mXhrbQ":{"text":"While the outside and inside of this establishment may not be terribly pleasing, the Dober","useful":0,"cool":0},"znIAnOhWm2SzBD7RuOTo1g":{"text":"Originally went here to get the chocolate chip beignets. They're no longer on the menu. Bu","useful":1,"cool":0},"J3z4_TapscZ0ec1rtQQEdQ":{"text":"We were so happy to find out that one of our fave places are open for business!! Every bit","useful":1,"cool":0},"_uyFsKdVlmuApeptKem2FQ":{"text":"Best rainbow almond cake attainable here In the city but sadly they've been closed since C","useful":0,"cool":0},"NnNM8F2Fdo3frgVtrem5lg":{"text":"It is located almost under the bridge. No parking lots but lots of streets parking. It is ","useful":1,"cool":0},"vR-38rTFQey4JfT8-YkspQ":{"text":"ONE OF THE TOP 5 BURGERS IN TOWN\nand yep it's much better than \"Company Burger\" (but not q","useful":11,"cool":8},"JUIREMl90HthyfKl7PyJSg":{"text":"So this was my 2nd visit to Bakey bar. Things have changed it went from a bar that serves ","useful":1,"cool":0},"IKnPbNsEeRLl4khstXLkIg":{"text":"I went during brunch, but wished the options had more variety. I tried the Mac and cheese ","useful":0,"cool":0},"8EBG6CViCAKDVpo72sKyLQ":{"text":"I loved the vibes, desserts, and atmosphere The Bakery Bar provided. This place was servin","useful":10,"cool":5},"cHtvJZO2J53jkL9eQOshVw":{"text":"While on the way to the New Orleans airport i wanted to stop for food and we googled anywh","useful":1,"cool":1},"5f0UNseM-o8en0yvR29YsA":{"text":"We hadn't planned on eating here on vacation, but we are so glad we did because the food i","useful":0,"cool":0},"GrxYbP1_KJjbub1GJP6W3g":{"text":"Douberge cake is now becoming a tradition of ours when visiting New Orleans - or I should ","useful":2,"cool":1},"oHO8PKqS8OynZrv66ozG7w":{"text":"The cutest little quaint place in nola. I absolutely love this place and will be coming ba","useful":1,"cool":0},"y-qIMHxOYyV6pi4R0PFgIQ":{"text":"Yummy!! I love sweet treats! Bakery Bar has a variety of cake flavors and petite cakes and","useful":1,"cool":0},"oKLgr-B2_1EwsG6l6FZjPQ":{"text":"Love to come to Bakery Bar; it has somehow ended up as a regular spot for me and my krewe ","useful":2,"cool":4},"RrrG7ukw_cRBTuoEDE3QRA":{"text":"A small, funky and fun place located at the edge of the warehouse district, the bakery bar","useful":4,"cool":2},"y4vi5gw0sgexLZxtYXFLWg":{"text":"Very nice quiet place for a dessert, after dinner drink or a great place sit back with fri","useful":1,"cool":0},"BkmxEzV5CPk1CBquj16JAQ":{"text":"Very nice quiet place for a dessert or after dinner drink . I could see The Bakery Bar als","useful":1,"cool":0},"mBrgarGrUWUC_7ykUMun7g":{"text":"Will for sure be back! My whole experience was great from the service, food, and happy hou","useful":0,"cool":0},"9ycGZ_yee38N9GmZFTPrUQ":{"text":"This is a super cute place and I love the idea of a bakery bar but the cakes were definite","useful":1,"cool":0},"O3SvI5h5_0VZOAQ4qL8Q1g":{"text":"I always heard great things about Bakery Bar but feel like I was just never in the area to","useful":0,"cool":1},"XWuzbztQHbzsKqV22x1jdQ":{"text":"Absolutely delicious ! Incredible desserts. Ordered hot teas and a round of desserts and e","useful":2,"cool":1},"SbyMjlsfbJjscW3W42VKfw":{"text":"First visit, and it was AMAZING! Bartender (Joe) was a delight! \nHe made us some ridiculou","useful":1,"cool":1},"vEzGrqyVrOf91wiCKkEWZA":{"text":"The food was amazing! Its flavorful and different. I loved the sweet potato chips that cam","useful":1,"cool":2},"_J2WpO7E7mO1bJE46a7TYA":{"text":"My wife and I visited New Orleans 2 weeks ago and made a trek to walk to this location fro","useful":1,"cool":0},"8ymwuiqzpU3214MyzlncqA":{"text":"The service was amazing and fast! Our waiter Joe, was fabulous and amazing. We went for ha","useful":1,"cool":1},"qyEeLkaskKWAE7RV6Urk3w":{"text":"Oh my! It's a bar, with a bakery! What's not to love? But, it is even more:\nThe building i","useful":1,"cool":0},"xvclnhSKax_aOguXNknL7w":{"text":"CAKE, CAKE, CAKE, CAKE! This place is my favorite for after dinner desserts. I've been her","useful":2,"cool":0},"OwehTlJGWkNv-GBabZ2lMQ":{"text":"Best beignets in my opinion but ask for extra powdered sugar.  The beignets were light, fl","useful":1,"cool":1},"jft49373Oap-xC1Fogcjug":{"text":"Ohhh this place is just wonderful! It's a very intimate place, decorated in such a cute wa","useful":14,"cool":11},"qgs8BgUOES0BDGObKgh65A":{"text":"Stopped here for a late night drink with my girlfriend. We got the peppermint red velvet c","useful":5,"cool":1},"7h5eXWDi4wyxX58Kvb0WvQ":{"text":"Really quaint and cute place!!! Lights are lower in the evening, giving an environment tha","useful":1,"cool":1},"dUgHJovrGeg9lxO4DblsjA":{"text":"So My friend, her mom, and I were really in the mood for some tasty dessert and we heard a","useful":1,"cool":2},"Fwd-wo_dsRSv6mXsr_xKrg":{"text":"I have been wanting to go to Bakery Bar for a long time and I think it fell a little short","useful":5,"cool":0},"kk0IftaJX-yi260SqeVnuA":{"text":"During our ride into town I asked our driver - born and raised in New Orleans - if they ha","useful":5,"cool":2},"DNdXduMhLylHJ45GZB5Hqw":{"text":"I'm a person with a huge sweet tooth, so a bakery that's also a bar is right up my alley! ","useful":1,"cool":1},"is2f9HdMusPgAMWzWCMlig":{"text":"I visited Bakery Bar this morning with a group of 5 total.\n\nI ordered the goat cheese and ","useful":2,"cool":0},"OwJUMamWlAAXfTdxxedU4g":{"text":"The best vibe ever! I so love the bartender and the nice, charming gentleman that took my ","useful":0,"cool":0},"-VhYriJdVWFvGUIM4_kxcQ":{"text":"This is a cute spot outside of the quarter on annunciation street. It can be a good walk f","useful":3,"cool":0},"FWJfxxAle_C1G5M4SwscAA":{"text":"Bakery Bar\n\nI've been on a few unique dates, and some spots stood out so much so that I co","useful":4,"cool":4},"VBIhrfL0NxWdYc4MoypxWw":{"text":"I usually pass by the Bakery Bar on my way to the Courtyard Brewery.  On this day, I was i","useful":4,"cool":3},"SvxqMv1lDOAXmuCDfSSUPw":{"text":"I've been a fan of Bakery Bar since it opened but what's really gotten me to finally write","useful":4,"cool":2},"ZxLmCqHQaCH9j9nSc0tmew":{"text":"This place is located in a place where you least expect it... under the highway near a pre","useful":0,"cool":1},"Ww8VjsOpzVxx2Hj_ci7P_A":{"text":"Was visiting New Orleans and I saw this place in an article about dessert places around th","useful":0,"cool":0},"RTIhkyGFI528oDie3WCduA":{"text":"I feel like the quality of cake has gone down in order for the small bakery to accommodate","useful":4,"cool":1},"vfiWQ2TiFhbqSMkQmeneow":{"text":"I was craving something sweet one evening after dinner and came across Bakery Bar. Excited","useful":3,"cool":0}}