{"FOIi4JRNohUHsX0bb0E5Iw":{"text":"My daughter and I spotted Pere Antoine while walking through the French Quarter while my w","useful":0,"cool":0},"GjmlpIbRv0-fpUkgykR0Zg":{"text":"The only thing this place has going for it is location & atmosphere. The food is below med","useful":0,"cool":0},"2e4Xta7trn7Lt6J4j64IzA":{"text":"Skip this place. Great location, our wait person was friendly and got everything right...o","useful":0,"cool":0},"L0J0BRbvtxmSJpcQdqugtQ":{"text":"I wish I had seen the reviews before entering. The food is just gross. Kraft slices on an ","useful":0,"cool":0},"lRRwdwAx5RZ3KHfPOFvKsQ":{"text":"What drew me in was the \"cocktails to go\" sign. And the realization I had to pee.... Wante","useful":0,"cool":0},"lDXS9uQyJyZNLBuBRanDYw":{"text":"Average at best. Bland food. The spicy wasn't spicy and most of the other dishes we ordere","useful":1,"cool":0},"ZiSptSr4ub4JbyAZSjcC-w":{"text":"I had a great fruity drink that had a surprising amount of alcohol in it! The sausage po b","useful":0,"cool":0},"NFQJUjz8IepNxHp4FeWpdg":{"text":"Great food all the samplers are a must try ask for Kenneth as your waiter he will make you","useful":0,"cool":0},"4ncJzw-VPthhCQ208FAUJg":{"text":"The food was pretty bad. The service was so so. The atmosphere was great. My son ordered t","useful":0,"cool":0},"ajOJCRJF8gyBjR1biHd9Eg":{"text":"Honestly.. I really do NOT understand how some of the reviews were written here. My lady i","useful":0,"cool":0},"ng3gLUUTM6ImlV8bnE4_mw":{"text":"Do not go here!!!! The food is not very good!! I had the fried seafood platter and everyth","useful":0,"cool":0},"TT9A10TWjrUyXIk69ft32g":{"text":"The Nona fish was definitely frozen and tasted fishy. It was also $19 and supposed to have","useful":0,"cool":0},"TE3T2-8lnjBEglZp_2Ayiw":{"text":"Disgusting flavorless garbage - so sad the only meal I had in New Orleans that was that ba","useful":0,"cool":0},"iSY6h5N1JimyBoba6rZoPA":{"text":"Accidentally stumbled in this place for dinner. Wasted 20$ on fish and 15 $ on rice and be","useful":0,"cool":0},"f2UIeypyAy0894t6BQjFXQ":{"text":"Beau was an exceptional server! A true gentleman who checks back frequently on his tables.","useful":0,"cool":0},"bu1tfjW-nqQQdAJ_4lsbkg":{"text":"We passed by this restaurant and it was really crowded.  So we stopped in for lunch.  I wi","useful":0,"cool":0},"0Ze-r9LXjlOtWZPaTOFEJQ":{"text":"Stopped in today for lunch between the bands at the festival at Congo Square. We put in ou","useful":0,"cool":0},"vzeFE6dxWvq9Wf9zBXWdvQ":{"text":"I came here with my friends while visiting New Orleans because it was conveniently located","useful":0,"cool":0},"KXUTIL7LxSsTSpn8lMaBDg":{"text":"Food was okay, but served luke warm and took forever. Wine was delivered in a plastic cup.","useful":1,"cool":0},"G1nwNapf6J4xFstOI7FfoQ":{"text":"Awesome gluten free friendly restaurant in the French Quarter!  Good food!  Good Times!","useful":0,"cool":0},"fomDXsidlh73XjXR1d4yDQ":{"text":"My fiancée and I stopped here for dinner and we're looking for something a little better t","useful":0,"cool":0},"CvWYmKEImHgzYN31MPcRRg":{"text":"I LOVE THIS PLACE. In the middle of the Quarter on Royal St. I found this place 3 years ag","useful":0,"cool":0},"WxieoW-pQ7VVEcoaeIYP6g":{"text":"From the sounds of what people said about this place it seemed like a hit or miss. For us ","useful":0,"cool":0},"toRXS4JeInrwlc5CoZlFaA":{"text":"We had a good meal and the service was fast. They get a 3 instead of 4 because the food wa","useful":0,"cool":0},"wceSGBdzrMyjCyh9-B3M1Q":{"text":"If there is only one thing you eat at this place eat the barbecue crab legs in the appetiz","useful":0,"cool":0},"eMOYUqDvsNFuv10os4Jgwg":{"text":"The atmosphere was cool with open windows looking into the quarter, but that's where the p","useful":1,"cool":0},"IUbe5NkA5Guh7vjLztov1w":{"text":"Absolutely horrible!!! Not only were the burgers extremely dry and bland our waiter was as","useful":0,"cool":0},"nfuMj4RkkhTN7Y160CC01A":{"text":"Food was mediocre tourist food and service was slow - only bc very few waiters and a ton o","useful":0,"cool":0},"IwMseCelay92ljiKQw_rTQ":{"text":"What's better than a beignet at cafe du monde in the morning? Beignet fries at night! Thes","useful":0,"cool":0},"Bs1_tQKsijjxgrg80g3OKA":{"text":"We stopped here for dinner while wandering around the French Quarter. The service was good","useful":0,"cool":0},"ncIaQ3uN_ehO6hrGxzqezQ":{"text":"You have to try the catfish oyster Po boy combo.  Came out hot as well as very meaty Frenc","useful":0,"cool":0},"MaJsW6NL-dvuog2Oe48Qyw":{"text":"Good service but I was not a fan of the food at all. I got some pasta thing with a creole ","useful":0,"cool":0},"hsL6YoRLzkzbxVtlhaUzzA":{"text":"Terrible food. Didn't even eat my meal and was charged full price..do your tastebuds a fav","useful":0,"cool":0},"DmSjSl103-Zhnp_oGYKL7w":{"text":"Two words: TOURIST TRAP.  The only thing this place has going for it is location & atmosph","useful":0,"cool":0},"Jlm92LJIBQzGVoMkrA6A1w":{"text":"It was POURING rain as we passed Pere Antoine. Kenneth (a member of the wait staff) called","useful":1,"cool":1},"4JZX9zz7TRJ58Jp35buuaA":{"text":"Don't get fooled by the crowd. Ordered the shrimp creole...literally had three tiny shrimp","useful":0,"cool":0},"t0oy89O39LjzYbZ-NUlv3Q":{"text":"Liked the open air atmosphere and our service was quick and friendly.   My husband ordered","useful":0,"cool":0},"jGFPfjz7zI95IynpDRhtPQ":{"text":"Lunch here was a great finish to our weekend. Food was fantastic and David made the experi","useful":0,"cool":0},"xekdC5hrjkEKgdY_iEGqjw":{"text":"We went here on a whim. We were super hungry and the menu looked ok. \n\nHow is it possible ","useful":0,"cool":0},"YjySls-31XqLouVi5NffEg":{"text":"Just ordered blackened fish with crawfish. And loved it. I recommend this place. Great cus","useful":0,"cool":0},"6vgWkn_vNZHXrMuG2Q7yZw":{"text":"We sat down at our table. It took 30 minutes to get someone to bring us water or take our ","useful":0,"cool":0},"AIzTCg7nUQ34Qu2n2QJxOg":{"text":"was with friends looking for a low key brunch- typically I go to $$$ or $$$$ places but wa","useful":0,"cool":0},"H9czvjrlQulFOCwdLT3OiQ":{"text":"We stopped in for a quick drink and took a seat at the bar. Kenneth provided us with exact","useful":0,"cool":0},"kBCM9jGxlU8Hm7QucTNB9w":{"text":"Great place to eat if you don't have taste buds. Caesar salad overdressed, crab cakes were","useful":0,"cool":0},"uTd4YoXge2iqzT16D__upQ":{"text":"While looking for a lunch spot without a wait this place as wide open ...mistake. After si","useful":1,"cool":0},"zw_6v98GRr5EaVbzCEwV1g":{"text":"I had a great experience when visiting. We had a fairly large party and they seated us alm","useful":0,"cool":0},"MMxoK564Q1ntRBK4YOFU3g":{"text":"First time dinner on a Wednesday night, all seats open at the bar.\n\nThe weather is heating","useful":0,"cool":0},"VPP8LR8VnL13uay93Q05Cg":{"text":"The breakfast menu here is impressive. Omelettes, BYO omelette, shrimp & grits, waffles, e","useful":0,"cool":0},"RdPJ-ZkO6Vr_UjsAaGxSLA":{"text":"Better off limiting your order to an oyster shooter or a cup of coffee.  Food is not prepa","useful":1,"cool":0},"n4bceeLWM-4V6oWp4tonMg":{"text":"horrible food and terrible service.... if i wanted frozen shrimp i could have gone to reb ","useful":1,"cool":0},"c_-hF15XgNhlyy_TqzmdaA":{"text":"I think this place is still in business because of it's location. Otherwise, nothing speci","useful":2,"cool":0},"Q3_FC887eNuRjs1FK9Vr6g":{"text":"Not very impressed with the restaurant. Stopped in for lunch and we could not be seated by","useful":0,"cool":0},"97qChkQrOynuU52x9Ka7WA":{"text":"Lovely atmosphere. The windows, around most of the restaurant, are great! Sadly, the cook ","useful":0,"cool":0},"Dpm2f7SVEvcz6fNb6xzfkg":{"text":"Thought it had a nice ambiance, friendly servers, but would say the food was mediocre. I h","useful":0,"cool":0},"8KohFEl8AQaKxFQgBhiv6A":{"text":"If we could give it less stars we would. Granted, perhaps our expectations may be higher t","useful":3,"cool":0},"h9QCqzEPFBlRywARdbhXPQ":{"text":"I strayed away from Yelp with this restaurant and what a mistake that was! Friends and I w","useful":0,"cool":0},"KX9dV3tXOSjp5E8UzS6pew":{"text":"After wandering in search for a reasonably priced restaurant opened later (past 10pm) on S","useful":0,"cool":0},"F59BZF7O1adnnMSKsTlZ-A":{"text":"Disregard all if the reviews left during Mardi gras. Not fair. Good food nice service.","useful":0,"cool":0},"cspd_ln3Lw7l-RJsFkvQcw":{"text":"This place is good, and if you're hungry and walking around the French quarter looking for","useful":1,"cool":1},"0DRPPlDJgPRiKCYlAwaAJw":{"text":"I was willing to give this place a shot, despite the bad yelp reviews, but I was wrong.\n\nM","useful":4,"cool":0},"UtFZPdjWvtKsll7Q3K7jTA":{"text":"Ordered the crab cakes. Mushy and gummy. Gumbo and shrimp creole watery with tiny popcorn ","useful":1,"cool":0},"9vcTTw-oUVOr7hqKW5Ydtw":{"text":"Walked into an empty restaurant one Wednesday morning. We are a party of four. There was a","useful":1,"cool":0},"6Evwy8WpZDBkdpeL2AcZFg":{"text":"The service was poor. The staff never smiled...probably means management is lacking. The a","useful":0,"cool":0},"QDbdHUcTkMHESnw4V-oDqw":{"text":"My wife and I stopped by for dinner after going on a ghost tour. There was a wait for a ta","useful":0,"cool":0},"Bz3yxafvbHXhApMYXA5Kdw":{"text":"This place had the worst service I have experienced in years. It took an hour to get our f","useful":2,"cool":0},"sV4fGvqCEA4V2YJnMIJa1g":{"text":"Best blackened catfish I ever had. Servers were friendly and attentive. Special shout out ","useful":0,"cool":0},"_KuBiCtScbUZyOpbVxg0TQ":{"text":"My fiancée and I stumbled over this place while walking in Royal St. After going in and or","useful":1,"cool":0},"_OQ89il2AkRvPXFO2Q8cKA":{"text":"I do not get the poor reviews as all! The food was good and the ambiance was wonderful. Ou","useful":0,"cool":1},"xH6TJjP0RqJgBsMQk-CaZQ":{"text":"While the location was nice, the food was just not good. I was really disappointed in the ","useful":0,"cool":0},"gimncR1lkTS28TK3-9VRTw":{"text":"We stopped in late Tuesday evening for something to eat before bed.  The server was very n","useful":0,"cool":0},"nTOgP-XpCmJtDXPs2NEGQA":{"text":"On our first night in New Orleans, we spent a long time browsing the French Quarter for a ","useful":2,"cool":0},"P5ET1PFIeNf7uJh_NiQu4Q":{"text":"Go here for ambience, not to eat.  I loved sitting here with a drink in my hand, watching ","useful":0,"cool":0},"QzAY2f9UczTAAH14WpCnSA":{"text":"This restaurant came off as average to us when we visited for dinner a month ago (I stroke","useful":0,"cool":0},"WH2RhmHquanvXscXP6Ot_A":{"text":"My Rajun Cajun omelet was a bland burned pile of goo. Service was as poor as the omelette.","useful":0,"cool":0},"BtsIH9f6Gg6gTFsJ3p72Lg":{"text":"Food was some of the best we had in New Orleans over the weekend.  Highly recommend to any","useful":0,"cool":0},"fjaJ2FbQ9oK9xodSnyobLw":{"text":"Food was tasty. Got seated quickly on a Saturday and food came quickly. We had the Big Eas","useful":0,"cool":0},"EDQ7OmFKAFRDkDjIWRIqag":{"text":"We thought that being off the beaten path, Bourbon Street, that the food would be better. ","useful":0,"cool":0},"1EBYoZnJTXw8x_BIplhiOA":{"text":"The service was good and that's about it. The interior was nice but the Food was bland and","useful":1,"cool":0},"Nv1Gv5NXxm_oOwQyQU2lyg":{"text":"Awesome and authentic Cajun food. Oysters were big and awesome. Good food and good value. ","useful":2,"cool":3},"bIncUAKoGB4kT2qREcMMoQ":{"text":"This place wasn't that bad. I had the 1/2 shrimp creole 1/2 crawfish étouffée meal. The cr","useful":0,"cool":0},"9o0x03-OcK0ISj6Xb5EnJw":{"text":"We had an outstanding time here from lunch one day to dinner the next and of course....won","useful":0,"cool":0},"QqAMDILru1-jHaQwWp8AmA":{"text":"Bad and slow service.  Food was ok.  Order a chicken PO boy and they have me a basic chick","useful":0,"cool":0},"_3vkaPSnObZYZqFpavomRA":{"text":"STAY AWAY!!!\n\nThis has to be the worst service and food that I have been served in a long ","useful":0,"cool":0},"okRlhzGX8xysEDvA5pTMFw":{"text":"The two star is for the service, the service was fine. \n\nSoo, when you enter the place it ","useful":4,"cool":0},"vIfK4gqrIgFlY32fCGzhIg":{"text":"Fried seafood platter tasted like old hot dog water\nCreole sauce is just canned tomatoes\nC","useful":1,"cool":0},"JHum7P4QOwi_e6aDwkla8w":{"text":"I am a native New Orleanian but moved away to the East coast. Came in Thanksgiving week. W","useful":1,"cool":0},"Fi9rTRJdV3m7KxcU1hu41w":{"text":"Shame on the owners of this place!\n\nI second Lucreze! Can I give a negative star? We were ","useful":1,"cool":0},"sHMnfFJje4bNuL--wXS-Dg":{"text":"Lovely spot. Window seat all to myself, enjoying the soft jazz playing in the background, ","useful":0,"cool":0},"avc2VQZCG8I3M9WK56fuiw":{"text":"Honestly, we came here because this was the only restaurant that was not a cafe or coffee ","useful":0,"cool":0},"5vV8fjXacOlirl45Kr5g5Q":{"text":"I seem to have dinner at this corner restaurant every time I'm in New Orleans. It's not as","useful":0,"cool":0},"ODqQ4anpUZ0M1Qh7LQi3ng":{"text":"The food is Awesome!!  I am not a catfish lover, but I loved their catfish and Love, Love ","useful":0,"cool":0},"KGIpWfijvJ6ZlGEUBsSGMQ":{"text":"Blah! This place is poor all-around. \nThe food was awful! I would rather eat a Zataran's f","useful":2,"cool":0},"strlVeCTw3v9bCrjGi8ikQ":{"text":"You could really do a whole lot better when dining in New Orleans. We went because the pla","useful":0,"cool":0},"XEeIozhJ2-7SlwVz5OlyIg":{"text":"I can't find crawfish in my crab cake crawfish pasta. Wait, I can find it, but they are ti","useful":0,"cool":0},"B9bVuS8aj-rMUbah452VxA":{"text":"So we were walking around the French Quarter looking for a place to eat.  We past this pla","useful":1,"cool":1},"rO1OMLhkGRoGiNnFLFu05Q":{"text":"What??? I'm shocked at the 3 star rating!! This restaurant has the best food!! We came bac","useful":0,"cool":0},"XGLvl3SJbG-tzQjQID5gRw":{"text":"Everything our group ordered was amazing! Danny was our waiter and he was very knowledgeab","useful":0,"cool":0},"MhTDHXWnKr5Xm4X7kxcLbA":{"text":"We came to this restaurant twice.  The first time was Saturday night and we literally sat ","useful":1,"cool":0},"Y5B2vnvOyT-bkVcslFtZ2g":{"text":"Went to this place after desperately seeking a lunch spot...kind of wish I would've search","useful":2,"cool":1},"68WkAtfRe64lY_bSOqW8yA":{"text":"Loud and noisy but I guess that is ok. I had the bacon wrapped shrimp and the shrimp was n","useful":2,"cool":0},"Cgh_bGSPq7KQjuJ_SfAmrg":{"text":"This is probably one of my favorite places in New Orleans, which is saying a lot. I am sho","useful":0,"cool":0},"O-OxEIYzgD6xFwcMsxTsog":{"text":"We stopped in last night for drinks and food. There were tables open in the main area and ","useful":0,"cool":0},"8eCDXJUCxySqcXZwVtJyQw":{"text":"I had a late breakfast here with my sweetie...we split a creole omelet with crawfish and g","useful":0,"cool":0},"J2f_P2aPx3iPKSpwtLrHhg":{"text":"Stayed closed to this restaurant and thought we would stop in for their \"cocktails to go\".","useful":0,"cool":0},"uZz_6G4JLr6sKmN3oPsPkg":{"text":"We were in a hurry, and so we chose this place by default despite the Yelp reviews. The Ye","useful":0,"cool":0},"ns6vU8V7tEVit3obhqBcfw":{"text":"Service was fine, red beans and rice were a healthy portion, but mediocre. Drinks were *ve","useful":0,"cool":0},"M6n3b2XqhOKRuueI4EAOhg":{"text":"Found this restaurant as we meandered through the Quarter.  We enjoyed it, but I was very ","useful":0,"cool":0},"JuF9XbzqnllRGxQZ8MK8jQ":{"text":"Food is ok at best!   Service is slow.    They don't substitute anything for any food alle","useful":0,"cool":0},"3X-d0f2v3UyTpECtJA8qEw":{"text":"Food was bland. Very bland. Was expecting more and got less. Had st Anne chicken. Very che","useful":0,"cool":0},"fJaxatzygEHfF3GYozj_tA":{"text":"Unlike a previous review, I do not mind laminated drink menus. I had a very positive exper","useful":0,"cool":0},"E79fuHfAKzn6Jy7MVJUIJw":{"text":"Fantastic food in the afternoon shift, but the evening cook needs to go back to school as ","useful":0,"cool":0},"HmG2MVW9MU2rbK9h6VVTMw":{"text":"Interesting take on Gumbo: good spicy stew, tasted really good it just looked a little wro","useful":0,"cool":0},"7VAnldZ1Z5WRKQPUcl0e2A":{"text":"We walked past this place a few times whilst walking around exploring the French quarter a","useful":0,"cool":0},"CgFeI60ccv6bvrJmGK_oDA":{"text":"We chose this place on the fly and it was a mistake. We waited too long for cold fries, co","useful":1,"cool":0},"dvlK9gWuRlLGfd_rmoylxQ":{"text":"Big mistake going in here for lunch. Ordered a fried chicken sandwich, shrimp po boy and v","useful":1,"cool":0},"HinxMJnFIGElcvd_vhoJeQ":{"text":"The service was trash but the food was great! I got the half & half combo which was as del","useful":0,"cool":0},"bZGn1YPei1pA5SF9UMItMw":{"text":"The best Bloody Mary I've ever had hands down.  Perfect balance of spice in the drink.  Al","useful":1,"cool":0},"iuLRBj0xjXdNG1e-KE477Q":{"text":"First and last time coming here. I went with two friends and we asked to be seated outside","useful":0,"cool":0},"yc1L8D9Rlgt3B-SgiDR4WQ":{"text":"The pecan pie was great & Tammy is AMAZING! (Really love the sassy she brings to the table","useful":0,"cool":0},"UaPCK7wXAZjG9G3Tz3WQ2g":{"text":"My boyfriend & I were searching for a place to eat, it was our 1st time in New Orleans & o","useful":0,"cool":0},"gzDF--sIXRMLFGX4vUPM-A":{"text":"Waited an hour for food once our orders were placed. When I received my chicken it was com","useful":0,"cool":0},"oY_5dc6f3oi3GO8hkkRudQ":{"text":"Came here for dinner during a NOLA vacation, for appetizers I got the cups of gumbo was re","useful":0,"cool":0},"XogHuHKU1jLGT73iwPEtNQ":{"text":"Visited this place twice during our short time in New Orleans as we all loved the food so ","useful":0,"cool":0},"0hmp0czWtyNEwm4CZHenyA":{"text":"Great service, good food, good portions to share, liked their gumbo the best of 5 tried th","useful":0,"cool":0},"FmFCAAnY7_YdKDu_yJ08ZA":{"text":"Went here for breakfast.  They do have a nice open setting.  The food was good.  I'm not s","useful":0,"cool":0},"6dsFi7Q603fCyMtsGzCeuA":{"text":"Service was mediocre. My party of four were seated, and all was well (or so we thought). A","useful":0,"cool":0},"2H-3k3SYLWSCReSMUY23fQ":{"text":"Our server was very sweet. That's the best we can say about it. Unfortunately we went in b","useful":0,"cool":0},"mIXPnmDU-L9YGoTLcQY6yQ":{"text":"Thank you, Kenneth!! Great spot for a Bloody and some BBQ shrimp. Good music and conversat","useful":0,"cool":0},"3WkUbTIKpN2qivDb-41qYQ":{"text":"This place is amazing!  Great food, great service, great host!   They are open this New Ye","useful":0,"cool":0},"HMGxit_qdypdoC6HtlySPw":{"text":"They serve breakfast all day. So if you come here get an omelette. It's hard to mess up an","useful":0,"cool":0},"GNKw2pk9aFjVyytTYeTI6w":{"text":"Only bad meal and bad service I've had in NOLA.  It took 45 minutes for food to come out. ","useful":1,"cool":0},"vh29Scq7qQuNxkMe9HlrCA":{"text":"As my first and only meal in New Orleans, I was left extremely disappointed. The food look","useful":0,"cool":0},"IGMtL2dVYcjf116HC0pBzQ":{"text":"Walking around, we spotted this place and decided to go in. The food didn't take too long ","useful":0,"cool":0},"dO9V1SMCHJeM16Rsw8btIg":{"text":"I give this place 3 & 1/2 stars. Last day in NOLA and had to check out by noon so needed a","useful":0,"cool":0},"cVLWJ1tDjiQpwV7C0_DnAQ":{"text":"The server was on the spot and very capable. Of all the places we ate in the French quarte","useful":0,"cool":0},"xM5aBcr3et86AXRz2x7ZsQ":{"text":"Honestly some of the worst service I have received in a very long time. We walked in as a ","useful":0,"cool":0},"lcgJP9KqxZlCqIkvizA69Q":{"text":"We had a really great experience last night. Very pretty dining experience and not expensi","useful":0,"cool":0},"O6v0Q1dsuQeuuW_Q-hhpYQ":{"text":"Surprised at some of the reviews - we thought this was a great place - in fact we ate here","useful":0,"cool":0},"ddgEr9baTmQDVIMOtvvTnw":{"text":"I don't know why people are bashing this place. It's great! We were just passing by and th","useful":0,"cool":0},"0_Tc4kLPrzoc3Pn39LLwAw":{"text":"Really good food but service not too good. Our waiter took forever to get our order in. Ev","useful":0,"cool":0},"b4qpVTlLGoTWQPHQUvDjYg":{"text":"Go at your own risk. The concept of TERRIBLE doesn't need explanation. The nice customer s","useful":0,"cool":0},"KgEWi41dGVo8-_GtDZvVmw":{"text":"After Yelp steering me wrong at every meal on this trip, decided to just walk down the str","useful":0,"cool":0},"7G5daDyhha7zvwuXrpuqYQ":{"text":"yikes! i ate at some pretty terrible places in the French Quarter but this was by far the ","useful":1,"cool":1},"U4un8xT8Mo8fPv4Teq0AVA":{"text":"Terrible food - the gumbo was more like beans and rice. Nice staff but not enough for the ","useful":0,"cool":0},"Nz336Ydl8scbQLVILqr6wA":{"text":"Came here for breakfast and was quite pleased with the food but more importantly my waiter","useful":3,"cool":0},"hv71m3F8G8srmLAo17Y3gg":{"text":"Came here for lunch on a weekend. Tried creole cuisine for the first time and it didn't di","useful":0,"cool":0},"v9Gf9TUPflcNogavqF8HJQ":{"text":"We waited over an hour for our food, and only saw the server (rushing by our table) a coup","useful":2,"cool":0},"qk_60cy-rHMIdFoRfj9P7Q":{"text":"Kenneth was a delight, the food was perfect and sitting by the open window was an excellen","useful":0,"cool":0},"wKeY8UHCNBcAO_ngLwFNFg":{"text":"My husband and I ate here this past week and had really good food.  He ordered the red bea","useful":0,"cool":0},"RJJTjqHsgXUxoB_BMMt24g":{"text":"At this point not a happy camper!!!? Ordered and got wine but no food. Other tables served","useful":1,"cool":0},"IjtM9va5HCqS7MBnhynuig":{"text":"Two words: rip off. Small potions for way way over priced food. Don't let the ridiculously","useful":0,"cool":0},"d3diSTQyzgRzt9gVPRDunA":{"text":"tourist trap! just walk an extra block to amelie cafe. Food here is mediocre, the omelette","useful":0,"cool":0},"GHP0obAD8XQhMjC5-8MVLg":{"text":"We came here for our last breakfast in New Orleans. Is in a great little location with a p","useful":1,"cool":0},"bAOwel7LCHfcU2IAd-7HIw":{"text":"Wonderful service and very friendly and attentive staff, food was amazing, I shared the cr","useful":0,"cool":0},"k-GSee1gjlnKKbWmhxtpPA":{"text":"I highly recommend the New Orleans sampler. The Red Beans and Rice and Chicken and Sausage","useful":1,"cool":0},"jcTeQyHxbtXO0ROSA8ffLg":{"text":"Happened to just run into this place because my friend was staying nearby. They were reall","useful":0,"cool":0},"QDbIViT-dx7qcVezoO56Eg":{"text":"This is totally one of those places you go into when you're tired of walking and you're hu","useful":0,"cool":0},"29kQzkBUoUGsV_ZnD7nqzA":{"text":"21 Jul 2014, 08:00p\n\nAfter dinner at Coop's, we walked around the Quarter trying to find s","useful":2,"cool":1},"cVbAdjJI2Yyr_h6-0Zjsfw":{"text":"The decor is nice. I loved the openness of the place with the open doors/windows. The staf","useful":0,"cool":1},"8NGrra8Opz_-n7BeDoNDBw":{"text":"I've eaten in a lot of high profile and in some not so high profile restaurants in the Fre","useful":0,"cool":0},"Vhy6jfjyVNzAKc5aqiMkbw":{"text":"First, our server Kenny was absolutely fantastic! He was hilarious, made great food recomm","useful":0,"cool":0},"Tw1dH_QgaWvo7M5vR9agCA":{"text":"I came in to grab a quick bite and it was okay. Not a great ambience but a convenient loca","useful":1,"cool":2},"dQg21zXLxYhn51NWC0sFJA":{"text":"Stopped in for a Hurricane to go. Friendly staff and quick service. The Hurricane was grea","useful":0,"cool":0},"qHyy8mgDOO14FSNWSOS0FQ":{"text":"A cute restaurant with the doors wide open so you can still be a part of the hustle and bu","useful":0,"cool":0},"ikTJ8Jwhm6aX_QJaGu8OPw":{"text":"We went here only for the banana foster any fries. My friend highly recommended and we wer","useful":0,"cool":0},"-rn9zm79lTgD1AZljLQGhQ":{"text":"Totally don't see why this place only has 2.5 stars - I've been here for 4 days for busine","useful":0,"cool":0},"vAR9QOLJUkU89ardXeaR6g":{"text":"Love to go here for fried green tomatoes topped with shrimp and remoulade sauce and Bbq Sh","useful":0,"cool":0},"Vmh6uxn4tNm2YI7pJKFVRw":{"text":"First stop for food in New Orleans and it was a treat.  The chicken sausage Gumbo was real","useful":0,"cool":0},"tPXMF2qJ_ZTej_2pUJWtoQ":{"text":"This place is 100% a tourist trap! The location is great, and that's about it.  We took a ","useful":0,"cool":0},"_tTgab-zZMu4zs0KMlBxqg":{"text":"We slipped in here last night around 11pm because we were hungry and it was open. Thankful","useful":1,"cool":0},"rg3geGu5CYYTqlJaf7iOeA":{"text":"It really isn't worth the wait. As other reviewers say it's blah. The server took forever ","useful":0,"cool":0},"zTeeRw1N_00T7EwlpSCzWw":{"text":"The food was good and the atmosphere was nice. I didn't like the bloody marry, I thought i","useful":0,"cool":0},"lczpfIaRDIfu5-eS_rXu_Q":{"text":"Jambalaya not tasty, though red drum was amazing, as were fried green tomatoes.  Service w","useful":0,"cool":0},"rFne9HjaWsYuetHXmjIVQw":{"text":"Only one word is needed to review this place - meh. The food is nothing spectacular and se","useful":0,"cool":0},"cCUAAPJOk_04_NsYusCXiw":{"text":"Not great but not the worst. My worst complaint is the service as they are very slow, forg","useful":0,"cool":0},"8E_CZQQrTC6GeP8AwrRcww":{"text":"Really great restaurant in the French quarter. A small quaint restaurant good for dates or","useful":0,"cool":0},"MTQ7aqaDMKoWgM_k-PbbwA":{"text":"We found this place walking on a Sunday night. Every other night we had reservations but d","useful":0,"cool":0},"cpdAAh0WhjedyNvTe7KIVA":{"text":"STAY AWAY. \n\nPulled up Yelp after I sat down and immediately regretted not having looked a","useful":1,"cool":0},"Rc1MtsU-RLvrax5FYd-7KA":{"text":"Update - After poor service we left a 10% tip. Checking my account today I find out that t","useful":1,"cool":0},"0gerMKSA3fjPfikLjHC0pw":{"text":"All I can think is that the people giving this restaurant, and I use the word loosely, thr","useful":1,"cool":2},"qAGlDVcJGPT-CWm7VuHG1Q":{"text":"Despite bad service and dirty conditions, the food was good. I actually liked the Royal Bl","useful":0,"cool":0},"lr23cWW8GvsyKkO1SNWhtg":{"text":"Can't believe I came back here.  Jane remembered it when she was young and now that we're ","useful":0,"cool":0},"OU9hDA9zU_FfkQrz83x6dQ":{"text":"Just don't buy the drinks (which are lacking a price)--they're $12 and should cost $4.\nAls","useful":1,"cool":0},"SD28X-PrwnRoYExGKK71Mg":{"text":"Great location. We had a quick, simple lunch = 2 small chicken Caesar salads and an ice te","useful":0,"cool":0},"LEB7mq3RmHX1DgQv461Kyw":{"text":"My wife and I have been to Pere Antoine Restaurant twice and we can't understand some of t","useful":0,"cool":0},"IhQ_FCHQIwrh4oweex2npA":{"text":"Friendly staff and nice place, but the food is probably some of the worst I have tasted. W","useful":0,"cool":0},"CqmuqbtKTjcB9vnvxFKSBg":{"text":"Wow. This was disgusting. Our crab cakes were absolutely inedible and tasted like bad cann","useful":1,"cool":0},"G6JXN_DT7znbKBDOwBxyYw":{"text":"Oh, the BBQ shrimp!!! Family recipe that is awesome. Oysters were fresh and delicious. My ","useful":0,"cool":0},"O1WiJzppyqyMOsIh-UBkww":{"text":"Great food, service and fantastic atmosphere. After visiting here twice during our week st","useful":0,"cool":0},"PW3kNdB07ltu0LT04Y4KIQ":{"text":"Walking down the French Quarter in NOLA on a Friday night is not for the faint of heart! W","useful":0,"cool":0},"9G_yq63B--sipu76tu3FKQ":{"text":"The thing is, you're going to go. You just are. The location is that good. You won't go th","useful":1,"cool":0},"WCVqV2JwZWAAxYwBbcsQ3Q":{"text":"This review has been stuck in my head now for almost a year when I visited this restaurant","useful":0,"cool":0},"O7ofXgMZVmXD0q6i_JaLtg":{"text":"Not that good. I ordered the St. Nona's Catch. The menu describes it thus:\n\n\"Catch of the ","useful":1,"cool":0},"Dh_86Xo9NmTlDQbfQoeQdA":{"text":"Just walk by this place, don't stop in. The service from our waitress was poor however ano","useful":0,"cool":0},"L4MYd_fX1QR4-z-o79N1KQ":{"text":"Host very nice and accommodated my request to sit by the window to people watch! Service e","useful":7,"cool":5},"6iN0z5uznCIxjE_GwjVX1Q":{"text":"Awful! Awful!! Awful!!!  If you have no taste go here.  We were desperate for a quick bite","useful":0,"cool":0},"uitpkusGTXDiMfWHBfCUFg":{"text":"Great openness to the street.\n\nFood was ok. \n\nOne item on the sampler plate was inedible. ","useful":0,"cool":0},"RAXDmNO6-UIiTIpSupvSZg":{"text":"Perfectly fine place for lunch and a respite after trekking through the French Quarter.  B","useful":0,"cool":0},"NR6VA0LpBgcTrJrfGi_Z5g":{"text":"The service was really good, our waiter gave us a history lesson on a couple local facts w","useful":0,"cool":0},"O1joDB6WP6BCBpJo9WkU-g":{"text":"Typical tourist restaurant in French quarter. We stopped in because we where tired of walk","useful":0,"cool":0},"-LQIc95y-L5QoJM2oUAGfw":{"text":"I LOVED this restaurant during my recent visit to NOLA! I ended up eating here twice and r","useful":0,"cool":0},"diyu21pAJ-AHUhheCuVZsw":{"text":"I ordered the bayou omelet with white toast.  Well The toast was good...  The eggs for the","useful":0,"cool":0},"lWSaWRQ--hJLj4JFUSzeog":{"text":"Stopped in for drinks and apps, our waitress was really nice and very accommodating, even ","useful":0,"cool":0},"ZHaIJg_TVrkr_Qcw263EVA":{"text":"The food was pretty good here. My blackened catfish wad awesome. The crawfish etoufee was ","useful":0,"cool":0},"m2u3l3MKJBe0YfbPaexYDQ":{"text":"Do not go to this restaurant.  Ordered gumbo which was more like a thin gruel with little ","useful":0,"cool":0},"e0CJucc-bJfCP4m7m2zzpw":{"text":"The reviews of this restaurant were not good. But the ambiance was compelling. Our waiter,","useful":0,"cool":0},"m8vkl6xUjNYoJilBgV7YZw":{"text":"Great seafood! Great gumbo! Great drinks! Wonderful banana foster's beignets! Great bread ","useful":0,"cool":1},"ARgvsWTqxHOJJ7Wc7lZKFA":{"text":"Food was very good. Service was friendly. Not sure why the negative comments by previous p","useful":1,"cool":0},"YrXXuyBi7nU7fhAEjMtJag":{"text":"Not impressed. Server refused to split check, and the restaurant was not busy. Gumbo and j","useful":0,"cool":0},"s625OamtYapOVkNzAO_LnQ":{"text":"Stopped in without a local recommendation. Waiter tried several times to get us to order a","useful":2,"cool":0},"MYWLug4mYamw_KprVidMUg":{"text":"The food here is terrible. I ate here with a group of friends. We ordered spinach dip, but","useful":0,"cool":0},"eh4LA4ULqZrvrAjiD6xVog":{"text":"Not as terrible as some reviews made this place seem, but not a place I would ever tell so","useful":0,"cool":0},"aQhh5nuuDvhQr2LROcLeOQ":{"text":"A wonderful meal and great service. We had the St Nona's Catch...blackened catfish with lu","useful":0,"cool":0},"PRxAr9hDUnKJhQLhow9bXw":{"text":"Stopped in for a snack and a bite. Really good vibe in the restaurant. Music could be impr","useful":0,"cool":0},"vPSTukDitM9F0u7JrK_xfQ":{"text":"This place had the worst bread pudding, sweet potato fries, and sea food pasta with cream ","useful":0,"cool":0},"-puu9PQsaAZXrPa-4bJbaQ":{"text":"Ambience is great.  However the staff is okay - none of the waiters smiled once while we w","useful":0,"cool":0},"YGQ-fAc9dq9REkfheQT7aA":{"text":"I LOVE THIS PLACE! Waitress name Tam was our server. She was extremely patient (I can be i","useful":0,"cool":0},"hJNkiEhkAbny-_-rXu1FUA":{"text":"Was looking for a great place to eat and came across this restaurant. They got 2 out of 2 ","useful":0,"cool":0},"eJ3vK2hfsh5mXI66Tf2_wA":{"text":"I stopped in here for a quick lunch last week.  A few years ago on a hot and humid August ","useful":0,"cool":0},"2L_KJ7DzN8y6NjIYh_L6Nw":{"text":"Wandered in here, hungover and hurting. Left feeling a lot better after a huge, delicious ","useful":0,"cool":0},"0OLeetymdcgjOo2eOfyq8Q":{"text":"Wow... unbelievably bad.  The salads are wilted and came with huge chunks of tomato stems ","useful":0,"cool":0},"Tii4lzqv0TepVAj7IDKlzA":{"text":"In a city with amazing food this place is a loser.   We stopped in because it was raining ","useful":2,"cool":1},"-Gj6AZhKwTzfzF0B-vPxwA":{"text":"Food was flavorful and well portioned.  I ordered a combination of Gumbo and Jambalaya the","useful":0,"cool":0},"EmJjINwP6ZLGUEGTp0LFUg":{"text":"Absolutely horrible. The Cajun pasta tastes like nothing. The \"mixed green\" salad was a pl","useful":1,"cool":0},"DppxZSrKcscnQmVUtP9LaQ":{"text":"The bartenders provided horrible service and did not know how to make a \"specialty drink\" ","useful":0,"cool":0},"SHt8iTK6dSYc_hniyEZjhQ":{"text":"I'm a little shocked by the reviews on this place but maybe it's just what I had?\nThe po-b","useful":0,"cool":0},"sXsFNQ2kSBGctQolqtNr9Q":{"text":"Seafood Po'Boy had oysters and catfish. Terrible. Top honors for worst, oysters were over ","useful":1,"cool":0},"T2w65CzyZ1IkBITuYV5UNQ":{"text":"Typical case of some business guy taking advantage of a good location and doesn't care abo","useful":0,"cool":0},"SBpJhr1OGLX6Pj1tO2l5Xg":{"text":"Our first dining experience in New Orleans. Food was to die for and great value for money!","useful":0,"cool":0},"SG3ju4vW_LYOPtIg-CnKXA":{"text":"Skip it.  I had the fried chicken breast sandwich, which was too thick to eat as a sandwic","useful":0,"cool":0},"pn5xGU4ZxCZjRYifS0NgEw":{"text":"Johnny, our server, was an amazing wealth of knowledge about the menu, NOLA history and th","useful":0,"cool":0},"w2_oGpXlc1JuEev2S8j1og":{"text":"We had brunch here on a Sunday morning. They did not have enough wait staff and so we had ","useful":1,"cool":0},"E6NdIK7W-C7URaqn8ewXeQ":{"text":"This place simply benefits from its prime location in the French Quarter; that's how it su","useful":0,"cool":0},"TC_gpqbov4hRYR7hvYG_yg":{"text":"Visiting from the west coast and this place was a treat. We ordered the seafood platter an","useful":0,"cool":0},"7xJICAH4bcmYGkMwMKqFgA":{"text":"What can I say about this place other than I hated I had to leave it and its employees beh","useful":0,"cool":0},"eirPkkrzEOsGZAhr1Q8OhA":{"text":"I have eaten here for years.   Two times last week  the service was completely unacceptabl","useful":0,"cool":0},"d_t-WewZSywwGv9IhzFa-g":{"text":"If I had to describe the food here in three words it would be bad, flavorless, and frozen.","useful":1,"cool":0},"OFBK2k3mXkD1cZDm50UNKg":{"text":"The staff was wonderful! The chief went out of his way to  cook us chicken & waffle, altho","useful":0,"cool":0},"sPOuHTkTxjomC1tckjBlZQ":{"text":"This place is great! I loved the food and the service was great. I tried the jambalaya and","useful":0,"cool":0},"YMNQSGoOy7V1fR63kSDsaw":{"text":"Stopped here for lunch (solo), greeted by John H., who asked me if I wanted a table or to ","useful":0,"cool":0},"xLI-13c8K_KUd1qUQ6gq3w":{"text":"A little salty for the appetizer I had, but wow our server made up for it. In the heart of","useful":1,"cool":1},"YgOacr4iAopyX6BlpFeDuQ":{"text":"I recommend  this restuarant the best food in the world and the most amazing  deserts. Als","useful":0,"cool":0},"buikjIChhKwArvmbpctp-Q":{"text":"Like most restaurants in the Quarter proper this place serves dumbed down, bland, overcook","useful":0,"cool":0},"-mdFBiL8posLqMKxmVnIqg":{"text":"The good: fun waitress and GREAT seat in the front window to watch the people go by.  The ","useful":0,"cool":0},"qVSRByMtWUIPI7QwNLaoqg":{"text":"Just wandered around a corner and walked in to this place. We ordered then waited about 30","useful":0,"cool":0},"nMtAH_lvMu473uiPWArMBA":{"text":"Ughhh.  I had the Crawfish and Crabcake Pontchartrain - the crabcakes tasted like sawdust ","useful":1,"cool":0},"Y3hpTbTtlzUhUu-Tvo1aZg":{"text":"Pretty tasty food, great bartender and drinks. Nothing crazy, wow, but certainly not anywh","useful":0,"cool":0},"PC6TWaV0bAgj4PLNro6iMg":{"text":"Friendly staff, decent solid food and reasonable prices. Best thing we had: bacon-wrapped ","useful":1,"cool":0},"1ANqnnf_pe-jRQZ6nSODbA":{"text":"Restaurant situé près de Jackson Square. L'endroit est très bien décoré. Le po' boy aux hu","useful":0,"cool":0},"yA4NN4RqWwk2q0mSQvkNUw":{"text":"OMG! This bloody Mary with pickled green beans and extra olives made spicy is the best I'v","useful":2,"cool":2},"wEMEWPCxL5qe92a_WAAFUg":{"text":"We got lucky! We had a nice time. The food was good. The service was good. The drinks were","useful":0,"cool":0},"i-Gi3M74NVUBsAXK_Xw8pg":{"text":"This was not very good at all and I wish I could ask for the return of a portion of our $6","useful":2,"cool":0},"HdBJDtUjF8jFv3Xq5eej2g":{"text":"Great food.\nMy wife & I came here twice during our weak long vacation. Once for dinner, ou","useful":0,"cool":0},"dLv9sEIbHYLmpLYMyeaQTQ":{"text":"I was a bit disappointed. The flavors of the food could've been a bit better. I can make f","useful":0,"cool":0},"cxx7A0ho58pN-MOkHhHN_w":{"text":"My fiance and I were in NOLA and stopped by this place because the menu items looked appet","useful":0,"cool":0},"ByPi3j7J2OwNbcLFHmALVg":{"text":"This place is a rare treat a French quarter. It Is open late and is  family friendly .The ","useful":0,"cool":0},"lz6Dvl4vv9Vu3LzGhiOQsA":{"text":"We were walking down the street and looked in the window, thinking this might be a good pl","useful":0,"cool":0},"FXJLUt3Xlk8Hnlg9Bd9PpQ":{"text":"Fantastic little spot just a block off of Bourbon Street. Bourbon Street was wild and crow","useful":0,"cool":0},"losb2mPiBqT0b_OtCOFmYg":{"text":"This was the worst dinning experience we've ever had. The place is completely uninspired. ","useful":1,"cool":0},"Tu9o2Ngz2zvc4pgTCabpkg":{"text":"The food was not great,  my wife's hot roast beef sandwich was cold and tasted like it was","useful":0,"cool":0},"2TeUtAJ5FoSer0t0W5MzFw":{"text":"I'm shocked to see so many terrible reviews for this place! I had a great meal here. I cam","useful":0,"cool":0},"v6YZQk9rneHoqEtBnsrlAg":{"text":"The one thing that was great was the ambiance. The rest was OK, slow service, food was jus","useful":0,"cool":0},"nWUuZ2IgXJ9A2T9uN9D1Fg":{"text":"First as I walked in I asked if they served FROZEN margaritas which I wanted with my meal.","useful":0,"cool":0},"RuijZZj_2MfztxobzOqkxw":{"text":"If you come to Pere Antoine's and don't have Kenneth/Kenny as your server, you are missing","useful":0,"cool":0},"XjCumfliLgLvV1RVwI28AA":{"text":"By far, my least favorite meal in New Orleans. There was nothing worth writing about. The ","useful":2,"cool":0},"MyOh9qhjAxI5DgD87jrqEQ":{"text":"(First, please note that this review is not for *Antoine's* Restaurant, which is one of th","useful":0,"cool":0},"B81QOROnwpCSS3mKfWvsZQ":{"text":"My boyfriend and I went to 4 different places and walked out because of terrible service o","useful":0,"cool":0},"k7h3-S3XpKCu0dYrOiy40w":{"text":"Agree with other reviews about the wait time. We're served water and given a chance to per","useful":0,"cool":0},"K8NbPynkbnNUASDxWuTdng":{"text":"Not good, wouldn't separate checks for business purposes, food ok would not recommend","useful":0,"cool":0},"oLDZN-AR8hAjPixy4VzoVQ":{"text":"Worst service ever, coming from someone who has worked in restaurants for over ten years. ","useful":0,"cool":0},"0DeK3AVUHLhPlu5x8ULyFg":{"text":"The chicken was over cooked, pasta had zero seasoning. Crab and spinach dip was bland. The","useful":0,"cool":0},"iNnf0nWprxW-YXcuz11Suw":{"text":"We stopped here on chance when the restaurant we were planning to go to had a 45+ minute w","useful":0,"cool":0},"DHD3r-Mi2IoGQ2RkZcCHAA":{"text":"If you want cold, dry sandwiches with soggy fries, this is the place for you. Totally over","useful":1,"cool":0},"gfFBA_2r8GmOFI3ZYDEnjQ":{"text":"This is a casual place, great for a late-night meal. It's nothing fancy, but has an authen","useful":0,"cool":0},"VkX9ouie4vIjPr3qlvki_w":{"text":"One rainy night in New Orleans, we wound up at Pete Antoines. Service was indifferent, if ","useful":1,"cool":0},"62x5VG94i1InTIib57M8lg":{"text":"While on a trip to Nola, my wife and I were curious to try some of the local cuisine. Our ","useful":2,"cool":2},"7WSmdUb8sEjouXDBL0sc6w":{"text":"The beignet fries were recommended to us by someone at our hotel. They did not disappoint.","useful":0,"cool":0},"B_v6n37frTA2Gg5ZOtVIYQ":{"text":"I ate here the other day. I had lived in the French Quarter for 5 years now and wanted to ","useful":1,"cool":0},"QkpR1He1zOAqyllbmyNCIw":{"text":"We tried going to cafe du monde but the line was too long so we stumbled upon this place. ","useful":1,"cool":1},"-W9Q5rUVSpdfQ2QckzUtuQ":{"text":"My three friends and I visited Pere Antoine Saturday during Mardi Gras.\nUpon ordering shri","useful":3,"cool":1},"Cv_TBZPScmDX0ojjlerqHQ":{"text":"This place was located right next to my hotel. I feel in love with the barbecue shrimp! Th","useful":0,"cool":0},"2G0iZkc4UfmkuPoMF9NXbw":{"text":"I really enjoyed this place. It was clean and friendly. We were greeted by Tam who is quit","useful":0,"cool":0},"wxjXWz7B9fQb8JQC2JaYyw":{"text":"We stumbled upon this place and absolutely loved it! David our waiter was Engageing, helpf","useful":0,"cool":0},"M7maYEoeyA3GRTYR9FtzFQ":{"text":"stopped in the other day with my wife. she asked for ms. melva to be our server. ms. melva","useful":0,"cool":0},"Ez1CkzbUPPn7Z6dF2jV8Qw":{"text":"The food was okay, but the service is what made me give them 1 star. We waited for our gum","useful":0,"cool":0},"9__sQQmutorSwN0jpUDD5A":{"text":"Food and location were great. Bloody Mary's were exquisite. We stopped by for breakfast an","useful":0,"cool":0},"XEio6OgLg8_lLWOOPY6vDA":{"text":"In a city filled with great restaurants, there is no excuse for such a lackluster effort. ","useful":3,"cool":0},"UEF7fMAuID3W9aFerF2l2w":{"text":"Yum!  My husband and I ducked into Pere Antoine during a rainstorm and how lucky we were t","useful":1,"cool":0},"nMeGlK_ocOe1R3ROGQfbKg":{"text":"Food was delicious but it was the manager that really made this experience awful. They wou","useful":0,"cool":0},"TUS9MrG4zh_FqPJnk9H7Zw":{"text":"This was by far the worst meal I had in New Orleans. We were a bit tired from walking arou","useful":4,"cool":0},"6rOhW_OlnE6MaSV2vavx0Q":{"text":"Our first day in New Orleans and knew that right out of the gate we had to get our hands o","useful":0,"cool":0},"H_Jj0xmvY_HIJTAEXp93yw":{"text":"We were there mid April.  Food ok. Restaurant very badly managed. We waited for 15 mins wi","useful":1,"cool":0},"UnbC35ew6qFqQ7O_dF64nQ":{"text":"Went here for a cocktail before a lunch reservation. \n\nBloody Mary is what you should orde","useful":0,"cool":0},"8QPfkV3bvaeLma8JhCiI0Q":{"text":"Very disappointed.  Dress code was not enforced, even the hostess was not dressed nicely. ","useful":0,"cool":0},"1jLWluCDJRo2dC1KJOPPrw":{"text":"Stopped in for a couple of drinks with friends.  Service was attentive and the restaurant ","useful":0,"cool":0},"k32dJ-0YJxlMIBFlFPp4LQ":{"text":"They make a great Bloody Mary and Oyster Shot.  Yep, that's all I had.  However, next trip","useful":0,"cool":0},"4BZUYyt7B3clh2kUteXxtw":{"text":"The food was alright but there was definitely nothing special about it. I think this is mo","useful":0,"cool":0},"XEBd097SQGX_Dcp5qbh2nw":{"text":"Another great gumbo and red beans and rice place. I sat outside during the day and it was ","useful":0,"cool":0},"kYUZaPfWPaDZdSxrdgLRtA":{"text":"We have been to NOLA many times and this one of my fav breakfast places the food is always","useful":0,"cool":0},"5ivQGYkPiTIBU5yUu07NtQ":{"text":"I arrived in New Orleans late and this was the only place still serving food.\nLittle did I","useful":2,"cool":1},"Q41Zp4_YJq24ZYjjCBalgQ":{"text":"Save your money, time and appetite for elsewhere in NOLA.  Wish we did.\nDon't eat here.  P","useful":2,"cool":0},"Z91D92EghEK5FdgoGglisw":{"text":"The BEST crawfish etouffee I've ever had. Tried my husband's coleslaw off his catfish plat","useful":0,"cool":0},"LiUf6BTVLCVZCEuSCb0Kjg":{"text":"When I questioned whether or not a meal had been prepared gluten free, as requested, our s","useful":0,"cool":0},"rmlFt5tFFK9AOdwlcCvrww":{"text":"Terrible.  Do not waste your time.  Stumbled in  here because we were hungry and needed so","useful":2,"cool":1},"cu48rrjIT3qswHrSZi0EmA":{"text":"Seafood was not fresh.  This type of place is why chain restaurants exist.  Slow service. ","useful":0,"cool":0},"HJ55D-u03B8s3UY0Cw8Djg":{"text":"4 of us stopped in for lunch. It does have a nice open atmosphere. The service from our wa","useful":0,"cool":0},"3SwdZA8ejVzz1xuCpAIb2w":{"text":"Stopped by for a late lunch. The setting looked nice with an open view to the street. We e","useful":0,"cool":0},"n-2hc2rEiXHKnFt_fZnJ9A":{"text":"Holy hell this place was terrible on every level - super disappointing because it was our ","useful":1,"cool":0},"sIvKBO-9v1g1GyrSnV4Qfw":{"text":"We managed to grab breakfast here twice while in town. The first time we were seated promp","useful":0,"cool":0},"JVM2dppf-PW0Fy2mpT7woQ":{"text":"Food was good but service was a C-. The waitress had put our order in late. We ended up or","useful":0,"cool":0},"9rrZ6xgDFJHRKWf14t5ZvA":{"text":"Had to eat here only to enjoy the weather . What a mistake. The staff in general was not f","useful":2,"cool":0},"rJKXZO4qLR16_fw4o924tw":{"text":"Stay away. My wife and I wanted to end our trip to NOLA on a high note and sadly found our","useful":0,"cool":0},"3USczmzCskBuFJqCjiozrQ":{"text":"Not sure what all the bad reviews are about... Came in for dinner Thursday night. Ordered ","useful":0,"cool":0},"teKlmwjvFzgeRkcttIekvw":{"text":"Haley was an amazing server. She was friendly and highly attentive. The food was also amaz","useful":0,"cool":0},"yWOYHlZ_B8QRfoYlCg1VCA":{"text":"Not sure why the reviews for this place are so low. We stopped in because we were thirsty ","useful":0,"cool":0},"-qiVlrrOhUO4CwC_NR6tOg":{"text":"So underwhelming. Due to horrible planning, I just wanted some brunch without an hour plus","useful":0,"cool":0},"fB1QchfnNh1vzd-eD_CLMg":{"text":"I am shocked by all the negative reviews! My husband and I went here for a late breakfast ","useful":0,"cool":0},"OeGwh6cg6s5ZVJ-fAdvygg":{"text":"The food was okay however the price was not.\nOmelet was very greaay.\nThe staff is friendly","useful":0,"cool":0},"0UkfTvTqVy7Fpj0OagoqAw":{"text":"Walked blindly into Pere Antoine and should have turned around and walked back out. But we","useful":0,"cool":0},"jsjE0obgT5JuaysrtyQ3oQ":{"text":"The food and services here are both below average. \nVery salty, they forget things that yo","useful":0,"cool":0},"JtrDwqUbG0-4pZsqWcUQrw":{"text":"This might be the best meal I had in NOLA.\n\nMe & my buddy were walking down Royal St and n","useful":6,"cool":5},"4aBkcG6lefP_-wr_SpF_Ow":{"text":"Ok so I've never eaten here so the majority of people can ignore this review from this poi","useful":0,"cool":0},"iYLsTK_7xP3g0vuUC4PhMA":{"text":"The reviews don't lie - if I could rate this zero stars I would. Terrible service, and gru","useful":2,"cool":0},"ZfWY6Mpk1ORmw6HYPMhmTQ":{"text":"Just blah.  We stumbled here because the line at Cafe Dumond was just outrageous.  We deci","useful":1,"cool":0},"10nSTWPXKh-rdxVuJjb9bA":{"text":"The best gumbo. Mmmmm. \nI am a picky eater and the chicken sausage gumbo here was deliciou","useful":0,"cool":0},"gEeR6LRAP0VkrlGEtJr2-g":{"text":"Appetizer was good angel horseback . The main entree crab cakes on pasta was gross. The cr","useful":0,"cool":0},"QhNeTYiETlHANT038gjVAw":{"text":"Well, so far our experience with Pere Antoine on Royal Street has been good. Busy Sunday b","useful":1,"cool":0},"3Y0HbX7qiYpUN0soc0aXaw":{"text":"OK, here we go, let me explain the 1 star.\n2 visits here, first visit, the girlfriend was ","useful":0,"cool":2},"nNhCWNJHEjnBuBgHX24cSA":{"text":"Food was decent. Surprised they didn't carry raw oysters. Wait staff slow and shared too m","useful":0,"cool":0},"RN7yJLQvuZIj9T4kk5r3eQ":{"text":"Stopped in very early and were greeted friendly by Kenneth.  Had a couple of Bloody Marys ","useful":0,"cool":0},"GfYaW-0l-cbfrh29ugja_Q":{"text":"Putting bananas in your bread pudding says it all for me.  Wasted a dinner in NOLA at this","useful":1,"cool":0},"DoYWu68Gt9wpcf0GQID-cw":{"text":"Poor service. Order your breakfast and ask three times for your toast. Finally after your ","useful":0,"cool":0},"eDH1g-tw8FxlrDWzVsDJ-w":{"text":"Staff: Was friendly, but Jamie was the best. She was very attentive and helpful. Answered ","useful":0,"cool":0},"YMeibGZWLKFYDf-4JV8l-Q":{"text":"Service was good. Drinks were below average. Food was ok. The location has a ton of potent","useful":0,"cool":0},"xWUSKr3V3WYZmDBfkXnBCA":{"text":"The food was okay but we had pretty small portions. The server was really young and more w","useful":0,"cool":0},"rHg9w65sZHIArGza_Gzoow":{"text":"This is the first place we ate when we arrived in the French Quarter and it was amazing!  ","useful":0,"cool":0},"JB0UBh1OA-JKVJZKQZvFDw":{"text":"The location is great- but that is where it ends.  They really dropped the ball on May 28 ","useful":0,"cool":0},"qoR0XTj4e4KHIReAq-5UzA":{"text":"This restaurant has a wonderful location, friendly staff, and a large dining room with win","useful":0,"cool":0},"0Igr6BwAMlqK0WcmH-CGjA":{"text":"Great place! Melva was awesome. She did a great service and helped me with the menu (first","useful":1,"cool":1},"j1Ez9ELdnhHfzoSqfUByNA":{"text":"Although they seemed a little bit unorganized at times the food was great and the waiter w","useful":0,"cool":0},"mfwzyA6fYyLgDg1QgVXeng":{"text":"First one star review of my life. Waited at the bar for a drink for 20 minutes. Bartender ","useful":0,"cool":0},"k6AANJLBbK9r1tI2odSTDQ":{"text":"Low quality food. There is better food out there. We had the New Orleans Sampler and the F","useful":0,"cool":0},"Aqgor9i7vG3lqfKf3W8fag":{"text":"The menu attracted my attention. It's not the best restaurant in town. The service was slo","useful":0,"cool":0},"qVdKfjw0G8P4Eof2JJom4Q":{"text":"Food is great and service was ok considering its mandi grade season.\nBlackened chichen St ","useful":0,"cool":0},"T454c2lk_JID5hUJX7q0NQ":{"text":"Stopped in this place for some apps and wine.  Really enjoyed the atmosphere of this place","useful":0,"cool":0},"XzZQVNSzjfTqFAzFMa9abg":{"text":"The fettuccine tastes like a Lipton instant dinner. The beans and rice as if they spilled ","useful":1,"cool":0},"b1xTAC35lgKADL8mMzDt-g":{"text":"This restaurant came off as average to us when we visited for dinner last night.  Some nic","useful":0,"cool":0},"195G_-P0aH9leat-1W9aJA":{"text":"I'm not sure why the reviews for this place are so bad, we had a delicious dinner. Crab an","useful":0,"cool":0},"YMnjiyeW_Zx-t6EPy-7aIg":{"text":"this review is for a to-go ~adult beverage~ only.\n\nfor my mardi gras sunday funday traipsi","useful":0,"cool":0},"VokF3sJY6LQZKrZkp8a1NQ":{"text":"Just ok.....not what I expected. My food was technically good. My partners catfish was goo","useful":0,"cool":0},"OoxGm1Yhzy_jd0NiIegoUA":{"text":"We had the most wonderful server, Eustice. He was great. The Bloody Mary was amazing. The ","useful":0,"cool":0},"oDH9plSIziLctv_ntISe8g":{"text":"This place is a disgusting tourist trap.  The food was inedible and over priced.  We serio","useful":3,"cool":1},"lfhkLOQix5vcp9ZVYSkfQA":{"text":"WHO DAT?!\n\nI wish I were more organized when it comes to dining in the Quarter.  Usually, ","useful":3,"cool":3},"Wq5cnh8pbWh9j180EJ7JUg":{"text":"A charming setting but one of the worst restaurant experiences ever. We waited over an hou","useful":0,"cool":0},"L1HE6S_ko2TjS0c6SgWOZg":{"text":"This review is for our most recent visit - but if you average our previous, fabulous visit","useful":0,"cool":0},"UbajIwy6lnJ0H3nZzVrzzw":{"text":"By far the worst restaurant I have come across here. Rude waiter, terrible service, and di","useful":0,"cool":0},"FXNySkCFs-WixFL92SKl6A":{"text":"Not in any guidebooks as a \"must-eat\" attraction - we stumbled upon Pere Antoine's while t","useful":0,"cool":0},"ic2ET0c4hRvb17O6qSrK7w":{"text":"Pretty average food tbh. This was an impulse dinner as it was a hot hot hot day and we wer","useful":0,"cool":0},"wDgkFGMrRmQDVDg9PPQbxA":{"text":"Meh...kinda overpriced. I'm from the South so I wasn't in awe of the food like the Yankees","useful":0,"cool":0},"zFYiys-u96mGIn_p5Y67Dw":{"text":"Frankly, we chose Pere Antoine because it was so damn humid outside and we were desperate ","useful":0,"cool":0},"wK6W9xAFqZRtTbfs50IqrQ":{"text":"Not impressed...no coffee cups, red beans and rice are ok!  Sausage was under cooked!  No ","useful":0,"cool":0},"UhdaYpMqYg9WZ7_B3UsYSg":{"text":"Awesome lunch. Po boy, gumbo, catfish were all awesome. Don't believe the low star rating.","useful":0,"cool":0},"9E2FE011bkmo0KMO9NDHqQ":{"text":"Saltine crackers that came with my gumbo have more flavor than anything here.  Waited for ","useful":2,"cool":0},"LX7MClJrrC8-y3EsR8T0LQ":{"text":"I have eaten here several times, and usually I would give it at least 3 or 4 stars. Howeve","useful":0,"cool":0},"7ezW51afZHXjxpOgzAeTmQ":{"text":"Service was great, our waitress was Tamarra and she was friendly and efficient. Crab cake ","useful":0,"cool":0},"j45o0oaH7aMIvOknGECnFg":{"text":"Hands down one of best bloody Mary's. Service, at the bar, was super friendly. I also orde","useful":0,"cool":0},"lyd9DGuclQOP2n-3dnufGg":{"text":"Stop by here on a Saturday morning during our vacation as Cafe du Monde had too long of a ","useful":0,"cool":0},"rV7GUDw4_HJVqI4hkCK70w":{"text":"Awesome restaurant! Just great and amazing food! I totally recommend their gumbo. It was v","useful":0,"cool":0},"OOExgEfjAXmrDZ-TqSoRmw":{"text":"Food was terrible. Jambalaya looked and tasted like rice with tomato sauce from a jar. Ett","useful":0,"cool":0},"M2uJCcgLUayGY6kYM0s2gA":{"text":"Can't beat the hospitality! Our waitress, Tammarra, was so nice and genuine  We had the Ja","useful":0,"cool":0},"JFRzZMssWCoz5VWvGHSfUg":{"text":"This place is awesome! The bloody Marys were fantastic!! And the food was soooo yumm.\nThey","useful":0,"cool":0},"1As6IH3IeAxnb8qhEc8wOQ":{"text":"Stopped here for dinner.  I had the half combo of crawfish ettouffee and shrimp creole.  I","useful":1,"cool":0},"9NTHAYQ8DX_TnoIc3Qnt8w":{"text":"Took 2 hours to get any food and i only ordered a salad!!! It was the worst meal i Had my ","useful":2,"cool":1},"QltWX8GcqBa-ENFV7rT-dQ":{"text":"We are frequent visitors to the city and look for new places to add to the repertoire.  Af","useful":0,"cool":0},"mNKi7v4cqYEYhjDmHynmIw":{"text":"Food was decent. \n\nHad the priciest pasta. Felt a bit overpriced. \n\nThe wait was really ba","useful":0,"cool":0},"37sNDlZDnc-NorFIbWpFUg":{"text":"Bad service and bad food! Do not go here. \nWe walked in here because another restaurant wa","useful":1,"cool":0},"K5dYlf4-jTCfK3h5RZFm9Q":{"text":"Tried sampler and went there next day for chicken & sausage gumbo specifically. Gumbo is r","useful":0,"cool":0},"uiKdqY8PweOZrSq7Mzpzgg":{"text":"Tourist trap! Stay away. Poor service, poor food, not a good experience. Did i mention the","useful":0,"cool":0},"arh9p6tERhp4YlqLGs7mtQ":{"text":"Was there last weekend.  The service was terrible!  Food came out cold.  With all the good","useful":0,"cool":0},"5SdmBZ6bClZZeaQRKC-iSQ":{"text":"The food was amazing! We had the fried green tomato appetizer and the New Orleans Sampler.","useful":0,"cool":0},"gM8jCoVB-C6D9t6dPjEGzg":{"text":"BREAD PUDDING FO LYFE. My first meal of 2016 at 1:30 in the morning was at this place and ","useful":0,"cool":0},"3mCi7anHnGVhhYqaCR0dvA":{"text":"The crab and spinach dip is delicious! Service was pretty quick for a Mardi Gras parade da","useful":0,"cool":0},"26Q4b-8H7wRkf2aZx64Wjg":{"text":"Great food, and Lena was very attentive to our unusual requests (Keto)   We enjoy the atmo","useful":0,"cool":0},"Tm2u-pQyCisFelg33GxOgg":{"text":"Our dinner was just okay. The gumbalaya is noteworthy. I really liked it. We also had the ","useful":1,"cool":0},"moXUU6iSqhlq3suVjLEjPw":{"text":"So, why is this place so under rated? We were skeptical, not many people there, but we wer","useful":0,"cool":0},"yoKfXlxuEIyYec2ckGiMPg":{"text":"Went for breakfast. First off, the mimosas were not strong enough. I had three and never e","useful":0,"cool":0},"EwRcPttStJKL_spMa54mKA":{"text":"Back from New Orleans . If you had not guessed it but, we love at NCB  ( No Culinary Backw","useful":0,"cool":0},"dVW52CL19u7OwVu53p2D-w":{"text":"A staple of the Quarter. Lots of good classics. Came here for a \"second dinner\" after walk","useful":0,"cool":0},"rp0QBlphDFplH9qxpCXOyQ":{"text":"This place was pretty terrible.  In retrospect, I'm in awe of my decision to order the oys","useful":0,"cool":0},"1WRznIiCQnZj1rqH1Vt53A":{"text":"Came here for brunch, sat near an open window and enjoyed the cool breeze and watching all","useful":0,"cool":0},"XJdA7vrK7vTv-_w55GGw_w":{"text":"Hands down the best fried green tomatoes ever!  We ate in the bar - bartender was great an","useful":0,"cool":0},"0d6xPOnIP7awJtucsOKQew":{"text":"I don't get all the bad reviews. Maybe because most of them start with \" I ordered a Burge","useful":2,"cool":1},"7Whl5dHHaPVAUpcc02QLqw":{"text":"The food was good. But the service was horrible, this was the worse service I have ever re","useful":0,"cool":0},"lJXkvkMvBMy3gSgFlzuWYQ":{"text":"Given the good food available here, this is very \"food service\" truck standard. Home made ","useful":0,"cool":0},"y-HcKAIe8vqmBe4e2IYxDg":{"text":"Are at the bar and Susan gave a great recommendation- the Gumalaya! Delicious!\nAlso the fr","useful":0,"cool":0},"PqOUaeQuawSVZtneN63zmA":{"text":"Good food, large portions, attentive service, immaculate restrooms. Stopped here for lunch","useful":0,"cool":0},"40nt2zJuLLq_bWSxSJrD8g":{"text":"I ended up in this festering shit-hole because I was hanging with folks from out of town a","useful":8,"cool":4},"Wi6JKT_N1CSDg2xPYiTgqA":{"text":"Came here twice during my visit to New Orleans. Really yummy omelets and the best hash bro","useful":0,"cool":0},"d3GIhAfWEe-s7-qBW_Ly1w":{"text":"Late one Sunday night, a friend and I stumbled into the virtually empty (that in itself sh","useful":0,"cool":0},"dOVX1p2qaezNFp-oNlE0RA":{"text":"Don't go here. Seriously, how many other restaurants in the French Quarter are there? Move","useful":1,"cool":0},"34ufLPrJQAjO7SQGKMYnbA":{"text":"We just happened upon this place. They seated us right away. Our server, Tam, was a gem. S","useful":0,"cool":0},"Niq7xbR6fj9LzhPiRJRbDw":{"text":"Not as bad as yelp made it seem,\nService is slow but I thought the food was worth it.\nBloo","useful":0,"cool":0},"bNi5HaPPa4sViI67i2wXFQ":{"text":"I only gave it 1 star because our waiter was very nice. The owner was really rude,loud and","useful":1,"cool":1},"kce4YleBm55I3yEIlpOlnQ":{"text":"Needs updating and is kinda dirty.  Drinks weren't that good","useful":0,"cool":0},"huIds9DpNT2YE52Qvagilw":{"text":"We had a delightful lunch there today. Perfect weather (not that the restaurant was respon","useful":0,"cool":0},"ah3YRn67ku1hyxEnxw9k7w":{"text":"I ordered a chicken sandwich that was literally the best chicken sandwich I've had in my l","useful":0,"cool":0},"PSpDNgePYNHnuflbHdrzWA":{"text":"After being told that there was a 45 minute wait at Café Amalie we looked around and found","useful":0,"cool":0},"aT1bSRypoSIkqMGra8z6Hw":{"text":"Let me start by saying we had a great server. Tam was very nice and did a great job. Howev","useful":1,"cool":0},"AgYKo98nimIBJuhMCirqkw":{"text":"Great choice for NOLA food in the Quarter. I am allergic to shellfish, so Cajun food is a ","useful":0,"cool":0},"80jWQGHvD6apkfS65YhKVA":{"text":"Shame on me for ordering food to-go 15 minutes before the kitchen closes.\n\nOrdered a small","useful":3,"cool":3},"KF36GWbR3tz6VXAMgcLgHw":{"text":"Went here for an early lunch and enjoyed the view and service. Our waiter was extremely fr","useful":0,"cool":0},"jCv3yrLjy8ojysV5HuwkGA":{"text":"Stopped in for a refreshing salad in the afternoon.  Wasn't too busy and though the hostes","useful":0,"cool":0},"z36Zljfbwo-IBRriC6iGzw":{"text":"Good food and good service. You just need to give a little more on the veges or portion si","useful":0,"cool":0},"SQv8yWmdvpQFM0OpqTFhdA":{"text":"This place was located right next to my hotel. I fell in love with the barbecue shrimp! Th","useful":0,"cool":0},"gYNXaI5-pd6-P3SWa4JLNg":{"text":"When I visited the French Quarter for the first time three years ago ,Pere Antoine was whe","useful":0,"cool":0},"TaU-RziDE2sC9_47nxmZUw":{"text":"Had my worst experience at a restaurant ever at this spot just a couple of weeks ago. I we","useful":2,"cool":0},"l6VdeSB-90v1tsJh2P5EQg":{"text":"Friendly staff, beautiful and convenient location. People watching is perfect.  Food is pa","useful":0,"cool":0},"fnCttaDJzeBTWxg_mNbHjw":{"text":"Crab cakes were delish!  Étouffée a little runny.  Not recommended..  Service was great an","useful":0,"cool":0},"cDp9NlqlRCUvQ2FcSiGseg":{"text":"Prices were right...food was ok...service not so much...3 of us got our food no problem...","useful":1,"cool":0},"CJiIs6etQXgFQ4Vbxjsswg":{"text":"Honestly have no clue why the reviews are so bad.   We just had phenomenal food in the gum","useful":0,"cool":0},"aXL6C__aXzfzyhFk_n8bmw":{"text":"Were looking for a place to have lunch and came across this place. The menu has many optio","useful":0,"cool":0},"xzqOVFqaObJsTtgaq1IhXw":{"text":"I'm glad I didn't read the reviews before I came here! It looks a bit hit and miss, luckil","useful":0,"cool":0},"CvFlFArTI96Sqy1m81zYvQ":{"text":"Food was bland. I wouldn't recommend their Cajun or Creole selection. It tasted like tomat","useful":0,"cool":0},"e_HwPqg8XNEF7hcaT1Gpow":{"text":"I give them 2 stars because of our waitress Jill.  Jill was one of the worse waitresses I'","useful":0,"cool":0},"PW04MZH_ISc7d4WgtCiTmg":{"text":"Had such a great time at this place! Our waiter Stan made our night even better!! We had t","useful":0,"cool":0},"hfQLrDMat0BRdy3ovCV5wA":{"text":"Casual, lively, and really good food! I ate the red beans and rice and it was the best we ","useful":0,"cool":0},"WIJgM6FG65m9n7YqSyJhlA":{"text":"Should have trusted my instinct with this place... Wine was served to us in plastic bathro","useful":0,"cool":0},"ic_XlYpQyB7Tc-nfWNsB5A":{"text":"We came for breakfast on a Saturday morning... the ambience was lovely as the open air was","useful":0,"cool":0},"qppq_gvVXdUWJPaXpXL29A":{"text":"The first bad sign was that place was mostly empty. But the group was hungry and didn't wa","useful":1,"cool":0},"xS8JyQMR3ogcEweOzbaPgA":{"text":"Excellent service from Kenneth. Food there was delicious (especially the seafood gumbo). W","useful":0,"cool":0},"N4gXkc65_Aenf1a1yR3_6A":{"text":"Had the Gumbalaya and Crawfish Crabcakes, the Gumbalaya was ok a little spice but no real ","useful":1,"cool":0},"0eBebfnjPf4-BSgE_9QpXA":{"text":"We loved our experience!  My husband had the crawfish and crab cake ponchatrain and it was","useful":0,"cool":0},"8EI82VPs-KXrQFEhMyY16w":{"text":"We walked up to the hostess stand, no one there.\nAfter about 5 minutes a waiter came to th","useful":1,"cool":0},"cAtfqrEPkBM98L7eS6FRog":{"text":"What can I say other than great food and great service! Stumbled into Pere Antoine's after","useful":0,"cool":0},"OMvOg4twxaacu6JaAzm3sw":{"text":"We went here mostly because we could get right in when everywhere else had a huge wait.  H","useful":0,"cool":0},"8biDiXcJD_L_0tt49fiSBQ":{"text":"TOURIST TRAP TOURIST TRAP TOURIST TRAP... But they were open....\nEverything closes pretty ","useful":1,"cool":0},"KWK0syL_05IwfNpqpFhI-w":{"text":"The New Orleans pasta & the catfish are the best things on the menu. So ridiculously delic","useful":0,"cool":0},"AmYqkUI3pro_PifwCH2AZA":{"text":"First, I probably would not be writing this review if I was offered a discount on my food ","useful":1,"cool":0},"fAEzTBSekx26c4IByR8Ekg":{"text":"Had the New Orleans sampler. Gumbo, Jambalaya, red beans and rice, fried shrimp...even bre","useful":0,"cool":0},"xryMfbS3PlsXqS7ecN7ASg":{"text":"My wife and I were walking down the street and the ambiance looked nice,  so we thought we","useful":1,"cool":0},"2Ype9MjMNc-l-Kouwd7yMQ":{"text":"There are so many amazing places to dine and/or imbibe in the French Quarter...but this is","useful":6,"cool":2},"Bdk8wpM-jSFSr8Vi41EKcg":{"text":"I went here with my friends for dinner on Halloween night because most other places were t","useful":1,"cool":0},"O3ZsEDsg6oI0LI-pFAqorA":{"text":"Over salted and hot sauced, trying to fool you into the typical hyped New Orleans food, no","useful":1,"cool":0},"EzDjXArnkphi8BBaiQvbCg":{"text":"Meh. Not horrible but not good either. Plenty of better choices for less money. Only good ","useful":0,"cool":0},"KizGesDwrS1AfDhIKAo_Ng":{"text":"Pay close attention, Yelp, because I am about to make a bold proclamation.\n\nPere Antoine i","useful":6,"cool":1},"EgGCHmlAuoTWQjRsDFBGbg":{"text":"Stopped in here on a Saturday for brunch when our first choice had a 45+ minute wait.  We ","useful":0,"cool":0},"VYNjA56RGYe52RKuGbeO_Q":{"text":"Worst service ever. Server stopped by my table and tells me he will be right back to take ","useful":0,"cool":0},"iLyFsayh3Q4biRUs_3Cgzw":{"text":"Always love stopping here for a cocktail whenever we come to the City. Bartender, Kenneth ","useful":0,"cool":0},"rYhXmr5Kzn42qKO2RNwFaQ":{"text":"Not great food. From what I could tell nothing made in house. All the food looked to be pr","useful":0,"cool":0},"ReWV3DdUV8_bMlNt-DjTkg":{"text":"Pere Antoine's is a wonderful place for a lazy lunch.  Quiet, clean, attentive service.  W","useful":0,"cool":0},"zH1URqHM0V9oxfoNMJtb2A":{"text":"The restaurant itself is pretty dirty which is why I gave it two stars. One of my group's ","useful":0,"cool":0},"qAUMvxnEJng3_W-kus_zCg":{"text":"Take a pass. Expensive and staff was unpleasant. Food was mediocre and cold. Bloody Mary w","useful":1,"cool":0},"muToc78V_O4ZY1uMR9yJLQ":{"text":"Dont eat here. It's a trap. While the location is the only thing good here. The staff was ","useful":1,"cool":0},"syB9WR0toe4X7gMXtb8wnQ":{"text":"This place exists only by preying on toursits who don't realize that this isn't  Antoine's","useful":3,"cool":1},"HDT-Z2NgsEgfTyUivZFrew":{"text":"We ate lunch here today. First of all the staff was super attentive and very friendly. The","useful":0,"cool":0},"wqhd0JozMnjoQcSSdsh7JQ":{"text":"Silly me for being so hungry and not patient enough to walk a little further and eat somew","useful":1,"cool":0},"3il86jKnA5laCx7cLmQ9ow":{"text":"Nice people but the food is average; my blackened fish was too salty and not plated well. ","useful":1,"cool":1},"dqmV8VLMZlWnPsge52obdA":{"text":"Always a favorite! I should try some other places, but when you know what you are getting ","useful":0,"cool":0},"nQ1XqNTg5a6mV29A_8RB4A":{"text":"A wonderful break from Bourbon Street. Quiet, homely, and genuinely Creole. You get to tal","useful":0,"cool":0},"Yaj9RGUtzWBgdAbuZRgazg":{"text":"I got the Mardi Gras pasta, I honestly didn't really like it. I did love the shrimp, sausa","useful":0,"cool":0},"VzhTKJQAHskurXbps_A47w":{"text":"Stopped in here for an early dinner. Very disappointed with lukewarm seafood jambalaya, wh","useful":0,"cool":0},"ahWbndlVaALUE83vr-z3Pw":{"text":"HORRIBLE service and so-so food.  It wasn't bad.  It just wasn't good.  And did I mention ","useful":1,"cool":0},"sgp-_JGNUeB8SkpR1NW8JA":{"text":"Longest I've ever waited for a mediocre meal. I would definitely suggest checking out othe","useful":1,"cool":0},"Ff0YAqNV_bIweSscHYLOCA":{"text":"We ate at this restaurant the morning after Halloween.  All of us (there were six of us) w","useful":0,"cool":0},"7GqHUZkJraTN8aci78Fjng":{"text":"My daughters and I ate here while we were on vacation.  We enjoyed the red beans and rice,","useful":0,"cool":0},"DGT6xraAWmdGw1hkHFafNA":{"text":"Worst Bread Pudding Ever, it seemed like it was made a week ago and they attempted to warm","useful":0,"cool":0},"4nsqTgv-wwKaOefRToIB3g":{"text":"It was a rainy Dirty Linen Night and 801 was packed across the street, so when this place ","useful":0,"cool":0},"FbjnPKXnChfPJN94PuS4Gg":{"text":"This place was really close to the hotel, so we ate here a couple times, last night the fo","useful":0,"cool":0},"FxEBv3Xzdzba0PhCtmD4wg":{"text":"We had apps and cocktail. Stephan and Brandon made a great team at the bar serving up cock","useful":0,"cool":0},"gyjh-TGu7VFEdYGwih5w7g":{"text":"This place was awful!  My first clue should have been the lack of customers compared to ot","useful":0,"cool":0},"f2a_HiYohnnG69vBmX7ytA":{"text":"I would rate this place in my top 3 list for great seafood ! The barbecue crab legs are th","useful":0,"cool":0},"W8x2UBOCmm71jZRGNve7kw":{"text":"Had lunch here twice while in New Orleans as my celiac husband was able to enjoy a taste i","useful":0,"cool":0},"hMSR5R6KhyWoYgerPQ6a3Q":{"text":"Well I would have given it 4 stars except that the Hostess was extremely rude.   The drink","useful":0,"cool":0},"MhtX9zTMgS3Z47RseYF_Iw":{"text":"Favorite food in New Orleans so far. \nFlavorful and reasonably priced.\nFried green tomatoe","useful":1,"cool":0},"niDn7a-Axf6dCGgm56JtPg":{"text":"Stopped in late a couple of weeks ago. Had the etouffe / shrimp creole and jambalaya. Food","useful":0,"cool":0},"DBLg9UoR1FxV3rH6kkTA6Q":{"text":"Stopped in here for breakfast on Sept 26th with two girlfriends. When the waitress (Tashon","useful":0,"cool":0},"FW60pn5FaYvZ88hyV1JXSw":{"text":"Don't go. Simple don't go... That is unless you are 100% deaf. You'll hear Lionel Richie, ","useful":0,"cool":0},"qeYKE_9-dauHLofUZGCRBg":{"text":"We ate here 2 days in a row and had a pretty diverse experience. The first afternoon we po","useful":0,"cool":0},"dCg9Z5axwEVcH7P20P2jmg":{"text":"Vegetarians beware. This place offers a vegetarian poboy which sounds amazing but it's rea","useful":0,"cool":0},"8z-6v18NYTarOtczdXS_0g":{"text":"Had and absolute wonderful time! The food was exceptional and our waitress, Mykel P, was v","useful":0,"cool":0},"zbNhH9JV-TB4phShcce3xQ":{"text":"Didn't plan on dining here, but we were pleased with the good food and excellent service. ","useful":0,"cool":0},"wY-jVq9NlCLMQK-mzwJhxQ":{"text":"Came here for an after dinner drink. Didn't try the food, but probably wouldn't after read","useful":1,"cool":2},"RGLulbgHyByqHz9Yhe7TPQ":{"text":"Food was good and waiter tried, but it took over an hour to receive two kids meals, an app","useful":0,"cool":0},"sYkJesWP2qU09JWtWgvctg":{"text":"Read other reviews about wait time but thankfully did not have the same issue. Great, very","useful":0,"cool":0},"xCc0V8BeWnS-VMljcN0Ijw":{"text":"Food was very good.   Great service and accommodating.  Our server was Melva.  She was so ","useful":1,"cool":2},"3C-rYT5W7tsYAYgf2yDcEw":{"text":"My advice: Unless you are too drunk to stumble elsewhere, don't eat here. Vegetables were ","useful":0,"cool":0},"CCnaWfTAqKGmykATyAFi7g":{"text":"Should have read the reviews! Cold, tasteless fries next to an even worse tasting burger. ","useful":0,"cool":0},"FzY5vxB0fpc2y91JJPAoxw":{"text":"It's open 24 hours - went for brunch. The service was speedy and our server was very nice ","useful":0,"cool":0},"sl0UbUJlQJvI_yQutcL69A":{"text":"We are visiting from Atlanta for the Crescent City Classic 10K. Easter morning brunch spot","useful":0,"cool":0},"fTAjVTx_fjcQY2sCN6PJxg":{"text":"This place was empty when we arrived and now we know why. Our server was SO SWEET and atte","useful":0,"cool":0},"oPO0CkSiZQ4bYT-La0YGRQ":{"text":"Kenneth is an amazing asset to this restaurant!   We are regulars here and every experienc","useful":0,"cool":0},"JV5clp2ThtIT6Kxs4SUL-Q":{"text":"This place not only has a beautiful view of the gorgeous architecture of New Orleans but t","useful":0,"cool":0},"9GP7YLtE_0t9Cw8u3kq62Q":{"text":"Food is great, but our server Donna is the most unpleasant person ever!!! Unlike my many o","useful":0,"cool":0},"4BO_Vt7bdOLfwtjY1W-DsA":{"text":"Service was okay. Food was awful, ordered the big breakfast sandwich...cheese wasn't even ","useful":0,"cool":0},"CBhdXDZkD9lF8i2g5rgrCw":{"text":"Cold hah browns.  Non de-veined  shrimp.  Stale oranges that were cut 1 to 2 days ago serv","useful":2,"cool":0},"9_Ug0s2VxtLQMBcGVdUHNw":{"text":"I went here twice during my visit and each time rated only three stars. \n\nIt was a crazy t","useful":2,"cool":1},"FlpHpcQCMRwga8Gwx3C33w":{"text":"Such great food and kind service. We were greeted with friendly and accomodating staff fro","useful":0,"cool":0},"zrnZvocalm3uz_2lfecDfw":{"text":"Definitely  a tourist trap.  Jambalaya  was the worse I have ever had. 3 tiny shrimp (tiny","useful":0,"cool":0},"pan_LuPkUudXzGKZ34ee9w":{"text":"I can only speak to breakfast-the Beignet Fries were UNBELIEVABLE. Best breakfast ever; th","useful":0,"cool":0},"730wPJtW3w0a3DloRyBJwQ":{"text":"This was an awesome meal!! It was our first meal in New Orleans and we had high expectatio","useful":0,"cool":0},"2Aq5XFSPu1M8TJ7hQBDkvQ":{"text":"It was late and hard to find somewhere to sit down and eat dinner.  We thought we'd just w","useful":0,"cool":0},"_rBjOnGVFIT75d_DNg8Llw":{"text":"We stopped in at midnight and they happily seated us & told us to take our time ordering. ","useful":1,"cool":1},"AuLpDApmKlqf_t8LZczKCA":{"text":"Food is incredible! We also had excellent service.  Beau was our server and he was perfect","useful":0,"cool":0},"Lh9q9Zrpt2hHrF3Pm5ZWpg":{"text":"Simply the best red beans and rice in New Orleans. A must visit for me on every trip here.","useful":0,"cool":0},"r_S25m0O-lyP5paGBcmfTg":{"text":"Loved the rear courtyard, bloody's delish...ask for bacon! Kenneth is the best waiter ever","useful":0,"cool":0},"KFeqmp_ZMdxHbBi7a1g1wA":{"text":"The only nice aspects of this restaurant are the location and building. As mentioned below","useful":0,"cool":0},"KjZ-IHxI3ReETwryGnPnPQ":{"text":"Service was excellent!  Food was pretty good had the mushroom tchoupitoulas and bread pudd","useful":0,"cool":0},"K19R7bMUZDrCrzcfR15jFg":{"text":"We popped in for lunch after a tour ended nearby, and had no expectations other than \"can ","useful":0,"cool":0},"8V5Pk5Re_KExHB8Pf4O2iw":{"text":"This place is great if you like really bad food half ass service sitting in an unaircondit","useful":0,"cool":0},"H4R278mFy8kI2gI0dQyTKQ":{"text":"This place is pretty ordinary and nothing really stood out. The service was really slow, a","useful":1,"cool":0},"XDSQXYSPoSTnod4PZ5w9AA":{"text":"NEVER EVER GO TO THIS PLACE!\nThey ACCIDENTALLY took 130$ from my credit card, by processin","useful":3,"cool":0},"SEkfi-AGWQQ1KYniSmrLCA":{"text":"When another restaurant was not open yet, we stubbled on this gem! We ordered the banana f","useful":0,"cool":0},"PxfjyUGjeNepxmMdEYR4eQ":{"text":"We arrived into NOLA on a Friday night post mardi gras and went looking for something clos","useful":0,"cool":0},"Qj8BuIt4qqXtbROsFt7_fw":{"text":"The shortened version of this review: The best part of the restaurants is the wrap around ","useful":4,"cool":3},"Yb_yzgQK4zCSAjv4uG4Ajg":{"text":"Ate here for breakfast.  Tried the meat omelet and the seafood omelet.  Both were very goo","useful":0,"cool":0},"eYUDe-QCOUNPdbfQuwvSuw":{"text":"I might have given it more stars if they were capable of serving food. Instead we waited f","useful":0,"cool":0},"FYm4O8SsRTtbpLBnGBJLdA":{"text":"DO NOT GO HERE!  I had breakfast here yesterday.  My friend ordered the veggie omelette th","useful":3,"cool":0},"1aFHy_Zg4famHpp2mo3lXQ":{"text":"Perfect timing today as we arrived before the lunch rush. We were seated at a table next t","useful":0,"cool":0},"1dwJJ-wsAsIcvOohyJ4hrg":{"text":"Yuck. \nService was bad. Waitress was annoying and absent. Promised to come back and never ","useful":0,"cool":0},"mq68eLvoiTG0WH8HBddQ2g":{"text":"Now I'm a bit disappointed to see that this place is rated so low.  Maybe because we didn'","useful":0,"cool":0},"8SKHqywdZRufTcNEjXUoPg":{"text":"Worst meal we had the entire trip.  It has such a great location and sitting in the window","useful":1,"cool":0},"52K5imp8y6RstxugaEMr_Q":{"text":"They had good service and affordable food but my plate I had something different when me a","useful":0,"cool":0},"WJ1Thrhr_eLyZAV9zxuPeg":{"text":"Every other restaurant had a long wait at the time we found this little gem. In fact, 2 mo","useful":0,"cool":0},"M9nj-qe8HA23xA6TK_Tc2g":{"text":"If I could sum up the dining experience here in a word, it would be \"meh\". We were seated ","useful":0,"cool":0},"fV03IL792dCHrdvY38biUQ":{"text":"There was a laminated drink list on the table.  Enough said?\n\nIn all fairness, I liked my ","useful":0,"cool":0},"SrNMhkL794ht5J4W5rxD3Q":{"text":"With all of the great food in New Orleans......GO SOMEWHERE ELSE. We had the red beans ome","useful":0,"cool":0},"Aw4jd7b69Zqt2B4XP8-FHA":{"text":"Only come here when every single place has a 90 minute wait on a Sunday morning.  You'll b","useful":0,"cool":0},"GGmOLsdk3WD7wsEX7WQWyQ":{"text":"This restaurant had the worst service we've ever experienced. We were walking through the ","useful":0,"cool":0},"h0Wwu64SonXVxlS3YAGOOA":{"text":"Had an early dinner here of red beans, rice and smoke sausage. Table by the window, so the","useful":0,"cool":0},"roYEtggHKAx144LaJce02w":{"text":"Staff was very friendly, although a little pushy with the alcohol sales. After the breakfa","useful":1,"cool":0},"Ua8zpEo7dnkIzPjkFpvOXQ":{"text":"The atmosphere is classic French Quarter and the food is on par with what you would find i","useful":0,"cool":0},"dt2oJ_9K639MRO64K9XHjg":{"text":"The food was horrible. I wish I had read the reviews before eating here. They can't even m","useful":0,"cool":0},"XkdoCctGgwMh39zPoYkNiQ":{"text":"5 stars on the drinks. Southern Belle and voodoo brew were yummy. The food, at least the a","useful":0,"cool":0},"RXXH7fpm2PDwIemIZiYx_w":{"text":"AMAZING bloody mary's.  Prices were a bit higher than most places nearby, and drinks a bit","useful":1,"cool":0},"JSJSsPahMaU35qeSFxdxxw":{"text":"We just had a wonderful tasty unique breakfast here, with a great waiter named Kenneth. Cl","useful":0,"cool":0},"EHnEJ7LdUwJy2bmOmgtfNQ":{"text":"Liked the location - we were shopping for art on Royal St.  I was craving salad after a fe","useful":0,"cool":0},"VXqkuc_ld3M1ZQa44PeJfw":{"text":"Good food at a reasonable price but what stood out to me was the amazing waitstaff. In par","useful":0,"cool":0},"n5HmN-4f6XA2GjcSlE509w":{"text":"After eating nothing but seafood in New Orleans I needed something normal. The bacon break","useful":0,"cool":0},"yXASuRDPSZk4J3OQAPo7Og":{"text":"Great menu and great prices.  The locals go there for lunch for a reason.   Sazerac whiske","useful":0,"cool":0},"ngKSRVhedixaIfEmXM1E8Q":{"text":"Are you kidding... Great food and way affordable off bourbon street.  Food is fantastic gr","useful":0,"cool":1},"SqU1IltHOZo2qrvMTT6IEA":{"text":"OMG giving this place One Star is five stars higher than it deserves. I wouldn't the dog o","useful":0,"cool":0},"Snsh6ySU0ECrKvF99JkktA":{"text":"Stopped in here for just a small bowl of chicken and sausage gumbo and ended up ordering 2","useful":0,"cool":0},"onYZs1wMtGJXvd_Q-x1obw":{"text":"Ordered Blackened catfish and it was a little too blackened and the vegetables that accomp","useful":1,"cool":0},"gV9J_h-tI3D73mNWeaoS5g":{"text":"The food was very good.   Traditional red beans and rice and BBQ shrimp.   Nice table with","useful":0,"cool":0},"NqvJ-RKkMTpNSh_GVGvBTA":{"text":"My sister and I ate at Pere Antoine's on the suggestion of our tour guide. We were absolut","useful":0,"cool":0},"aA14kCpfUpP9FxxA0lMPJQ":{"text":"Avoid at all costs. Tourist trap. Wedge salad was covered in dressing you couldn't even ta","useful":0,"cool":0},"gzYXbaoyff0yjyKVysfFTQ":{"text":"Meep...I am a little embarrassed that as a self-proclaimed Yelp snob (4+ stars only, plz),","useful":2,"cool":0},"3L2GzhD0EM-v0oY50okvEA":{"text":"We stumbled upon this restaurant after a long night of partying (surprise, surprise). One ","useful":0,"cool":0},"TCDeYCWTx0ftQznIUelrTQ":{"text":"Stopped here for lunch with my traveling buddies. We shared a sampler of the local cuisine","useful":0,"cool":0},"WsloPIIuXJdq1ExnElNX6A":{"text":"We made the mistake of not reading the yelp reviews until after we had been seated and ord","useful":1,"cool":0},"p1CNVKHiKR4uqR61uwwiHg":{"text":"Awesomely awesome blackened catfish & crawfish etoufee\nNot the cheapest place, but similar","useful":0,"cool":0},"M7y6Pe4C5FkRLvgPn1GGDQ":{"text":"Our second time visiting this restaurant. Our waiter Kenneth was fabulous and the food was","useful":0,"cool":0},"iWomHSdBus1u903Uq59YFA":{"text":"While the food was good and the location is great, especially with a window seat, the offe","useful":0,"cool":0},"g6V8N_qja-6alTEaP6zhFA":{"text":"We have ate alot of good restaurants while on our stay in the NOLA but this was the worst.","useful":0,"cool":0},"P2mLZjyDPH7ZB5yawS6eDA":{"text":"Food was very good!  Red beans and spicy sausage. Red bean omelette!  Hash browns greasy -","useful":0,"cool":0},"_zt8uSrqsFBdv-asmoP8lA":{"text":"This was yet another place that I tried gumbo in the city. Now, I am NOT a person that lik","useful":0,"cool":1},"D6QUITYWJ-7LH0rHeFZ5Bg":{"text":"We left our room for a late dinner \"a little past 9:30\" and it was sunday so most places e","useful":2,"cool":0},"yXTCcIwIETWU9nfGpTwyxg":{"text":"Spent three days in New Orleans and hands down, this was the best food we had our whole tr","useful":0,"cool":0},"iFHxrr82Wdke9uiMvwB_WA":{"text":"I am very surprised to see the criticism expressed regarding this restaurant.  My spouse a","useful":2,"cool":0},"1m6apZkfBfgvMKh7nmY3Ug":{"text":"Perfect in every way. Well priced, great service , food prepared excellently! Casual setti","useful":0,"cool":0},"xaLDTt80Z9EjJEfr55phuQ":{"text":"Open late and the baseball games on. Terrence was amazing but food was meh. Oversized mozz","useful":0,"cool":0},"-rcArcTm5PE0VUvUYHBrsg":{"text":"I love visiting NOLA and the restaurants and people are awesome.  However, I have to say t","useful":0,"cool":0},"gP72UUY14mqyZqYYLv6jnw":{"text":"Just don't go.  You'll be lured in by the menu, prices and location, but it will be a mist","useful":1,"cool":0},"l5LVPdG2drpCksbyl4naCg":{"text":"After our swamp tour, the bus dropped us off in the Quarter, and we walked around to find ","useful":2,"cool":2},"ijXcoidLwdQp52zA4aLzsQ":{"text":"Kenneth is the best! That's it, he is number 1 in my book. He makes everything better!!","useful":0,"cool":0},"AW-yzBT4IFBkde1PB0DU0g":{"text":"If I could leave zero stars I would.  Sat for 10 min before we were even acknowledged...if","useful":0,"cool":0},"eU85_b5967lJi-AmyW4Uyw":{"text":"Best of the Best in every category!!!!!! Wow!!! Amazingly delicious crawfish etouffe!!! Ex","useful":0,"cool":0},"jnI01h3rhqS0esmQBBLZQw":{"text":"Do yourself a favor and avoid this place. Might look super cute from the outside but the f","useful":2,"cool":0},"MRFbC87Vheu4O8P2KRNEUw":{"text":"The only way to mess up a Poboy is to put it in hard stale bread. Pere Antoine did just th","useful":1,"cool":0},"JNUm4PYAPPKFf0-eatiKQQ":{"text":"Great food and great service! Kenneth was super fun and totally made our day. The begniet ","useful":0,"cool":0},"ArWiNwBeVnvt-flGKA1vxA":{"text":"Avoid. They can't keep up with busy crowd. Food was served cold (felt like they forgot to ","useful":0,"cool":0},"HyZLRxfOp4SDDH1NruhwBg":{"text":"On a week's long trip we stopped in this restaurant to get out of the New Orleans rain and","useful":0,"cool":0},"7ruYxDzQegKIJSCO0D2oSw":{"text":"Great staff! Bartender is very friendly and makes one of the best Bloody Mary's I have had","useful":0,"cool":0},"iJXcL7fWlI2e3ZK3ENzenA":{"text":"I have seen a lot of negative reviews. I can only go on my personal experience. I came in ","useful":0,"cool":0},"zqSNvvcTeaNvvtJ6NCeKHg":{"text":"Average. Average food, average flavor, average prices, slow service.","useful":1,"cool":0},"0yIoNE6sV5i6tN8ONEuZsA":{"text":"We chose\n the Cajun sampler and it started off well. The gumbo was good and so was the ser","useful":2,"cool":0},"oTTBc_bp2EhLvpVGaoVx0g":{"text":"My visit to New Orleans for the 2019 Mardi Gras. I had a wonderful time!! I'm so glad we s","useful":0,"cool":0},"jy4HgGLin8xrOLFzWd2Y4Q":{"text":"Horrible service - the waiters mostly ignored us before finally bringing us waters, but wa","useful":0,"cool":0},"MHzSW5duHNmxiUYh5L90Lg":{"text":"Food is pretty good. We ate and had full bellies upon departure. Love the male host today.","useful":0,"cool":0},"jmZGWtnwJhvL800DTuzf8Q":{"text":"Not an enjoyable experience, very long wait, not enough servers. My po-boy surf and turf (","useful":0,"cool":0},"_xJhlZ0OzjPD5igZfS0tZQ":{"text":"After running around NOLA, I needed something cool so I went a salad with grilled shrimp. ","useful":0,"cool":0},"28ApYSJ58iOMcx9HA1OhQw":{"text":"Nice restaurant   Very clean and friendly staff.  Good food selection with vegetarian opti","useful":0,"cool":0},"zkHqBveI4MhfkKl4aeoA6A":{"text":"Atmosphere is great! Food just ok, Rajun Cajun Omelette very tough almost felt like boiled","useful":0,"cool":0},"6zIIJwuTZzSI1k2JmfG0WA":{"text":"I came here with my family of 8 from out of town. We had people ranging from age 4 to 64 a","useful":0,"cool":0},"YSPpBODtc8FrKNsWVAGsDg":{"text":"This used to be a decent place to sample some New Orleans favorites and they offer some go","useful":4,"cool":1},"7SS2eIrJvIDTX3zM1TRpwQ":{"text":"This was not a good experience. We should have seen the lack of people inside and took it ","useful":1,"cool":0},"983mC5X3ORhJZh2JR24Wew":{"text":"I would give them a 3.5 if I could. I have read a lot of reviews on Pere Antoine and here ","useful":0,"cool":0},"9SIBMZ19Yn2mgebjINwU6g":{"text":"A very nice place with nice atmosphere.  Our server was Donald, the service was nice once ","useful":0,"cool":0},"MKFWtKxzNV4dNV23oHz0_Q":{"text":"Awesome service and fabulous food!!  Kenneth was too-notch. Great recommendations for the ","useful":0,"cool":0},"d-UsEoZwknnrLmnFeAd2Mw":{"text":"Excellent restaurant! Came for lunch and then breakfast the next day. Friendly staff, grea","useful":0,"cool":0},"zY9bNK68aBBqWVwOYZsyeg":{"text":"Wow the place looks so nice but the food is awful!  Bland and poor quality I can imagine t","useful":0,"cool":0},"W_vNgNdTW7GXUPGtycfgtA":{"text":"Great breakfast. Delicious and service as well. The banana beignets are amazing. The Ameri","useful":0,"cool":0},"zTjW8PgwtXyeSpzuPewBrA":{"text":"It was breakfast-time, but I wanted my first stop in NOLA to have a Cajun or Creole zing. ","useful":0,"cool":0},"4XDsOmYyc8YXvb6H-Tb5YA":{"text":"DO NOT GO TO THIS RESTAURANT!!!!!!!!!!!!!! Where do I begin?? Maybe the drink?! I SPECIFIC","useful":1,"cool":0},"hVFzrpLAPGWjvjwp5ytKcw":{"text":"What a find. If you're looking for a terrific post hangover breakfast this is a great find","useful":0,"cool":0},"YwbSLHH59-mc-NMwitEzFQ":{"text":"Looking for a relatively inexpensive place with a kids menu in the Quarter for a visitor's","useful":1,"cool":0},"jUaxRsenuE5lNjMeI3KIlw":{"text":"Terrible. The bar tender was rude and unattentive. The food was watery. Two of our 10 peop","useful":0,"cool":0},"7y5zXIiSSkv-RQUaFJzuHQ":{"text":"Decent food.  Small crowd and quiet.  Better service than Gumbo Shop down the street.  Wai","useful":0,"cool":0},"NYNUb6MFcoX6XmKRMmajcg":{"text":"Terrible place, DO NOT recommend, waitress rude, owner and the host also rude, it seems th","useful":0,"cool":0},"5o0MEQMWhzZ0lyhVFP0OAA":{"text":"Went looking for a bite to eat in the French Quarter on a Sunday night. Pere Antoine's loo","useful":0,"cool":0},"dBmw8AjOi-iiRVTPv7iw3Q":{"text":"Decent mixed drinks, but I didnt have any food, so take it for what its worth. I had a tra","useful":0,"cool":1},"-f2OMpT7nVkevJi2olJ1WA":{"text":"Another place we just walked by and decided to stop in and grab a bite and a drink. Our se","useful":0,"cool":0},"egxECntJkM7BofFqXvCv7w":{"text":"Yes, you're probably going to have a wait once you're seated, but get over it. NOLA is bus","useful":0,"cool":0},"jLMZeMXT_YSjQSZWWUoRUQ":{"text":"Great food ! Service was lousy and it wasn't even busy. We were starving after our flight&","useful":0,"cool":0},"2cUpfmFROVLW8JNg0rRg-Q":{"text":"Poor service. \nStopped in for Sunday breakfast. Overpriced. \nEggs come scrambled; that's i","useful":1,"cool":0},"hB-fJ-1PCJFldErMfLIffg":{"text":"Terrible food.  Terrible.  Very bad service.  Sloppy and unprofessional.  Good location an","useful":4,"cool":0},"zSf0dui68fOvtuTAyq_mGg":{"text":"Randomly stopped here for lunch after looking at art galleries. I'm from Cali so take this","useful":0,"cool":0},"oboec0DGw-GJuhGF56d_gw":{"text":"Found this gem of a location after leaving Lafitte's. Great service and wonderful food and","useful":0,"cool":0},"BkAuwevydP9FsOYaaK0DfQ":{"text":"Food was decent, service was ok. Out of all the places we had eaten in New Orleans this wa","useful":0,"cool":0},"LX0SSmSK5GBsx1lN6ta4_A":{"text":"David was a great sever!! Panned Chicken dinner exceeded expectations! The weather was per","useful":0,"cool":0},"xgHakaEamRhr4qUXHOqcZA":{"text":"The gator bites are PHENOMENAL. Unlike most of the gator served in New Orleans, it's not b","useful":0,"cool":0},"lGTIrnuNHpSA9r_1w-FOHQ":{"text":"I learned my lesson. Always read the Yelp reviews before walking in the door! Mediocre foo","useful":1,"cool":0},"KfLhLYKdqWwMueabVei8DQ":{"text":"To day this seafood was delicious is an understatement!! For starters, I am extremely pick","useful":0,"cool":0},"oYlFQfjYTnilLNNLfK1i5Q":{"text":"Came in just for a drink.   Ended up have a bunch more.  Great food and great drinks.  Ste","useful":0,"cool":0},"_drOZZiSwxg1bKzDRAx9XQ":{"text":"Good restaurant if your looking to try some good old fashion jambalaya. Cheap and service ","useful":0,"cool":0},"ZKvsVRTWgrH-SIguvXxGbw":{"text":"Trying something different while here in New Orleans (8/09/2018) ; won't come back here. T","useful":0,"cool":0},"0fQOocBXe0NrLejh5IaB5Q":{"text":"Had the Gumbalaya (Gumbo and Jambalaya combined) and it was delicious. It was so good I we","useful":0,"cool":0},"nfYBu6o3huPxeI6kfdpw9g":{"text":"Went here for a late dinner after doing some touristy stuff. I started with the chicken an","useful":0,"cool":0},"583yha7wV8qMkprEYMj7eg":{"text":"Great location and Kenneth is the best waiter ever!!  Be sure to add some DAT Sauce to you","useful":0,"cool":0},"KdcS3ULz5kdA4tJ1Q47L4A":{"text":"Yep.  Just walking around the Quarter trying to decide if I wanted to eat in a restaurant ","useful":0,"cool":0},"lwwJLG8KAu7ksLRsHhqhdg":{"text":"Hah, yeah that was bad. Our waitress was really nice, though. We ate our food and peaced o","useful":0,"cool":0},"eijjYB1niJMiu-jx6cokWQ":{"text":"My friend and I loved this place. Not a huge menu but I got the gamba lays (gumbo with jam","useful":0,"cool":0},"CwinJxwNW0DCb45b_OpzXw":{"text":"The restaurant had a great location and lots of promise when I first set out to eat there.","useful":1,"cool":0},"8eU1mZg7_A2XJeUEcRrgWw":{"text":"Blackened catfish with crawfish étouffée is outstanding- a must when I'm visiting New Orle","useful":0,"cool":0},"lll4QvXwjlMp_nVh9VtZcw":{"text":"My son has Celiac's disease.  Eating out is a challenge with a lot of eleven year olds, bu","useful":0,"cool":0},"MfxjhcSWbfvGLBr7gvkm6g":{"text":"My mom and I were looking for a traditional New Orleans lunch spot when we came across thi","useful":0,"cool":0},"i5EookF5SJvffBASsbhSCQ":{"text":"The food was okay. Honestly it was kind of bland. My parents like blander food but for my ","useful":0,"cool":0},"6obOwfXv9D4fp5TqXNB2xA":{"text":"Great restaurant! Our server Kenneth is awesome! The mixed seafood omelet was fantastic. T","useful":0,"cool":0},"QLSpj6FJGEjyyYH_lEcs-g":{"text":"While I wouldn't recommend the food here, I do have to say that the drinks we ordered were","useful":0,"cool":0},"3fo9KxHa1qGnLWZQT0dZEQ":{"text":"Two stars is being generous! I took my family of four here and to say that we were disappo","useful":0,"cool":0},"bFcvHvPh5BhE0ZwbgKPVGw":{"text":"Walked in to get out if the rain. We really liked it! The gumbo was really good as well as","useful":0,"cool":0},"QEo_iyqe9KMceK9jn-OMdw":{"text":"Finding an appropriate restaurant for six (including a 3-year-old and an infant) in the Fr","useful":2,"cool":1},"FOTFPuZ-EmebFAHui1EQdg":{"text":"I ordered the breakfast sandwich with ham. It was delicious. The food arrived in a timely ","useful":0,"cool":0},"DtZ_mEtFbUL1N9ImutBfrA":{"text":"I would not recommend this place. The food was good and decently priced, but the service w","useful":1,"cool":0},"T8HfYh--xI5XucpQE4Us-A":{"text":"After spending a few hours on Royal Street during Dirty Linen night, I received a text fro","useful":0,"cool":0},"PMlEaS3qDZ7NXQbawrbOBQ":{"text":"Food was excellent, especially for the price. (Half/half combo, chicken gumbo) host and wa","useful":0,"cool":0},"M5fPIgDKX9Mokcn8UEHJoA":{"text":"I had the misfortune of going here twice, neither of those times impressive. For breakfast","useful":0,"cool":0},"3boM1RACrKwA2RzFEwIseQ":{"text":"My husband and I joined a table of his coworkers late. When the waitress came by, my husba","useful":0,"cool":0},"BAwmy7DH53_zdb0lA5r7mw":{"text":"Terence was our waiter- truly a seasoned waiter!! Food was excellent. Try the New Orleans ","useful":0,"cool":0},"9Nxl9wNJRlgXeWQnmwdgIQ":{"text":"As someone with Celiac disease who can't have gluten, I was relieved that they marked all ","useful":0,"cool":0},"Cqe6ihftXi0MRryhe_J14Q":{"text":"Very nice waiter but quality of food is very poor.....which explains why it was possible t","useful":0,"cool":0},"ePBwDH8H8miRgev8tO6D-w":{"text":"Nice location with big open windows. But my Caesar salad was drown in dressing so much I c","useful":0,"cool":0},"DGDqImP7YK6K7npEgXVxbw":{"text":"I am giving this place  two stars because we got the nice window seat and our nice waitres","useful":0,"cool":0},"0dq856F-tBX2RPRa0Ky5qQ":{"text":"We were just looking for a quick bite to eat while in tench quarter so we stumble upon her","useful":1,"cool":0},"OgT0H-7Hjz7F9IiO-23wjQ":{"text":"The Food had good flavor but was cold and the beer was hot. The manger refunded all our dr","useful":0,"cool":0},"ZS6U7EfwEcmgaZGooGQXeg":{"text":"Ate here for brunch and the food was pretty good! I had the surf n turf po boy which was w","useful":1,"cool":1},"n-QYGUm35Tjo7AwzL6nnBw":{"text":"It was alright. Waitress was awesome, kinda expensive for relatively small portions.","useful":0,"cool":0},"5k4lrwVKwffZY723GBcvyA":{"text":"Got the etoufe and creole combination. Seemed Overpriced for the amount of protein actuall","useful":0,"cool":0},"bMmQNERp9yc6Dv9owNw2DA":{"text":"Kenny the \"Crazy Cajun\" was an amazing bartender, he recommend a bunch of places to go che","useful":0,"cool":0},"nsnhU19Myb4BV7Y1s9Ki9g":{"text":"Best Bloody Mary in NOLA.  Great place for breakfast as well. A little pricey but a good b","useful":0,"cool":0},"0QSS3kggh0WjHPmJlamM1Q":{"text":"Great Cajun restaurant. Right in the quarter, but off of bourbon street - a good thing. Th","useful":0,"cool":0},"1w2IsXaOQ-7gb0nuJZ9wag":{"text":"This was probably the worst restaurant I've ever been to in my life.  The scrambled eggs t","useful":0,"cool":0},"3pp95zjjXQ526pxCf0qPew":{"text":"Conveniently located when we stayed in the French Quarter. Loved the decor, place was full","useful":0,"cool":0},"2iwpvgZ9oIO0kfg9YTdgDw":{"text":"They get one star for atmosphere as the restaurant has an open air dining room and fans cr","useful":1,"cool":0},"r3jKncI4CLGvzdsvcGhQxw":{"text":"This was the first stop we made as we came into town. It was mid-afternoon and we got a se","useful":1,"cool":0},"0B5YkaUD6mof_lt4WWWhiw":{"text":"Went there for dinner last night for a 'must get food can't drink any more on empty stomac","useful":0,"cool":0},"PSloRzgYeUkqcc3FOtsgOg":{"text":"Oh, Pere Antoine...\n\nPere Antoine was the first restaurant that I ever visited in New Orle","useful":1,"cool":1},"MGMuppL8uw0XFd2Y4NB_4Q":{"text":"I want to start this review by stating that I hardly ever will send back food at a restaur","useful":0,"cool":0},"DWxjp8W2nRM8n9VOZxLUbQ":{"text":"Can I give this shithole negative stars?  We've been here for over 30 mins with a party of","useful":0,"cool":0},"xrnLk204Mt3coOHsC2_KCQ":{"text":"Our waiter was better than excellent to describe the mouthwatering dishes; Crawfish étouff","useful":0,"cool":0},"nVqaXwjqDmvSyU-0LHZ70g":{"text":"This is a tourist trap. The food is really, really bad. Do not eat here.","useful":2,"cool":0},"zVo3mur6EtpvS2DHAJniVA":{"text":"After being dropped off by an Uber onto Royal St, I walked awhile until I found a place th","useful":1,"cool":0},"vu6MNX05zBy76AxI_w1sjA":{"text":"We didn't actually eat here or even purchase drinks. The location is a prime spot on a cor","useful":2,"cool":0},"AHLEXfwga6OvMTp5hFr5nQ":{"text":"Not good. We ducked in here before a parade for some food & drinks. The frozen lemonade wa","useful":0,"cool":0},"hKOMQgp1WARAMIzH4EQ_DQ":{"text":"Ordered the New Orleans sampler, the only thing that was good was the gumbo & 2 fried shri","useful":0,"cool":0},"EZ4RnbrG-FNVRjMP-G63Wg":{"text":"Kenneth. Kenneth. Kenneth. If you don't go for the amazing food, fabulous food, delightful","useful":0,"cool":0},"bKHY0uRbLTMlF7Y7OFsipw":{"text":"My wife Sue and I recently visited N.O. and happened upon this place. The drinks were wond","useful":0,"cool":0},"B_875utFP4OXa7pP3JJ5PQ":{"text":"This was the WORST restaurant I've ever been to in NOLA. There were 7 of us and we walked ","useful":7,"cool":3},"m0jmfLlzAL-b8UFGFy-QPQ":{"text":"Total total mess.  Messed up order and then tried to charge more.   First my mushrooms end","useful":0,"cool":0},"BKprFD8VOmmmj9S5AjvhAw":{"text":"Kenneth was a fabulous server! We had a lovely meal overlooking St Ana. It was a great vib","useful":0,"cool":0},"WCyUELyVwX0k0FNMD7h7HQ":{"text":"I love this place. It's my second time. Every time I've had great service and good food. T","useful":0,"cool":0},"Eyk1i5t8FcmXCakT0uiMWw":{"text":"If you're looking for a moderately priced quick bite to eat, this is the place. Nothing sp","useful":1,"cool":0},"_oD-TYJMcb6DhZBDoz8zvw":{"text":"We needed a place for lunch that could seat 8 in the Quarter, and this place hit the spot!","useful":0,"cool":0},"-HZSDO7euCmODKLZhfQ5Sg":{"text":"Lousy meal. I ordered the St. Nona's redfish with lump crab and eggplant. The waiter recom","useful":0,"cool":0},"Z7PRV-PMHCXvdo93f6BEsA":{"text":"Actually they deserve a big fat ZERO for their poor customer service and full on pretentio","useful":0,"cool":0},"l5wzMOliEYmArtG7k-q-_w":{"text":"Not being from this area, we didn't know what to expect. Getting seated right away and the","useful":0,"cool":0},"iB-Afh4wvSto3eFiw1QI_w":{"text":"I'd love to try something nicer to say, because it was a busy New Years eve night. However","useful":0,"cool":0},"e7lLHq3b4TseWY9tpIc2KA":{"text":"We came in town for a bachelorette and ended up back at this place 3 times during our stay","useful":0,"cool":0},"cNgaF3DsFnXh99voHUftHw":{"text":"This place doesn't have the best reviews but we walked by and gave it a shot. I had a seaf","useful":1,"cool":1},"EE5fjjOktM3jOdaapleEWg":{"text":"We went here on a whim. We were super hungry and the menu looked ok. \n\nHow is it possible ","useful":0,"cool":0},"P5aiFlTqmosNMRO9l7tTGg":{"text":"Kenny the crazy cajun was the best bartender in New Orleans. Drinks were phenomenal and st","useful":0,"cool":0},"Zwodw2rmBfq0ywpAjS_SKQ":{"text":"Got seated fast next to the Santa Clause dummy  table.   Server just passed us by 3 times ","useful":1,"cool":0},"-_Pe14kejfueGliOC6exJw":{"text":"The service at this restaurant was terrible. After being seated, they ignored us for about","useful":0,"cool":0},"vrxZSefFdmk5t3zLOCj93A":{"text":"Decided to have lunch here. What a disappointment. The highlight was the bacon wrapped shr","useful":0,"cool":0},"iCLds54qvjJUQpgRgdw8_g":{"text":"Good, delicious food, but service was extremely slow and had to ask a bust boy to order ou","useful":2,"cool":0},"cVuGBjviPMizKNX-DBjjpw":{"text":"The staff were friendly. The restaurant was clean. However, after receiving our menu if to","useful":0,"cool":0},"SjVHVuIbDhbf9fEN5vx10g":{"text":"One of my favorite places. I usually take a table in the bar area as I find it quieter and","useful":0,"cool":0},"dGSIKX_ef0UsVkBc9nLwRg":{"text":"The bloody Mary's are fantastic. The location is choice especially when getting a window s","useful":0,"cool":0},"M9nBQ8Lv3VWcRbgCmcHrCQ":{"text":"I'd probably settle on 2 1/2 stars here. \n\nSo much butter. \n\nEating even moderately health","useful":1,"cool":0},"H45uYqbKEibAS1XbGrrlLQ":{"text":"Oh my gosh. We happened to be walking by, looking for a dinner spot, and noticed this plac","useful":0,"cool":0},"n9kjON8DVzDk0xC2boX6Lw":{"text":"Best crawfish cakes and etouffee in the city. Small but clean and inviting. Definite stop ","useful":0,"cool":0},"yK5-_aunfPb5knpXhFWLQA":{"text":"Great service.  Incredible roast beef.  I would love to see a great salad on the menu.  To","useful":0,"cool":0},"6nTJJcL5-S3Woj2v1LnoAg":{"text":"Our food was luke warm, service was poor. When we asked for food to be heated, it took 20 ","useful":0,"cool":0},"XNV6yPrWz11rJcjkzOpnDA":{"text":"Terrible food for a premium.\n\nI will kick myself for days for entering this place and spen","useful":5,"cool":0},"TTc8XwoKDcru_6tYD02miA":{"text":"What a disappointment!  This was the first restaurant we tried when wandering the French Q","useful":0,"cool":0},"CBFFKlip_VieW8zeV1iTIQ":{"text":"Abysmal service overshadowed any semblance of a meal we had here.  Definitely have overloo","useful":0,"cool":0},"WMEZPa1BzaGiF_LgyKvDsw":{"text":"I have no idea why this place has so few stars! We loved the drinks, the ambiance and espe","useful":2,"cool":2},"4y1omUGOdBfRbk5D2gLN2Q":{"text":"Went into this bar and restaurant and omg the food was awesome.  Bartender Jessica has a p","useful":0,"cool":0},"BRjbE1O-yZoucHh_XcX20A":{"text":"We went here for a quick breakfast, it's just around the corner from the Bourbon Orleans h","useful":0,"cool":0},"bUK1OzxbAf190Os9v3I2aw":{"text":"Although the location is alluring, the drinks were overpriced and the food was underwhelmi","useful":0,"cool":0},"AREjKea7aZHyua57gXw-xA":{"text":"We stumbled upon this gem while looking for a place for dinner. Our server was attentive a","useful":0,"cool":0},"JzFdQpY6ND72W7H9hx12yw":{"text":"I didn't try the food, but stopped in for drinks and glad we did. The bartender Stephanie ","useful":0,"cool":0},"e0DLJKtWlwQmql9l9k2vgg":{"text":"I was quite impressed with this place despite some of the other reviews. We were recommend","useful":1,"cool":1},"cUSUqFvVtMukQBHxLBJ7iw":{"text":"1 star because almost everything about this place was unsatisfactory. This place has a ver","useful":0,"cool":0},"63yDreV3JLfSFgu5ojsPEQ":{"text":"I love this place from Mary our waitress to Stephanie at the bar to our singing waiter Ken","useful":0,"cool":0},"Xxe7fDqNWzBKL5ILSLfR8A":{"text":"Stay away from this place! Two of us went for a dinner and were seated immediately. The sp","useful":0,"cool":1},"V3n70Y08TXTpkIkJehxKyQ":{"text":"Great food, the Bloody Marys are homemade delish. My server was Haley. She was knowledgeab","useful":0,"cool":0},"IQwP0YHXCXNnGgr28S_dLA":{"text":"We stopped here due to the rain and it was not our to do list. Order the ribs and the stuf","useful":0,"cool":0},"3qc9WBZ7T_2w5jRV6KRsFg":{"text":"I have had better coffee, food and service from a gas station. The restaurant  was deserte","useful":0,"cool":0},"0AKdqmKv2MoMu-v6zcdrfQ":{"text":"Big thanks to Haley for taking such good care of us. Food was delicious... particularly th","useful":0,"cool":0},"B9po2Gc81j0ZPrGpFnQpCQ":{"text":"Stumbled upon this place and it's the best meal we've had so far. We're not looking for st","useful":0,"cool":0},"jSaMi97y3OX1sYCDofbJaw":{"text":"Overall, not a bad spot to escape the clamour and the heat of the french quarter. The beig","useful":0,"cool":0},"cLYvmMFlVTkUEMdcGOhmhg":{"text":"Wow this was a horrible experience.\n\nWe tried to go to Stanley's for brunch but it was a 3","useful":1,"cool":0},"HDCaTe6ClWq10eI8bl21Vw":{"text":"I have been here 2 times over the past view.visits. This has to be one of the top 5 worst ","useful":4,"cool":0},"lMKl4smB98GGqxrR5aXoBg":{"text":"Had a great dinner here tonight. The fried green tomato and shrimp app was delicious and n","useful":0,"cool":0},"6glAwLQMkvHabC3cqVPmXA":{"text":"Been to NOLA twice and came here both times! It will always have a special place in my hea","useful":0,"cool":0},"UzMbN-_Ti2juz4vItmm7xQ":{"text":"Food was good but the service was horrible. Our waitress did not refill our water and took","useful":0,"cool":0},"DbLBX3oPnuIVUWRUcDPKgA":{"text":"Dirty! Dirty! We were two and one order  came on dirty plate and the other a chipped plate","useful":1,"cool":0},"b2ufB5VVTp8lJxYE6k7VMQ":{"text":"Literally the worst restaurant I have been to. Took over and hour and a half to get the fo","useful":0,"cool":0},"MTpPO6wfJN2DCefuL73KBQ":{"text":"I live in New Orieans. This place is really awful again. I thought I'll give it a second c","useful":0,"cool":0},"OUEBTEi6cHXWHl1YT05Xug":{"text":"Three of us stopped for dinner on Saturday Oct, 22 for dinner. Sat at a table at the bar. ","useful":0,"cool":0},"wvkM48k0U2hBrHPR9JnohA":{"text":"Where do I start.... they said the food will take about 35 minutes, it took over an hour. ","useful":5,"cool":0},"o9nxQtuigYUIxj4PAI0yRw":{"text":"I am visiting Nola and this is the first negative review that I am writing down in here. W","useful":0,"cool":0},"UF8rXXmwNqnyxnp1Q05azQ":{"text":"I had an enjoyable time with the waitress I had while I was here. Lena was her name if I r","useful":0,"cool":0},"TOrOznqswUagyWteWOrocQ":{"text":"Tonight we had dinner here and it was delicious. Our waitress was a little slow at first b","useful":0,"cool":0},"lCxS7DfSVbGFv03kouPpgg":{"text":"I was not completely impressed with this restaurant. The food was just okay and the servic","useful":0,"cool":1},"DwlmjTK5koSn_DAbFl20WA":{"text":"Worst service EVER! Hayley was a trash waitress. Rarely checked on us, had a terrible atti","useful":0,"cool":0},"2dkVOf7nxLKr0CUxSYFvyg":{"text":"Whatever you do don't eat here!\n\nWe were starving, and based on the recommendation of some","useful":1,"cool":0},"SYivjS8rMfhDRl4jvB5w3w":{"text":"Every thing was reasonably good  not great.  I had the blackened fish.  It was very good, ","useful":0,"cool":0},"3_lBTVtbR5ihzKUkPWuF8Q":{"text":"We used to like this place but the food is so meh now.  Scrambled eggs only.  When I asked","useful":2,"cool":1},"5GD4YhAmqTqzo9ZOwSNuJA":{"text":"waited an hour for our food. finally they brought out our cups of gumbo which were very wa","useful":0,"cool":0},"wm8j5mzlkDJLb0GBfcChcg":{"text":"Had a great meal started with phenomenal Bloody Mary's, Fried Green Tomatoes and Angels on","useful":0,"cool":0},"us8Xgclfgdq-pUSsVSDqQQ":{"text":"We had breakfast here and it was very good. Great spot to sit and look outside and people ","useful":0,"cool":0},"Y2Rnnin-Vdy419oWLkbyqQ":{"text":"I know why this place has so few stars... Because the food and service are mediocre. I wis","useful":1,"cool":0},"VeUU4cmgCHgFu1sLeqIfSA":{"text":"Great service! Got the Mardi Gras Pasta and it was delicious! Bloody Mary's are good and s","useful":0,"cool":0},"xledapzZ37pZVxnWsOZOoQ":{"text":"Delightful French Quarter spot serving wonderful creole dishes. Regulars hang at the bar w","useful":0,"cool":0},"28ghHu7JVR_aV52oOI13HA":{"text":"The setting was nice, with windows wide open to the street, and the service was good, but ","useful":0,"cool":0},"Ml4ZpeoChsazRQk6NKrGxg":{"text":"Ok this is my second time back and I'll keep coming the service wasn't as on point like th","useful":0,"cool":0},"K-XD71NRIYOrZyG28O6p8Q":{"text":"French toast or croissant with egg were amazing.  Good coffee also.  Nice view and quiet n","useful":0,"cool":0},"ItU4OpXuz_eSJFw6z6u6ww":{"text":"Dropped in for a quick dinner at the bar on a Thursday night. Bar tender was super helpful","useful":0,"cool":0},"qdslacaesz6yyrwPY9HY2A":{"text":"The atmosphere is very nice. There is a cool breeze with all the ceiling fans. The tables ","useful":0,"cool":0},"xyxOtp5Odp9zBc9z6aTMqQ":{"text":"For a great Louisiana cuisine experience, this is a good place! We enjoyed the traditional","useful":0,"cool":0},"u0xTFnn6F-YptakIv4GUZQ":{"text":"The food and the service here was really great. For starters we had the trio and i loved t","useful":0,"cool":1},"1Lmq7qEea525vm1HsiBPbQ":{"text":"This is a long time favorite every time I come to New Orleans. This visit was probably my ","useful":0,"cool":0},"kXJBEQJV3ej_jc7LcuQ9Gg":{"text":"Visited the bar twice while in town for Mardi Gras. Great drinks and great service. Stepha","useful":0,"cool":0},"pfjOcGs7KFe2ezPMcFfk-Q":{"text":"Slightly overpriced put in a fantastic location. The devils on horseback appetizer has a n","useful":0,"cool":0},"3orlRXAVzjHMTBLVTVbIgA":{"text":"It was just ok but considering the other talent all around it? I should have gone some pla","useful":1,"cool":0},"22jYon1vqHV-bBTlQwi2Og":{"text":"Terrible and unprofessional service. Food was even worse. The server who took our order di","useful":0,"cool":0},"r_N2nZOH8PLqOdvbPlJWRg":{"text":"This was my worst food in Nola during the French Quarter festival. \n1) Waiting for about 1","useful":2,"cool":0},"SLqblmht0oCi0Xn_Bkzsrw":{"text":"Was walking around the area and noticed they had a bar. My partner and I decided to take a","useful":0,"cool":0},"IW606BBLJPsXXhOOwErvaA":{"text":"Just like others said the food and service need some HELP!!! \n\nWe wasted our money eating ","useful":1,"cool":0},"GSap_nqxu_rfMViL2e5ezw":{"text":"this place was amazing!!! i came here with my mum and we had been originally planning on g","useful":0,"cool":0},"5T7RDIXAFmZewblUqoiABQ":{"text":"Skip the roast beef sandwich and fries, both are tasteless. The gumbalaya (jumbalya in a b","useful":0,"cool":0},"M0eP3TLyoqDFxat4RV5A1w":{"text":"We sat out on the patio, waited watched a rat the size of a squirrel run past our table an","useful":0,"cool":0},"RLknh_a13stE1PLg1YYKMA":{"text":"If your from South Louisiana, the food is different from what you would expect. It's decen","useful":0,"cool":0},"SNCA6wF_OEj0ganRlTbHTw":{"text":"Late dinner on our first night in NOLA. New Orleans Sampler was great and my wife loved th","useful":0,"cool":0},"2Od0s7XxJaFOJzCZcck0Lg":{"text":"Try the trio platter or the BBQ shrimp! My favorite place, its such a cute place that does","useful":0,"cool":1},"FbwTPTsG307A9MRUh9JCaQ":{"text":"We were seated rather quickly. Fast friendly service here.   They have a good atmosphere t","useful":2,"cool":2},"RJKgSaAOTKfXQoEAqVSgng":{"text":"I had a dinner at Atchafalaya and I loved the place. Sort of upscale but not too much. Gre","useful":0,"cool":0},"fRdJzFXcg0hJqrFEci7rFg":{"text":"I am native New Orleans.  I was working on film production crew late and got hungry.   I k","useful":0,"cool":0},"dal6DDmGghjp2pgllf_cFA":{"text":"The worst etouffee I've ever had in Louisiana.  Bland flavor.  Reb beans had good flavor b","useful":0,"cool":0},"bDrK-DT-JGzWczO84Lsl0Q":{"text":"Drinks were over priced and under poured. The AC dripped on our food which probably made i","useful":0,"cool":0},"lmL3jRQLQ0YlUc-10pdTeg":{"text":"My husband and I came here after a horrible interaction with the hostesses at Royal House.","useful":1,"cool":1},"3_QO9cVTY56sdVJUv7oJag":{"text":"On Fat Tuesday there isn't a whole lot that remains open, so finding a place to nom aside ","useful":2,"cool":1},"vbjtaVQlUQ_IkFuPyQ5RUQ":{"text":"We stopped in for lunch while strolling through the city. I ordered the jambalaya and my h","useful":0,"cool":0},"89G59Pl-cbpaDrLvljaKSw":{"text":"We had lunch here on a previous trip to NOLA that was OK but not great. Since it was right","useful":0,"cool":0},"Wu0lMbAIg-sqHf5A624Mww":{"text":"It's been 30 minutes since we ordered. Haven't seen the waiter since we did.\n\n....38 minut","useful":0,"cool":0},"yf2CSjivnltCjoUpFzYbmg":{"text":"Average average average. Unfortunately this was my first meal in NOLA - luckily everything","useful":0,"cool":0},"otcEgzigmdtOVLrDfzTiMA":{"text":"Don't even waste your time. Took over an hour and a half to get any food after ordering. F","useful":1,"cool":0},"pn04neU-w3WcNe2KCMBOWg":{"text":"We ordered the Decatur gator, Mushroom Tchoupitoulas and the Crawfish Etoufee. We topped i","useful":0,"cool":0},"BHL3gU1HGQqE8CfYKZSBqA":{"text":"The service here SUCKED!!!! We are a family of five so we always get refillable drinks it ","useful":0,"cool":0},"DjbP62nHYbjfAm5xtjLTmA":{"text":"Waited 25 minutes to be sat which was alright as we sat at the bar. But when we were sat, ","useful":2,"cool":0},"dkXtrZ8JuBx2vjuWuHCVfw":{"text":"The food was pretty good, but took way too long to arrive when the restaurant was nearly e","useful":0,"cool":0},"TuIy-d77Qk0hXJSUFwVGLw":{"text":"So I want to start off by saying that the service was great because this review will be pr","useful":0,"cool":0},"E0jifqIEgBupY8WKXThxsA":{"text":"Yep , absolutely, yes and uh-ha, this is one to check out , it's a quaint little restauran","useful":0,"cool":0},"anI1YobE2Z_Mvj3sBWck7Q":{"text":"The food is of a non-mentionable honor. For the price the food is tolerable but wouldn't c","useful":0,"cool":0},"Tw4Lr7PcwCrqntz4-ddisg":{"text":"Great little place. Large open doors but lots of fans to keep the environment very cool. W","useful":0,"cool":0},"xxtPbMOWMjTh25y8Je0ZFA":{"text":"Wondered in to this place randomly, had the NOLA style crawfish pizza app to start, was fa","useful":0,"cool":0},"pDnLbEeP4HlXcYQWZQqQjg":{"text":"We have been to Pere Antoine on two different occasions. Both times we walked right in and","useful":0,"cool":0},"hX7i7gqahRnxlEK3hRrI-A":{"text":"I don't get the hate on this place on Yelp.  I liked it.  I'm not saying they are going to","useful":4,"cool":1},"xpmCZvo5n8-Kl5127LN3rQ":{"text":"Great food and service! Recommend the Red Beans and Rice with smoked sausages! Yum! Thanks","useful":0,"cool":0},"StnOQ1gn08T6UL-PUMEi0g":{"text":"We were seated and that's as far as our attempt to eat here went.  After sitting for 15 mi","useful":0,"cool":0},"rAr0o-KBwKeXez6XRD3JpQ":{"text":"I went here for a late lunch today and ended up not eating.  I was seated with a friend an","useful":1,"cool":0},"UnW03_5ywNaVoXW-ijU7fQ":{"text":"Husband was hungry so we stopped in without reading reviews. My first mistake. Sat at the ","useful":0,"cool":0},"1vxIKTnGY2kaj89CDeYV8w":{"text":"To bad this was our first impression of New Orleans. Server was very clueless. We all orde","useful":1,"cool":0},"625yM8Gwv-qpqBurzBlxyA":{"text":"Upon arriving, we asked our server if we could change our appetizer order. She very rudely","useful":1,"cool":1},"vUnjY4pLSbxsAKcH0-NarA":{"text":"It's good, it's just not great. The server was a pleasure and seemed to take pride in her ","useful":0,"cool":0},"TBUawqAxTy1TmYhl65DznA":{"text":"I was psyched when I saw that this place served breakfast all day.  Their omelet selection","useful":0,"cool":0},"8QCS8s6mpXsBqugYkd87Qw":{"text":"Great restaurant in the French Quarter. Atmosphere is great. Food is great. My wife ordere","useful":1,"cool":0},"YYUAts6zwzdj0V_XejqlfQ":{"text":"The food was cold, the batter was bland at best, and overall the food was not worth it. On","useful":0,"cool":0},"q86Ax6fgMLr1U8cB4yvaUw":{"text":"Went to have a late lunch, were sat at a lovely table perfect for people watching.  And th","useful":0,"cool":0},"0tihFzNnbyDA4EeGOILMbA":{"text":"I went here because it is close to the Bourbon Orleans Hotel I was staying at. The atmosph","useful":0,"cool":0},"yGEyiJ4-t7T4_KITIQuP5A":{"text":"Pere Antoine is the worst restaurant I have ever been to. To start off when we got our wat","useful":3,"cool":1},"M7d3hu2_cO1A7aNoqvVo8Q":{"text":"We were looking for some good fish and jambalaya and gumbo...we were not disappointed! The","useful":1,"cool":0},"xNhWGoFIghgnJUcoGbpiag":{"text":"Stumbled here the other day looking for some typical New Orleans food. Ordered the gumbo d","useful":1,"cool":0},"PupJtA5-MxwWlSyDgCTjFA":{"text":"The building is beautiful. We enjoyed the atmosphere. Our food however took FOR.EVER! The ","useful":0,"cool":0},"XnWSfeN4oeDgh6PU1hy16A":{"text":"I can't speak about the restaurant, but the bar was fun and lively, and barkeep, Phyllis, ","useful":0,"cool":0},"3j4JzjwBt4puCR_1FuMMcQ":{"text":"This must be a late night place for drunk people who won't remember their food. The server","useful":0,"cool":0},"docyta2ICrsORERJFsAmUg":{"text":"Went here on a recommendation. Terrible slow service. Did not get bread at our table, did ","useful":0,"cool":0},"x_UeVN_b8MHy1tzdmCLxaw":{"text":"Came here by myself to eat. I had heard some great things about them so I wanted to give i","useful":0,"cool":0},"6QZzxaZVkufCqjCNrmlrzg":{"text":"Not my favorite meal of New Orleans, but certainly not \"bad.\"\n\nI'd say service was a littl","useful":2,"cool":0},"KVV1eQH2t54PmUqgHzmY4g":{"text":"We loved the open dining area, appetizer sampler, and St. Peter cocktail!  Our waiter was ","useful":1,"cool":0},"A-ZJQowxlx1WJKP45Crscg":{"text":"Pere Anotine was a great surprise. We stopped by just to take  a beer at lunchtime. We the","useful":0,"cool":0},"Bkb76WX9Xs0KzDmuldVqWw":{"text":"The service here was decent, even though it was busy. We got one of each of the three samp","useful":0,"cool":0},"T5_FWoxMdyATmNt0y3WMFQ":{"text":"Good service, but the food wasn't very good. My pasta  (the veggie Alfredo) tasted like Li","useful":0,"cool":0},"H6jBfzON_HZkQxAfjD1YTg":{"text":"Came here for breakfast. Everything tasted dry and old. How you can make your scrambled eg","useful":0,"cool":0},"sti8FZzgF4iTKtIzKeaB0A":{"text":"Great place to try NOLA faves in the French Quarter m! We ordered the New Orleans sampler ","useful":0,"cool":0},"SNmZ9BBcC-Vqbq_uH-UajQ":{"text":"Food is just average - I had a shrimp PO boy and it was okay but the shrimp were tiny and ","useful":1,"cool":0},"9BzSkQ65OCVjsyTkvrbGAA":{"text":"Stopped in with friends on a Saturday night while looking for a restaurant that wasn't pac","useful":2,"cool":1},"Dyl22gpBPyE0-5087szYEQ":{"text":"We chose to eat at Pere Antoine's because of the atmosphere; the place is beautiful! The f","useful":0,"cool":0},"zfSVdx9Ky3bbFW-nln2zXw":{"text":"This place sucks. I ordered crawfish etouffee and when it came out it did not look appetiz","useful":1,"cool":0},"ZgBhD9ZyVA-lm-MwJro6Pw":{"text":"Didn't know you could find bad food in new orleans - until we went here. Bland is the nice","useful":0,"cool":0},"aUoYfeC5B9C8wOP7NLICWg":{"text":"Wholly disappointing. Our server was nice enough, but food was not good. My jambalaya side","useful":0,"cool":0},"DnUQdJDlJSjumu93p73tNw":{"text":"Kinda like a diner that serves NOLA staples....especially great after hours. You MUST try ","useful":0,"cool":0},"9yCYu_Jzb80LsSz7g1TWfg":{"text":"Food:. Large portions but somewhat bland taste.  Feels like reheated gumbo or jambalaya.  ","useful":1,"cool":0},"GSOxAHjp-wMMYME3vN9J1Q":{"text":"My 2nd trip to NOLA and the first time I was so disappointed in food and service.  First w","useful":0,"cool":0},"OFdQSmDYak1cVSfU8Y3HVA":{"text":"Why does this place have low ratings? I thought it was great! Good food (gumbo and jambala","useful":2,"cool":1},"qUTRh6m0u2a7yY8fBkmiuw":{"text":"In a city renowned for its culinary scene, I can't imagine how bad you'd have to be to sli","useful":0,"cool":0},"eBsp8JoWEAHZZye5kKmKFg":{"text":"I've NEVER left a one-star review before, but this place earned it. Literally sat at table","useful":0,"cool":0},"Ox_jZx5MkIQ0lRdJqLtAmw":{"text":"This was our first taste of New Orleans and it was amazing! We got the sampler that gave u","useful":0,"cool":0},"LvMrhZjxrdZWGmLvjxrNjw":{"text":"Probably the worst shrimp po boy you'll ever have in your life.\n\nA bunch of us needed food","useful":1,"cool":0},"Qwz5cw736ljzlutfam0tIw":{"text":"This place was slightly horrifying. We were starving and the menu didn't look bad, so we r","useful":0,"cool":0},"5m1S6Ntb-HBRKW7wUR6ofA":{"text":"Wasn't our first choice but it was a good.  Started with a Mimosa ani had something a bit ","useful":1,"cool":0},"pJ2Pi7-_mrfhzeHK5uW_Xg":{"text":"This restaurant has such potential, the location\nIs amazing, the interior is cool and seri","useful":0,"cool":0},"0PRhKDc1wdQv7J6Go6l6GA":{"text":"Not impressed, fries are limp coleslaw is awful the seafood platter was mostly fries and n","useful":0,"cool":0},"eq6AlzE2zqE9DdezLlaEZA":{"text":"Adam and I stumbled across Pere Antoine restaurant. They were super understaffed but did a","useful":0,"cool":0},"R89dhWJR2TVc1-wUvDmKxQ":{"text":"Not great. We should have checked Yelp before picking this place. The wait staff was very ","useful":0,"cool":0},"_yeqnQdkI6YCYMFsSLXbPg":{"text":"The only reason we went here is that I had a neighbor who worked here (notice the past ten","useful":5,"cool":2},"hH68TJgaGEaB-tBWAQs5ZA":{"text":"It's been 4 days since I had the surf n turf po boy - and I've been miserable since!\nThis ","useful":1,"cool":0},"x-E79lFoEslExvWMZ3DbIQ":{"text":"Bartender was very nice and friendly and food was mediocre, but the music...terrible eleva","useful":0,"cool":0},"yqL4JhLW2gqX9fnC6ZykIg":{"text":"How does a New Orleans restaurant make such bad jumbalaya? ???   We'll here at Pere Antoin","useful":0,"cool":0},"nTNSss9vtThwDZX1nzkzhg":{"text":"I don't often write one star reviews but the service in our experience was non-existent. T","useful":3,"cool":0},"7o1wMeHfeLpQvySD96K5og":{"text":"We stumbled upon this place while walking through the French Quarter. We were seated immed","useful":0,"cool":0},"HBYSv98U-P3fgTZUu-LPuQ":{"text":"Okay I hate to admit it but I had waitress envy.  My waiter was fairly new I guess but Ute","useful":2,"cool":0},"p5U_pv1rPG-nSTL_w7WJbg":{"text":"NOLA opening back up and stopped for a drink and a bite. So glad we did. Friendly staff, B","useful":0,"cool":0},"UxE6zLADxr11Lo1GVwzKcA":{"text":"Pere Antoine's location is perfect for the trapping of Tourists. No permit needed. It's th","useful":4,"cool":1},"iZaaty4r32i0MPppIOSqdA":{"text":"Food was terrible.  Soggy French toast.  Greasy omelette.   Friendly staff was the reason ","useful":0,"cool":0},"H-L44loOJSe9iUJK8pK6ug":{"text":"What an amazing experience! The staff are fun and friendly and not afraid to entertain you","useful":0,"cool":0},"QlB8tZE9eBWyimSDyEkdrQ":{"text":"My Friends and I were looking for somewhere to eat New Orleans specialities, so we both to","useful":0,"cool":0},"EkNhdNPXscGTW5PxbD6RcA":{"text":"Our night had taken a change in plans when all live jazz venues were filled to the brim. W","useful":0,"cool":0},"cQxEF5aNlf6A3tF3D2V2qQ":{"text":"I visit New Orleans quite frequently and eat at all types of restaurants all over the city","useful":0,"cool":0},"D1cj2sModuxQA9c9MmjCkQ":{"text":"Great food. We had the creole jambalaya and the half & half (shrimp/crawfish creole).","useful":0,"cool":0},"runR0Om_ABBN3fS-SeBMCA":{"text":"I don't usually write Yelp reviews but I couldn't believe this place had so few stars. We ","useful":0,"cool":0},"low7DcA5EUoH0QaRqMu5Dw":{"text":"We were looking for a place to eat that we could sit at right away since it was a busy Sat","useful":0,"cool":0},"a1W2s7Xldgg7rqYzzu-hzQ":{"text":"Stopped in for dinner because it was close to my hotel. Should have checked the reviews he","useful":0,"cool":0},"7qXa5bkz9RnEliZH7o8Mkg":{"text":"The food was very delicious and service was great. The atmosphere was nice and not loud. I","useful":0,"cool":0},"oEkkP04CKEzgqQoT3axRkQ":{"text":"NOLA DON'T GOLA\nFor any reason because there is never ANY reason to come her for ANYTHING!","useful":0,"cool":0},"AK8wBAtbmyFLvBLxXz8T5Q":{"text":"One star for the open dining area that I did not get to enjoy.\n\nWe had made the reservatio","useful":2,"cool":0},"t7hTc0wLCGDUeE7yT3azSw":{"text":"Stopped in here for a quick lunch because it was time to eat and it was right in front of ","useful":9,"cool":6},"yfxATqSt4dIBdqXc1dOKwA":{"text":"Bloody Mary was amazing and Emily our bartender was super sweet and attentive.  Made our b","useful":0,"cool":0},"3fmCdPThZkaBP66IFI4lcQ":{"text":"Pere Antoine has a wonderful view for parades or people watching. The shrimp étouffée was ","useful":0,"cool":0},"gcMDRepNfWxrpOmbt7q_Xg":{"text":"I don't recommend this place. The service was slow despite it being a Tuesday and the plac","useful":1,"cool":0},"3yAYzNXs2cmtA2rSAQXdFw":{"text":"After finding out the restaurant we were looking for on Royal street was closed, we decide","useful":0,"cool":0},"n2wqf6VU97zup9wenCGqxw":{"text":"You guys.... Kenneth is the best waiter I have ever had. He was so funny and very attentiv","useful":0,"cool":0},"yOjGZychXkK_U6PV8ZpZ7g":{"text":"We stumbled upon PA while wandering around the French Quarter. They accommodated our group","useful":0,"cool":0},"lUGNDngshNNGJIKyVLWj-A":{"text":"This review is a little late, but I visited this Pere Antoine in August. I found this rest","useful":2,"cool":1},"YluvIebat-MIYhPtsRAR7w":{"text":"This place has so much potential!!  Our service was spotty .. Didn't have much accuracy wh","useful":0,"cool":0},"IrSyW0PDviBuyzrPu4flnA":{"text":"I was very sceptical of this place at first based on the other reviews, but my wife and I ","useful":3,"cool":0},"u7iv8o7_kYIXLqGn0moXag":{"text":"Worst experience after we have been eating here for years. There is a specific waiter that","useful":1,"cool":0},"ioFrguRD6arTJCCtMvz29w":{"text":"I liked this place, really cute. My daughter tried gumbo for the first time and she liked ","useful":0,"cool":0},"BEBw9QNybSZ2CZXojx8dUg":{"text":"Not the best Crawfish Etouffe I have ever had BUT, Beau was an exceptional WAITER. They se","useful":0,"cool":0},"GvcShZm_cuK_DbEDLDqcng":{"text":"I am from New Orleans and wouldn't recommend this restaurant to my worst enemy. Like I wou","useful":1,"cool":0},"eUhCqDuq5ULDqefL9Lot3Q":{"text":"I ordered the roast beef po'boy.  Stay away!  Hardly any meat in sandwich.  Fries were und","useful":0,"cool":0},"TdamAomUA_kFcD-8mtZ8Sw":{"text":"Close to our hotel but never crowded. We gave it a shot. Pretty mediocre experience. Jamba","useful":0,"cool":0},"rJQ7kWqAx_opWoYngYUUgg":{"text":"Overall, this place isn't as bad as some of the reviews would have you believe. Yes, it's ","useful":2,"cool":2},"k2N279LXwrTzk-1WtI-GHQ":{"text":"We were there on busy Saturday night for dinner..The hostess was courteous and got us seat","useful":1,"cool":1},"viwI-_9mVlaIW7Ca2CzweA":{"text":"Didn't plan on stopping but walking by in the morning and smelled good. Stopped in and sta","useful":0,"cool":0},"siwP8pntWCF3I1FrGOIPLQ":{"text":"5 stars for the service!! The food was just so so. We walked in at 10 minutes til 9pm. The","useful":19,"cool":17},"ZSo2o8qFj75PhdYHsgdlZg":{"text":"Finally a place in New Orleans that serves vegetarian creole! It taste like Campbell's Veg","useful":1,"cool":0},"R4isYFOnHm_t9xZQt60ruA":{"text":"Staff was friendly, but that's where it ended. Went in for breakfast, slow to get waters, ","useful":0,"cool":0},"qiyZn-CDTQm6-0IAy49NTg":{"text":"The best omelette I have EVER had and the best meal in New Orleans so far!!!very cheap for","useful":0,"cool":0},"KGbLivsuXA0nIVPH5r82uw":{"text":"Food was delicious. My husband and I split the seafood platter and each ordered a salad an","useful":0,"cool":0},"LVFCctRab-u5QMc5GVWKIg":{"text":"I'm genuinely appalled. Everything about this place was terrible. We should have immediate","useful":2,"cool":0},"UTnnhu7OXfdUXNbzfMm1dg":{"text":"First of all , I love New Orleans! Great city, food, and music!  So I'm walking around the","useful":0,"cool":0},"GgdWxesOyHWS7ejNmvtAqA":{"text":"Damn this food was nasty. I can still smell the stench of the diarrhea that was the afterm","useful":1,"cool":0},"mytST3tHrcMglmPU7HyfIg":{"text":"Honestly literally the worst restaurant experience I've ever had. When we first sit down w","useful":0,"cool":0},"3qV3KWGmdEB8j6hRu31fQg":{"text":"I love New Orleans but I think it's gone to shit since COVID.  We tried going inside to ea","useful":0,"cool":0},"CatHoPONp2yiUWW8QaKq6g":{"text":"Located on Royal street, it's central location allows for an entertaining ambiance while y","useful":1,"cool":0},"gdCC92pQHA04rYMxd0800A":{"text":"Have always had breakfast here when visiting.  Relaxed atmosphere.  Friendly servers.  Whe","useful":0,"cool":0},"qFPA216cJGdwbMJL5dxwFQ":{"text":"I am really surprise that Pere Antoine's ratings are that great! I stumbled into this rest","useful":1,"cool":0},"OieYHOun5TlO1Do7WTXdxA":{"text":"This place is awful. Really long wait to get food. Servers didn't even realize we were her","useful":1,"cool":0},"vuekMol_ONSCzfjsoRzalQ":{"text":"All the birthday girl wanted was a nice brunch before we headed back home to Houston. The ","useful":34,"cool":19},"g1mX2vaeUKjS2NJr-1O5sw":{"text":"I'm a bit surprised by all the poor reviews for this place because I had a pretty good exp","useful":5,"cool":1},"GyDtJ4PeRmP_CD2iuH6tsw":{"text":"We wandered in here after a long day of walking around the French quarter. We ordered thei","useful":0,"cool":0},"2LMsF9m5GppfVrDFz9tqcQ":{"text":"We visited on our final day in NOLA. The food was good but the service was not the best. I","useful":1,"cool":0},"cTtQKQ5EXy2DWGaYJmSSww":{"text":"Terrelll was likely drunk and food was alright. The roast beef was mostly bread but the gu","useful":0,"cool":0},"zMnrWO3mzZdunKpnune8Jg":{"text":"The food was just okay, but the service was horrible. The waitress was slow and forgot par","useful":0,"cool":0},"0fNMfYCVs7-5VF-l5TZhnw":{"text":"Fantastic food at reasonable prices.  Our waitress Hailey was knowledgeable about the menu","useful":0,"cool":0},"XhufBlGXqlnE04IFqkxEug":{"text":"I went to new Orleans for a day trip and walked around the French quarters for a few hours","useful":2,"cool":0},"Ould9o2N9JuBVHdI3-pKhg":{"text":"Love this place. It's always a must do when we're in town. They are currently operating on","useful":0,"cool":0},"0tXst2INKNMeNf8elBT_aQ":{"text":"Had breakfast here yesterday. Service is slow but ok. Had the bacon, egg and cheese croiss","useful":1,"cool":0},"g_SwNDMf6_noerMNMHqIGg":{"text":"We chose this spot because it was late and was still serving food. The food was hit or mis","useful":0,"cool":1},"fq9TjDztD5WVTshJsZ5uIg":{"text":"Sat at the bar & also ordered food. My husband ordered chicken & sausage gumbo in a bowl. ","useful":0,"cool":0},"_AYmvnrulqtGbc3g9kWUow":{"text":"We came here because the restaurants in the main square were crowded. It took 10 minutes f","useful":0,"cool":0},"_GodiP04zlDNLY7tPmOjpA":{"text":"To be honest this place was just ok. The lady got the chicken pasta, here's was warm and t","useful":1,"cool":0},"t_Yt3IdLmOZN-xs36oxhTw":{"text":"I'd save your money move on down the road.\nOne of our selections was seafood gumbo, it was","useful":0,"cool":0},"Vybyu2ErR07ia6DXdklpww":{"text":"Waited a long time to be seated when there was no line and empty tables.  After being seat","useful":0,"cool":0},"mSDrSdHsntFHbO2sC-SWOg":{"text":"Bad service, warm beer. You can do beter anywhere else. By the way , do not trust the menu","useful":0,"cool":0},"r2FN5deoO8_EAo_l3v3mEA":{"text":"As someone who lives in this area, I would never recommend this place to anyone. Maybe it ","useful":0,"cool":0},"4iVMCUj3xNSY8DJMFmo0BA":{"text":"Total disappointment but my fault for not doing my research before trying it. Tourist trap","useful":0,"cool":0},"yyWQeJ2tuvzzJzMGFROMlQ":{"text":"When we visit another city we love to find new and exciting places to go eat, and we stumb","useful":1,"cool":1},"LWMAgMZ7czoAw_yx1T7WKw":{"text":"Not great. Went for take out breakfast just after they opened on a Sunday. Took 40 minutes","useful":0,"cool":0},"GVXofi_fiOUgx2rO0WLvwg":{"text":"Found this place looking for lunch. Service was great - shout out to Marlon.  Food was ok.","useful":2,"cool":0},"N4TzrBbRftwhSW-Ol_uj1g":{"text":"There are plenty restaurants to eat at in the French Quarter, don't waste your time or mon","useful":0,"cool":0},"aOiFcofBCNLUWRwxDO8FGA":{"text":"Be sure you plan for enough time to get your meal! Four guests, two apps for the table and","useful":0,"cool":0},"9kd1NRIeXETZwbhHFHmlHg":{"text":"Don't waste your time or hard earn money here. We waited probably 45 min to be seated. Onc","useful":0,"cool":0},"J7Hta96AtAV4PSsMXEx7Iw":{"text":"Stopped her for a quick bite after getting into town and walking around for a bit. The foo","useful":3,"cool":2},"yTo7sZAtioReZkd-BJ7NuQ":{"text":"We visited this place, primarily to find a bathroom, and to do so justified the need to st","useful":0,"cool":0},"ouwDdHVjp7uTRPC72tBIcQ":{"text":"The waiters were very nice and attentive. The food was good for the price. However we orde","useful":0,"cool":0},"IYul73ZJeWEjs6v9fYAYig":{"text":"Terrence was our server and he is such a kind, soft souled man! Service was phenomenal. Th","useful":0,"cool":0},"KAyrvKyeLxVHjvbf0bzEOA":{"text":"Really bad, slow service. Food came out cold and my poboy was soggy. Prices weren't too ba","useful":0,"cool":0},"Wecz1pwtblhKmFEJCqFzOQ":{"text":"A must go for me every time I'm in NOLA. Their beignet fries are the best beignet in NO (y","useful":0,"cool":0},"6N9ygiUk-e4EOeM7dx_lrw":{"text":"Very delicious Poboy, it had fried catfish and oysters in it. Meat was crispy outside juic","useful":0,"cool":0},"aX9S5x7GOxxVkdrWk1dhZQ":{"text":"The Peach Bellini is good. It doesn't look like a peach Bellini - truthfully I think it's ","useful":12,"cool":6},"X7tVj9YVI4EMuWclbziIRw":{"text":"Delicious. Stopped by for lunch on a weekday around 1 and it was nice and quiet. The gumbo","useful":0,"cool":0},"0eYZjV2J1KM2nqYqbLNZFw":{"text":"Visiting the city of New Orleans & have been to this restaurant twice. The gumbo & red bea","useful":1,"cool":0},"j4wzvWFuXwS_WZc7YP0OWw":{"text":"Terrible experience, ordered something- they brought something which is totally opposite t","useful":3,"cool":1},"nQdDwPt8jLafwLtGXYYolw":{"text":"We visited here on a busy night after leaving a ghost tour and had a great time. The break","useful":0,"cool":0},"hpWvDzGlnkeYVleq8wCESQ":{"text":"FANTASTIC!!  Food and service!!  Had breakfast here today on the recommendation of my brot","useful":0,"cool":0},"wzRo6gTtG0qGbG4qk7tmwQ":{"text":"Sure it's a little touristy, and a bit pricey, but on a hot sultry Saturday afternoon, it ","useful":19,"cool":17},"Z7Nb0NlC8CFi5tEhYkI9RQ":{"text":"May 18, 2021, My husband got violently ill after eating Jambalaya for lunch at this restau","useful":0,"cool":0},"L5Bd5X1Kyz-8WOHWwDl_yg":{"text":"We came in for a quick bite to eat, but weren't greeted at our table for probably 15 minut","useful":0,"cool":0},"7r_FbQb_1VULJ2lP0Hw-tQ":{"text":"The French Quarter is known for having great food, but horrible service. Pete Antoine's is","useful":0,"cool":0},"Oc1NEX26DV5ZNpLwpheCSQ":{"text":"Horrible, horrible place!  Sat at the bar, she took our order, got our drinks and we waite","useful":0,"cool":0},"Y1fvvHAmJg2xzwTnCskEkg":{"text":"I loved my bartender. I can't remember her name, but she had a thick N.O. accent, white la","useful":1,"cool":0},"zzwtoAEjpQNx96BcSeeVNA":{"text":"Below average food, very casual and pretty dirty. Wouldn't recommend unless you're in a pi","useful":0,"cool":0},"Pw_UcUtEPO99gLNtknVjyA":{"text":"This was by far my favorite restaurant experience during my last trip to New Orleans. We s","useful":6,"cool":6},"kXAt2fSGFBJA8Y070-eNxA":{"text":"Was very disappointed in our visit here the other day as a few years ago this place was am","useful":0,"cool":0},"Pj6q_dvAm8E3uNigCg0qdA":{"text":"Poor service, rude customer service and food is bland.  So far the worst place i have eate","useful":0,"cool":0},"1qnMQPCXi5-ucxDfgQxA-A":{"text":"Two words. Food poisoning. Ate here once and only had a cup of gumbo and for the past 12 h","useful":1,"cool":0},"0UPpn565ibuPbh_51oyQ0g":{"text":"I was white girl wasted and I still remember thinking, \"Yuck, this place is the worst.\" an","useful":4,"cool":3},"XGVRJlf97wiqLN0X_u5MNQ":{"text":"If you don't want the bums rush...... order your appetizer first and nothing else. When yo","useful":0,"cool":0},"FvidzGOtLluPy2smCldAIw":{"text":"This review is solely on service or lack thereof. My wife and I were standing there 15 min","useful":0,"cool":0},"ZZEPIWcCer5AEOBhGkdDAg":{"text":"Not worth of money food but cocktails were ok.\nWe ordered creole specials and it was disgu","useful":0,"cool":0},"rPOPWhC5g9u1lhpMVjZSmQ":{"text":"Bad service (slow).\n\nBad food (obviously pre-cooked).\n\nBad drinks (\"hurricane\" tasted only","useful":2,"cool":1},"gjTeqzSG_ltppVK7BACV1g":{"text":"Our new favorite place in the French Quarter! We stopped in for drinks at the bar and to g","useful":2,"cool":2},"pk59sVAl3F-QFgEOhXKdzw":{"text":"Almost left 1 star, but one very kind waitress made up for this place... To the rest of th","useful":2,"cool":0},"mDLSc34aoWIlq9YP9pOOhA":{"text":"We love this place and we had excellent service from Be'Anna. I went in not feeling very w","useful":0,"cool":0},"t2NIhpnBkNpCdS0xO3A0qQ":{"text":"The jambalaya came out luke-warm. :(","useful":1,"cool":0},"shGuV-AS-q686V9VXkhlAw":{"text":"I always thought it was impossible to have a bad meal in New Orleans. Pere Antoine proved ","useful":0,"cool":0},"W8iMVTrzjAIRbbwZ4Xyhmw":{"text":"I only wish I could give this place 0 Stars. This restaurant (so they call it) had the NER","useful":0,"cool":0},"ctge4NLk1aKSY3QOgYhoDA":{"text":"This is my favorite place in NOLA. I came across this picture in my Timehop today and it m","useful":1,"cool":2},"KPOc9E5Zc5vS0bxRh8MveA":{"text":"Despite the long line (which is true about all great places in NOLA), the food here is ter","useful":0,"cool":0},"dZyvqYpbF3wuVh44tn_I3g":{"text":"Kein schlechter Laden, aber viel Auswahl hatten wir auch nicht um ehrlich zu sein.\n\nPositi","useful":0,"cool":1},"rPzrRD51_X0An3WhhVcWtw":{"text":"The major difference I noticed during my trip to NOLA was that the service industry folks ","useful":2,"cool":0}}