{"C9obe5nmQsoRRCaL8qgL4g":{"text":"Chef inspired Poboys that will change your life!!!!  We go every time we visit New Orleans","useful":1,"cool":0},"Tvr-_7jtYarH1dwJG_3Xiw":{"text":"Get the cauliflower sandwich on poboy bread. You don't gotta thank me. You will want to, b","useful":0,"cool":0},"aiZ8db4Rde3HzTJbjgnqCA":{"text":"We love the name and were pretty excited to try the food here. Upon entering we were nicel","useful":0,"cool":1},"2B9Bz0E9E_8cow6dDdBeDA":{"text":"Loveeeeee the shrimp ! Was a perfect portion of bread, coleslaw,shrimp ratio.\nThe shrimp a","useful":0,"cool":0},"m0QAQh5E-bx_AvGVzk6nDQ":{"text":"Not your mama's Poboy : so much mo bettah. Tired of the greasy fried mystery meat / seafoo","useful":0,"cool":0},"4STGQUvAeCtIhUut5hcZ7A":{"text":"Amazing! Originally planned on eating somewhere else but the line was too long. So happy w","useful":0,"cool":0},"ZjYhxXPl1GD9WWannEluCA":{"text":"I won't lie, I've been a KPB fan for years. In a city consumed in traditional Poboys and m","useful":3,"cool":2},"zumUilp2EKf9CxRUQPzb_g":{"text":"Let me just say, the seared shrimp po boy was slap yo mama good! The bread was fresh and c","useful":1,"cool":1},"oZxTewyfhVljoup4ZNeD8w":{"text":"This was the best shrimp po boy that I have ever had. Full of flavor and not a long wait. ","useful":0,"cool":0},"NUtN0kQOb2Tk-HPmtPss2A":{"text":"Awesome food!  Split shrimp and prom belly poboys between 3 people and plenty to eat. They","useful":0,"cool":0},"lWjad_XwwGRi9qM0n4Bbhw":{"text":"Pork belly with a side of smothered greens, as recommended by the woman behind the counter","useful":0,"cool":0},"R5ERyrtM_7nHhUNN017eEw":{"text":"I really wanted to like this place more but the pork bell was just too much fat for me to ","useful":0,"cool":0},"Y2In9T3XukJUGxvisq3WiQ":{"text":"Yum! We popped in to grab a quick breakfast and save a sandwich for later. The chorizo san","useful":0,"cool":0},"m9FXey9iiWncP4pBqb0Fow":{"text":"Food was excellent. Don't pay attention to\nAppearance. Very reasonably priced & excellent ","useful":0,"cool":0},"VlkHkn84QqoAPlQ187xL2w":{"text":"Have been a fan of the original location for years. The new spot may not be quite as gritt","useful":0,"cool":0},"4draXfmased_wpHW2GXmdA":{"text":"I don't normally use Yelp, but when I do it's to give a dope spot their due.  Killer Poboy","useful":1,"cool":0},"EcYMSzELyJfEqC9sZnJPmQ":{"text":"Try the cheddar omelet poboy! It's unexpectedly delicious. Delightful! Love the location. ","useful":0,"cool":0},"5nlQE5ZMKsyxhWEbKKyCGQ":{"text":"When in Rome, right? I figured I needed to experience an authentic po-boy while I was in N","useful":0,"cool":0},"WKZ4MjWNG6fBizkEjrU3wQ":{"text":"I read about this place in Bon Appetit and it was worth the visit. Their po'boy sandwiches","useful":1,"cool":2},"xZeSeiBTV-9Xwax-xW1rjQ":{"text":"Recommend: pork belly.\nTheir cauliflower is interesting and their shrimp was okay. \n\nThis ","useful":0,"cool":0},"4FC7v-HCf7J1p4b1A9fh2g":{"text":"This ended up being one of my favorite dishes in New Orleans. I had a standard po' boy els","useful":0,"cool":0},"z8Zb0lDeLV2pDHcec2DT6Q":{"text":"Very  good shrimp seared poboy! Huge shrimp, balanced flavor! Will definitely return to hi","useful":0,"cool":0},"WuWek0i8gGiXc3yW5CpxLA":{"text":"A hidden gem. Unique Poboys with a global twist. Small storefront but cozy seating and fri","useful":0,"cool":0},"eBfyfIN7qOiK-bo5brKGWA":{"text":"The staff is great. They have some amazing vegan options. We stumbled on this place our fi","useful":1,"cool":0},"GhpewkQ4lCHc2Timn4XISQ":{"text":"First time to New Orleans... Read and heard so much about PoBoys.... And boy this place li","useful":0,"cool":1},"5tqm-DCs8cQnDqNBrDVZmg":{"text":"This is definitely not your traditional poboy. These were more like bahn mi. The bread is ","useful":2,"cool":1},"zOaplaRnYmOhM3exVsfpuw":{"text":"Hum, this place was Ok but there are better and less expensive po-boys all over the French","useful":0,"cool":0},"TteF_gZX6z5PbEPiLEwGkw":{"text":"Not bad po-boy.  Inventive stuff, but not entirely what I was looking for.  I know plenty ","useful":0,"cool":0},"1Gdxf5VYMDBE3PdCkjVF4w":{"text":"Went here recently and really enjoyed my shrimp po'boy, honestly it tasted more like a shr","useful":0,"cool":0},"wlOclzPopnqYkDCddGx69Q":{"text":"Not a bad sucker for a Poboy of a sandwich. I had the Ham & Pimento Cheese Poboy. The ingr","useful":2,"cool":2},"X4rx5_2FOet-Es6SOYKokw":{"text":"We decided to try this place on the recommendation of a site that lists vegetarian and veg","useful":1,"cool":0},"z95P2B67eXmCj6cwrAO3Lw":{"text":"I would really give this 3.5 stars but I've only been once so I'm giving it the benefit of","useful":0,"cool":0},"wbrFmfFasWBYmu9HEFwkhg":{"text":"My friends stepdad says that he hasn't liked a sandwich place in the 20 years he has been ","useful":0,"cool":0},"sciA6vQ4Y8Uth0uXyvgP1Q":{"text":"I was nervous about visiting New Orleans as a vegetarian since most of the city's classic ","useful":0,"cool":1},"UmRqJC17YeeQPLP73FW2eQ":{"text":"MY FAVORITE POBOYS IN NOLA! I absolutely love this place, and everything I've tried has be","useful":0,"cool":0},"rSywpBIFbqAVlLagrwEDoQ":{"text":"The roasted cauliflower (on the po boy bread instead of the multigrain) is the best thing ","useful":1,"cool":0},"EHy3upS1s5kYeJzjIC2X3Q":{"text":"Made it by here for the soft open. Cam has done great things here. Always loved the origin","useful":1,"cool":0},"4VdIPhdfvOhEH9wIOcfDbg":{"text":"Really good -- and worth the visit. Go to the original location and grab a cocktail after ","useful":2,"cool":0},"X8JIKT1YyIjIQu15mstdJA":{"text":"I picked it out because this place offers something distinctively New Orleans, but which I","useful":1,"cool":2},"msHjJW-h_p1vZ7ySEeLGcQ":{"text":"I was psyched to find somewhere close to where I was staying that sold veggie poboys...and","useful":1,"cool":0},"BLAJhwmKQKJgFOSeuWP3zA":{"text":"I had the gulf shrimp and hubs had the pork belly po boy. Altho the \"meats\" were good tast","useful":0,"cool":0},"bg4vQ1pW_Wht2l9d0lfTRQ":{"text":"We REALLY enjoyed our lunch at Killer Po Boys.  My spouse asked repeated where we could fi","useful":0,"cool":1},"7oI7JZ9Y3AT_4CeOTOxhaQ":{"text":"I passed the place up twice because the name is not on the front of the building. It's jus","useful":0,"cool":0},"vyrane2RWR_2qebOQ8q8QQ":{"text":"First time visiting NOLA and definitely wanted to try a Po boy. I am vegetarian and could ","useful":1,"cool":0},"sjPEhNYxA0D_9uqtnZ01VQ":{"text":"My husband and I shared a Pork Belly Po Boy as he ate the meat and I ate the fat. It was m","useful":0,"cool":0},"0N6cFrAQPp38FuGYw9h35w":{"text":"Food is always great, but the counter help. Today's gal was not only unfriendly, but borde","useful":0,"cool":0},"O1VIj1zgTJ2uVqPeaAuMPw":{"text":"Our first meal in New Orleans did not disappoint. We got the pork belly and the shrimp - b","useful":0,"cool":0},"uviAd1IcVH8h0zVhQpEWKQ":{"text":"Chorizo Po Boy was delicious.  The potato salad was awesome!  I would have gone back for m","useful":0,"cool":0},"cUnOatsVUIOZl3lfbjuq8Q":{"text":"Glazed Pork Belly Po Boy!! Get it. This was the most memorable place that my group ate at ","useful":0,"cool":0},"UEHIyIgYUziRmh6ABmgo5Q":{"text":"First time here and the shrimp Po'Boy is so delicious with all the right combination of sp","useful":1,"cool":1},"hus87VhHUL4I6eD07di0sw":{"text":"Great food. I am vegetarian and my son is not but we both got delicious food . Even tho it","useful":0,"cool":0},"qUhqxllqrfYun8Snq7LzXQ":{"text":"had their bahn mi inspired poboy which was nicely spiced and the siracha aioli worked. The","useful":0,"cool":0},"nU74pCpXm00SLR5boEknGA":{"text":"Wonderful cauliflower poboy...a full meal...and the braised kale side was  delish. The fac","useful":0,"cool":0},"s47RIVRaZHhTWRQumLb0Hw":{"text":"The shrimp P.O. boy is amazing! I just finished mine an am contemplating ordering another ","useful":0,"cool":0},"Mxk6MEsGgcqi6VbGAyJk0A":{"text":"Ordered the shrimp po boy that everyone raved about and it was total garbage. \n\nThe shrimp","useful":4,"cool":3},"vozoY_Vc07DwZXH34VE7HQ":{"text":"The poboys here are delicious!!! They do not skimp on the ingerdients and the ingerdients ","useful":0,"cool":0},"emdggHgaDnPS3_KVJg9t_w":{"text":"It always makes me happy to see vegan and vegetarian menu items! Ate there with a bunch of","useful":0,"cool":0},"wvT38ruToAYOpEvJw8e91Q":{"text":"Loved the food and atmosphere. One of the most delicious poboys ever! Definitely worth ano","useful":0,"cool":0},"zxjYtWs_4n1wrEqSC1ww5w":{"text":"I came here for a quick bite with the boyfriend. We got a seared shrimp poboy to share. Th","useful":0,"cool":0},"xSwXljoxsbztkSvYQ7GCZQ":{"text":"So very delicious. Worth a trip. Very friendly service with a nice selection of craft beer","useful":0,"cool":0},"ylBPdQDF3KAwhKE6gZxwaQ":{"text":"Holy moly this place is good.\nSo good we went back for seconds.\nI had the beef debris both","useful":0,"cool":0},"0NI2gx289WvFIZlkX0EORQ":{"text":"Got lost finding the spot. It was inside a bar in the back & had 5 menu items to pick from","useful":0,"cool":0},"kXKOk4GnWEBJg8tf0ipU1Q":{"text":"3.5 stars for the Shrimp Po Boy\n\nThis place is much bigger than their bar location & has m","useful":4,"cool":3},"sFEwHwqT7ewkzkiEndVNog":{"text":"This was my second time here and once again it was amazing. The pork belly poboy and shrim","useful":0,"cool":0},"QltWc7SlK1Mxo6sc0kS4dg":{"text":"Based on these great reviews how could this place go wrong. It does. Meh is the best word ","useful":1,"cool":0},"6cXK7-0XkhYfK1K5HvL2dw":{"text":"My first time in NOLA and it was my first meal. Small quaint place, order at counter and g","useful":0,"cool":0},"2GEIixmWJNCO2mqDZvx_LQ":{"text":"You have to go here! They have this location and the window inside the Erin Rose pub not f","useful":0,"cool":0},"UjadawwYHQ9U9NaJKHZ0WA":{"text":"Poor rendition of a po-boy. This place should call their sandwiches something else and not","useful":0,"cool":0},"sO2Bef80asSrH7u8JdrsnA":{"text":"My friend and I tried several things from here. The BBQ chicken was good. I didn't care fo","useful":0,"cool":0},"4Py_-Zhs8XoU8U3X7MTjlw":{"text":"Had the Gulf shrimp poboy for lunch--delicious!!! Great service and mouth-watering sandwic","useful":0,"cool":0},"GlKnm-1uZ6KecSIQjCMOcA":{"text":"Got the BBQ chicken Poboy and it was not what I expected at all. Thought the chicken would","useful":0,"cool":0},"zYhzADnp2AQ--oeUyDa4yQ":{"text":"Highly recommend!!!!! delicious poboys and they have vegan options!","useful":0,"cool":0},"ryVqribKqnU0Gs5FT-h34Q":{"text":"Poboys were a MUST try on my NOLA bucket list. Coincidentally  Killer Poboys was located a","useful":2,"cool":3},"NxUpK9PuJIux_bf76MGO9g":{"text":"So we hit 2 very positively rated Po Boy shops while in NOLA.\nThis was the \"nontraditional","useful":0,"cool":0},"mPZvP1gR47__JmXJZMflVg":{"text":"Got the shrimp poboy. It's was so good. No frills about it just a great easy meal straight","useful":0,"cool":0},"m9qJcyoQwRVPoY9Wo5ZnWQ":{"text":"enjoyed the off brand chips and almond cola that went w my po boy. the cook came over and ","useful":0,"cool":0},"2HPJ1fFHoR_MiCOSHm8xKg":{"text":"This is an awesome Po'boy spot. \n\nI had absolutely no complaints about the seared po'boy I","useful":0,"cool":0},"ExWNyNxpROYpaOMRS9j6kw":{"text":"Had the ham and cheese and the shrimp. Really liked the ham one. Sure would have liked mor","useful":0,"cool":0},"QV9LqTQEJKe5GjBkZOAdIQ":{"text":"Searching for a vegetarian PoBoy brought us here. They are a small nice place. Very friend","useful":2,"cool":1},"jPrmhjwjc9N0BM1Q3Q50XQ":{"text":"They have a nice selection of options for veggies and vegans.  I requested roasted caulifl","useful":0,"cool":0},"VmFtdaI74YaV4SE_TVVqHw":{"text":"Had the cauliflower po-boy. It comes with an amazing romesco sauce. The cauliflower was pe","useful":0,"cool":0},"j_OdcxvCF38yBMUczp3TQg":{"text":"Great variety of poboys. Excellent vegan and vegetarian options. Every item on the menu is","useful":1,"cool":0},"cOoF-KDJfpvUXaC_r89Ndg":{"text":"I'm actually from miami and I was highly recommended to try the shrimp po-boy. The shrimp ","useful":2,"cool":2},"-YB3tKLC6eGRt259sxj0tg":{"text":"This is a must visit for foodies! The sandwiches are A-amazing!! Shrimp po boy is deliciou","useful":0,"cool":0},"t6AqSP7aP0cnB52qWQ-P5w":{"text":"I wanted\nTraditional and this was the only place that was open. Who puts carrots in a pobo","useful":0,"cool":0},"dmUiAjplXl_mkcSE8Wm3Fg":{"text":"Very good, have vegan options and everything seems really fresh - only side note the side ","useful":0,"cool":0},"55skpr7b6Ft86ZS3rR3pAQ":{"text":"I had never had a poboy before but apparently I HAD to (according to my mother) if I was c","useful":0,"cool":0},"DmAPxOlxZNHd9t4eCS3m2Q":{"text":"This place boasts a menu dedicated to poboys...you really can't go wrong with their select","useful":0,"cool":0},"RWVhHWc2NhQKTEWU7qtbvA":{"text":"decent atmosphere, great service, great location. but nothing to absolutely rave about her","useful":0,"cool":0},"Rsz2R07PSwgx91WiYTOzbg":{"text":"Nice, clean, fresh, and local spot to grab a quick bite. We ordered and shrimp po boy and ","useful":0,"cool":0},"3yx2rMeFoHWDvVTpYAOQQw":{"text":"Four stars for their pork belly sandwich! We bought their salmon, chorizo, shrimp, grilled","useful":0,"cool":0},"esIRsOLOJNe4EcfhE8obyQ":{"text":"Was in New Orleans for a conference and went here for a quick dinner. It was just fine, a ","useful":0,"cool":0},"VUt3zL5cK6JHUkKPvI6TgQ":{"text":"I got a shrimp po boy to go yesterday and it was so good! I didn't even get to eat it righ","useful":0,"cool":0},"ut3718B1rLGOUeK-AH1f5Q":{"text":"These poboys: They are pretty killer though. They're definitely of the non-traditional, cr","useful":5,"cool":4},"XAqXgznJjBCKuH9AdocQbw":{"text":"Down and Dirty! If you want a quick poboy while in NOLA and in the Quarter, this is your p","useful":1,"cool":0},"XeNSuAIKMxaJflCVrEmQCQ":{"text":"When itravel for food,  itry to go the off beaten path but few me to this place was the fa","useful":2,"cool":1},"SxknNb98QaV551wvz7Gdng":{"text":"Check this place out for a little different spin on a Poboy.  I've had them before at othe","useful":0,"cool":0},"EPY1b4cGmSBWmxjOiAGdLA":{"text":"It was our first time in New Orleans and we wanted some po boys. We were very happy with o","useful":0,"cool":0},"FPXHKfM1cINKL5Ae8k6uPg":{"text":"Simple sandwich not bad hungry and can eat anything now. Not crowded so order came fast.","useful":0,"cool":0},"BCO6IAGQFnC1KORBuyRwWg":{"text":"Day 3 in New Orleans and I was on the hunt for something healthy (i.e. vegan, veggies, any","useful":2,"cool":1},"A2NTyCPzOeaiv9cXIUj-Tw":{"text":"If in NOLA, this is a must. Many restaurants out here have po boys, but if you want the be","useful":2,"cool":1},"JAzCnR7t46LK2NJTsho4uw":{"text":"Great service, and delicious food. I tried the venison PO boy. The meat was delicious but ","useful":0,"cool":0},"lZ1B_LL9ggC-JHU4yozjNg":{"text":"Delicious lunch option. I enjoyed the shrimp po boy with a local bourbon cream soda. Absol","useful":0,"cool":0},"ZKnepmqcYUFhyCnL_QYQZA":{"text":"Killer for a reason ... so good! \nFirst time I was able to enjoy goat meat ... and always ","useful":0,"cool":0},"h0f330O4K5T2DUbrA4MzHA":{"text":"A.M.A.Z.I.N.G!! Was torn between the seared shrimp and pork belly. Went with the shrimp an","useful":0,"cool":0},"M-ZOOYGkFwuZopZjlzrkbA":{"text":"Solid vegan options here. The best is the roasted cauliflower sandwich - they'll put it on","useful":0,"cool":0},"XFqnrT4F7fCgSbRgzU1WMQ":{"text":"Awesome little spot.   Loved the Shrimp Poboy.  Super friendly staff and quick service.  O","useful":0,"cool":0},"K34rFtyqbFBLNFBplNyaig":{"text":"Super Nice staff, We were the first customers of the day before leaving LA. What a treat t","useful":0,"cool":0},"Wji3bL7v_Etg8eRdj3vrKw":{"text":"As someone who had never had a Po boy before, I don't really understand the excitement. It","useful":0,"cool":0},"4VsuckUEod6ggGD9Kc-cww":{"text":"Stopped here for a quick bite to eat. Got the glazed pork belly poboy and it was delicious","useful":0,"cool":0},"6R5wIWNLAnvjy9j4cNEdrQ":{"text":"The Po boy sandwiches were delicious. Gotta try the seared shrimp. Our favorite! Super aff","useful":0,"cool":0},"4BaTE61p6cg86qcIRsStew":{"text":"So disappointed. We were so excited to try the food here. We got the debris poboy. It was ","useful":1,"cool":0},"vBN8Y-QzaV5DtxECoWT2mg":{"text":"Better poboys than some of the more upscale restaurants I visited. I had the chorizo poboy","useful":2,"cool":1},"yOJkiOLNPfiRfSynAx0-6w":{"text":"Ordered the bbq chicken and the shrimp subs, I paid $26.24 and it was not worth it at all.","useful":0,"cool":0},"nNoZQRN_utmPK0gI3ZVGvg":{"text":"When my husband, a picky eater, has to come to eat their po'boys for 3 straight days, you ","useful":0,"cool":0},"Q9KOddP6n9tMSgRmgc0NMQ":{"text":"This may be the best kept secret in the French quarter. Great, inventive twists on traditi","useful":0,"cool":0},"sOoc8LclM9Do45dpKBuGow":{"text":"I tried the shrimp and the beef po-boy! They were both so tasty! The staff here is super f","useful":0,"cool":0},"I6U1nBHOrAYDaAmaPqtxbw":{"text":"Ordered the pork po boy. The meat was all fat. Could not even enjoy one bite without pulli","useful":0,"cool":0},"zepmzZSTD7CgXXsL1mZeCA":{"text":"We got the Glazed Pork Belly and Ham and Pimento Cheese Poboys. Both were very good but th","useful":0,"cool":0},"5sSTkL9owgzZjW42pZWq4A":{"text":"It's good, not mind-blowing.  Husband got the whiskey grilled cheese which was delicious. ","useful":0,"cool":0},"0CE4OAKNJtNP83FBOS0XQA":{"text":"Hands one, one of the BEST Poboys in town! There are two locations for this, but my favori","useful":0,"cool":0},"PS9Gp7rarQFpOkEGXERRSg":{"text":"I am not one to leave reviews, but I had to come to say that the Pork Belly Poboy is truly","useful":0,"cool":0},"ndCuPMTS-rhlZ6jWG-lZ9g":{"text":"I tried this place twice because it boasts vegetarian options, but the cauliflower sandwic","useful":1,"cool":0},"4qXuInLMsq_trQ2OakxTyw":{"text":"It's called 'Killer Po Boys' for a reason. KILLER PO BOYS! Great atmosphere and really coo","useful":0,"cool":0},"PMdohDxrFZ6bXTzEi8Mu0w":{"text":"Got the Seared Shrimp po boy...it was delicious!!! They had a nice variety of menu items a","useful":0,"cool":0},"39-AuotUtHtqyB0ctoRAqg":{"text":"This is the only place you can get a curry goat poboy. Yes that's a curry goat poboy. It's","useful":0,"cool":0},"u2MRkHn2122llP3Hx94MzA":{"text":"GO HERE! Forget any other poboy spot and come here instead. Everything on the menu is awes","useful":0,"cool":0},"Jf5m2gs6vtpw3qWd7iu53w":{"text":"Last time I was in New Orleans back in 2011, I went looking for a vegetarian version of a ","useful":0,"cool":0},"TFV2P4gjvicCHwmL-ul4yA":{"text":"I tried the cauliflower sandwich and the sweet potato poboy. I was hoping for more flavor ","useful":0,"cool":0},"nkNAMCp__bz4y2CfLWoWng":{"text":"Big ups to that glaze on the pork belly po'boy! Truly unique. The shrimp po'boy was just o","useful":0,"cool":0},"dNNQjfChpyNNAZwCLBJVwA":{"text":"Amazing poboy!  I have always stayed clear of poboys due to the amount of bread and \"fried","useful":0,"cool":0},"SnI8nRkMACu3EB1YQHDZvQ":{"text":"Have been here many times. Great food,staff and atmosphere.  Love the sides! Great place t","useful":0,"cool":0},"gKBFfuIb26cyRG1qVzdOiQ":{"text":"Went here while on vacation in NOLA. Was really looking forward to trying the vegan Poboys","useful":0,"cool":0},"cHcnEEffGsqxpi1LRCJEBg":{"text":"Best vegan poboys in town. Every sandwich on the menu has a unique flavor. Gotta try em al","useful":0,"cool":2},"-IByuTCM9lIMM90_ZM_nLg":{"text":"If shrimp poboys don't turn you on, try Killer Poboys.  This place is the bomb!!  We had a","useful":0,"cool":0},"0iccliF8j16zfleB1zz8sg":{"text":"Nice local beer & chips I got the shrimp po boy good bun and filling except the shrimp had","useful":0,"cool":0},"U9rJHNjf6mzIyJzN1zz30Q":{"text":"Shrimp poboy is a must. It's a cool play on banh mi. Honestly though, everything they make","useful":0,"cool":0},"lWK38a2hWkMnOMuwjAjSdA":{"text":"We read this place was amazing and were eager to try it out after a morning of shopping. O","useful":0,"cool":0},"EKQF55TgfPZZK83I_xS5Hg":{"text":"Very good poorboys all round! I order the chicken confit with BBQ sauce. Not your traditio","useful":0,"cool":0},"8R33VxFU5BWTQvh8dUBWoA":{"text":"Very clean! Server washed hands before serving.  We had chorizo and a chicken poboys sandw","useful":0,"cool":0},"2aScaJPrUhMi9DtLTLle3w":{"text":"Killer Poboys is a great twist on New Orleans style poboys.  Normally a poboy is your typi","useful":0,"cool":0},"Y2U2UoSVIRr6iXg3jlq6tA":{"text":"Delicious and affordable. Great to have some interesting and yummy vegan and vegetarian op","useful":0,"cool":0},"-zDSZabWvRIZhqnwt8XXIw":{"text":"Whoa! Delicious sandwiches and sides. Po-Boys with flair, on point. Friendly, very fast se","useful":0,"cool":0},"W37V2JlTEbunOQxFWnIOVA":{"text":"Cool place which unfortunately did not meet expectations.  First heard about it thru Micha","useful":1,"cool":0},"43vMl9X7SoP6WS-w7Z0cXg":{"text":"The grilled shrimp po boy is the best sandwich I've ever had. Hands down. The bagette was ","useful":0,"cool":0},"-jvKwRx3AdkCUUZuKz7F2g":{"text":"I prefer the smaller menu selection of the Killer Poboys located inside of Erin Rose, more","useful":3,"cool":0},"VlwsLRTA0VvnNznMbLElZQ":{"text":"I'm ded. So very good! I had the classic beef poboy. The texture of the filling, the juici","useful":0,"cool":0},"vIaVngLxEAnCujEnolAN7g":{"text":"For someone who doesn't like shrimp, the Seared Shrimp Po Boy was pretty tasty. The sandwi","useful":1,"cool":1},"X40KXI5wXJ8vf4sD1SOpxA":{"text":"Located in a great dive bar, these po boys were amazing. I got the glazed pork belly which","useful":0,"cool":0},"oN0G3xrSzpQ6N4dW3jMbOw":{"text":"Fire but word of caution don't spend all day drinking then eat three shrimp Po boys you'll","useful":0,"cool":0},"dO1sQtJfcGAkWdX8z3Q00g":{"text":"Wow!!!  Super amazing!  Different but absolutely killer PoBoys. The Ham and Pimento cheese","useful":0,"cool":0},"yenDYWUY1czHwboMcBI8zg":{"text":"Service was great and food was served quickly after ordering. 5/5\n\nFood, on the other hand","useful":0,"cool":0},"Rkn3FMXCeVamzc5TLlrrzg":{"text":"Nice atmosphere, great employees, clean restaurant. My first ever poboy so don't have some","useful":0,"cool":0},"kEqnDCpb1Z2DU9TVg_T9Nw":{"text":"Killer Poboys were really killer! Had the seared shrimp one with diakon, cilantro, cucumbe","useful":0,"cool":0},"v3XppkTxtqXfFbAunZTpsA":{"text":"If you're looking for traditional po boys, this isn't the place, but the sandwiches are de","useful":0,"cool":0},"ES-yJESkkI-zoE7phdqVQA":{"text":"Exceedingly inviting. Superbly delicious. Really appreciate the flavor balance and care pu","useful":1,"cool":1},"LZojzcvKtcxxDZvywmUBww":{"text":"Yum, hit the spot. I had the shrimp poboy, it was perfect, it wasn't heavy despite the amo","useful":0,"cool":0},"ISyPoHjbByH5ctSRiDWuHg":{"text":"Visiting Nola I enjoyed sooooo many PoBoys, but was really craving a vegetarian sando. I h","useful":1,"cool":1},"RqCLiR7j5_PBqV7s8pgj5Q":{"text":"Have been here many times. Great food,staff and atmosphere.  Love the sides! Great place t","useful":0,"cool":0},"A_TJOsgBil4p3o9qyQ9zqQ":{"text":"Went twice while I was in NOLA (once with my wife).\n\nWe didn't try them all, but in order ","useful":1,"cool":1},"I8M05S-QRIWMTqdMRiNX7w":{"text":"Place is not too far from where we stayed. It's well worth the trip. Had the seared shrimp","useful":1,"cool":1},"MIhFcQyVHAOJvZRlQhhcfw":{"text":"Really wonderful vegan options and plenty for carnivores. Great selections of beers and ot","useful":0,"cool":0},"Db6yjMqhBfUxE5c2wD_o-g":{"text":"Best shrimp in New Orleans and one of the best meals here with kickass staff. Amazing sand","useful":0,"cool":0},"TUjRUbhrjJ2sl5g8kmlJTg":{"text":"Husband had a shrimp poboy, which he loved. I had the grilled cheese and it was the best g","useful":2,"cool":0},"HRuNZZkek7iU1c24hoFgZw":{"text":"I ordered the Roasted Cauliflower Sandwich. It was delicious!!! The staff was very sweet a","useful":0,"cool":0},"XMOIL3kUHyoU2QaBvOREFA":{"text":"We got the cauliflower and grilled shrimp Poboys. Both were so flavorful that we bought mo","useful":0,"cool":1},"bIkGvj2tQUTf-6qFL0K14A":{"text":"Just ordered a debris and cheddar omelet  w/ sweet potato poboys.  Rock solid!  Fun twist ","useful":0,"cool":0},"e6b-GVO2qAObOcnPNgjAJw":{"text":"Every bite a delight! My first crawdad poboy. Tasted like yummy shrimp. Our server at the ","useful":0,"cool":0},"awSZ_nr5X_52bTqFNQ1AGQ":{"text":"I would've rated this place 5 stars if I'd only gotten the pork belly poboy, because that ","useful":0,"cool":0},"eZ3KFIqN7M3n_lBeQ7edng":{"text":"An innovative take on traditional po-boys and a good stop if you're wanting a break from a","useful":0,"cool":0},"R1aS_bN7T1Eo4qXUXwTVWg":{"text":"This is my go-to for po boys aka subs, grinders or hoagies. And like those, their tastines","useful":0,"cool":0},"rpZZX-EO9bGrWHqVQrvUkw":{"text":"Wow you mean I can get some kind of poboy other than a fried something something smothered","useful":2,"cool":0},"L59gU6ELd55I-tN2Ayrh-w":{"text":"Best greens I've had so far. We tried the shrimp, beef and pork belly and all of them were","useful":0,"cool":0},"9zXOMpyOAu97oiwGn4ns1w":{"text":"I shared a pork poboy and a chirizo poboy. The pork was sweet and moist with excellent fla","useful":0,"cool":0},"TbbNMCndr-s-o1Yfpy4weQ":{"text":"I tried the Braised Beef Po Boy...meat was juicy and flavorful, pickled veggies added crun","useful":0,"cool":0},"l0UXVMTOunRTehDbGfucZw":{"text":"This place is a dream come true! Everything is delicious, and the service is prompt and fr","useful":0,"cool":0},"DAYm7rlG1fo4eTwUaZE2ZA":{"text":"Such a delicious take on a New Orleans classic. Looking forward to another sandwich next t","useful":0,"cool":0},"vkbFDuJeIwkVQ3H1TyzEYg":{"text":"Parking in the French Quarter is the biggest PITA, so sometimes I park in Treme if I just ","useful":1,"cool":0},"h1fYmfttKqKXNmbtNUP9jw":{"text":"Coffee BBQ sauce.\nThat is all.\nNo, really, we had 2 awesome vegan po boys here. The sweet ","useful":3,"cool":2},"FpJooIWl-KkfUlJ6LFKsQQ":{"text":"Amazing food. Good service. I got the shrimp Poboy and my girlfriend got the grilled chees","useful":0,"cool":0},"wJ-YLHSmoj-Cg-bD5hsC9A":{"text":"It was indeed a Killer Poboy. It wasn't all breaded and over fried. The carrot slaw on the","useful":0,"cool":0},"QvcA6fkEKnuN6Dmga9d1QQ":{"text":"Odd concoctions that shouldn't taste any good but OMG!!! The whiskey grilled cheese is ama","useful":0,"cool":0},"3WUah2Vn-tWAc3p21zT6Fg":{"text":"Poboys are something you're supposed to try when in New Orleans and this restaurant appear","useful":1,"cool":0},"7ocJqzw_Kf_4G9G4ITN4UA":{"text":"Had the beef PoBoy. All I can say is this sandwich was A1!! The only disappointing thing a","useful":0,"cool":0},"3Lm_eYIOozd2rpqga5VJvw":{"text":"This is the same amazing food as the original Killer PoBoys in the back of the Erin Rose b","useful":0,"cool":0},"LTYOuoXl6h6siKGtXSBYig":{"text":"My goodness.  It was soooooo good. I didn't know what to get.  On advice,  I got the Glaze","useful":1,"cool":0},"_EnARsu2xuHQZBXa72I2wg":{"text":"The pork belly poboy is divine. Decent beer selection too.\n\nI also like this space. Plenty","useful":1,"cool":0},"YHAc8b_9UDF4qx8OrdzOMw":{"text":"Great food. Can't go wrong. Loved the cauliflower sandwich and the ham poboy. Def going ba","useful":0,"cool":0},"8MNvJFuyj6Rbb9YLQnrXRA":{"text":"Special today: Burgundy braised Venison Poboy. \nWill be back when I visit NOLA again!","useful":0,"cool":0},"oGNSHLV1IJvPg0tGete4kw":{"text":"BBQ chicken po boy is outrageously good.  Friendly staff.  I'll be returning at least once","useful":0,"cool":0},"V4G4_vKdG51IaknlvAe1qg":{"text":"It hurts my heart a little to write this review because I absolutely wanted to love this p","useful":2,"cool":2},"pwO3nFk10Hx6Xv00LtlJKQ":{"text":"The staff here are really nice, the chefs are great and the food is good. There are a coup","useful":0,"cool":0},"p_gdOifFazwlhx7_KzvFrQ":{"text":"I wanted to have a Po boy. This place was near the hotel. I got the seared shrimp \npo boy.","useful":1,"cool":0},"PpmDdV5XfqpZS86zWy8w6A":{"text":"We went here after reading good reviews on some blogs. Some calling it \"the best\" poboy sp","useful":0,"cool":0},"PZTXf81GVUO_o8utmfI3nA":{"text":"This was a great first experience for eating Po'boys! I had the cauliflower Po'boy, which ","useful":1,"cool":2},"DJW4FAJ9YTiRbbsq5ktwqw":{"text":"This was my first meal of my first trip to New Orleans, and while the food was delicious, ","useful":0,"cool":0},"hsjrr6VWGO42RFUKjImamA":{"text":"Great po'boys! I got the shrimp po'boy and it was more than enough to fill me. the shrimp ","useful":1,"cool":1},"kvA7I5k8Ei8p_pctwcuhyQ":{"text":"Wonderful, near perfection!\nI got to know about this place due to the guys at SortedFood. ","useful":1,"cool":0},"TjZpMLGve0iUnD7PFgkBfw":{"text":"On the second day of our trip to NOLA, we ventured out to find a place where we could samp","useful":0,"cool":0},"ReULOnRwnYfrdbdWrTNs9Q":{"text":"Great new take on Poboys that brings a fun and exciting flair to an otherwise fairly basic","useful":0,"cool":0},"8ze5TVh-HGBFufhBkMh5Qw":{"text":"Comme il y a une option végane pour ma femme nous sommes venus tester ce Poboy.\nPour ma pa","useful":0,"cool":0},"XEC8rEJ6SGppnlPjRFRwBg":{"text":"I had high hopes. Meh. Shrimp Poboy was ok. Too much carrot. The Pork Belly PoBoy was tast","useful":0,"cool":0},"6l2_G5wiUCwTsNZlPrjeWA":{"text":"We went here because deanies had a long line and we passed by. If you are looking for a po","useful":0,"cool":0},"rU9AharSQ9vstLjIhxM4EA":{"text":"Braised beef PO-boy like Mom's roast beef.  Mmmm\nGreat seared shrimp with pickled carrots ","useful":0,"cool":0},"aPgrzfffddUKxDttL4SKYg":{"text":"Good spot. Small, but comfortable and not much of a wait at all, even right at the lunch h","useful":1,"cool":1},"z7bi2JJfcO2ReRkTA2D7rA":{"text":"The Erin Rose location sent us to Dauphine and we are so glad. We didn't study first to le","useful":1,"cool":0},"S5xsCnXyKLNQRGcJlzLEIA":{"text":"Was walking around the French Quarters when we noticed this place. Now for some reason we ","useful":0,"cool":0},"LTNRjyeCbcUiZhqEuPnEbQ":{"text":"Been hearing about this place and had to see what the fuss was all about. For he grills sh","useful":0,"cool":0},"aKJS0wGhpbKDszr8A0ihJA":{"text":"Ordered the seared shrimp Po boy & immediately after the first bite I was hooked. Plenty o","useful":0,"cool":0},"bR_ckFUzyu_RwS5Sfd0jxw":{"text":"The pork belly was super!!! I definitely recommend that you try it. Definite experienced t","useful":0,"cool":0},"SiDuGcYFdVt7NBpULDzGWw":{"text":"This place offers a very unique and creative spin on poboys. If you are looking for someth","useful":5,"cool":4},"iT9aHRNaJ_fEeAHDw43VUA":{"text":"My wife and I were wandering the quarter and needed something to drink sp we stopped in he","useful":0,"cool":0},"kQaT_jWBadgPLHiH9AyAWQ":{"text":"We went to Killer Poboys at a random time and there were still a few patrons, but it was n","useful":0,"cool":0},"9aXzClwXEro8oV8R4mgSzw":{"text":"Killer Po-boys is what happens when you put a contemporary spin on NOLA tradition. KPB del","useful":0,"cool":0},"9z1z-3gI4VcOKlr63Yfdvg":{"text":"Three different days, three different sandwiches.  First was the Black Beer Beef Debris - ","useful":0,"cool":0},"e-_QFNrm8Vp5BXwxBDZOPQ":{"text":"Omg, I just had a Po Boy made with roasted cauliflower, avocado, radish, kale and it was a","useful":0,"cool":0},"lBV0ZSBTY3YPcTOgGjrx5Q":{"text":"Probably closer to a 4.5.  I got the beef debris Po boy, and it was fantastic.  The beef w","useful":1,"cool":0},"_qbUb773Smncxst6YDRd3w":{"text":"As a vegetarian I like to partake of the meals I enjoy without meat. I wanted a PoBoy whil","useful":1,"cool":0},"UAsvVB3jyREbPy9dxx0rMQ":{"text":"Looking for vegan option while in NOLA for NYE weekend. Stopped in for a Poboy. I ordered ","useful":0,"cool":0},"1wjJK6nSxZhOmdtTiMREjw":{"text":"Looking for some non-traditional poboy options? Look no further!\n\nKiller Poboys has your t","useful":1,"cool":1},"nVbxO-Kl0gMheCraJ9gEEw":{"text":"In town for a work conference, this was a great place to grab lunch. Off the beaten path a","useful":0,"cool":1},"Gckn_rJNUJEPv-d8TRy_og":{"text":"A delicious shrimp po boy here!  While I love the traditional  po boy sandwich,  Killer Po","useful":0,"cool":0},"CQrmwxGUnXFvo1VE7jGaJQ":{"text":"I would eat these everyday if I could. Not your traditional po boy, but a million times be","useful":0,"cool":0},"yThJyUIxQ0-1lIQyRz8O_g":{"text":"I had one of the vegan poboys and it was fine. Decent flavor, but the bread was a little s","useful":0,"cool":0},"0zks4UxZQu_S5PQaKR4wrg":{"text":"Tried the grilled shrimp po'boy and something tasted gross in it. Lots of good reviews for","useful":0,"cool":0},"VWD4NuXx-NiMl0uelFXYHg":{"text":"No your typical poboy. Very gourmet. No fried. So much vegetable the bread was soaking wet","useful":0,"cool":0},"79Y10rjLd6n6Qw3qUILlPg":{"text":"If you want opposite of a po boy this is your place. Mierda ala mode. Though the almond so","useful":1,"cool":1},"LW6LJepZb3-nMcy44bUWRw":{"text":"First time in New Orleans me and my girlfriend had to try some poboys here. Customer servi","useful":0,"cool":0},"WLvppLisWrqncHxOMUt0DQ":{"text":"PO Boys were great. Good craft beer available. Looks scary in outside and inside as well..","useful":0,"cool":0},"hulvrbB3dVDh2wHiXaVZLA":{"text":"Read many great reviews and decided to have the shrimp poboy. While eating, the shrimp man","useful":0,"cool":0},"UXav-qiNiTwZLpSGXJPtSA":{"text":"So definitely not your traditional\nPro boy, but I like bahn mi sandwiches so I figured thi","useful":0,"cool":0},"MMWx9kbDbaktwP0LM0a_dQ":{"text":"Best Poe boy I have ever eaten. I had the Collie flower and my day had the shrimp Po boy a","useful":0,"cool":0},"2L4GAVXR-VqdWmmJggZ66A":{"text":"Killer Poboys is a great spot to pick up a poboy and a beer! We headed to this location ve","useful":3,"cool":2},"XDs2r-PNXTwFJAlep6a1Ug":{"text":"In the French quarter it's hard to find places that really please vegetarians. Killer po b","useful":0,"cool":0},"3h-uUBYASjS4D1KW0Xo1hg":{"text":"Good food great service. My brother decided to try the curry goat poboy special, but didn'","useful":0,"cool":0},"qCCKfRUBOuWBz190fphVWQ":{"text":"Chef Cam Boudreaux is opening a second stand-alone Killer Poboys a block and a half from t","useful":3,"cool":2},"Ba1Rkfe_tatbKzERoLAZqA":{"text":"Best Poboys you could probably get around here. Great vegetarian options for any vegetaria","useful":1,"cool":1},"s0QUySYmnsB2e2fair8OtA":{"text":"Love a good hole-in-the wall and this place didn't disappoint. Had barbecue chicken and po","useful":0,"cool":0},"Bwfo5DXUuOjVMWob2z2lTg":{"text":"First let's start off with when you walk up you see the logo and you know it's on your abl","useful":2,"cool":0},"3VFEPdFAlrwaqcJ0-yKA5Q":{"text":"Stopped in on my birthday for a sandwich while visiting from Hawaii. I'm dairy free and my","useful":2,"cool":0},"0jO7ZCcyHCFOMYmja8NIGQ":{"text":"This is a vegetarian review. My first poboy and it was very disappointing. I got the sweet","useful":0,"cool":0},"_Qx04GqMUsFQM6DpVU1b1g":{"text":"The seared shrimp po boy was very good. They tell me the shrimp are brought in daily and I","useful":0,"cool":1},"2w8XY-BLD5YsVuh6GoldpA":{"text":"Vegan and vegetarian food that rocks my soul! The groans were amazing. A nice selection of","useful":1,"cool":0},"y88sciQ1aTC6cI6Ay4hkkA":{"text":"I've heard a lot of people rave about these poboys but I was not all that impressed. I had","useful":1,"cool":1},"4HGJAhy7-sZQ5d9B42mveA":{"text":"Decent location. A good amount of seating. I tried the vegan cauliflower poboy. The taste ","useful":0,"cool":0},"2BMfdBRmk4fXzNUUfV3eiA":{"text":"I love this place! It's a tiny whole in the wall with no real signage other than a wooden ","useful":2,"cool":0},"mxckCkQgf6p6KD5h3sbltA":{"text":"Went to Killer PoBoys on Dauphine for lunch thrice while in Nola for work. The PoBoys here","useful":0,"cool":0},"AynY1g8fQqE8DKFZmNvk7Q":{"text":"Seared shrimp poboy. Major banger alert . If your starving you'll be content but it's perf","useful":0,"cool":0},"115kbi4o_b5yBw4Z274X7A":{"text":"Great place for a poboy! They even have vegan options for those who want to experience NOL","useful":2,"cool":1},"0padcxlRt32x7GpqMBI7Tg":{"text":"Came on a Thursday at 3pm and there were only a few tables filled in the restaurant. Walki","useful":3,"cool":2},"JHniPsyOLeMdPoam2xfapg":{"text":"My first poboy in NOLA! The service here was great, and the lady at the front was very nic","useful":0,"cool":0},"DsBYVKcE4-MwfxLXLCnDlw":{"text":"Best meal I've had in NOLA. In a sea of fried foods this sandwich shop was a breath of fre","useful":0,"cool":0},"J6UeojgtoY3JChrqSuhbWA":{"text":"I'm still a little unsure of what exactly makes a poboy a poboy and not a sandwich, but I ","useful":2,"cool":0},"ywO4JtgRdzK4kjWx7RSMZg":{"text":"Small and not flaky enough, seems more like a vegan and vegetarian option heavy poboy spot","useful":0,"cool":0},"lnLT2Cj1RjP5tlXVP2bg8g":{"text":"Wow. Amazing sandwich. I've been just once and will return. I got the shrimp and everythin","useful":3,"cool":0},"nmPpgiK4aaDIlK_wRW67QA":{"text":"As Advertised. Killer Poboys and sides were awesome as well. Will definitely eat again on ","useful":0,"cool":0},"Bbil2jXcHUvBSHECz8_X4g":{"text":"This place is no frills.  I was not a fan of my shrimp po-boy but maybe po-boys aren't my ","useful":0,"cool":0},"_A-etAQBQ1N-7Bm5sQcfBQ":{"text":"Great taste, just not enough. I was told by a friend to come here, had to walk super far s","useful":0,"cool":0},"ng4ED6Vi9UC-dDV1qzBapQ":{"text":"Great food. Good vegetarian/ vegan options. Highly recommended if you're visiting NOLA.","useful":0,"cool":0},"sJiEKRLFbHyOSBJozGr5WQ":{"text":"Being a vegetarian in NOLA was no easy feat! Luckily, Killer Poboys offered a delicious al","useful":4,"cool":1},"OenJozEjyMCux54qvTop_g":{"text":"Found this place on Yelp while visiting NOLA over the St. Patrick's day weekend. \n\nIt was ","useful":0,"cool":0},"h4K5m5dNJLyDUbwkZa4mcA":{"text":"This was our 1st choice when it came to po boys. All the yelp reviews on po boy in New orl","useful":0,"cool":0},"JHuyJNAw84ckom8-WC7_Sw":{"text":"I headed here one Thursday a little after noon. It was PACKED. I think pretty much every c","useful":2,"cool":0},"HeFTtVV9BXBS_WbnPt_57w":{"text":"The po boys here are true to their name. They absolutely #slay. They are so rich and tende","useful":1,"cool":2},"kaBAfj7e3FKyLgZWb9gXyw":{"text":"Their cauliflower po'boy IS SO GOOD!!!! my husband and I got their sweet potato one too wh","useful":0,"cool":0},"Ii1JVJqrDtXPqa0Eb08TYA":{"text":"Isn't it lovely to eat Poboys that seem healthy? This isn't Killer Poboys. It's good livin","useful":1,"cool":1},"yQRLFlru_hGkU0miYrGnGw":{"text":"As an out of town or I can tell you that this food is delicious and unique to New Orleans.","useful":0,"cool":0},"XqCH8lYqIC447CViQCKlbg":{"text":"Got the chorizo poboy which was Good and unique.  It seemed pretty simple to make yourself","useful":0,"cool":0},"RowBu_TyWbdvqDjOVylhfg":{"text":"My first time here, and it was recommended by many friends who have visited NOLA. It's mor","useful":2,"cool":2},"I6V3_qelswXLl-EwnRUcdw":{"text":"I went yesterday with my two sons. The place smelled bad ( strongly fishy) and the tables ","useful":0,"cool":0},"18BAFGV81xVEyks_8Ocr-A":{"text":"If you're willing to sacrifice the authenticity of a \"classic\" po' boy for something a lit","useful":0,"cool":0},"J1ABru6a1EDaqtd-ZBAoBQ":{"text":"Cool little hole in the wall with a calm, chill vibe and surprisingly sophisticated food o","useful":1,"cool":1},"sZCZG1ov1GTvvI_ZFQmTZQ":{"text":"Totally amazing... The staff was so friendly and so helpful! We tried the shrimp, pork bel","useful":0,"cool":0},"mm8LWEIRq1yVrDYF4NketQ":{"text":"Not your Pawpaw's poboy shop but who cares. Even us locals like diversity so I don't think","useful":6,"cool":2},"ADEiW7RkV4JJ2OKkeTPUGw":{"text":"This is seriously good food.  It was our first time here but the lovely young woman at the","useful":0,"cool":0},"PohQ1DcI2FzWQ-8rBK7akA":{"text":"I ordered the seared shrimp and pork belly poboys  and both were delicious. I only wish th","useful":0,"cool":1},"gOY6A05kXhRdOw4QG3bgOQ":{"text":"Not KILLER  at all, shrimp is grilled instead of fried which was fine bc we knew that ahea","useful":0,"cool":0},"Pk5oilRBbM86AzMMVkAdFw":{"text":"This little hole in the wall slice of heaven with super awesome staff that seem to really ","useful":0,"cool":0},"ZBdmw38wfBgYmJXl7UOQfw":{"text":"First time and awesome shrimp poboy.....fresh bread, shrimp fresh and plentiful but the si","useful":0,"cool":1},"98GascB9ISM-_9aMO8jhRw":{"text":"Husband & I split the Seared Gulf Shrimp poboy...it's been a week and I can't stop thinkin","useful":0,"cool":0},"PuNIB0TIyTN_xtxn9EY6dg":{"text":"Unbelievable!!! Glazed pork belly was amazing. The staff was so great. The truly are an ex","useful":0,"cool":0},"ko5e30T9HPaBPHMvr_clTA":{"text":"Come here for tasty and innovative poboys! We enjoyed both the glazed pork belly and seare","useful":1,"cool":3},"0Uf9maYPkjbYZ8tyG8AAPw":{"text":"I'm not sure what I was expecting when it came to Po'boys. Maybe it was something massive,","useful":2,"cool":0},"iaARXIczy3WQ3wax58VdYg":{"text":"Killer Poboys has non-traditional poboys that sound pretty good, but they can be hit or mi","useful":0,"cool":0},"iX5MJY7Y202r6VHMvqikUg":{"text":"Poboys and New Orleans... that's just a given aside from the amazing culture and scene of ","useful":11,"cool":8},"R87NJivdzsJ9P-t6nx0PVw":{"text":"Maybe Killer Poboys isn't the best place to try a NOLA poboy for the first time. But I cou","useful":2,"cool":0},"Afy-J1M22XyxoK2DVheT6A":{"text":"Good. Easy order. \n Spicy potato salad. I ate it. It was good. Shrimp po boy and carrot sl","useful":0,"cool":0},"qfR1Gk_6Dq5GSerWXNz33w":{"text":"Found this on some sites of places to try. It was ok, but nothing to write home about. Fir","useful":0,"cool":0},"qjvF37E86DBYgIXh0HKM5w":{"text":"Extremely disappointed in the Ham & Pimiento Cheese Poboy. Apparently the chef has decided","useful":0,"cool":0},"GeNnmOvR8uhnCBghqux6sQ":{"text":"4 stars because my husband REALLY LIKED his pork belly po'boy. I got the shrimp, and being","useful":2,"cool":0},"8RR1Pf1LfCjxgox8QEePDw":{"text":"It's okay. Not traditional poboys but a \"modern\" and \"fusion\" take on it. \nWe had the pork","useful":0,"cool":0},"VAYSIncFblEBkvVn_WoECw":{"text":"Of the several poboys I managed to eat in the 4-day period I was in New Orleans, Killer Po","useful":4,"cool":2},"Y3luLhoakSKoD1vcOJAfzg":{"text":"We were headed to Acme but the line was long and I was hangry. I did a quick search and fo","useful":0,"cool":0},"uM4cbcdRPs0u0ka1UtGCQQ":{"text":"When looking for Vegan inspired NOLA food I came across this spot and boy am I glad I did!","useful":5,"cool":4},"eNqM_tNJMi9mooLRBxa-Wg":{"text":"Good news Killer Poboys fans! Now you can get KPB in two awesome spots. The old location i","useful":6,"cool":2},"eQ1L7MU8kDdHNE1s1Y0UsA":{"text":"Roast beef sandwich had no \"green beans, pickled peppers or horseradish\" just dry roast be","useful":0,"cool":0},"KWxwWrtRB53FfbOpzNPO5w":{"text":"I had po boys from 3 different places including here, and if you've never eaten a Po Boy a","useful":0,"cool":0},"lyi14UKEdZdN1kIGl8NWlg":{"text":"Best Po'boys! Wow I'm so glad we stopped. Don't hesitate to try this place out, you will n","useful":0,"cool":1},"KyyjOWZoqSoIT62jW5d9uw":{"text":"they aren't f**king around here...these are excellent .. I can't even say sandwiches becau","useful":0,"cool":0},"biUxzF4U3gXXO0-TrSpaew":{"text":"If you're deciding between the seared shrimp or the glazed pork belly, get the pork belly!","useful":1,"cool":0},"FMAJOwe1SPJC2ubTl9hbRQ":{"text":"I totally walked past Killer Poboys while trying to find it. There is a small sign so keep","useful":3,"cool":2},"_nJ4b6DQyEqVQJD7oxWT8A":{"text":"I'm not exactly sure what makes a sandwich a poboy rather than a sandwich, but having shri","useful":1,"cool":1},"ZG8_uWlEtL3rNCzigQ7qlw":{"text":"Not all the vegetarian options are listed on the menu, but they have plenty of them availa","useful":0,"cool":0},"aDLUOgIV0MrQcoiVs-ODuw":{"text":"Nice Po-Boys in town.  Crispy bread and we tried seared  shrimp.  Sandwich comes with shre","useful":0,"cool":0},"0a0RyH8KfrM7bq8VeSi4tA":{"text":"I've been coming to Killer Poboys on each of my NOLA trips for several years starting when","useful":0,"cool":0},"k5o9EbzY2xbWHYFKd-uMWA":{"text":"Great variety in modern type of po'boys, ie vegan etc, but lacking in the full flavored So","useful":1,"cool":2},"ixAz30NZQp3LwZSabpmIAw":{"text":"Killer Poboys is the spot to go when you want fantastic Poboys near bourbon st, but not TO","useful":2,"cool":3},"dNiV5QtSE5iFsT5vms_afg":{"text":"We came here based on positive online reviews. Both of us ordered the shrimp po boy. It wa","useful":0,"cool":0},"P0rnadl0LqxQaD7x5X6hOQ":{"text":"I wanted to give this place 5 stars because the lady at the register is EXTREMELY nice and","useful":0,"cool":0},"RvVv-RI5n5BbgI4MXJ7IGA":{"text":"Had the seared shrimp Poboy. As expected, it was delicious. The shrimp was cooked perfect ","useful":0,"cool":0},"SwCOpAYI4WjH_hjkcd7jlQ":{"text":"Vegan po boys. What more is there to say? \n\nA solid sandwich nicely spiced. The potato sal","useful":0,"cool":0},"KTq10yimkaFO0qfWRVVylA":{"text":"Vegan review -\n\nHad the sweet potato and greens po' boy and it really was good. It could u","useful":1,"cool":1},"mJAv28nkWI6-j5yYoyBZKw":{"text":"Came here with much anticipation with try their unusual but delicious sounding po boys. We","useful":0,"cool":0},"2RmABC2mX4owlV49_fV0xg":{"text":"Super good sandwiches. This location is open longer hours (and also on Mondays!) than the ","useful":3,"cool":1},"67QqKRUycKAm4QCit0tXcw":{"text":"Make this one of your poboy destinations while in NOLA. \n\nPOBOY: Ordered the glazed pork b","useful":2,"cool":1},"DATwq4DkXlzIq0Je-SelyA":{"text":"2.5, but rounding up.\n\nI wanted a \"killer po' boy\" - but what I got was far from what I'd ","useful":0,"cool":0},"T66f84l2stPkv4VKplD8Sg":{"text":"A little disappointed with my choice here.  My boyfriend and I had great poboys all around","useful":1,"cool":1},"a3Mzw44GMorl60Ym0Duddg":{"text":"3/5 Solid stars\n\nA bit disappointing. It tasted like a banh mi but not really...A banh mi ","useful":2,"cool":1},"H2iqPkH2SbDBuvHEJ5erpg":{"text":"Holy Jesus....this place was awesome. Almost passed it up because we didn't see the sign b","useful":0,"cool":0},"iEkABlDYH8SCUgj3V6O82g":{"text":"So delicious! I love Their shrimp poboy and vegetarian options! Definitely a friendly atmo","useful":0,"cool":1},"t3drkaN49tVIe6IxC_phdQ":{"text":"They are strictly following the COVID guidelines to keep everyone safe. \n\nOne you enter an","useful":1,"cool":1},"0YvGZSNstVc9xuXAVGEfJg":{"text":"We got the sweet potato po boy with collard greens and a black eye pea / pecan spread.  Al","useful":0,"cool":0},"VaCIuL2P0FKcAVhTMvJqlw":{"text":"Hate that Im writing this review so late but was out in NoLA for Mardi Gras and stumbled u","useful":0,"cool":0},"yXs5CRS5_n7BnA9-PkekyQ":{"text":"Great place. They had a tv where o watched the champions league final. Their staff is supe","useful":0,"cool":0},"r5KoPt6P0mtQBlUBBc8r8w":{"text":"I am so glad I visited Killer PoBoys, I tried the Seared Shrimp and it was absolutely sens","useful":2,"cool":1},"aXwpWPRArQYaeaI7yCABlA":{"text":"AMAZING!! Seriously, one of THE BEST sandwiches I've ever had!!!!  We've been twice in as ","useful":0,"cool":0},"y1HVaIwlREfsi6eUduS-4Q":{"text":"Meh, I wasn't that impressed. First of all, it's expensive for what you get. If the poboy ","useful":0,"cool":0},"rQxP4SqVUEvRsHLWdCU7hw":{"text":"Vegetarian PoorBoy was great! Very flavorful and fun. I was so happy to have this option. ","useful":0,"cool":0},"gZtOifH3-wbGB1mS0OhVFQ":{"text":"After a long day of walking around the French Quarter, nothing hits the spot more than a p","useful":0,"cool":0},"_HYMM7-vJyfmN6JZu3Pn_A":{"text":"Pork belly. Enough Said\n\n\n\n\nFirst Po Boy I've tried while in NOLA and I would have to say ","useful":2,"cool":1},"Q9WhwFahV9clIbHLD8E2LQ":{"text":"This place was just okay.  Poboys aren't to die for.  Had the pork belly it was sweet but ","useful":0,"cool":0},"bo3Sob3E94H8W6CKqEegGw":{"text":"I desperately needed a bite to eat before a gig and needed something fast, so I thought I ","useful":1,"cool":0},"BAJ86e-wr5eTN_BDAD7tCg":{"text":"Delicious Sweet Potato Poboy! Awesome vegan and vegetarian options! Clean open space with ","useful":1,"cool":0},"vZLrQBEiL8KmktnjLS60pg":{"text":"Wow.\n\nWhere to start... the first bite in the freshly baked bread has the perfect, crisp, ","useful":0,"cool":0},"ZcOQOsxlfB3Bb82YNNQSMg":{"text":"Don't get me wrong, fantastic sandwich- I had the ever popular shrimp one. Cool fusion opt","useful":0,"cool":0},"ygnvpfLyjpE078ndKZTl0A":{"text":"Wish I could have the recipe for the smothered greens here because they stole the show.  B","useful":2,"cool":0},"y1erjukZYZd1xw8vvi_XXg":{"text":"We got this rec from a nearby concierge when we asked about veggie friendly places! I spli","useful":0,"cool":0},"PdRuNF83NPW0cUIhH7gkfQ":{"text":"This was my first Po'boy experience and this place got me hooked! Just don't go here for a","useful":0,"cool":1},"0yED48bOMWYX6Dprrj2emQ":{"text":"Such a simple thing a po boy and this place does a hell of a job changing a traditional po","useful":3,"cool":3},"-2iJ61ltPyxIXnux1KP5Pg":{"text":"I got the grilled shrimp poboy but I wasn't a fan of the flavors. The shrimp had a great j","useful":1,"cool":0},"90fpjLUL87BZNnLAYr0_Ug":{"text":"I came to this Poboy location because I saw a lot of good reviews on Yelp, but unfortunate","useful":0,"cool":0},"akqczH8McrLPRDaufOAuqQ":{"text":"This place is great if your a hipster. It felt more like a sandwich shop in Denver. The fo","useful":2,"cool":1},"-oqo20lNxsM7KDj3CB9WkQ":{"text":"I really like Killer PoBoys.  This is my first time at this location as I usually visit th","useful":1,"cool":3},"EDq6riaF3OTmUv0QVshGDw":{"text":"This place is awesome... the sandwiches are amazing!  David was super cool ... thank you f","useful":2,"cool":1},"mshySZW_4Sh-IAX3qEpQQw":{"text":"Never would have thought of a po-boy with sweet potato, braised greens, and a black eye pe","useful":3,"cool":0},"4-JYb0Hhg73-esPll5dhJg":{"text":"It was a good sandwich, but to make the shrimp po boy so much more expensive. WHY THOUGH? ","useful":2,"cool":0},"KIaMCbKuRUxhUjwNIENNIQ":{"text":"OMG! This place is absolutely amazing ! Everything is made from scratch including the aiol","useful":1,"cool":0},"0w3wxzKoEqPbKlJ_CuXDSQ":{"text":"My husband and I were in NOLA on business recently and he took it upon himself to feed me ","useful":1,"cool":1},"clpYEFk2S-mEvXDTyP1tMw":{"text":"covid review:\n\nsadly, the original killer poboys aint open right now, but dont fear - this","useful":3,"cool":4},"lhgJelptPa13qlvwxIfZUw":{"text":"We saw a line and luckily didn't turn around - the line is people waiting outside the muse","useful":0,"cool":0},"q3rdUuuus95oLoOSIItw2A":{"text":"My husband and I split the pork belly po' boy and had a couple Mexican Cokes and a bag of ","useful":0,"cool":0},"xsKEpYQGnMVVcB13CtetbQ":{"text":"Needed to grab some breakfast quick and head back to the hotel. Sent here on a recommendat","useful":0,"cool":0},"Oin-Hvd8huNfWwl2eLMYcg":{"text":"If you are a vegetarian, you will love their cauliflower po-boy!!! We also ordered the swe","useful":0,"cool":0},"AYiIpqhGCYxM01lvl2Nv_Q":{"text":"I stopped at this place located in the back of a bar based on the good reviews. The locati","useful":0,"cool":0},"2mVCPH2f7qvxP96-SgwLZw":{"text":"Both the shrimp and the sweet potato poboys Were excellent. Ate at the bar. Great vibe. Gr","useful":0,"cool":0},"adDI0XRbG7UPl4uG6VA6Fg":{"text":"Very Good! Seared Shrimp is soooooo fresh! The Braised Beef Debris was even better to me. ","useful":0,"cool":0},"czfJgXPcaiS_qcccbzyX0w":{"text":"My poboy was soggy and gross like it'd been sitting in its own juices for 15 minutes and t","useful":0,"cool":0},"R9hFzSp69x1GfabMgU_ZnQ":{"text":"This is truly a po'boys restaurant for the most part.  When I ordered, there wasn't much t","useful":1,"cool":0},"5WtU2cVQB3xATngG6HsvPw":{"text":"This is a great place for some very \"out of the ordinary\" Po'boys.  You won't find any of ","useful":3,"cool":1},"ZbyfGur7ibmLJMrVarfzdg":{"text":"It's been a few years since I've reviewed this exceptional French Quarter poboy shop.  It ","useful":20,"cool":23},"VZ-yEhcthOoqGet9qmaefA":{"text":"I'm glad I found a place in New Orleans that was veggie friendly. They advertise it and it","useful":0,"cool":0},"PrVLw1c-1nuM2RS1LcgzaA":{"text":"Awesome hole in the wall Poboy spot off the beaten path in downtown NOLA. \n\nI came here sp","useful":5,"cool":2},"xDD6eGVLfBrYOT12LKJsYw":{"text":"Really good pizza-boys here. Most recently I had the beef debris and I after finishing I i","useful":0,"cool":0},"MBRV2qe-NV1AUZW5WtHnLA":{"text":"I was really disappointed with my experience here. Everyone kept on raving about how this ","useful":1,"cool":0},"ZLuzcV1B0syBJwBOjbytNw":{"text":"I went with what I assume is the popular option - the seared shrimp po boy. It was really ","useful":1,"cool":1},"NCFfTQVARyfo6LJ_sPvQdA":{"text":"I was in New Orleans for a business conference, my first time back in Nawlins since 2001! ","useful":0,"cool":0},"m92CloxAhMsOXwqBVfFQYw":{"text":"The shrimp poBoy was the best I've ever had- absolutely delicious & flavorful! We also ord","useful":1,"cool":0},"cf66B_u4sdyAU0vG8RwzXg":{"text":"Super nice service and the name says it all. Killer Poboys. Non traditional menu and plent","useful":0,"cool":1},"GNIY8FP046ZyHSBt0e9bOQ":{"text":"Amazing Poboys\n\nSuper cute bathrooms\n\nWhat more could you want from a po boy shop?\n\nThe pr","useful":4,"cool":2},"lAsdUWKPUa1rRjiEC3jy6Q":{"text":"BBQ chicken confit poboy was to die for! Best Poboy I ever had! I would eat this over and ","useful":2,"cool":0},"BRh-zs7AW7AOX5vwvfrANA":{"text":"We wanted to grab a poboy from here since they have unique options compared to the basic P","useful":0,"cool":0},"wTExWHsMNdqHAkyRcimBXg":{"text":"This place was so good that my friend and I came here twice during our 4 days in NOLA. We ","useful":0,"cool":0},"D4NNz_X5beo7txFOoaXHAg":{"text":"Delicious non traditional poboys. We had the pork belly po boy, which was great. Definitel","useful":0,"cool":0},"zvwvNfRiU8lP_QoIx_kL5w":{"text":"Had to try this place after seeing the reviews.  I had the seared shrimp poboy and a side ","useful":0,"cool":0},"IRm5ixZG9Fn9G4MlIN-BCA":{"text":"Had the shrimp poboy and potato salad. Food tasted good but you only get about 4-5 small s","useful":0,"cool":0},"0Xvxzy475U-S7h5HzlkL_A":{"text":"Maybe I was expecting too much, but I just really wasn't that impressed. I came on a weekd","useful":7,"cool":3},"g7rY9T45Om_xKZQfgSUluw":{"text":"Killer Poboys is BOMB. They're conveniently located in Erin Rose (super fun local French Q","useful":2,"cool":2},"J-_Et6I7XnhNQwqu5cD3rQ":{"text":"Fantastic little spot. Good vegetarian options and very kind an welcoming staff. I thought","useful":1,"cool":0},"XMg1LSFAevvjntWvf2dmug":{"text":"After drinking on burbon this was the closest spot offering something vegan. The cauliflow","useful":0,"cool":0},"G-uyDKnye4ZYkmT3Ol4Sgw":{"text":"Really enjoyed the grilled shrimp poboy.  They pack a generous amount of shrimp in there. ","useful":1,"cool":0},"JE2KDGkg0OCWWGEI-J9Xqg":{"text":"Fantastic poboys with Asian and French influences; killer is quite accurate. They have Cov","useful":1,"cool":1},"8SnQxhAIusapJh4Uyo7gZQ":{"text":"A pretty lowkey and smaller place serving a few varieties of po boys along with a few side","useful":1,"cool":1},"GqcDEkbQ2qo-cc5jT8-MFA":{"text":"For our first trip to NOLA, we knew we had to try some poboys. After researching, we were ","useful":4,"cool":1},"0ItZ5arV-LiPd3i16Spkcw":{"text":"Had to try a poboy in NOLA and what a fun place. Nothing fancy just great food. Had the se","useful":0,"cool":0},"0k6ESuSFDz-ZQFnXCMhVHg":{"text":"I was underwhelmed by Killer Poboys' grilled shrimp po boy. I expected something much more","useful":0,"cool":0},"wznJGXNNCrzr2YXA037wvg":{"text":"After reading all of the amazing reviews of this place, I decided to check this place out ","useful":2,"cool":1},"1ZUyri0SbBgJ1YHtK8BXbw":{"text":"Ordered the cauliflower po'boy. It was MAAAAD good. Super quick as well! Right now for pic","useful":0,"cool":0},"VhjYsjrA0BDAa_C-uLZpaQ":{"text":"Fresh ingredients with lots of unique flavors. We had the pork belly and seared shrimp pob","useful":1,"cool":0},"uoxgLGRhuYzsoQmyPfvlJw":{"text":"Excellent choice for vegetarian! They have solid options for vegetarian, vegans or just a ","useful":0,"cool":0},"KF2eJmCTcZgYPpB9cCQ-KQ":{"text":"The shrimp was so good!! Flavor on the seared shrimp was delicious and I love how soft the","useful":0,"cool":0},"eDx2K5CyigHgQQIYfjOaVQ":{"text":"Prior to traveling to New Orleans, I did a deep dive into its food history and the must ea","useful":5,"cool":2},"JItCH3-ftPdnBKjvncCVlQ":{"text":"Two words: shrimp poboy! Really good with the daikon and fresh toppings. A little expensiv","useful":1,"cool":1},"DmShJ3PK5P2D_-GMm43tOw":{"text":"I had the shrimp Po boy. If you live in New Orleans and want a change of pace I'm sure thi","useful":0,"cool":0},"u6dCjl4_FuW9uph0MC5E_w":{"text":"So hands down this is a MUST try in NOLA.  We went to the Po Boy Festival and tried so man","useful":3,"cool":3},"AZxFFJmYbnh9ve3jDpGN2Q":{"text":"Thoroughly enjoyed my cauliflower poboy- I would definitely recommend getting it on the po","useful":0,"cool":0},"NxLyUVcA5bvkO5kfWeQxMg":{"text":"The shrimp po boy I ordered was more of a Vietnamese banh mi. I think they need to rename ","useful":0,"cool":0},"C7b4j5mt5bOpZjsvMnShCw":{"text":"My first real poboy experience. I'll say this, of all the places we ate on our vacation, t","useful":1,"cool":0},"iU6ggZwpHNUfZ6Vd5ysu_Q":{"text":"Visiting Nola for the first time, I wanted to try as many local non-touristy places as pos","useful":2,"cool":0},"aY5O3isDJtUz3jYnZa62BA":{"text":"A CAULIflower po boy for the gal from CAULIfornia!\n\nKeep your eyes open for this place as ","useful":169,"cool":164},"0Kjxqr-eSgH0vxEnnOQFCw":{"text":"Really yummy! I had the Gulf Shrimp Seared poboy and was really happy with it. Much lighte","useful":1,"cool":1},"ILAdphH6-9amNowNDWq3KA":{"text":"We were recommended this place from the hotel concierge at The Roosevelt where we were sta","useful":1,"cool":1},"RxW-EbGqOZON1WhXfo6MyA":{"text":"This was more like a banh mi than a po boy? I'm really surprised by how highly this is rat","useful":0,"cool":0},"h29F7JpJl_5ewSL0M3PHKA":{"text":"Best poboy in the Quarter, hands-down!  You'll find way more creative chef-inspired option","useful":1,"cool":0},"GIdx4C6CNKQBmBEioeURRA":{"text":"Ordered a Seared Gulf Shrimp po boy that contained coriander lime spice, sriracha aioli, h","useful":0,"cool":0},"an5e9TDGC4w4ApXkhfU8aw":{"text":"Amazing flavors and textures in their po boys.  The shrimp one is so delicious.  Not tradi","useful":0,"cool":0},"wLbaeegv3jg57A1h41_r_Q":{"text":"Untraditional po boys with a twist, the music is also on point  joy division, the smiths, ","useful":0,"cool":0},"4GIjrqAcjo-I67FXMnevtQ":{"text":"Was looking for a quick vegetarian meal near Bourbon Street and thankfully came across thi","useful":2,"cool":1},"5rppt08HDv9H7grBtYBwtQ":{"text":"I think this place is ok! I like the hole in the wall feel but I felt like the poboy was p","useful":1,"cool":1},"1RAxZQm49GshGemMmYCC1g":{"text":"Really casual place with delicious poboys.  I had the cauliflower & truly enjoyed it.  My ","useful":0,"cool":0},"pLtF61M7oX5FEFDs0PwIvg":{"text":"This was phenomenal. Just what I was hoping as we looked for a vegetarian friendly hole in","useful":0,"cool":0},"bqcVC_GEXfOP6IL6x24Wcg":{"text":"As my friend texted when I sent her a photo of my pork belly sandwich: OMFG.  This place. ","useful":2,"cool":0},"v68-dAGy2c5ZwMox0WmTMQ":{"text":"If you're looking for the traditional poboy, Killer Poboys is probably not your desired ex","useful":1,"cool":1},"zzcL6aA8tmxgYAhoglIekg":{"text":"Kind staff, delicious vegan options, hometown ambience. Worth a visit. I got the cauliflow","useful":1,"cool":1},"8gLKcpyaVQFKr2b1u2cMpg":{"text":"I'm so glad we stopped in here before we left town! Definitely one of my favorite NOLA spo","useful":11,"cool":9},"z6GCg6rXPHBtB3E5NkDmoQ":{"text":"Heard a lot of good things about this place but honestly just was not impressed. The flavo","useful":0,"cool":0},"aNShPTURqGUNRjk8KFfIhw":{"text":"Ordered 3 sandwiches and only 1 was edible. The Braised Beef Debris was waaaaaay too salty","useful":0,"cool":0},"zQsK9mE8CoX91plooulJFg":{"text":"Best poboys in town, not just for tourists. Not traditional New Orleans selections but the","useful":0,"cool":0},"cAXeSDzT0nc1qVMEBZNv3A":{"text":"I am giving it five stars, because if you like Poboys, this place is amazing. Inventive fl","useful":0,"cool":0},"3T9qVmO7J_hfK65dPEgpcw":{"text":"We got to try 3 of their best sellers (the shrimp, belly pork and braised beef poboys). Th","useful":0,"cool":0},"FUTin9zPyn_BPuiXblhVgA":{"text":"My wife and I stopped in for lunch and were both very pleased with the food.  There were s","useful":0,"cool":0},"HRlprO8qHOyl3H1S4p1TtA":{"text":"Keep your eyes out for the sign with the skill and crossed bread. Really delicious pork be","useful":0,"cool":0},"mRgkl9VlXEO66xtb5rIUdQ":{"text":"The staff is very friendly. Also the greens are amazing & a great cure for a hangover!","useful":1,"cool":0},"idecCqFS7HkmW65LMhEnpw":{"text":"The sign says \"internationally inspired poboys.\" \n\nLots of choices to pick from including ","useful":1,"cool":1},"gcRQuB13hj90w77T55BMpg":{"text":"Outstanding Po'Boys, a NOLA spin on the sub sandwich. I've never had a shrimp one that was","useful":9,"cool":4},"-AOqPhsR2cT45IEfFEmeVQ":{"text":"Good ideas, poorly executed.  While the concepts behind the menu are interesting and creat","useful":0,"cool":0},"4UYSCgOcwyJUHAjaYZWo3g":{"text":"Wow! Wanted a po'boy because we hadn't been to New Orleans in ages. Really glad we opted f","useful":0,"cool":0},"MIq-Mr40BXSUleO8qD7Fuw":{"text":"Seared shrimp po boy was soooooooo good. Best po boy I have had in a looong time. FYI thei","useful":0,"cool":0},"olWp8fjup9Q8KNjrPdIaUg":{"text":"Giving 4 stars because 3.5 is not an option. The accoutrement to kp's is great. Service on","useful":0,"cool":0},"jCxB1ltkUpxAlKFak_WuXg":{"text":"I have never had a real po'boy so perhaps my taste buds are not attuned but I really enjoy","useful":1,"cool":0},"Xf6PzF0nUPsTOZRrg6VjVQ":{"text":"We had the seared shrimp poboy, which was delicious and every good thing everyone has writ","useful":0,"cool":0},"Qi-AQuphOPvkSWbYStHW9g":{"text":"Best seared po boy I've had ever!! Love that it's a bahn mi style as well. Very tasty and ","useful":2,"cool":1},"UVJQCSgng4TLscpzevdeIg":{"text":"Really good food and a great price!  I loved the sweet potato po boy, it was sweet and sav","useful":1,"cool":0},"riZdXONup8pZhnYWtDBvxA":{"text":"I made landfall in this city at noon and was stuffing my face here by 2:30pm. No time to w","useful":5,"cool":3},"fb_lxOaTSLu8zFxDQmxwcw":{"text":"This is not your typical Po'Boy and that is absolutely ok with me! This is such a cool pla","useful":2,"cool":1},"INsBTWSrCBWYASuIFZrbNg":{"text":"Such a far cry above the rest of the half-@ssed poboys in the Quarter. Fresh ingredients a","useful":0,"cool":0},"2VboyJnOv5ybnCj_y6BXrg":{"text":"Omg. We were visiting from Chicago this past weekend, and neither of us had ever had a po-","useful":1,"cool":1},"lZ0FSHwt60rjsPL630k95w":{"text":"Came for the glazed Pork belly and seared shrimp and was not disappointed by either. Nice ","useful":0,"cool":1},"cEg3z5eXD39eiYpiFn7Pyw":{"text":"I appreciate that there are vegan options but they didn't meet my expectations. For a po' ","useful":0,"cool":0},"igZ_noWtIcU6iXQkNijI5g":{"text":"So we came in here expecting to find the pork belly poboy on the menu but they weren't ser","useful":0,"cool":0},"Js7zKqKlTQWaqBmu2hKHQQ":{"text":"The best! Got the bbq chicken, spicy, but flavorful- and I don't do spicy stuff! So good! ","useful":1,"cool":0},"WgNzSD7GFWGqXyqhkuGglA":{"text":"Decent, casual lunch option in NOLA. We satisfied our po-boy cravings in the midst of day-","useful":30,"cool":26},"DoBIA-7VYGu9OiEZDuKttw":{"text":"Fresh and flavorful, plus good portions and friendly service. Not much in the way of ambie","useful":0,"cool":0},"_Adrs034UCnEMSghSSmWJg":{"text":"Stopped in because we were starving, but I'm so glad we did! Unique fresh flavors come tog","useful":1,"cool":0},"mgvcMFcC5VqmelfpwGm6rQ":{"text":"I visited here as a tourist in NOLA. I was super pleased to see several vegan options on t","useful":0,"cool":0},"R4OexhvnXCWgv3G-j4FEpg":{"text":"Fire Poboys. Get the glazed pork one... SO good for 12$. Not a ton of food, but better tha","useful":0,"cool":0},"86sNoMg0t8bHkifveHxleg":{"text":"We tried the Cauliflower poboy.. it was savory and filling ... it wasn't killer though .. ","useful":0,"cool":0},"uBVrn1tUOzZckkrWroOCYA":{"text":"I got the bbq chicken and my friend got the seared shrimp. They were good! My chicken was ","useful":0,"cool":0},"8agQGfUM9UnuDit6mbrlCA":{"text":"At first, I kept passing by the restaurant. The logo, rather than the name, is above the d","useful":2,"cool":1},"wnmOHkTghixo6H9hRr9hAQ":{"text":"I had the Ham and Pimento Poboy with a side of spicy potato salad and it was GREAT. Chill ","useful":1,"cool":0},"YAG_DpC3ATWu3F8VE7p8Zg":{"text":"Such a great spot hidden in the Erin Rose bar. Get yourself a frozen Irish coffee from the","useful":0,"cool":0},"noVMtvPJ1GYfuBssjnrvTA":{"text":"The name says it all with this place: killer. I had the best pork belly Poboy I have (and ","useful":0,"cool":0},"LijuTIg9cFZCNcVqLoarAQ":{"text":"Awesome poboys! Nice and friendly and informative staff who made suggestions that we loved","useful":0,"cool":0},"h2htEKdPK9pMThcXDmWZXQ":{"text":"TL; DR Seared Gulf Shrimp is a must try, You can get their poboys to go (ask for slaw on t","useful":2,"cool":2},"wLoLkiZuIign_jkJAdL8Qg":{"text":"I'm leaving this review based on my personal taste of the food. The place is clean and nic","useful":0,"cool":0},"XnlOj5ruNUe9ngfP0SYFIw":{"text":"This is a Great spot for a quick bite for lunch. I loved the beef debris Po'boy . It was f","useful":0,"cool":0},"vSM2S2XqiQs4OoeDqmg-yg":{"text":"The best po-boy in NOLA hands down. Everything is top notch but the pork belly is the best","useful":0,"cool":0},"iCT5QT-NMW5TSvD_a2LFfQ":{"text":"The pork belly po boy was so delicious. Service was quick and staff was very nice. The res","useful":0,"cool":1},"dnNV7AlHpVDZwUp7ekyYFQ":{"text":"Can't say much more...... Awesome awesome food, location is walking distance from all the ","useful":0,"cool":1},"dgSexq32yblfXKRYYvxrqA":{"text":"our first time trying poboys, and we after we tried it, we all agreed that poboys are pret","useful":0,"cool":0},"r1VsYIwNeN4OvuUYhxmyTw":{"text":"Within walking distance of our hotel in the CBD just off Canal, was I pleased (and somewha","useful":0,"cool":0},"xsCUhafd6hWFwGb6l9ptKA":{"text":"This is my 1st time trying Po' boy sandwich and came here since my friend recommended it. ","useful":3,"cool":1},"0NUFhmNGnqN7vENtucNLPw":{"text":"If you are visiting N.O. in search of what may be considered traditional po boys, this may","useful":1,"cool":1},"3Ymta9eQJp-HQbTXPPq3uA":{"text":"Very cute little po-boy shop in the quarter close to Canal St. I was really excited to fin","useful":1,"cool":0},"OMHuqpMzSjSsZ1kbjPwcqA":{"text":"Decided to check this place out since I was in the area visiting. Definitely one to check ","useful":1,"cool":1},"1oBit_kKg6w6niJNU-reig":{"text":"Seared Shrimp Poboy was so good! Very flavorful and fresh! Our food came out quick and the","useful":0,"cool":0},"ag9gTrqxjkEZC_jgd5dsHg":{"text":"Last stop on our way out from our New Orleans trip, and I am beyond thankful we stopped in","useful":1,"cool":1},"BiQmCkYkTPXn0tddStFjBA":{"text":"This is a NOLA essential. We LOVED our po boys. I got the shrimp one. The shrimp was cooke","useful":0,"cool":0},"u-LjFtHxyv77TuQy0e8NjA":{"text":"This was our first stop after checking into our hotel around the corner. We were famished.","useful":0,"cool":0},"9clQ2l94affi85tHy2f8_w":{"text":"We got their pork belly and seared shrimp po boy with iced tea. Both my husband and I woul","useful":0,"cool":0},"9CtxfHm8OpYhemdYwerFtg":{"text":"Loved this place. The shrimp Po Boy was exceptional, and just what I was looking for. The ","useful":0,"cool":0},"48omfAYyNR63v_djvBFF9w":{"text":"Poboy omelet! To die for! The location is amazing. It's swanky and super cool and the staf","useful":1,"cool":0},"QM6RHi9pgeSsAl8zEVxoYw":{"text":"I got the cauliflower Po'boy and it was excellent! Such a different and delicious take on ","useful":0,"cool":0},"aXjrBPpYFNX-QUN9KVw8dA":{"text":"First meal I had in New Orleans and my gosh it was amazing!! It set the bar so high for th","useful":0,"cool":0},"RF9I-rBxVuwq96YT77A3Vg":{"text":"This was our first stop when getting into New Orleans. We wanted to try a new Po Boy place","useful":23,"cool":18},"L-G2RwYvC1SVSnKwNn2S_w":{"text":"Great experience on the start of a busy Saturday. Staff was very helpful and overall frien","useful":2,"cool":2},"h6NBvtxsnRC-u9epzzdrpg":{"text":"Pretty disappointing since the reviews are 4 stars, but you get super bland poboys. \nThe s","useful":2,"cool":1},"qgaSvGBbLGPlFZMxO4gnmA":{"text":"I went here with a group from work during a team outing. Our fearless leader chose this pl","useful":1,"cool":1},"Xa6ZmKyEDW1j_cjaDIJmAQ":{"text":"We really like this restaurant. Their variety of Poboys was awesome. There were four of us","useful":0,"cool":0},"jKUHm7WIgLyAebKaF2HIXg":{"text":"The food was great but the service was a little odd..the guy taking my order seemed annoye","useful":9,"cool":8},"ya3yyH2EU9u_eAhnG6ZfTw":{"text":"I'm vegan and was excited to see a vegan pizza boy option in a seafood heavy city. I got t","useful":1,"cool":1},"nEd0aDalS4l0nRe3JQZPnw":{"text":"Went with the seared shrimp poboy and I really enjoyed it.  When you enter this shop, you ","useful":1,"cool":0},"vytqNp3iDFvhQZuVvmlExA":{"text":"I love that they have a vegetarian/vegan option in the sweet potato poboy.  I enjoyed it b","useful":2,"cool":0},"a5xbJTIdNu4YgCmOj2p9wg":{"text":"These poboys were KILLER.... they live up to their name! Don't let the unassuming appearan","useful":2,"cool":2},"fmd07005w-8mdUqqHnII7Q":{"text":"This location is the expanded store...they've been around a few years as a pop up in the b","useful":6,"cool":4},"Qh6YITnU1QWYIX6vgYJ5qg":{"text":"Wanted to try this place yesterday, but closed early due to NYE. So came back today to try","useful":1,"cool":0},"MxZeDATBZrJpiwcqJxUpjg":{"text":"This was one of my fav meals while visiting New Orleans recently. I had an amazing caulifl","useful":3,"cool":0},"5ZoKOc2WLL34iwRKxqta2g":{"text":"First meal in New Orleans did not disappoint! This place is just a 10-minute walk from whe","useful":2,"cool":2},"lwj2R64ytCs-JtAel36PLg":{"text":"Never had a bad poboy in New Orleans. This is not your \"standard fried fish/shrimp po-boy.","useful":2,"cool":1}}