{"6ABAxLP38Kozqj4EtIRH1Q":{"text":"My favorite new place especially since football season is approaching, lots of outdoor vie","useful":0,"cool":0},"WukyiwFEarHGrjuZJvDl-w":{"text":"New restaurant in the warehouse district- an absolute gem!  Everything we ordered was deli","useful":0,"cool":0},"uhce6tsUJkpgGdAj-KyU8g":{"text":"Our favorite new place which opened just yesterday. The outdoor seating is out of this wor","useful":3,"cool":1},"lrKtiADytnURIDb9VzE3ug":{"text":"Chicken Fried Chicken!!!\n\nYou want a filling dinner, this is the one!!!  Delicious and ful","useful":2,"cool":0},"Njg-zPUIFrxrM5RvyIApGg":{"text":"This was my first time at this place. There were 8 of us there celebrating a bday. The foo","useful":1,"cool":1},"qhpIlUvImvI5aKb1jkxdTA":{"text":"My new favorite restaurant. Great \"flocktail\" menu and ample selection of draft beers and ","useful":1,"cool":1},"VIacktKScp_jSCwKe4hAJA":{"text":"If you are looking for a place that is not located near the French Quarters this is the pl","useful":1,"cool":1},"V_oxFm-WTX4h-d3TUmn6Rw":{"text":"The atmosphere and food were amazing. Plus with great company you can't go wrong. I was th","useful":1,"cool":1},"CJ90qDrZF3C7UEp76Hml3w":{"text":"By far the worst service I have received. Ordered Hawaiian Steak Kabobs , veggies weren't ","useful":0,"cool":0},"2hcxZgNNzH5sE1hG8lX1eQ":{"text":"There is something here for everybody. The place is stylish and new. The staff is sweet an","useful":0,"cool":0},"lE0BH_K-k2V2BRuHLEOuYQ":{"text":"Terrible service, we waited for over 10 minutes before any waiter walking by even acknowle","useful":0,"cool":0},"PkTOdF5hZ--L3W1-uA8UzA":{"text":"DO NOT go here if you are looking for good service. Waited one hour to be seated while sta","useful":0,"cool":0},"RdQ8LHNE51AqsUphREAiNw":{"text":"Amazing food at a great price and service was divine. Mimosas started comin and they don't","useful":0,"cool":0},"osrpr0m2kftbxW30s_2MtA":{"text":"I went yesterday with another adult and a child. I arrived after the other members of my p","useful":0,"cool":0},"kDxY_fJrdq0zEGJS7QBmGA":{"text":"Stopped by between parades on Bacchus Sunday. Great food. Service always willing to help. ","useful":0,"cool":0},"cry73LzlQ8Qo4500ab7F3Q":{"text":"Awesome environment and pet friendly. Some much on the menu and everything I've had so far","useful":0,"cool":0},"YRMMJZPmtp2nn913ubJnbg":{"text":"Friday night and understaffed!   We waited 20 minutes for a drink at the bar. The bartende","useful":2,"cool":0},"n-ZZUTU0yVgAPIZxSv4u8w":{"text":"Food is great!! The drinks are phenomenal!!!\nOur server was Destiny and she was fantastic!","useful":0,"cool":0},"440H2lpHD0RkAyRw4isJtQ":{"text":"The hype for this place is unforgettable, but the burger was forgettable. When they don't ","useful":2,"cool":0},"HlJ-bZI4ZuGivd-_3jXyTA":{"text":"We visited Flamingo A Go Go on August 5th (my mom's 61st birthday). We had a party of 7 +2","useful":0,"cool":0},"qxGxaopplPEQe0n4qvmNmA":{"text":"Great new neighborhood bar and grill. The outdoor patio was great for watching the game. T","useful":0,"cool":0},"ACpz4_Tqx7hDC6FTxTDTHQ":{"text":"The decor here is so fun and the outdoor area is very tropical makes you feel like your no","useful":0,"cool":0},"M0OuYAMkXLTMAt-Bx68dRg":{"text":"This place was so underwhelming and a big let down. The atmosphere was about the best part","useful":0,"cool":0},"XqNdahzIxnh9mZl6w6Ev0A":{"text":"Absolutely LOVE this place! Awesome set up and environment. Brunch was great, definitely c","useful":0,"cool":0},"Ulw2Qb1l81lgrmWUABc9Kg":{"text":"Great casual atmosphere both inside the restaurant and outside on their whimsical patio. S","useful":0,"cool":0},"8UBa_tyPVyGOFOCtCsfRnw":{"text":"This is my second visit and I can officially add this to my list of go to restaurants/bars","useful":2,"cool":1},"LtibzYVsU_KJLxbPXmDYag":{"text":"So for starters, the hostess was nice when we walked in. A nice clean environment. Thats a","useful":1,"cool":0},"YSrkms39BfB14gxVqVpOLg":{"text":"Went here after walking around in the area for a bit and saw that the restaurant had great","useful":0,"cool":0},"8OD52xsSFpAGQnroKrJkUg":{"text":"Melva is great! Shrimp and grits and the gogo balls are off the chain! The garlic fries ar","useful":1,"cool":2},"QKJV6M0FIVPVe0ocorRXdQ":{"text":"Don't eat here for dinner. Beer was warm by the time I got it. Food took forever. Service ","useful":0,"cool":0},"l2D4GmS1XbRXX8bgZVL7cQ":{"text":"This is a brunch review. \n\nWe love to eat here and have been with our friends and kids man","useful":1,"cool":1},"OW1-7Una8hekIkPUO_v9IQ":{"text":"Chris, our waiter,  was great! He was knowledgeable of the foods on the menu and kept the ","useful":0,"cool":0},"Wsa_zn1HcU5Rmp_rTTBmbw":{"text":"It's very conveniently located, but I can't recommend it. I don't think I've ever been in ","useful":0,"cool":0},"-Zu7kArionIww04VittJJw":{"text":"I was REALLY excited to finally try this place and I was more disappointed than I wanted t","useful":1,"cool":0},"cGrMz1kj6lsJsuRSLNQB1w":{"text":"Very disappointing! Made reservations 1 week prior to celebrate my 40th Birthday with five","useful":0,"cool":0},"DRy-Ep4o2zTmqL8bn9iukA":{"text":"Meh. Took forever for our waitress to come around but I'm pretty sure that's because nobod","useful":0,"cool":0},"hz4-WN5Wj7uGIMZW0z-u1A":{"text":"Emily- a-go-go gave us a super personalized experience. Food was great, $10 bottomless Mim","useful":0,"cool":0},"RXBH0CIaNoicY_1JBoR8Eg":{"text":"Very impressed with Flamingo a go-go! The inside is a restaurant/bar and the outside has a","useful":3,"cool":1},"-xcpB3wRErVtKrqW0DO_LA":{"text":"Cool space. Great for groups. Service needs some work. Over priced.\n\nSingle diners seem mo","useful":1,"cool":1},"BWlAS5yCJhhp2RiWQ46wOw":{"text":"After watching Mardi Gras parades and drinking since 7am, we were famished by 1pm. One of ","useful":8,"cool":5},"S91cupUUoh1wLDIJKlCGzg":{"text":"Service and management is horrible!!!!  Over one hour of waiting for food after being seat","useful":0,"cool":0},"YVtb0bxi0ZkoCtpRSqUNGw":{"text":"This is the second time we ordered a Waitr order from them. The first time 20 min went by ","useful":1,"cool":0},"ueMf-UVPmXhGHwRTNUd1NQ":{"text":"Cool patio, terrible service.  My friend talked to the manager said we'd been waiting for ","useful":0,"cool":0},"1bmYKBeR56SNn1S-qC3fvQ":{"text":"Stopped in on the way back from a walk down Magazine Street in the Garden District. As oth","useful":0,"cool":0},"yf7k06APWZ0y_HVHecvCBA":{"text":"We visited this spot during our visit at Essence Fest. OMG....I can't to go back.  \nLindsa","useful":1,"cool":0},"jylprAnbe_RpDXLVpywWLg":{"text":"We loved this place.  Food was fantastic. Service was friendly.  The outside patio has a g","useful":0,"cool":0},"19ZfPJrwNV4BQydlG48bzg":{"text":"Very nice place to hang out with friends for family where there is a large seating area in","useful":0,"cool":0},"NtndVYPxjJyEbHsRjI1OlQ":{"text":"This place is an actual joke: the drinks are Splenda-filled and disgusting. The staff is k","useful":1,"cool":0},"ICS_DzC302gXUnjqJoX2KA":{"text":"Flamingo A-Go-Go is a fun spot to enjoy some good eats and drinks with friends in a laid-b","useful":1,"cool":0},"MXqswMTGcnhhrxtvjUOkmw":{"text":"I just ate here for the third time. I usually don't go out of my way to write a review whe","useful":0,"cool":0},"qivqG0GOwlmMpUwbD3ukLw":{"text":"Setting: This place is really cute with a vibrant background and chill set up with an outs","useful":0,"cool":0},"vHzdmWUAyqyHGKytFpcQXw":{"text":"This place seems very aimed towards tourists which is okay but just not a great place wher","useful":0,"cool":0},"3Dn0J-ZaeXBTpUjnB3_dSQ":{"text":"Really enjoyed my Chicken fried chicken, bottomless mimosas (for $10! Great deal.), and wh","useful":0,"cool":0},"z9qXdve6b8WJs85tDkyISQ":{"text":"We came here for my friends birthday and the shrimp appetizer that i ordered was amazing! ","useful":0,"cool":0},"U8XKf8Ec_E9-seDXNcyVaQ":{"text":"Best ambiance ever. This place is a must-go-to. Didn't have food to add to the review, sur","useful":0,"cool":0},"DbKeSgC6yCX6o49JuyADIg":{"text":"Fun atmosphere. Great food! Staff is super friendly and helpful. Great courtyard. New favo","useful":0,"cool":0},"Sc-g9EuupasGYpXLj5eNIQ":{"text":"Flamingo a NO NO! I have been anticipating the opening of this establishment for a while n","useful":2,"cool":0},"ZeV0f_7W6464JKgXKdUGlg":{"text":"Had lunch at Flamingo A Go Go today with 7 other good friends here for the Sugar Bowl! The","useful":0,"cool":0},"rP7_qHdYoOjlsa_27Yaa4w":{"text":"Either I was really hungry or the food was really good because I cleaned my plate. I got t","useful":1,"cool":0},"D9v59mZ-IPR96O9h7ClaEw":{"text":"Went to Sunday brunch and a birthday celebration. Made the reservations thru Open Table an","useful":1,"cool":0},"X5dVoj84MXXu-Cv-WToAHg":{"text":"We popped by this place for lunch before exploring the WWII museum, mostly cos I loved how","useful":0,"cool":0},"KVaGlsYkRTTtzIek4vZqfg":{"text":"Flamingo A-go-go gets everything right.  I live in New Orleans and make sure to bring ever","useful":0,"cool":0},"-lGCAm_igW_fmschv3cGoA":{"text":"Such a super cute restaurant! I loved the Instagramable ambiance. But we're here to talk a","useful":2,"cool":2},"ou-WWRtD40CSrlG5rIBgsA":{"text":"Celebrated my grandson's 9th birthday here. Food was mediocre. I had the fish with dirty r","useful":0,"cool":0},"GCcLlsG3y6SopGdMiq12sA":{"text":"Looking for a place to stop and rest with my dog and they bring me me out a doggie menu.","useful":1,"cool":0},"95GdfkWLl70G7RDILnXP5g":{"text":"The hostess was energetic and greeted us immediately. She took us inside to be seated. We ","useful":0,"cool":0},"5J-bbvJNsXCwJ14Q7iCzlw":{"text":"Worse crab claw appetizer n hamburger was a hockey puck\nTerrible food\nGreat service\nReview","useful":0,"cool":0},"MCGT7x6dvjwTOS6q1HloNA":{"text":"The atmosphere is great! Its in a great locations and the placed inside and outside is nic","useful":0,"cool":0},"pfFKCW_MwzkziPmTn_lsHg":{"text":"Fun and delicious! \n\nI came here with a couple friends. We chose to sit outside which was ","useful":1,"cool":1},"avYwEkREKLR6fudJVONE0g":{"text":"We stumbled upon Flamingo A-Go-Go after the WWII museum. What an awesome casual and fun pl","useful":1,"cool":1},"fMFYQZggWizQTAhJT3TtyA":{"text":"I should give it 1 star.\nWe were greeted by our \"server\" lexis or Alexis whatever her name","useful":0,"cool":0},"Ew7PCxyMxpIZTYVKIAPtNw":{"text":"Fabulous Alex was our waitress yesterday was great and helpful going back for superbowl","useful":0,"cool":0},"Kid10DsQgRWu-23i27uaEw":{"text":"Interesting with potential to be better.  New place but run by a restaurant group so shoul","useful":2,"cool":1},"az3sNdIWEQ71tJtk_FTE5w":{"text":"Fun atmosphere!! Great outdoor dining! Prices are reasonable and food was great!!! The Hav","useful":0,"cool":0},"9I77NvcMvq4nhW5YtKDTzA":{"text":"Nice people and a great location - but the biggest problem with this restaurant is the foo","useful":0,"cool":0},"ID4GFS-ddazdCmoChiD60g":{"text":"This place was really good and their happy hour was really recent. I tried their  Bushwhac","useful":0,"cool":0},"71EvMboXE6TUR63aPpmCqQ":{"text":"I came here to do recon for potential venue sites for our work parties of about 150-200 pp","useful":0,"cool":0},"Lek2LTFwAiTEnmuw7Bub8Q":{"text":"The menu was wonderful but even more so our waitress Desiree was a delight (coming from a ","useful":0,"cool":0},"-MqITuehbU2uchQIDbZz-w":{"text":"Such a fun atmosphere!  My hubby and I were looking for a patio in NOLA and struggled to f","useful":0,"cool":0},"nYJD89IrTilmi98d5imakg":{"text":"First time here and let me tell you this. My wife and I loved everything, everything about","useful":1,"cool":0},"QBhenG4ph85c-e6_lZ8W9g":{"text":"First visit to Flamingo, was recommended through a friend and I will be back. Awesome food","useful":0,"cool":0},"2qe9BDHcXHoYeh03s1bOsw":{"text":"I thoroughly enjoyed. The atmosphere is fun and funky and relaxed.   I went the first time","useful":0,"cool":0},"K0dY0GRy4d-WZofDxsHHRA":{"text":"This place could be amazing, food could be tasty, drinks could be delicious...but I will n","useful":0,"cool":0},"FTqBbLMtisNW8d0YFey6bQ":{"text":"So slow. No one in the restaurant knows how to smile either. They looked fully staffed but","useful":0,"cool":0},"h2Y5GgiHHsOVJZPR28rkrQ":{"text":"We enjoyed lunch today in the patio. Our waitress was fab, drinks were good, loved the amb","useful":1,"cool":1},"BUMIHOpMhuR_6ACoNEED5Q":{"text":"Oh. My. Goodness. Quite possibly the best meal I've ever eaten. I got the Acapulco chicken","useful":0,"cool":0},"2XWOSKT_mLrmxCw77Dpi9w":{"text":"I 100% would recommend this place. My boyfriend and I went one night at 8pm and sit outsid","useful":0,"cool":1},"NRP-AxKTeT19FgCn-gETFQ":{"text":"Excellent customer service, amazing scenery , great vibes! This place is exactly what you ","useful":0,"cool":0},"dIbqJXKlh3RYAeUbm4H1NA":{"text":"Really good lunch today. First time going. Very cool vibe. People of all ages were there. ","useful":0,"cool":0},"ioKvb_ewD9MBuIRRbYVzdg":{"text":"Food was good, service lacking. We were a large party and did not get much attention. Orde","useful":0,"cool":0},"Z7TGcw4wGb-UmBW05ftx7g":{"text":"Walk from the CBD for lunch almost once a week. Great options to eat a big long lunch in t","useful":0,"cool":0},"KjyWiyeko8ry86E1nyXb5w":{"text":"This place gets an extra star from me for the doggie menu..komos loved his chicken dinner ","useful":0,"cool":0},"G1Sjg1tynPXLKpoi57g-4Q":{"text":"Horrible experience here.....entrees were delivered before appetizers, avocado in chicken ","useful":1,"cool":0},"w3HcrzKP0OaBgX69c-bvnA":{"text":"Great drinks, apps were good too! My salad was basic.. but the atmosphere was pretty cool!","useful":0,"cool":0},"b9ugKTrwAW9XB1wSZHhSKg":{"text":"The decoration of the restaurant is a lot of fun and it has its own authenticity. Our drin","useful":0,"cool":0},"m6XB_VqLa6_a5-4KmN31bg":{"text":"came here for drinks.    Lovely patio area.   I got no clue what happened at shift change ","useful":1,"cool":2},"iZNsO2X4By0sBq8LIGYcbQ":{"text":"Now this is how you reestablish a relationship! I voiced my concerns about my last two exp","useful":0,"cool":0},"ajn3eNIVvkLJJ6a4UsE9zA":{"text":"This is a great option for a big group-- especially if you are heading to the Superdome! D","useful":0,"cool":0},"C6WDWSGz4ZLxqz3JjOq7yA":{"text":"Flew in for a convention and stayed a block and a half from here (Springhill Suites). Food","useful":2,"cool":0},"f9bjpWjpbQEBRJ7PtORp3A":{"text":"Great place to go if you are by the WWII museum. Took us 5 minutes to walk. Has indoor and","useful":0,"cool":0},"CU3vrPMznyhG3iQOhM6qxA":{"text":"IT'S A GO GO!!!! I had brunch here and it was a great experience. Our waitress Hailey was ","useful":0,"cool":0},"q_e5KwfxeSEH7fjHq36ilQ":{"text":"Here at \"Flamingo Go Go\" little bit of a flashy name how ever the vibe is very laid back, ","useful":0,"cool":0},"U3A9ZWMSu8X17_HwmXhDVQ":{"text":"Flocktails are super unique & delish. A great place to dine by the WWII Museum. Not NOLA c","useful":1,"cool":1},"HdjlaazrmgqUkDMp_4CODw":{"text":"Dined with my family at Flamingo last week,\n\nWe sat outside and we took our dog with us.  ","useful":2,"cool":1},"1JcxDqYxDNM7u2atm_F78Q":{"text":"I really wanted to try this place like really wanted to but we sat there for 15 minutes an","useful":0,"cool":0},"1Yh2eAMsTCQG8QZzQBTFzA":{"text":"Eh. Our meal started off with an awkward tour of where the bar, patio, bathrooms, and upst","useful":0,"cool":0},"XFOaMhdefudpcYnXsEY3wg":{"text":"I love this place when it's packed. When it's empty the vibe isn't as great. But game nigh","useful":2,"cool":1},"PfQuDsLUfwwL-oehrAf4VQ":{"text":"I wanted to scope this place out as a potential baby shower location for a co-worker, so m","useful":1,"cool":1},"0SqA5smLNYxgnG3XbvOjUA":{"text":"The food was descent. The deserts are underwhelming and they put us at the wrong table and","useful":1,"cool":1},"M718q-YPCT7-KSzrjB8A3g":{"text":"This place was really cool , looks like it can be a very happening place . Went on a Monda","useful":0,"cool":0},"uRGtW-ZTqTwPEC4d3d-xbg":{"text":"It's a very energetic feel coming into the restaurant. Bright colors and pretty cool music","useful":0,"cool":0},"zcmJZu0Kr0Ab2vzk2fACgw":{"text":"Sean was so friendly and kind! We came on a hot summer day and he went out of his way to g","useful":0,"cool":0},"h0YUvtpFLDINXFU6kcho_A":{"text":"Went for lunch the food was great! I had a chicken sandwich with avocado I don't remember ","useful":0,"cool":0},"UxYGr5lYxTnitDy24b7Wkw":{"text":"Grab your girlies and get your brunch on! This place is ADORABLE! They have a huge menu an","useful":0,"cool":0},"HFCuRV4eePiUe79Dn7xd-A":{"text":"Mixed feelings about this place. When you first get there, it really has a nice open layou","useful":0,"cool":0},"FB-ex0_EF9EnRel6HAP1gw":{"text":"Only restaurant we came back to twice on our vacation to New Orleans. We came back for the","useful":0,"cool":0},"_WgnmZ6fx_u_kj97HZ9Mig":{"text":"I really wanted to like it. We had reservations for a table inside (not bar, not high top)","useful":0,"cool":0},"mRatn9F4BVOjBxvlmEUiyQ":{"text":"Beautiful courtyard, delicious food, prompt service. We rolled up with a group of 12 (afte","useful":0,"cool":0},"O5a8mA7L_Gbuw6Bx91H-_Q":{"text":"My gals and I were so excited to try this place out. We made a reservation well in advance","useful":0,"cool":0},"-o9RvNwaJ_VnDkMxDnYXFA":{"text":"Great place to hang out & get a flavor of New Orleans! We happened to be there on National","useful":0,"cool":0},"h1xBvwmYrr3gdOjr3CxqfQ":{"text":"We visited the restaurant on Monday afternoon during Mardi Gras, the place was busy but no","useful":0,"cool":0},"n9yMwP2nn08xGlTqNYUNYA":{"text":"My friends and I wanted a place to grab a bite to eat while we were out and we weren't dis","useful":0,"cool":0},"Ccty292hrjCVn7rvW6DnNg":{"text":"Amazing place to sit back and have drinks.  Also a great place to bring the kids for brunc","useful":0,"cool":0},"ptIwbOG4r1xU8TQu9OMMAg":{"text":"Really fun drink selections - great place for drinks AND food. \n\nThe truck in the back is ","useful":3,"cool":1},"Zp2xtCdsKEwYvC8Li_FnGQ":{"text":"What an awesome little place. So we turned right when exiting the Old 77 Hotel and found t","useful":0,"cool":1},"r4fFnC6cDrP8lSDcdOYThQ":{"text":"Great atmosphere. Great drinks. Really cool place. Service was not that good. Apps were so","useful":0,"cool":0},"kMhPeltle9iTWktZRUf5_g":{"text":"Such a good place to go with a group of friends or your significant other. It's good to ma","useful":1,"cool":0},"Q7HwwALA2CX-Q7HGQH-7LQ":{"text":"Went on a Saturday night at 7pm and sat at the bar. Got our first drinks fairly quickly. I","useful":0,"cool":0},"0wn3SvymmfhZ0BEkFu0RnA":{"text":"If you are looking for a cute spot to hang out for eats and drinks, Flamingo a GoGo is the","useful":0,"cool":0},"5EyTw3ZjHydluIQ1GtekGQ":{"text":"I was really excited to go try this place, but was totally disappointed in the menu, both ","useful":0,"cool":0},"ukReQ2aAs-KmmZvfwfQwvA":{"text":"First time eating at this place. It has been on my brunch list for a while now and today w","useful":0,"cool":0},"lgSGjPcQQyS1mQ_y-fedLw":{"text":"Arrived in New Orleans late and we were all pretty starving not to mention thirsty! We wal","useful":0,"cool":0},"glhVyDtL5bMFecL8EnXrLg":{"text":"Alrighty, flam, here it a go-go's.... \nHere's how the night went down: ordered our first r","useful":0,"cool":0},"bxCTwmX0T92g-tATfWSt2g":{"text":"This place has the worst service I've ever experienced in my life. Our server didn't come ","useful":0,"cool":0},"0CL_FhHV2ztcvjWNPI2_YQ":{"text":"My friend and I sat at the bar and the service was really slow. I ordered the Alfredo Past","useful":0,"cool":0},"a6iT6tqx2fgAnUjDVQandg":{"text":"First of all the decor and space is awesome- huge improvement over the last restaurant tha","useful":0,"cool":0},"4qjc-Abp07rPZI2dmQHuvQ":{"text":"We made reservations for a large group one week in advance. Reservation was for 1230. It w","useful":0,"cool":0},"VGFX_tjt1UOF32lb27Jd0A":{"text":"Tried to give this place A LAST CHANCE before I totally wrote it off.... thinking that a s","useful":0,"cool":0},"zdZFpXMb7DWWT0vYglwL9w":{"text":"Sabrina was great as a server! Great food and the service was quick. A fun environment for","useful":0,"cool":0},"8EQ_xZadtCa3q0voC_x19w":{"text":"I'm going to to be honest. The food was not worth mentioning. Standard bar fare. But maybe","useful":0,"cool":0},"txqbN7FHIk3ksJCm5NqlUQ":{"text":"Place was amazing service even better will definitely return for a game or just cocktails","useful":0,"cool":0},"YnF6pzDKFyp6fsyyzNOsGg":{"text":"Really likes the atmosphere.  We had ate already and just stopped in for a cool drink.  Ba","useful":0,"cool":1},"-Sac_2D1Tot8lHSzkHjdTg":{"text":"I, my husband and teenage son enjoyed our lunch/brunch here on Sunday (April 29th) before ","useful":0,"cool":0},"tcg2_7kVmkHVi5r7XFGvJQ":{"text":"Stopped here to pickup a couple of drinks on a very hot day!  It was lively with customers","useful":0,"cool":0},"6oQF6Hz4-LIzqH_G3Gi63Q":{"text":"Overall good experience not a lot of vegan or vegetarian options but the bottomless mimosa","useful":0,"cool":0},"OcwSdz8zrporcPAlbilmGg":{"text":"Excellent. Atmosphere is colorful. You'll see the flamingos painted on the outside wall an","useful":1,"cool":0},"oqAZYAWXB2FSv2W2587bcw":{"text":"Flamingo A-Go-Go is SO CUTE! But the excitement stops there. We came here for a pretty lar","useful":0,"cool":0},"SsRKhk0xwySwzU64i0pMyQ":{"text":"Aireon our server was the most sad part of our experience.  If she is having an off day ok","useful":2,"cool":0},"LUAdQvaCTBauKImlei8viQ":{"text":"Love this place! Atmosphere is great. Staff was friendly and the food was absolutely delic","useful":0,"cool":0},"brEtgLh94XSL-fEe6vMf-A":{"text":"This place looks good and has the potential to be great our experience fell short. The foo","useful":0,"cool":1},"QyulHVpOAjEuAXaASgbjLA":{"text":"The staff was slow but very friendly. Frozee's all day, the best drink for the best price.","useful":1,"cool":0},"ZHsg4ZYLSmA-YUtj2HdC_Q":{"text":"This place amazing. Some friends and I stopped by there for lunch today and let me tell ya","useful":5,"cool":2},"8JigY0uoN0XZMKlZLBDtag":{"text":"Second visit was even better. Great food, great service and great place to hang. \n\n\nOur fa","useful":3,"cool":3},"lV4O1ZbgOjApkbrA1mPgXA":{"text":"\"Wide Variety of Fun, Food & Drinks \"\n\nWe visited the Flamingo A-Go-Go in New Orleans  a f","useful":1,"cool":0},"yIuFdmAkLJrMF17eBX8zJw":{"text":"Super fun, funky decor and ambiance. The staff was great, food was good, but don't get the","useful":1,"cool":0},"wns2zI2pFbUtjWqlG6-pLg":{"text":"Bar food and cocktails in a nice patio. TVs everywhere, so kinda a tropical of a sports ba","useful":0,"cool":0},"2vSMzaL90da-z7DGFQp_nQ":{"text":"I had heard nothing but great things about this restaurant and finally decided to give it ","useful":2,"cool":1},"7g1GuB9BYdh_BsYiBwI6zA":{"text":"Went to Flamingo a-go-go last night for their happy hour.  It's a cute space and I love th","useful":0,"cool":0},"I0CK9TTw67n7EA6r3MjfRA":{"text":"Food was tasty but nothing special. Service was terrible, he took 10 minutes to show up to","useful":0,"cool":0},"dCWQe0Xsz0nO1MChL-olWQ":{"text":"Came in to celebrate my birthday; it was a great atmosphere, amazing servers and food was ","useful":0,"cool":0},"nQ8XzsH-t2rVJ_twI4UPjw":{"text":"I wanted to really enjoy my experience. I picked the restaurant from yelp for my group of ","useful":0,"cool":0},"Q9uwZC8SFUrht87Lr5tGGQ":{"text":"This place is fantastic / the atmosphere is great (Sit in the Outside area) !!!!!!\n\nThe Fi","useful":0,"cool":0},"P8ly1cKcBaQfG0VM3GCCQw":{"text":"I've come here for cocktails multiple times, and will definitely be going again. The barte","useful":0,"cool":0},"k2M3wRTa2TjDPG6Ok5Kmcg":{"text":"Had Desiree, She's awesome! The food was great and the atmosphere was perfect. My wife and","useful":0,"cool":0},"K_JO1Dvxxd2ncGGTyuXEbA":{"text":"Stopped in on the fly because we saw the huge tv projected on the side of the building. We","useful":0,"cool":0},"Pp9g_iswa65sJJEaawyYUQ":{"text":"Love flamingo a go go and their happy hour deals. Such a cute big patio area in the CBD. W","useful":0,"cool":0},"hBw8EiX77MuBenz1OT3W9g":{"text":"Yummy food and drinks. Fun place to eat and chitchat. The art is fun to take pics in front","useful":2,"cool":0},"BfgiybShz4oTDo2r2pGhJw":{"text":"Went here for the 1st time a few months after they opened. It's fresh and new and I haven'","useful":0,"cool":0},"Y1HdHew20XWX41cN4zh_Xg":{"text":"Ate there for the first time last night and ordered the grilled redfish. Fish was fresh an","useful":1,"cool":0},"BCJ6J_V03vV-Wrkh6Tv7cQ":{"text":"This is a tourist paradise... complete garbage.   Cocktails on tap??      When nola is all","useful":0,"cool":0},"Sbd4iMcXpHyWjEucVFNznA":{"text":"Our annual family reunion is being held in NOLA this year so we needed to find a place tha","useful":0,"cool":0},"Xw3AdxKdsavAWS4Qw90zgg":{"text":"This is definitely the most bang for your buck brunch around. $10 bottomless mimosas/rosé ","useful":0,"cool":0},"PdPjJs_FFVxT0SU_AaIESQ":{"text":"Place was good. Moderately priced.  Nice selection.  Staff was great. I would come back n ","useful":1,"cool":1},"MCtkwoMaMYLd2pWYwXKeow":{"text":"More like Flamingo-a-no-no\n\nWaited 20 min for our waitress to take a drink order and anoth","useful":0,"cool":0},"zTqz7nSWJ0sDdjilW15fjg":{"text":"Really fun place!  Attentive, friendly staff.  Delicious food. Will be back for sure!","useful":0,"cool":0},"4BzXPlXwUoSzxFWzrHSyEA":{"text":"Holy hell- you have to order the fried havarti- and the queso. They are absolutely amazing","useful":0,"cool":0},"PMJNuBOT1X4VKc33uMvLig":{"text":"Great service, and the patio is very dog-friendly, which is great. The poke bowl I ordered","useful":0,"cool":0},"LSBflrMbR_cNpPLxB7-tnQ":{"text":"Food is ok, but not as good as most of the Nola food. Our waitress disappeared after she b","useful":1,"cool":0},"17GU3EwlGqQtkpUAu6tcQw":{"text":"I always come here when I want some late-night drinks in a cool place! I love the funky at","useful":1,"cool":1},"VXDped6piWlqrrYySUiRXA":{"text":"My husband and I were excited about trying this place, but were very disappointed! We went","useful":0,"cool":0},"zLyrvGH99xfOBxIqzMb8Lg":{"text":"Great people, and great service...but the food was just okay. Solid 3.5/5. I guess after h","useful":0,"cool":0},"zQOGB-zVPXzwiXReMwe3Gw":{"text":"Came of afternoon drinks one Sunday afternoon. \nWe sat outside it was a little warm..lol\nH","useful":0,"cool":0},"vQF1o0-abJ_pvaV0QY7iBA":{"text":"Terrible service terrible food. Took twenty minutes after being seated for a server to ack","useful":0,"cool":0},"Fr6Y2bwqaK8D_bLn9O7Ukg":{"text":"Thanks for noticing us at the bar, Randall. Pretty cool patio and the shrimp appetizer was","useful":0,"cool":0},"sPEI3nyEvapIFV9iAe_CKA":{"text":"Tasty and well presented food. Staff is supper nice and attentive. Not your usual Nola far","useful":0,"cool":0},"XuM0IDYF8pGfBTAaiqR8ag":{"text":"I came here today for lunch with 2 coworkers.  One worker and myself ordered the Acapulco ","useful":4,"cool":3},"gUELeQqdR8P6UNWMNHIuhA":{"text":"Dope place the outside area is very nice and also where else can you get bottomless mimosa","useful":0,"cool":0},"fzimfPFf-OdoQ7-1zxmI-g":{"text":"Orean (probably butchered that spelling) the hostess, and all the other hostesses this eve","useful":0,"cool":0},"3GPmBIFGLka-tbz0Vd1bjw":{"text":"Unbelievable customer service. Made up for the rain by far. Christy didn't have the power ","useful":0,"cool":0},"rxfcu1WZ2Vv05GoWyWzQ0A":{"text":"UPDATE: Went back to give it another try, and it was worse. Our server was in a horrible m","useful":0,"cool":0},"NiyXEr-6K8QofUbex0WqAg":{"text":"Went for Sunday brunch.  Food was good. Atmosphere was nice.  Service was bad and the rest","useful":0,"cool":0},"v4gJGeAGtHdVrvIIF640ZQ":{"text":"Flamingo A Slow Slow. Takes server forever to even ask for your drink. Avoid the hype.","useful":0,"cool":0},"_9Ra7CjCkmgOd7Enio9Vxw":{"text":"Finally went! Super cute, really great for groups. Plenty of space for groups of 15 or lar","useful":2,"cool":1},"NZIaC-2pE4K3m0r4ycgxBg":{"text":"I had the Smoked Gouda Grits and Shrimp. It was awesomely rich and flavorful. I'd go back ","useful":0,"cool":1},"OHOodC_Dx-0zhTfHBkdbMw":{"text":"I ate here on December 12, 2018. My first and last time!!  I was beyond disappointed in th","useful":0,"cool":0},"GTC97T38dUG-JyuLb-onKQ":{"text":"Great service from our server Chris and fun atmosphere! We went for drinks before a Pels g","useful":0,"cool":0},"EawRG7OpYGMlp1yjcecGDg":{"text":"This is not a New Orleans restaurant.\n\nI say that not as a condemnation, but simply as a s","useful":6,"cool":1},"_akJGY8hejYeWCqEhjUeQw":{"text":"This place is terrible. Went after French quarter festival and was nice outside so request","useful":0,"cool":0},"laPxFkMj-9pcUSBrdVnQKQ":{"text":"We had a five pm reservation but didn't get seated until 6. Then after we were seated not ","useful":0,"cool":0},"Z5yIO02yt-9mWmR14mgk6A":{"text":"We were walking past and my partner was hungry and wanted to eat. I was excited to eat her","useful":0,"cool":0},"f0Cn27f5RzXaXiO57L5KSQ":{"text":"Alexis was our server today, could both have asked for better service or food. Very large ","useful":0,"cool":1},"hBA5nm4tegs-X3auNkKrYA":{"text":"I wanted to dig this place but, and maybe I will go again for the patio ambiance--would be","useful":0,"cool":0},"SRexFqbPpSaKC24fQpaYXQ":{"text":"Always loved this spot but now they have the service and food to meet the great location a","useful":0,"cool":0},"a_ptyHYDrEFHxOZU0bwrEw":{"text":"Service is just so so. Recently sat at the bar and bartender was a little slow. Everything","useful":1,"cool":1},"xI1owjCNROAskkBonOWpUw":{"text":"4 because I didn't try the food.I basically hopped in from a frigid walk as a quick stop b","useful":1,"cool":0},"EbuGFwIp90Ewy32_BWeBcA":{"text":"Expect this biz to fail. \nLooked promising, but did not live up to expectations. Rude host","useful":0,"cool":0},"noxz9IvgmWyCUWg3FvB3aQ":{"text":"The food here was unsatisfactory. The ahi tuna poke bowl was a small amount of food and di","useful":0,"cool":0},"2UcpupQecX00P6sLap9GRg":{"text":"Slow and slightly disorganized service, but nice ambiance outside if the weather is good. ","useful":0,"cool":0},"GVUX94N9hqLNXzgmees6WQ":{"text":"Flamingo A-No-No. Arrived at 7pm and didn't leave until 9pm for a party of four.  Hostess ","useful":0,"cool":0},"CtW0qaC4D6PUH6Y8D_Oliw":{"text":"Already been here twice, and pretty sure this will become a regular spot. I find myself in","useful":3,"cool":2},"NXoQyZ6X0lOA0o6zU7xKFQ":{"text":"Service was not good at all. The waitress rarely came around. I had to call after multiple","useful":0,"cool":0},"g9hDfraqOrLbCqCwXWWB7w":{"text":"Great food!!! Lots of fun flocktails!!!Our server Alexis was amazing!!!!! Will be back for","useful":0,"cool":0},"K0q-rJiA9BjZ97yW0kCMMA":{"text":"This was our day 1 breakfast spot on our 4 day trip to NOLA, as we were staying in the War","useful":0,"cool":0},"mTs41T5AqjT3ZR9xi0-_RQ":{"text":"Food was on point and the staff was great!   We had a table for 10 outside and unfortunate","useful":0,"cool":0},"WoG0uRbKxf6P01RU528bsQ":{"text":"Wonderful atmosphere and great food. My husband and I sat outside. Our server, Desiree was","useful":0,"cool":0},"q2iUsANBowULVejMF_y0cg":{"text":"Sat inside, extremely chaotic and loud. It took an hour + to get our meals.. and I only or","useful":0,"cool":0},"9ShCnbKWj9T1TSpK8Hxf8w":{"text":"So much potential but meh.   Great if drinks are your only interest.  I don't mind a wait ","useful":0,"cool":0},"N9mVHh6A-P1kp-1rv4dDwA":{"text":"My friends and I walked into this bar on a whim and honestly, it was one of the best decis","useful":0,"cool":0},"nIk5r1JtobybVhfBZOdDbw":{"text":"Great atmosphere but that's about all. The hostess on Sunday afternoon greeted us more lik","useful":0,"cool":0},"DKkCVFUq8CKyDu_MIxFrjw":{"text":"Great food! Great service! With a fun atmosphere!  Can't wait to eat here again!!  The men","useful":0,"cool":0},"SRWqnLP8yOGRQELEuOrDRw":{"text":"We had several drinks - all were very good.  Ordered shrimp and grits and a Fried shrimp p","useful":1,"cool":0},"Bqyt3GbnH9MSrCsVI5giKA":{"text":"Came here after the Saints game on 12-17.  Great place to watch the game and hang out! The","useful":1,"cool":1},"yPr7G7XJ2TcP5-sNpfYvgw":{"text":"We went just after lunch maybe 1 pm. Our waiter was awful. Probably why he was working tha","useful":0,"cool":0},"qKzdYW36Y-VlAw880sX8Og":{"text":"Went here to celebrate my fiancé and I engagement since we were looking for a brunch spot ","useful":3,"cool":0},"gmB67vL2VIYVmY7H4P7-rQ":{"text":"Overall poor dining experience. Service was lacking, the place was empty and I still had a","useful":0,"cool":0},"IZoPTFJ6zMz8uUKNgfLoxw":{"text":"DOG-FRIENDLY!\n\nFlamingo A-Go-Go is my favorite place to happy hour with my dog, Ruhk and f","useful":0,"cool":0},"JIVcQ9TYg3naou4BOSMJKQ":{"text":"We went here as soon as we landed for bottomless brunch which was fantastic. They are very","useful":0,"cool":0},"JNqD4FFzDgIsSqmInU5d7w":{"text":"I stopped in for a quick drink with friends. Regrettably I couldn't stay long enough to tr","useful":4,"cool":1},"T7t4u9yj3tR1t_7NKXs-XQ":{"text":"Came in for happy hour, the service was amazing! Great drinks and killer appetizers all in","useful":0,"cool":0},"SzNHs4TJcxbfzMdpdnrXDg":{"text":"Went to this new place tonight with some good friends from my boyfriend's firm for a birth","useful":5,"cool":2},"ixl_UAzUJcyI1FzIVxfRpg":{"text":"Superb service by Sabrina ! Please ask for her. I enjoy the hostesses maya and Shalon! The","useful":0,"cool":0},"U7UkBvvLqWx63EQIxNwGSQ":{"text":"My first time coming to NOLA, and I must say I was impressed with the hospitality and food","useful":0,"cool":0},"2hfGu-XhJti7MwPi9N-jxg":{"text":"We came here for our last dinner in new Orleans. We were a bit leary because of the other ","useful":1,"cool":0},"qpkqvgL7EwwzUoYTuCjvXg":{"text":"Love the unique turn & burn atmosphere in here. Drink specials til 7 is pretty generous in","useful":3,"cool":2},"WCi3Um448mSx9oGwiCdEOg":{"text":"I came with a group of friends from work and we had a blast!!! Their cocktail drink menu i","useful":0,"cool":0},"fcgUKHFLrgnjA_HCiffLzQ":{"text":"Went with 4 people for happy hour. Happy hour is $1 off drinks and apps, not an amazing de","useful":0,"cool":0},"WfXsJnf9LWMhTEU_HCvpfw":{"text":"Oblivious cutie and mediocre food make this a forgettable but not all together unpleasant ","useful":1,"cool":0},"bwBTx0NAxKU4jj9g-3guiA":{"text":"Service food, and drinks were all terrible. Definitely not up to NOLA standards. \n\nFood: f","useful":0,"cool":0},"oLJBf2rqM2FHQaA0LLeWtQ":{"text":"A WAY better place to eat when visiting the WWII museum than  paying insane prices for med","useful":2,"cool":0},"F5UgEKJAgNm5JMVu20uuiQ":{"text":"We had a reservation for a party of 12 for 12:30 pm. We made it a week before. Two of us g","useful":0,"cool":0},"nhW7nXYoctWqmpxZ6tZe9g":{"text":"Amazing food, bar, and scenery! Flocktails and unique menu keeps us coming back! Poke bowl","useful":0,"cool":0},"7cOY04Ga0agXc4r0EvIhgQ":{"text":"Went with a couple of friends for Saturday brunch. Service was friendly but slow and the f","useful":0,"cool":0},"GYNEX5IzIQC9cA9MiIgPlw":{"text":"I came here for a co workers lunch today.  No problem with parking, service was good and t","useful":6,"cool":2},"TC9NLww2baI9RKorwr4TmQ":{"text":"Omg I love everything about it first our waitress Jess was amazing and she had great sugge","useful":0,"cool":0},"QoTttsg2PiD9aZXqJMuvbg":{"text":"Cute place but very stingy with their drinks/alcohol. Food was pretty good. Service was ve","useful":0,"cool":0},"IP4rRrla5qWbUxev0vtQHQ":{"text":"The food was outstanding! We sat inside which was fun and laid back. We had the French oni","useful":0,"cool":0},"MeNw-VTf6OuPtE6En7BLuw":{"text":"Went here for my moms birthday. We were the only table here. Our server was more intereste","useful":0,"cool":0},"v8Twp_cGHahUz3pLLoWeEQ":{"text":"Flamingo go go is a no no.  If you are a tourist in NOLA this is perfect.  Locals stay hom","useful":0,"cool":0},"y5Ge6wy0wJwmj3mLG4SSAw":{"text":"I came here on a Saturday morning for brunch, prepared that the restaurant may be pretty b","useful":1,"cool":0},"F1tnqJ3suPYWMmr7vg8qbg":{"text":"U guys chased a customer down about taking a glass out the building but brought cold food ","useful":0,"cool":0},"38AkaCqMaT2eT064r2n2CQ":{"text":"I cannot day enough good things about this restaurant! Every time I have come here I have ","useful":2,"cool":2},"bqhz1AqDF1_QBMbbRZ6lFA":{"text":"Had 12:00 indoor reservations and was pushed aside with all the walk ins. After waiting 30","useful":0,"cool":0},"FM1V4ImkcY_ft12VzevYxg":{"text":"The atmosphere is nice. The service is horrible. Don't know if it is lack of staff or what","useful":0,"cool":1},"Ov7MM_rW3qWffv83vra7gg":{"text":"Although this restaurant doesn't have the best food to me personally, I really enjoy going","useful":0,"cool":0},"ouTFbSFo-MvA70uf6UgXhg":{"text":"I wanted to love this place -- from the name to the decor and what I saw on their website,","useful":0,"cool":0},"DfE7svuHDTe4nWIYv9ryQw":{"text":"My daughter and I were in town for the independent film festival, which is based in the Co","useful":1,"cool":0},"937JFi5ZWBD81Oa2cdvIEQ":{"text":"Slow service, even with the place being mostly empty and having made a reservation. Food w","useful":0,"cool":0},"7xavYG0fDSskP67xVEAU7A":{"text":"Such a cute place in the area! Went here for happy hour which slightly disappointed as the","useful":0,"cool":0},"qDzBtnjg8jmIj3ZwXtWn8Q":{"text":"Lisa, you were awesome. I really respected that you were busing tables, serving drinks, cl","useful":0,"cool":0},"HVy8J5vRADZl6vxlBqa5Wg":{"text":"Tuesday night. Still, this place should not have been as empty as it was. It is one block ","useful":2,"cool":1},"fh4-9oIkxb1gyXj2QuAJyA":{"text":"If you don't ask for Laura, you are getting a disservice. Best and most accommodating visi","useful":0,"cool":0},"0RDmgxfSL6D4LzOCkqMIvw":{"text":"They were the best! Best frozè. I crave them! And rose, yum! Plus they were amazing to our","useful":1,"cool":0},"zrjAHerazqjHS6ZZfqxmHQ":{"text":"My friends and I came on a weeknight and sat at the bar. Our bartender Amber was super nic","useful":2,"cool":0},"gBBSJXKDu97GR59wGYmdIA":{"text":"I have a cat at home named, Chow, and I was really excited to hear that y'all had \"Corn Ch","useful":0,"cool":0},"6_vN8szhBjoc_etMOOmIXA":{"text":"Very busy early evening...took quite a bit of time to be approached at counter bar seating","useful":1,"cool":0},"REeTBWed1T6V6NbnMIIxsw":{"text":"We found the best place to eat super close to the Hotel . Brian our server was very knowle","useful":0,"cool":0},"OPbIPGivoh4Ena0EUr-5tQ":{"text":"Delicious drinks - too many good ones that made it a hard decision. Yummy burger. Excellen","useful":1,"cool":1},"L-0aH4pbJPf2sCYPI4Y2OQ":{"text":"I chose this establishment to celebrate a monumental moment in my life- my engagement. Muc","useful":4,"cool":0},"ppea7IlC2c_K5Gs6wLGk0Q":{"text":"A real fun hip place. The food was yummy and the service was great. I went there for my bi","useful":0,"cool":0},"QcsZFuTxcklrib9gnIHG9A":{"text":"Rarely do I write a bad review... however... this place was beyond bad. Service was slow a","useful":1,"cool":0},"RgZNlz56MjuTXblfnj5Yxg":{"text":"The worst service I have ever experienced...the concept is good but the food and service i","useful":0,"cool":0},"vFqqxvdU_pKcKviGQYglNg":{"text":"I have been to flamingo a go go about 3 times now, and it has been a terrible experience e","useful":0,"cool":0},"hH--_STZGY0dV2fWVEHeRw":{"text":"REALLY fun place and great staff! Drinks and food were all way better than i thought they ","useful":2,"cool":2},"uH0WMS2ilWCPYXujCwbwFg":{"text":"LOCATION:  The restaurant is just 2-3 blocks down St. Joseph St. (On corner of St. Joe's &","useful":0,"cool":0},"lHRn7YP7nOWslek2I0dK1w":{"text":"Loved the atmosphere of this place but will probably never go again.The first time I went ","useful":0,"cool":0},"0NG9Nlap20xYW6etOqYSeA":{"text":"Okayyyyy so let's start with it took over 30 minutes to get bottomless mimosas and rosé. A","useful":1,"cool":0},"Fou4BLfPK28huXg2Ckdhlg":{"text":"Food was great as were the drinks service not so much. The hostesses were great our waitre","useful":0,"cool":0},"bXSgQxn0KlWsuR3SH7eIhw":{"text":"Super fun and colorful atmosphere-definitely a good drinking place for larger groups. I've","useful":0,"cool":0},"LtGYFRFdLpeYGxmRd2anCg":{"text":"FLAMINGO A NO NO. Service slow. Waiter on phone! We waited 25 min for our check alone and ","useful":1,"cool":0},"w90SOILEClVzpZBhomkcbA":{"text":"Busy Sunday visit! So busy that Maya our hostess stepped in to ensure our experience was a","useful":0,"cool":0},"Pt0HU71JvAPcUD45rkI7cw":{"text":"Great service! We had a 17 top for my friends 21st birthday and Amanda was great! Very att","useful":0,"cool":0},"lbSoLcGvq-dfmQk_SU1Izw":{"text":"I ONLY gave this restaurant 1 star because I had to pick something. So, 9/15 I have dinner","useful":1,"cool":0},"SEgrPIbcgJ-lyU3aI3o-hQ":{"text":"I came here for Sunday brunch. The food was great and the prices were too. Came out to spe","useful":1,"cool":1},"xsX1-kuTMTXhEhTAi_4nTg":{"text":"This is the worst place I've ever been to just based on the service or should I say lack o","useful":0,"cool":0},"k5KWAUWcibDbhQ7mOvRjZw":{"text":"What a cute, creative and fun spot. I just stopped in for a quick $5 HH frozen margarita t","useful":0,"cool":0},"aD6jTBWlPsLmLq2XY30FxQ":{"text":"Everything was so good and this place is so inviting. A group of 14 went for brunch today ","useful":0,"cool":1},"-92_SrsIl6TrbSEeF9krgw":{"text":"Let me start out by saying this place is really cool. A super fun place, with really neat ","useful":0,"cool":0},"aQoue1PtwCgPf3Crj6My9w":{"text":"I really wanted to like this place. I went for brunch and got the bottomless mimosas (of c","useful":4,"cool":1},"J15wgIhPexjzfBqVBkIZ8w":{"text":"I wanted to love this place so badly because it's so cute! If I only reviewed the decor an","useful":0,"cool":0},"mEOL6kJbfpMdObpWNcUk9A":{"text":"If you ever visit ask for Emily! The food was great but the service outshined the entire r","useful":0,"cool":0},"oMTjyGWrH6kwz3-GFyPaKg":{"text":"Y'all have to come see Jinette during brunch!!! Best waitress everrrrrrrrrrr\nWait time for","useful":0,"cool":0},"EFXZ_RkDfmKFxgR9J5EGtw":{"text":"Such a fun and festive atmosphere, with drink specials to die for. If you're in the area, ","useful":0,"cool":0},"DBS8xoLHAKOMGe0RQN0SuQ":{"text":"Our Waiter today was very unfriendly. We were sitting at the Bar and it was fairly busy. S","useful":0,"cool":0},"iKOQEC84aaEawpkg43x4ow":{"text":"Will I ever go back no. I was invited for a friend's bday. I had chicken and waffles, frie","useful":0,"cool":0},"sS2gNefQIr3vnjQtLy_80g":{"text":"The only reason I gave this restaurant two stars is for the food. It was very good but our","useful":0,"cool":0},"D6Lr39dc3XX2C9k3nR4DgQ":{"text":"the appetizers and drinks were good but service was horrible. the waitress took 30 minutes","useful":0,"cool":0},"00JDELJIIKFWuUFgBja3qg":{"text":"Flamingo a go go is the best. Chef Patricia in the Kitchen is cranking out some of the bes","useful":0,"cool":0},"IGN0BRFnIReu_ZTJtZp--A":{"text":"If you are looking for a cocktail this is your spot!  If you are looking for a meal look e","useful":0,"cool":0},"3Jl0ZN-Gd0Hhy9IesgEhdg":{"text":"When arrived there was only 1 other small group of people at the bar (3 or 4).   The barte","useful":0,"cool":0},"z4VF8DPp1pFbSscrrYbcsQ":{"text":"We went in on a night with an event so it was expectedly busy. After waiting about 30 minu","useful":0,"cool":0},"jE3_x_HtNJZZSU82v79A3g":{"text":"I frequent New Orleans a lot, and was so happy to stumble across this gem thanks to my fri","useful":2,"cool":2},"DJWvnNFjtoma0Jiithzhig":{"text":"we waited two hours to be served. we came for the bottomless mimosas on a saturday, and af","useful":0,"cool":0},"dWz449u8wyOOVKC5nVr8Kw":{"text":"I came here with a few girl friends because the decor is cute and we wanted to sit on the ","useful":1,"cool":0},"_N7qdeJL9AFuJTZlp3PELg":{"text":"They are the best. The manager is 10/10. The food was great. They went out of their way to","useful":0,"cool":0},"H1QoAGsajGi3Wu0Hu5wcJw":{"text":"Had a wonderful spring evening on the patio here! Shrimp and grits were phenomenal, as was","useful":0,"cool":0},"QoJqFZldfXYgNm15uR---g":{"text":"Such an amazing EXPERIENCE. The environment, the food is great and Christy (the manager) i","useful":0,"cool":0},"_k1S_GYg28L8gDHpumU67w":{"text":"We walked in with a large party and were seated right away. Our sever Amanda, was very att","useful":0,"cool":0},"jKHtZ1JQrKY2EOjsJ1zlsg":{"text":"Best brunch spot in New Orleans. We were seated immediately for a large group of 7 even th","useful":1,"cool":0},"ccIbqbfMnGa-J3FutbZFyQ":{"text":"The place was nice but the service was awful. It took an hour to have a beer, the food was","useful":0,"cool":0},"FHys8CrWBZnAWL-Dsc8yaQ":{"text":"Service is just so so. Recently sat at the bar and bartender was a little slow. Everything","useful":0,"cool":0},"TKZT5wQAaMXj7kw80lX2qg":{"text":"I've eaten both the Seared Tuna Salad and Ahi Tuna Poke. Both were exceptional. The inside","useful":0,"cool":0},"czYVxZhYepZ3jsE8Tf-NLA":{"text":"Made reservations for 12:15 brunch for 2 people. Took over an hour and a half to get our f","useful":0,"cool":0},"C6gB6YQfTb50dBZY-0plXg":{"text":"Nice to hang out for a beer. Nice bar and outdoor patio  Fries are good. Omelette was unde","useful":0,"cool":0},"8v4IBJXFywX1Exkm-lwAIw":{"text":"The atmosphere inside the restaurant was very noisy and the wait staff was disappointing. ","useful":0,"cool":0},"NJflJZPyc6HwEZb65vw2Iw":{"text":"Flamingo is located in a nice area where there are plenty of restaurants, bars, shops etc ","useful":0,"cool":0},"gv7FGWTpsYjpVFcZP1z2qQ":{"text":"This place was horrible, we ordered nachos as an appetizer, that were cold like they had b","useful":0,"cool":0},"RoSiOGXPNSRy1pxI0p_xvw":{"text":"Terrible service because of the rude hostess. She told us there was a 10 minute wait for b","useful":0,"cool":0},"6iYBHDJ8ns56Y8XMFcFRsw":{"text":"Drinks, drinks, drinks! The Frose here is out of this WORLD! It's legit, make sure to try ","useful":1,"cool":0},"YuUi6dnVMKA3Mtb1iOk4Fg":{"text":"Love this place. Came for brunch and was not disappointed. Iced Irish coffee topped with B","useful":0,"cool":0},"jvd8Ze1FE9ZzTQSoTk6zug":{"text":"\"Flamingo A-No-No\" \nExtremely over priced and overrated. A single slice of toast with avoc","useful":1,"cool":0},"fCuqWlxUe8JFy1ZlOj9g_w":{"text":"This is a great place to watch sporting events and gather with friends! The staff is atten","useful":0,"cool":0},"Sw1e3gPTJSc0_qlYsvgYXw":{"text":"Posh and colorful spot with equally fabulous seating both indoor and outdoor. Lots of sout","useful":1,"cool":1},"667E0TUorXKjNHerPgnZgA":{"text":"My family and I went here after the WWII museum. The food and drinks were really great!! E","useful":0,"cool":0},"DZFGgyhmUyLTWxH2vmA_0w":{"text":"We had a great experience the other night. Our waitress, Erin, was great! She made really ","useful":0,"cool":0},"wRaY4amAoMP56ZO4JIXFqQ":{"text":"This place is poorly managed and hostess staff is always rude. I have come here on multipl","useful":1,"cool":0},"Z7lwqwPSGGxNBHvPw1hqZA":{"text":"RED DRESS RUN! \n\nExperience was excellent! Maya was so sweet when we walked in and complim","useful":0,"cool":0},"r5XOzBXJzVCilI7XuJIU1w":{"text":"The service here is horrible!! Very unorganized! The kitchen is slow, Appetizers come out ","useful":0,"cool":0},"sScijwSADDlFCBAjXG7lOA":{"text":"Such a great brunch spot!!! Flamingo has a wonderful atmosphere in addition to having a su","useful":0,"cool":0},"SC2E4JYbWDwe9mVOFMEm3w":{"text":"Great service! The bottomless mimosas were always bottomless with the quick service. We ha","useful":0,"cool":0},"iBcSB2TWthY12l5OradxoQ":{"text":"Had a great time at this Flamingo themed place! It's whimsy and fun! Tyrone the Manager ma","useful":0,"cool":0},"5a6jIOwjFxWED5Bae1sTaA":{"text":"The food was ok. Two servers came up stating they were our servers making It confusing. My","useful":0,"cool":0},"NvMRDl_SQnIFEGwFfdOsOQ":{"text":"omg. i never got so drunk/tipsy over bottomless mimosas before until now LOL. i came with ","useful":0,"cool":0},"ZXc6HwOJbr3oxd3dNxlvnQ":{"text":"We had several issues on this visit which was our very first visit to the establishment. T","useful":0,"cool":0},"wEN9IRpja3oyCOzUHwcjJg":{"text":"*Brunch review only* \n\nCame by for brunch on a Saturday. I made a reservation for a large ","useful":0,"cool":0},"JviBx9SwvAktp5safb0dzA":{"text":"Nice little electric place with fun wall art  good music selection, Great food and refresh","useful":0,"cool":0},"wvpOdj_8V4lnX2ju3vF8NQ":{"text":"Unfortunately the service was so bad, the food was unmemorable. \n\nWe made a reservation in","useful":0,"cool":0},"uZTpQvtRNeVt39aCU8YDGg":{"text":"It's a fun place and good for kids.  The food is ok (the bartenders were slow-FYI) but wha","useful":0,"cool":0},"89ZlIRmtnKRL18apc-2gOQ":{"text":"Nice place to grab a quick bite to eat. \n\nOpen and spacious seating area; indoors and outd","useful":15,"cool":11},"sx7_ycP3Qo9UDGCd4WGP8w":{"text":"Finally got to come here and try it! I've always heard great things about the place and ho","useful":0,"cool":0},"HrgZwWwoDF2SWUEezDx1qw":{"text":"Oh. My. Gosh. Flamingo A-Go-Go has really set the bar for brunch and I only fault them for","useful":3,"cool":3},"heGF6nxpuPpnJymaS90GwQ":{"text":"Brian was a great server! He made awesome recommendations. I will definitely ask for him n","useful":0,"cool":0},"Ig6-sWFdJFVkfW6TXZZX5g":{"text":"This place is tragically awful! Service sucks, the food is disgusting! I ordered a shrimp ","useful":0,"cool":0},"BQvz51wIlwIGPrFzBQQ6Iw":{"text":"Our server,Emily, was fantastic and very helpful. Margarita was good, but sidecar was too ","useful":0,"cool":0},"4JkIWKwLOS9bq1qWK9QITA":{"text":"I'm a New Orleans resident who made the grave mistake of allowing friends from out of town","useful":0,"cool":0},"paN8o5RFndZPVOhRbVqATw":{"text":"Saltiest food I've ever had in my entire life. My omelette tasted like a salt shaker. Not ","useful":0,"cool":0},"pXc4mqzMqDoybx8EO6MY7w":{"text":"Seriously Stupid Good!! OMGawd, y'all. If you want fresh ingredients, sautéed into histori","useful":0,"cool":0},"VF8ieKsMRmK1rG7ExSZpMg":{"text":"If your 25 this for you , music in the back patio ... but very loud Inside ... I order shr","useful":0,"cool":0},"gFdbyv0kfxSpccmgJNWP2g":{"text":"Service, atmosphere and food was outstanding. Chicken rotini was amazing and do not forget","useful":1,"cool":1},"E5awlchrFK47l4lsA_HaFA":{"text":"We had the dog with us so we needed a breakfast place that we can bring him with us. Flami","useful":3,"cool":1},"PgZHlphboHVQdEtfKVtsTw":{"text":"Came in after the Sugarbowl for a quick bite since they have a late night menu from 11pm-1","useful":1,"cool":0},"zis4sCN5cNy6aVcpZvUzZw":{"text":"My boyfriend and I sat at the outside patio to eat lunch where it was beautifully decorate","useful":3,"cool":1},"023dKCe8_4kNYWwhpsyrfA":{"text":"Laralynn was an excellent server. She's accommodated for a large party, got us extra chair","useful":0,"cool":0},"SRhzJUhOXBzkOul9Fe686g":{"text":"Food was good, but generic tasting. The atmosphere was cool and the staff was very attenti","useful":2,"cool":1},"4tnlRrH4boGqvuiguYZhFA":{"text":"Dined this restaurant with a large group and the service was great! The food, notsomuch, b","useful":0,"cool":0},"JtGiiyW_Ma1r7O1IxXKTvg":{"text":"Cool place....away from French Quarter, just a block away from WWII museum (easy walk). Ki","useful":1,"cool":1},"Q_wq-9H-L-F09B_O5KYY8w":{"text":"If you're ever in town, you have to try out this place! The food was amazing, the hospital","useful":0,"cool":1},"L7eF5al6jGmRv-w6xH8O5g":{"text":"The food here is amazing as always. It's really the only reason I keep coming. The service","useful":0,"cool":0},"XIVXJKAzFPCOYluqxfQLQg":{"text":"Second time coming to this restaurant.  \n\nThe first time we came to the restaurant, it too","useful":0,"cool":0},"nZ8WMWP2CEHlbxBqd7qI4Q":{"text":"They accomodated our party of 30 beautifully!!Allen Jay was amazing! He handled an energet","useful":0,"cool":0},"0PGvl2lZzaunvL7h6zo4CQ":{"text":"I was there with friends recently and the atmosphere is amazing, the food was FANTASTIC. I","useful":0,"cool":0},"Uk_h8AFL0CzUmc6UXlfuJA":{"text":"Slow service. Bottomless drinks are cool but not when the service is so slow that you bare","useful":0,"cool":0},"M8tKfJMsUiQ_QDqsORPwqQ":{"text":"Shante was AMAZING for our big party! She was like having five waitresses in one!! The foo","useful":0,"cool":0},"eWFMhyqovBUT7anKAYVgYw":{"text":"We stopped by for drinks and then had an appetizer.  The staff was so friendly. Alexis was","useful":1,"cool":0},"Y9zsz_CfG94bcWx_eTPpRQ":{"text":"Laralynn was the best server ever!!!! Should just go for her! Plus mimosas and flocktails ","useful":0,"cool":0},"JeChodnICobOgBi530YI3g":{"text":"So... I've read the reviews and I have my own opinion. The brunch is everything. $10 botto","useful":0,"cool":0},"Xz8wqjLZGbeTTNPNurw7Aw":{"text":"Great place to stop in for cocktails! Love the decor and vibe. Didnt get a chance to try t","useful":0,"cool":0},"6ehiIcjOjX97OhXyNeH3Lg":{"text":"Terrible experience. We arrived and we were told it was an hour wait it ended up being 2 h","useful":0,"cool":0},"MtrJY4heGr6jfXGQ-dQ_5Q":{"text":"Went here to get drinks and appetizers and it was absolutely amazing! The food and drinks ","useful":0,"cool":0},"K0HxJxgmwrLaT2pyKBFogA":{"text":"I usually stay in the warehouse district when in NO, so the FLamingo is a great spot to gr","useful":0,"cool":0},"uyfExSCVA62IIMcxWugXyg":{"text":"Flamingo is a neighborhood spot that my friends & I frequent. When we don't sit at the bar","useful":0,"cool":0},"ZwymT41uiN2lcuJs51Aohw":{"text":"Do yourself a favor and go here....specifically on weekends for brunch! The atmosphere is ","useful":0,"cool":0},"vwAPOZDWyzKTJGk1W_KmIw":{"text":"Today was the NFL Championship game and the city was packed. After the game we headed here","useful":0,"cool":0},"bsefoeu49idiiiTanYnCcA":{"text":"Very good service! Chrishante was the best. The food was great. The shrimp and Grits were ","useful":0,"cool":0},"zO7VgKeX7WIQA3C0Mjq3Gw":{"text":"What a fun place! While visiting from out of state we stopped by for lunch and cocktails. ","useful":0,"cool":0},"bnCEPEjpF_f9JrftKnw0bw":{"text":"Wonderful service  for a large (large!) party. Shanté was awesome and made sure everyone h","useful":0,"cool":0},"ykWpJo2PO1vpso3f5koLEw":{"text":"First we went with a large group of people. We had a wonderful and witty young waiter. Foo","useful":0,"cool":0},"7_1qZ36Bk8nG6HgEcDxtaA":{"text":"Just moved across the Street as this new establishment was opening so I was initially exci","useful":0,"cool":0},"mFUbLa27KN9fWHMehmXqtw":{"text":"Ate here on a Saturday morning for brunch. The atmosphere is cool, the food was moderate, ","useful":0,"cool":0},"Lpi-NBacsu0PQ3d2KjqFIg":{"text":"This place has very fruity drinks, not really my kind of place but everything was okay. I ","useful":2,"cool":2},"zVgB3XD1uIjCet_iMHswmQ":{"text":"This place is so cute. Definitely off the beaten path but worth the exploration. We came f","useful":2,"cool":1},"GHf6bQpwmg_pyAFhMipEFA":{"text":"Loved this place! We just arrived from Fort Lauderdale and had a great experience thanks t","useful":0,"cool":0},"2HVfgG7aG2aR_uWK2qfJRg":{"text":"Yes yes yes!!! We live nearby and have watched this place transform into a super cool plac","useful":7,"cool":6},"EhR-L5wvGuS0C46xYRO9kA":{"text":"Good was above average for bar food. Actually delicious.  Healthy portion sizes and served","useful":0,"cool":0},"1Tr-aKciCUfy-zEZWqidyQ":{"text":"Hurricane Barry was looming ever closer, and a lot of places around New Orleans looked lik","useful":1,"cool":0},"KI50sBmZsQz6K-iOrvLu_g":{"text":"This place was everything! Millennial approved! There was a group of 6 of us for a birthda","useful":0,"cool":1},"-nP_d6dolAsVQGraoTDddA":{"text":"This place was a blessing being open on Christmas Day for brunch. I'm active duty in the U","useful":1,"cool":1},"9dvJynIUsAXHBlEYpGMMAA":{"text":"Amazing place and service!!!! Will definitely be back for another girls night!! Our server","useful":0,"cool":0},"PE4BqiJO2LbX_C4IMzTIIQ":{"text":"I was hangry at the World War II Museum and literally this was the first spot my boyfriend","useful":0,"cool":0},"7noZSegTLufMHR47ymC8TQ":{"text":"My co worker DJs here on Fridays, so some of my other coworkers and myself decided to come","useful":1,"cool":0},"1JUClQ00afeHSRx2DSLXuA":{"text":"Today was the NFL Championship game and the city was packed. After the game we headed here","useful":0,"cool":0},"Lu_ZviDW47Olfu3I9-1BhA":{"text":"amazing first experience! Tory was excellent.!!!drinks,foods and service we're fantastic!","useful":0,"cool":0},"r4v_n05LTMDbsoI0KcD_rg":{"text":"What can I say about this place. First the positives, plenty of alcohol choices.  The deco","useful":0,"cool":0},"oOZJNYmUrZC5Eop2aOvhtw":{"text":"Arrived here after a cycling class so we were obviously starving. We were in a group of 13","useful":0,"cool":0},"LnNuabSBCoPuutihSAHofA":{"text":"This is not a place you go to for a nice dinner or anything like that. It's more of a plac","useful":1,"cool":1},"dKzP02cltpcdY_CzQqvvQw":{"text":"Went to this spot off of a suggestion. Wasn't quite sure bc I looked at a review a few hou","useful":0,"cool":0},"NfHoGDT8Eon-F7RtmwKDng":{"text":"Just went there today Missy the manger was AMAZING! The food good. Will be back for sure.","useful":0,"cool":0},"Ngy7ZazM7VCMZ8-rwcfcIA":{"text":"-30 minute wait for 3 salads\n-pathetic portions and no croutons even though the menu liste","useful":2,"cool":2},"x0urfjTd78yODXhxpjgs7g":{"text":"This place is extremely overrated and overpriced. It's cool for atheistic reasons but that","useful":0,"cool":0},"rWCxM8DqJeWtZtdo42VX_A":{"text":"I adore this place, especially for $10 bottomless mimosas and rose at brunch from 11-3 (ye","useful":1,"cool":0},"ey1I3raJzz9hu9QO8zB65A":{"text":"I came to Flamingo with a friend and our daughters after spending a year hearing my teenag","useful":0,"cool":0},"QXXy5mYXlcwy_iK2aY5siw":{"text":"We were very excited for the bottomless brunch! But unfortunately it did not live up to ou","useful":0,"cool":0},"nwqCYE0bJEOixfVQSnQqPQ":{"text":"This establishment is by far the most exceptional restaurant my tastebuds have ever experi","useful":0,"cool":0},"wx2wcL3Cc4pTH342Wk6E4A":{"text":"This place had great food lots of different options and most importantly a great staff!! W","useful":0,"cool":0},"AzW7644sI_vDzWdxpSJT9w":{"text":"Awesome chicken and waffles!  Bottomless Mimosas....so good!!  But the best part of our di","useful":0,"cool":0},"0C0d0IylhoAGK3HMe9SI8Q":{"text":"We were served breakfast by Danielle, and Kia came around refilling our drinks!!!  I usual","useful":0,"cool":0},"2ystUqpUANhYaK0VBAIH9g":{"text":"Decent local place with average food and inattentive service. Bar food, mixed with attempt","useful":0,"cool":0},"PCqclJpb1BQzJuL8Ba0qBw":{"text":"Let's start off on a positive note. The food is DELICIOUS, HOWEVER the service sucksssss! ","useful":0,"cool":0},"pmAQLNaGXjJtq8IE-3-zDg":{"text":"The atmosphere, service, and food were awesome! We sat on the outdoor patio which had a pr","useful":1,"cool":0},"cWoSMbc9vdPP7w0NT6ugXA":{"text":"This place had great food lots of different options and most importantly a great staff!! T","useful":0,"cool":0},"ygXyD3tmdu0cCgh16a0d8A":{"text":"Emily Danos was the best server I've ever had. She was very personable and kept our bottom","useful":0,"cool":0},"b44c4_f256WCTGyhY3ovQA":{"text":"Danielle C was amazing. With this being our first time she definitely showed great custome","useful":0,"cool":0},"bsEtZhTcnH8Bv0jGfthYoQ":{"text":"When first approaching them the place seemed so promising. The decor and atmosphere is rea","useful":0,"cool":0},"M_DRHGvbQoPMAtVkmvEa6A":{"text":"4/24/19\nOur second time trying this place. First time didn't even get to order. This time,","useful":1,"cool":0},"m0ac4x05RKpbc8e1M8nyCQ":{"text":"Lara Lynn was the best server ever!!!! Super accommodating and friendly. Great experience","useful":0,"cool":0},"dj88N7fkrkReKmt4sIn8iQ":{"text":"Such a great brunch spot!!! Flamingo has a wonderful atmosphere in addition to having a su","useful":0,"cool":0},"Ctwr5giTOW7MQiNgg9j_vQ":{"text":"I've never dealt with service like this before. We never received water, our order was mes","useful":0,"cool":0},"CP4w8Jfj6h11o-VkphUHqQ":{"text":"Came here with our friend, arrived at 8:15. After 15-20 minutes, first round of drinks fin","useful":0,"cool":0},"kSutBkJ0JpmrcW8mKI_Gpw":{"text":"Flamingo A-Go-Go is a good spot in the warehouse district for getting together with a grou","useful":12,"cool":8},"uNlviCFZN7p83L8smJb8qA":{"text":"Omg! This venue is awesome and amazing.. My cousin had her Engagement Party here last Sund","useful":0,"cool":0},"edKhM1W-xcD76mBs3KKatA":{"text":"For the record, I only do establishments that are excellent or are absolutely awful, this ","useful":0,"cool":0},"28aL9ouIYBBgL_MI39chfw":{"text":"We walked into this place at 7:30 pm today with 2 hungry kids. There was no one present to","useful":0,"cool":0},"MdONxHcD0Zd2JpTJYRa44g":{"text":"We went here for brunch today while we were on vacation and had a pretty decent experience","useful":0,"cool":0},"rSqKWHiXeT-7DDFUULYPXg":{"text":"This was our first time at  Flamingo a-go-go and we'd definitely be back! The service was ","useful":0,"cool":0},"bZIP69t8T64_65O4q5HWgQ":{"text":"I was walking on the street and saw this place, looked it up on yelp and it had ok reviews","useful":1,"cool":0},"8nP03fqntrOUARVKpkKKag":{"text":"Came by on a Friday night. Very young vibes with music and affordable food. Got the fried ","useful":0,"cool":0},"MhV8fHDdB_zgcz61CgdzlA":{"text":"Went here for brunch for my friends birthday and the food was amazing. The Gouda grits and","useful":0,"cool":0},"3NljkzkyqyOp2ilx0B0Dbw":{"text":"Ask for Amanda G. when you decide to visit. She is easily one of the best waitresses I've ","useful":0,"cool":0},"x3G6PHj90xfd168aDM5iGw":{"text":"I ordered on Waitr and after 30 min there was still no response from the restuarant so I c","useful":0,"cool":0},"T6gM-hn5rI1l7uloOfm02Q":{"text":"In der Nähe des World War II Museum liegt dieses bunte und schrille Lokal mit Biergarten .","useful":0,"cool":0},"0X8bofiJocgUvY_g4SqfuA":{"text":"Amber and Joh'Quissa are the best waitresses/ bartenders I have ever had. They are doing g","useful":0,"cool":0},"hJCAF50VBngN4Woh_m8kBg":{"text":"Fabulous Food! Very friendly service and a fun atmosphere! Will definitely go back!!!!","useful":0,"cool":0},"QhVREVUU6YMQ8iHaagTIJw":{"text":"Laralynn was awesome!  We were seated in the courtyard when it started raining.  She helpe","useful":0,"cool":0},"Mtq0ragbb8qWxfzooIQZ8w":{"text":"I came in with my friends for my birthday brunch Saturday 3/23 and i had the worst waitres","useful":0,"cool":0},"E8YAAb9ooBFNx5KM3IYf1Q":{"text":"Drinks and food are pretty good. The service was great! I really wish my steak kabobs had ","useful":0,"cool":0},"ROxh0h76bzasxDxPcR65eA":{"text":"It's fun to be in LA enjoying local flare. I love the patio atmosphere with all the colore","useful":1,"cool":0},"MR3P3hVlUw_4oGzO-k-adg":{"text":"Absolute best brunch spot I've been to. Super affordable, and impeccable service. Going ou","useful":0,"cool":0},"npnZKruPaNyS-ycdi8j6gg":{"text":"The food was okay, I've had better quality but our server was awesome! She was attentive a","useful":0,"cool":0},"j0-nN1SP6Bu4_VMByXbfmg":{"text":"Came with a large group for a bachelorette party. Service was quick and food was good! Dan","useful":0,"cool":0},"eV9tVWoTQNGfwpTcLzf5xQ":{"text":"Worst service I have had in New Orleans in past 5 years despite the restaurant only being ","useful":1,"cool":0},"yWetCblh3VVPkCb_Qv1ZkQ":{"text":"Flamingo A-Go-Go.. hmm. I'll just say it's a must off the bottomless mimosas. $12 unlimite","useful":0,"cool":0},"VIzDuxeIaBX4mxnTkqyDng":{"text":"Today we celebrated a dear friend's 30th birthday brunch! I had no prior knowledge of this","useful":0,"cool":0},"pyH4MLKBw0Gy-sJLYNSPCg":{"text":"This place is so cute and I love the vibe. My waitress Desiree stood out to me, she was ve","useful":1,"cool":1},"zrBGvcj95QPmekidpt0JDw":{"text":"Great place...good concept place drinks are straight like 9:15...food on point like the . ","useful":1,"cool":0},"Lsw4rdf5_csyQXnz__0bBA":{"text":"This restaurant is not worth the wait. We waited over an hour and a half for a table just ","useful":1,"cool":0},"cBTGZbfAnWHduDV_3xpTkg":{"text":"This place is awesome the patio it a great space! Food was amazing! And bottomless mimosas","useful":0,"cool":0},"m7evgr9nxrreXc5KLi4bZg":{"text":"Giving three stars bc of their bottomless, that's all I ever come for since the food is ve","useful":1,"cool":0},"3gyMVZ1Ep2kUnUyfXxLnhg":{"text":"I was pleasantly surprised. To start off, the interior and exterior decor is really nice. ","useful":0,"cool":0},"Df4qIIe9ForQbHYdE5ym1A":{"text":"Really large outdoor space was nice, I'm sure its fun when its packed popping. Drinks were","useful":1,"cool":0},"qeulfmUhZIb34VjbW8z65Q":{"text":"The food was great. The service was also great. We sat outside and the ambience was amazin","useful":0,"cool":0},"zd081hWDsvm7KVQUPPIErw":{"text":"Fun patio and even better drinks! I came here for cocktails on a bachelorette party. It wa","useful":0,"cool":0},"MWlW8VnNsgX70uatZj2R-A":{"text":"We had 16 people for a bachelorette brunch, and they did not have our reservation saved in","useful":0,"cool":0},"ILdLgWSON7aX_z9Ia_sqjA":{"text":"What is wrong with Yelpers when they arrive in N.Orleans? They get so drunk, that everythi","useful":0,"cool":0},"YA20rC-pgtxBlFVbPe5VEw":{"text":"The atmosphere and food are amazing! Get the go-go bites and ask to sit outside if the wea","useful":0,"cool":0},"rAVU8PfhWwenES3lvTSRLA":{"text":"I'm very glad we stopped in on Sunday morning for brunch. The service was AMAZING and we h","useful":0,"cool":0},"OxHUklz7sSBDIg4hsQAyxQ":{"text":"Fun atmosphere. Plenty of fun drinks to choose from. Menu had great offerings but they wer","useful":0,"cool":0},"5RAX_Jn2NliuJUD_vR_X7A":{"text":"This place has the potential to be awesome. But it is over-priced and the staff are awful.","useful":0,"cool":0},"pANBw546rE3XzBeYXCXSZA":{"text":"This was a great little brunch spot! My friend found it on a blog about NOLA. Danielle C w","useful":0,"cool":0},"zAuECkeLa4ks5BRHZwgZ2Q":{"text":"Awesome atmosphere! Drink prices were very reasonable, and the bar tender was great. If yo","useful":0,"cool":0},"2eITDmVCoL_uZ7wdaK-uLQ":{"text":"Went to dine here with a friend this past Saturday and had a very disturbing experience. T","useful":0,"cool":0},"XujY1KT8zER-d04yTJmEqw":{"text":"Service was slow, the hostess today had the slightest idea what was going on in the restau","useful":0,"cool":0},"JxTCI5xkev6oB3IF5yAkqw":{"text":"This was my first time visiting the restaurant and I was pleasantly surprised. The brunch ","useful":0,"cool":0},"sljTiGJ96XiiFBJzo1MlLg":{"text":"Made a visit while in town for a work event for the first time. Great atmosphere and good ","useful":0,"cool":0},"M5IfFcaD_qp8-cOmXmKU4A":{"text":"Came in for happy hour, the service was amazing! Great drinks and killer appetizers all in","useful":0,"cool":0},"rHWw_lrx1deBAMbKPXnb_w":{"text":"I'm really digging the renovation of this restaurant! The exterior and interior are now ve","useful":2,"cool":0},"H3rt5Em6XmCRqumSG1p21A":{"text":"A hell of a chilled low key place ,quick service ,the mango mamosa was my personal favorit","useful":0,"cool":0},"-sCcwjw2EnQQdcvPsrcM7g":{"text":"Bryan was awesome! Had a great experience. Super helpful with figuring out drinks and appe","useful":0,"cool":0},"5M6zBiBMvsNpXDeN1Qlzkg":{"text":"So great in here! The atmosphere is really fun and the food is delicious. Try the all Amer","useful":0,"cool":0},"sZkIrbo2qbdMlZ6hmwfgkg":{"text":"I came here with some friends on a Monday night to watch the bachelor and really did enjoy","useful":0,"cool":0},"6CmpjD2UPDKUVWsNFuHLCg":{"text":"A great spot to have lunch-  it's family friendly and close to the WWII Museum.  The food ","useful":0,"cool":0},"mZMtuPxohHxgAlRIL_62BQ":{"text":"We went in to Flamingo A-Go-Go for drinks and appetizers for my sister's 21st birthday and","useful":0,"cool":0},"Y9e3N1bMKsmVYCzfrWSQFg":{"text":"Lackluster service, lackluster food and a misleading happy hour. Flocktails are very sweet","useful":0,"cool":0},"IF6iXOkTxJnTYbX9R4AqGQ":{"text":"Flamingo a NO-NO... nothing more than a trendy New Orleans Friday's... nothing impressive.","useful":0,"cool":0},"wPcAWw-q3VEMiJ12ptXJyA":{"text":"Great spot on a sunny day. They have a great patio and yummy frozen drinks like the Bushwa","useful":2,"cool":2},"x1fwKNkK9gK_-9Lv23xh8Q":{"text":"i cannot thank, nor tip, the staff enough for all they did\nI came for the first time on Au","useful":2,"cool":0},"Hm9TJpsK58QcZPRk2dyyfA":{"text":"Great place for food and drinks! Some of the Krewe of Muses had their pre party here befor","useful":1,"cool":0},"AAIQEvoU-4JWw98Z4YqWFA":{"text":"Not much to say. Walked in after Wednesdays at the Square, there weren't too many people s","useful":0,"cool":0},"frMQyxdubpLG7jvslqElXA":{"text":"We came to Flamingo a Go Go at about 1:00PM on Sunday, September 2nd hoping to have a grea","useful":2,"cool":1},"EzzDnzu9ga5inu_gSULong":{"text":"First we went with a large group of people. We had a wonderful and witty young waiter. Foo","useful":1,"cool":0},"_p8SF3OLSytXOxsL9dYMng":{"text":"Had brunch there today. The ambiance is better on the patio than inside, provided you have","useful":0,"cool":0},"Lmf4lh2Z7vrt6-Dr9n-y1A":{"text":"This place is Cool Dude Vibes.  Today I felt Cool. So I seeked this place out. Really awes","useful":4,"cool":1},"ZbIB7YygUAxWpDmZbjdoNg":{"text":"I mean it is what it is. Kitchen stays open late so that's a big plus. The food is okay. B","useful":0,"cool":0},"dS0Q9wuQ9ocoAwkGikfnZw":{"text":"I heard great things about this place, so I was really looking forward to trying it. The s","useful":0,"cool":0},"sibWVUWjE--HE0EZu_fqEg":{"text":"Is this where all people go to practice their serving skills before going on to work somew","useful":0,"cool":0},"Y0UIZmYB6II0y8Bzkq1mSg":{"text":"Their food is flavorful and the restaurant is filled with music and fun. I went twice on m","useful":0,"cool":0},"-GsWzmCsqztA2IOmc58DHA":{"text":"If I close my eyes and wish really hard, I can still taste that Masa Crusted Gulf Fish. I ","useful":0,"cool":0},"TcGirXdvQ-7SkgsAY9PbUg":{"text":"They were so nice to us! Gave us bottomless mosas that were really good and have great foo","useful":0,"cool":0},"cJgii3AZ45Wife_diidC1A":{"text":"Before my first trip to NOLA, I was put on brunch duty.  I had to figure out what type of ","useful":3,"cool":0},"MJDIt6pFeCtFUhpJMFcm1Q":{"text":"Lara Lynn was incredibly fantastic, she was always willing to help and super quick! Love h","useful":0,"cool":0},"3b7Cpd9InT9Mngdxgbmo5g":{"text":"Read some reviews before coming here and wanted to give this place a chance. Unfortunately","useful":2,"cool":1},"I7vDYSRXkCzo7jN48B8t2Q":{"text":"Again, stellar food and vibes here. I made a reservation on open table and the table was r","useful":0,"cool":0},"U0GoVw_-WYcn1eJOto7kAg":{"text":"It was okay. We had the smoked salmon spread as an appetizer; it wasn't bad just had a fis","useful":0,"cool":0},"uDyUsvalA0GOiAy9H-2FDA":{"text":"Only giving one star because the drinks do rock. We are from out of town and heard great t","useful":0,"cool":0},"U9oIQMG73yylK1EgJPE8Qw":{"text":"I was super hopeful about this place after having tried their Cuban sandwich at a festival","useful":0,"cool":0},"cIYISUqypej0d3x1fBO_KQ":{"text":"This is SUCH a cool spot to hang out at. My rating is based on the ambiance and drinks sin","useful":0,"cool":0},"YldN2b1afFSAKVNuOEYH3g":{"text":"Service: 10. Staff: 10 Food: 10. Atmosphere: 10. Drinks: 10. 10s 10s 10s across the room H","useful":0,"cool":0},"VZ4NmJ3A5g6oZMLIzMSh6A":{"text":"Ordered the chicken and waffles, bottomless mimosas, expected that to be the star of the m","useful":0,"cool":0},"8TsPuUFOlC2S1d1FjHdk2Q":{"text":"So I went on a slow night. But that didn't matter. The drinks were sooo good and the app w","useful":0,"cool":0},"nFGQzzmcCiv6oWkdtlvNAg":{"text":"Love this place!!! Came to NOLA for a girls trip and decided to go to Flamingo A-Go-Go for","useful":0,"cool":0},"qel1gJ56JU8rHe99PNbJHA":{"text":"I can't possibly gush enough about how much I loved Flamingo-a-Go-Go's Sunday brunch with ","useful":8,"cool":6},"FNXIj3CsdiejSDCesKALWg":{"text":"Eh. Food took over an hour to come out after we ordered. AND it was cold. AND it wasn't ev","useful":0,"cool":0},"JaDiLcfSYgRayXv8DKdGow":{"text":"I had high hopes for this place based on its funky exterior, but it lost me pretty quick. ","useful":1,"cool":1},"DGrv11prF4_iNvGIzTa7EA":{"text":"As a faithful regular...everytime I come to Flamingo a go go I receive the best treatment ","useful":0,"cool":0},"uQGUXEORfc2oU2T7FFFZqQ":{"text":"Had so much fun at the flamingo a go go! We just moved around the corner and heard they ha","useful":0,"cool":0},"af7A0fFdy78u7sx1LVVNFA":{"text":"We had a fun , delicious dog friendly meal out in the courtyard. My grand dog even had his","useful":0,"cool":0},"T-s0SwG78XHU3RmM38BmCQ":{"text":"Joh is amazing! Best waitress that never let us have an empty cup or an empty plate. We lo","useful":0,"cool":0},"QDSig7rrwh6UlaWVHs5dZQ":{"text":"This was a great ending to the day. Was at WWII museum all day and found this gem around t","useful":0,"cool":0},"mzyHZbJW7jP7kQ779lS1ig":{"text":"We stumbled upon this gem on our way to the  WW II museum. The cool music & bright colors ","useful":1,"cool":0},"OwsqePK-UKp-7QhJXpU25A":{"text":"So we had a party of 8 last night. It was our friend's birthday party and we decided to go","useful":0,"cool":0},"68jCmsko6N4H8XChVyZn9g":{"text":"There are so many reviews for this place I almost think it's pointless to add yet another,","useful":1,"cool":0},"JNOtU8ADxU5k3EpHZykfUA":{"text":"This is a place I come to mainly too snap photos.  Literally. I know it may sound weird bu","useful":1,"cool":2},"4HiDDyQCBbAkxB8xgORo2Q":{"text":"I came to visit for my first time with my aunt for the Galentines Day, the hostess at firs","useful":0,"cool":0},"9c2InSgdN5S8KOduMwW9fw":{"text":"The outside patio set-up and environment is amazing. I love that they're dog friendly and ","useful":0,"cool":0},"ScueRlwtPW007qabBZwtgw":{"text":"Overall I like what I see going on here, but I get the sense that it's still a little bit ","useful":3,"cool":2},"VP6hw2STduZQWteEgEuwCg":{"text":"Was there this past Saturday and I can say the Frozè was delicious, and the kebabs were ta","useful":1,"cool":0},"SLzeed5-rrUWzMOkfhFsGQ":{"text":"Flamingo A-Go-Go is very new and I think they are still trying to figure out what they wan","useful":6,"cool":3},"QAE9BA9qzlrtS27IyL49UA":{"text":"Great drinks! Fun environment! This is a place that you can come to have a ton of fun. May","useful":0,"cool":0},"P0mPF-ozGtbj5XNS6v37UA":{"text":"We love this place for brunch! The theme is so cute, but the food and drinks are also awes","useful":0,"cool":0},"4HBpNUfQrA9_Ts4BeaJOCQ":{"text":"Went with one of my school organizations for a nice dinner and the food was pretty good as","useful":0,"cool":0},"juu8EmzXDwte3li85jnJKA":{"text":"This place has so much potential to be a hit! I went on a Friday night to try it out for t","useful":0,"cool":0},"JJuDZgolDFU9BsxpogIjdQ":{"text":"Food was delicious, drinks were great and service was awesome! Will, Ashley and Jessica re","useful":0,"cool":0},"pS6zq6yHQj6hiYL__SrtNg":{"text":"That's not a +1 star, that should really be a negative star. My first day in New Orleans, ","useful":0,"cool":0},"OGr0a38TBlSpWNL4hl5HlA":{"text":"We sat outside it was a great. Jessica did an amazing job the service was phenomenal. We w","useful":0,"cool":0},"5Ji1_hiYpBR8lJmCG5E7Iw":{"text":"Wish I had the option for no stars. Loud atmosphere, server was rude. Never got drinks. Ev","useful":0,"cool":0},"Z6awBMrUtlGdw-eFq-ZC_A":{"text":"The decor is fun and cute. The service is very slow and the food made gave a bad stomach a","useful":0,"cool":0},"SaM1o8P-8W6E4K80K30hLA":{"text":"Went for bottomless brunch on a Saturday with my sister and cousin.  This was place is loc","useful":1,"cool":0},"QGzBYywVcqB859EODOlO1g":{"text":"We went here for lunch on a week day. It was not too busy. They had the doors open, and it","useful":2,"cool":0},"1Sn627fKyg1ttb7yv9rtiQ":{"text":"Awesome place to hang with good food. Plus, our server Allen J was amazing!!! So sweet, wi","useful":0,"cool":0},"QuomZb0oGpSh03xKr3SeLA":{"text":"Had a TERRIBLE overall experience when I went for brunch with friends this past Sunday. I ","useful":0,"cool":0},"KhmJrHpAxZro2aYrPRsuRw":{"text":"Great customer service. Bottomless drinks and great prices. Food was really good as well. ","useful":0,"cool":0},"tfgBGVob8pYwDTtVanFkag":{"text":"Horrible service for a birthday group. Ordered bottomless mimosas, yet only received two r","useful":0,"cool":0},"j9HQ3wTr0goJEYPSzRuPtw":{"text":"Ok, it was a bit hot out but the staff hook us up with a fan! The food was good and the dr","useful":0,"cool":0},"MwNo70buAt3w03wplzN1Dw":{"text":"I really love this atmosphere and the food, but Maya the hostess is the reason we keep com","useful":0,"cool":0},"STK925sKlBTaCHmLBdmX9A":{"text":"My friends and I came for brunch-- Bottomless mimosas for $12 and I do mean bottomless. My","useful":0,"cool":0},"wBxld9pMJt4ooFKXxa7yRA":{"text":"Food-4.5\nService-3\nAmbience-3.5\n\nSurprise, surprise, I'm starting off yet another review w","useful":2,"cool":2},"rOOqRITqwBOJTp5n5RjtlQ":{"text":"I came here because someone I know recommended this place. When I first walked in, I was i","useful":1,"cool":0},"kyXNp3gbIXngpj2byRKINQ":{"text":"Jo!!! Best waitress ever! Great service!! The food was great and our group had so much fun","useful":0,"cool":0},"TnSiaiasO-j0oLktHr76EQ":{"text":"My friends and I took a last minute road trip from Orlando to New Orleans and on the way r","useful":3,"cool":0},"j8ol8LyyJLY7fi0xVfmGQA":{"text":"Service here leaves a lot to be desired. We were sat at 3:09, and our drink/ food order wa","useful":0,"cool":0},"LKnLWEjqOjkA4oM6ixvt4w":{"text":"I will never be returning to this restaurant. It was full of bachelorette parties. The pri","useful":0,"cool":0},"FgRyeNAitm-vlizHnGyaYQ":{"text":"This has always been the weirdest spot. The building is so large that every space in here ","useful":4,"cool":4},"aIViX_v-HebwWYv4AgmQjw":{"text":"Came here for brunch, we were served by Danielle C. and she was AMAZING!! If you come here","useful":0,"cool":0},"-NMJwG8TL57wr3K7UIoR7w":{"text":"Fun and energetic spot. Nice outside patio area for those fabulous fall or early spring da","useful":0,"cool":0},"x5Hj85cuXCWBhmMmOZtEMg":{"text":"Wow. Favorite place in NOLA hands down. Came for the LSU game and we heard about this plac","useful":0,"cool":0},"bEGb9hILj506ukvJulerkQ":{"text":"The food was good and reasonably priced. I order the shrimp and grits. I highly recommend ","useful":1,"cool":0},"xBcMQnTi_09lsSDhg094kQ":{"text":"Mariah and Jessica were absolutely amazing! Went out of their way to help us with everythi","useful":0,"cool":0},"LvfmmEw_MWQWqA8bBjjunw":{"text":"I was in town and heard about this restaurant, the food wasn't the best  but the drinks we","useful":0,"cool":0},"_bRkASwImuFu_baepUD_9Q":{"text":"Fun atmosphere. Perfectly decorated. Lots of awesome drinks. Great service.  Make a reserv","useful":0,"cool":0},"tQQMHMiDoehbFEULAhVtKA":{"text":"I've come to this place a few times & each time the service is horrible. We ordered our dr","useful":0,"cool":0},"llPvru8AXFPLFynzNmBUow":{"text":"When I walked in I absolutely loved the atmosphere. My friends and I picked this place bec","useful":0,"cool":0},"O68mbN_U5y_xWhmUU4JteA":{"text":"fun atmosphere, above average food, but can improve service quality. Waited 15 mins to be ","useful":0,"cool":0},"9eWh_XD3b2PdRgmondwr4w":{"text":"The atmosphere is cool and fun! Great place for drinks and hanging on a game day! Once it ","useful":1,"cool":1},"dt3-W5FZX_SNUzNLwOcL3g":{"text":"Sooo good. A local recommended this place because it's girly and they have bottomless mimo","useful":0,"cool":0},"quJCm0zdIqhUyU0su2YquQ":{"text":"I am giving this brunch experience 4 stars because up until we dared approach the unpleasa","useful":7,"cool":5},"SANdl1qIoilnVjKekdGuUA":{"text":"Great food and bottomless mimosas. The service was great and the food was amazing. Couldn'","useful":0,"cool":0},"zGD7_MJovYyfHdYTv4gmNQ":{"text":"Had the worst experience in a restaurant ever.  Chishantay was rude and belittling to me a","useful":0,"cool":0},"fYYS-beOC5hZ68cyRiqlMQ":{"text":"We were in NoLa on vacation and went on Christmas Day and planned our evening around it. D","useful":0,"cool":0},"uwwySzUTzSn6Ikqiy7Lm5Q":{"text":"This is a must go to spot. Went for a late dinner and drinks tonight. What a great experie","useful":1,"cool":0},"diCRcxn_K3j0JTLvGcIBmw":{"text":"So cute! Stopped by for a froze and to check out the funky decor. Too bad I was visiting f","useful":1,"cool":0},"A9ByCrbinG4V7Kj2dy53rw":{"text":"As many times as I've come here for brunch, I have never had such an awful experience like","useful":0,"cool":0},"MqS9ssdWbzAK1iEcYVv_5Q":{"text":"My favorite go to bar.... but only because Desiree works there (and I recommend the queso ","useful":0,"cool":0},"E0AWkTGMZa4D8oQcX5ZLAg":{"text":"Now I know why I haven't been here in a couple of years. Our server danielle was not atten","useful":0,"cool":0},"0En9LZoE4fSeEHveYQXiSg":{"text":"Had a great experience for our brunch of 20 people. Laura Lynn was excellent and served ou","useful":0,"cool":0},"v-nBe0ZvL76mnOr0ohS9bg":{"text":"Allen is an angel, he made our bachelorette brunch memorable- great food- great service an","useful":0,"cool":0},"4T_FOZud1VGVvcvfhfplMQ":{"text":"Flamingo A-Go-Go is a very hip place to come drink and socialize. Brunch specials, mimosas","useful":0,"cool":0},"L8eTn6C0G1CajkGi62hu8g":{"text":"Fun vibe. Convenient location for lunch next to WW2 museum. Food pretty basic. I guess I e","useful":0,"cool":0},"j4tcUSsDfNedpnS5feTRWg":{"text":"Today I was FINALLY able to make my way to Flamingo A-Go-Go and it did not disappoint. I'v","useful":0,"cool":0},"NiBfYC2jZmxZJoAKlZo0Bg":{"text":"Food was great, awesome patio! Great place to have some drinks. I had a lot of fun I highl","useful":0,"cool":0},"z3mtRSSp3bHA6hrk8YI71w":{"text":"Cool new addition to the Warehouse District! I will def. return. \n\nCame here after the Sai","useful":15,"cool":14},"AkqoTaWXO-qie1oyva8E0w":{"text":"We were a group of 5 today, we had a reservation so we sat down fast. Our waiter was very ","useful":2,"cool":1},"Skxnm4p7p13S9OY4xVi88g":{"text":"I've been here twice in like the last month?\n\nFirst time was the last Saints game for bott","useful":0,"cool":0},"jas-wPdb88H8lFmx9i6MVQ":{"text":"Casey was AMAZING! So sweet, her glitter highlighter looked amazing, absolutely beautiful.","useful":2,"cool":1},"qv7HQi50r8n02Uwdq5iQvw":{"text":"Flamingo Go-Go has an upbeat, tropical decor with a large patio outback.  Menu is mostly a","useful":0,"cool":0},"ZzHx87awNEd6vEpO0Poy9w":{"text":"This place is a joke. I waited an hour to be sat down, okay no problem. i don't mind waiti","useful":0,"cool":0},"EBUkUyXCaAWNHK_CoU0bdA":{"text":"I came with some friends for a Bachelorette party and we all go good which came out so tim","useful":0,"cool":0},"W-H-QGSm2iRubO5EH76-lA":{"text":"girl this place was a wreck!!!? reservations at 1:15, just got sat an hour later at 2:12. ","useful":0,"cool":0},"GA_5X4kO8aPVgDXe5Yys_w":{"text":"We waited 30 minutes for a table outside after being told it would be a 10-15 minute wait.","useful":1,"cool":0},"HlVIeHXEQ0iCtuqa23xWeQ":{"text":"Good ambience, plenty of TVs to watch sport. Food is the usual bar food, good quality, we ","useful":2,"cool":1},"I5Xihz4xPsTjiDT4iNvTyw":{"text":"Jo was an exceptionally good waitress. She made sure all of our needs were met and she was","useful":0,"cool":0},"EVdqcqPrMUaZ6r69UDc1XQ":{"text":"Staff was so amazing and friendly! I feel so bad because it seems like they are over worke","useful":0,"cool":0},"mI774Ln0Bpk2-QlO5qCMsQ":{"text":"How in the heck do they provide to go orders but you can't place a to go order online. Cal","useful":0,"cool":0},"gxfkZWDPgK5BshSK45zBGQ":{"text":"This place needs to get their stuff together, or they aren't going to make it. Our friend ","useful":0,"cool":0},"6OUASLo5EyWpub4ymqBskw":{"text":"Awesome Time and wonderful service. Thanks to waitress Sophia very polite and outgoing. I ","useful":0,"cool":0},"TQbW8JkhGzsrfwX7toVXDw":{"text":"My first time visiting this spot. I like the fact that you can make a reservation through ","useful":0,"cool":1},"PYSWr7sKBePtnvhYhgNvDA":{"text":"First off, the decor and theming of this restaurant is incredible! I felt like I was dinin","useful":3,"cool":1},"froP-_ux8P9IX8fAs7bojA":{"text":"Chris B our server was amazing. Great food great, yummy drinks great atmosphere, great pri","useful":0,"cool":0},"oTPfPVS2IjXRTTlMTuBqvA":{"text":"To start, the outside place was really cool.. Food took over an hour to arrive after order","useful":0,"cool":0},"OjgobRdFU0YjW2t3ws11fw":{"text":"This is a review on drinks and atmosphere only bc i didnt get a chance to eat. Went here f","useful":0,"cool":0},"56fUVt5F6A0cfe5fYccQ7g":{"text":"We walked to this place because it was close to our hotel and it was late. The waitress we","useful":1,"cool":0},"igcBTW1nR1BO6WeXRXXKwg":{"text":"Worst service. Was told at the door it would take 30 minutes to be seated outside... looke","useful":0,"cool":0},"QVQ3iHnL-tV9ToFWAVqZHw":{"text":"I was very attracted to this place because of the outside seating and the Rose slush. Upon","useful":2,"cool":1},"haHe0NOLSooZe2qXoPyi7g":{"text":"Great Service!!! We went for the first time(party of 8) and we were pretty much satisfied.","useful":0,"cool":0},"zbgZK0pEwRBoT6UnIMilEg":{"text":"Great Food and Service! The hostess Mya treated us with kindness, laughter, and a smile! O","useful":0,"cool":0},"TOEYOLXUcFa5pFpZejEjlw":{"text":"Allen J was AMAZING !! He was very fun, entertaining, and provided great service! Definite","useful":0,"cool":0},"UduVt6sWaLrdtIgESSRdew":{"text":"The waitress was very sweet but the food wasn't as flavorful as I hoped. Had the blue dran","useful":0,"cool":0},"tGCqvU2jqJ1ryaaKISJIyQ":{"text":"We had an awesome time at brunch with bottomless mimosas that literally never got close to","useful":0,"cool":0},"T-GBfNB2m9J_4QpYD1EdaQ":{"text":"I would only suggest going here if you were drinking heavily. While they are attempting to","useful":0,"cool":0},"-bdjzPLIKJBEzgQt-7zCRg":{"text":"My sister had her wedding rehearsal dinner here. They have a fantastic outdoor area that w","useful":0,"cool":0},"ktOZSo6JIP9ZXV4xbujOEQ":{"text":"I called a few days ahead of time to make a reservation for a work dinner of associates so","useful":2,"cool":0},"gvwOGaAQT48CU7XTrBws4w":{"text":"Super cute! If you're into pictures this a good place for you.  Prices are fair. But bewar","useful":1,"cool":0},"Vy0NnqD5VXq5uO1Von9XZg":{"text":"stumbled in here right at opening time after spending all morning at the running of the bu","useful":1,"cool":0},"fJFSvV1WD8HmMDx86gKZmA":{"text":"Such a cute place, cute and delicious drinks, colorful ambiance, Miami vibes. They had a n","useful":0,"cool":0},"AfzXP0Hqoqt3jNR4diiXSQ":{"text":"This is my first time coming here, the food was so unbelievably great. Highly recommend th","useful":1,"cool":1},"NptfEXC530AWVyaDY7pyNQ":{"text":"There's a pandemic so everyone understands that customer service is spotty especially with","useful":0,"cool":0},"YbVN_RBsWi_VAw4bVC6TSA":{"text":"I had a great time! The atmosphere and ambience was amazing! Our waitress SOFIE made us fe","useful":0,"cool":0},"u_NWBzDruh1XBM3wKzTcJA":{"text":"Visually appealing, which is great since you'll be staring at a wall for about two hours i","useful":0,"cool":0},"dBupTTpMHgL-D7rKYqf9rQ":{"text":"This place has such a fun atmosphere and a great outdoor porch area in the back. They have","useful":1,"cool":0},"ZCIJ0etxQLRIzo6bKTRnvg":{"text":"Reading the prior reviews I do angry the food isn't anything out of this world. However, i","useful":0,"cool":0},"lsmBnde_ait1ZsVcFU7ifQ":{"text":"The food is \"okay\". My Brussel sprouts were not cooked all they way & my boom boom shrimp ","useful":0,"cool":0},"Bi2phSz2U59CiH9oDIJGWA":{"text":"The food was good but the service was awful! We waited for a waitress for about 15 minutes","useful":0,"cool":0},"lnaYum3QTMh8hPVcrcVvnw":{"text":"Stopped here for breakfast Sunday morning on our walk from Canal St. to the WWII Museum.  ","useful":0,"cool":0},"yDkONKkaK9g3ljf2c_R77Q":{"text":"Went for lunch and our meal and drinks were great.  A good spin on a classic dish.  My hus","useful":0,"cool":0},"u7EB0R6_ftfnphRccdL2CQ":{"text":"Jacquelyn never responded to my email. Very unprofessional considering the owner asked me ","useful":0,"cool":0},"8Qa-Cde8sQsSpp3aZCeQeA":{"text":"Staff was great! The food was okay! Reminded me of bar food or food you want with college/","useful":0,"cool":0},"J5EsD8ar_BHnDvAOENuUfA":{"text":"Do you feel like eating something you would drunkenly make at 3am but still be ashamed at ","useful":0,"cool":0},"4aqCuxGHMur9NpXIrsQaQQ":{"text":"Was visiting from Michigan this weekend and was struggling to find a place that could seat","useful":0,"cool":0},"s8cz0n6B2pteihBBeVzZhg":{"text":"Went to brunch and the food was amazing. The service was amazing. Our server Drew was a co","useful":0,"cool":0},"VxQ6h1ys89v8prqDXkSsEw":{"text":"What. A. Fav. I visited Flamingo A-Go-Go for a pre-birthday happy hour and they haven't be","useful":3,"cool":2},"8Fo8EEb8klYY6D2NEQAnRQ":{"text":"Pepper Jack Boudin Bombers were great!  The flatbread pizza also good.  Garlic chicken bit","useful":1,"cool":0},"EV8Y9QzyT3_Ybw5wu8AFWA":{"text":"This was my second time visiting. This time, we sat on outside patio. The food and service","useful":1,"cool":0},"3xqaAtm3COhMhQa53pUiew":{"text":"Love this place.  I've been drinking here for years.  Scott is a funny dude and his staff ","useful":0,"cool":0},"GO_AW4OutUYsoHzAnpPcbQ":{"text":"Very filthy. Didn't feel comfortable eating there. Food and service were OK. Just OK, noth","useful":0,"cool":0},"hvEnvwry1ZvyPRZCbf3x3g":{"text":"best place EVER! we go at least once a month. Manny the server is amazing, and David the m","useful":0,"cool":0},"msRzZkt2f8905xhdEEFqwQ":{"text":"Originally came here for a girls day bottomless mimosas brunch. However, when we arrived a","useful":0,"cool":0},"TK5bA39ztZhRNA1oc0KHyw":{"text":"This looked like an interesting new place.  I must say we had a great server who was pleas","useful":0,"cool":0},"A_rR4AToBp8JDYrsI20Mlw":{"text":"The food was delicious, the atmosphere light and fun, and Desiree was an awesome and atten","useful":0,"cool":0},"TMN2yOdWMQcSrk-MLk98UQ":{"text":"We stopped here on a whim because it looked colorful and fun. From the moment we walked in","useful":0,"cool":0},"pYp1gYtvTCJSs6ziyauMIQ":{"text":"I haven't been back in a while, but I was beyond excited to See Maya the hostess! She's be","useful":0,"cool":0},"05HmomT8IQjNs5VjZNKwyw":{"text":"Drew was a phenomenal waitress. She was so attentive. The food was great and the prices fo","useful":0,"cool":0},"KBcsJzN3qHSY6bFy-zgOXQ":{"text":"We came for the $1 off drinks/apps for happy hour and to dine on a truck (must prebook bef","useful":1,"cool":0},"mgc_70Pw96wxxV4dhLxVRQ":{"text":"So I'll start with the positives: \n\nThe location is in  a great spot in the Warehouse dist","useful":2,"cool":0},"JcZYM3B-bZv9d2eALRv2jA":{"text":"Had so.much fun! Bottom less mamosas! I felt like I had to tip huge... I didn't mind great","useful":0,"cool":0},"UDChrN5pRoakxpufqiO63g":{"text":"This place is the ultimate cat fish. Looks so cute online but is a literal shack with one ","useful":0,"cool":0},"2GvPaNfkPaSsAEbQrbiKrw":{"text":"Food was great!! and the drinks are very much top tier. 10/10 for the bottomless mimosas a","useful":0,"cool":0},"S0g50sF0akvN_kAHHmhtjg":{"text":"Food was a disappointment.  Queso was clumpy. Service was a lot to be desired. Will not be","useful":0,"cool":0},"3qVG0mDJ7tjFAPXY5FM4ug":{"text":"This place is a disaster. The service is sloooowwwww. Two hours for breakfast. When the fo","useful":0,"cool":0},"KrZEFF6lMTszqaIrDXI7IA":{"text":"The food was okay, but the service was sub par. We waited a long time to get seated with a","useful":0,"cool":0},"Wu4t-pgkWZWagNbuBaHljg":{"text":"Amazing service, food and drinks. Bri was our server, and still training. She did an aweso","useful":0,"cool":0},"Crl03KYrSfU-v_qJZs1ceA":{"text":"Jo is the best waitress here, she has excellent service. Excellent food, excellent drinks,","useful":0,"cool":0},"gQkVi-rWu_Ks0ELzXEBlJA":{"text":"With how many other choices there are similar to Flamingo in the CBD, I recommend to avoid","useful":0,"cool":1},"ypBJCQmjLq_E_w-u1TzNUA":{"text":"I love this place so much omg. Great service and excellent atmosphere. My waitress Alexe i","useful":0,"cool":0},"pq1bhQRNbwVCLnloMzPGCQ":{"text":"Booked through open table for a bachelorette trip. Super easy process. Had a cute table ou","useful":0,"cool":0},"jUQqCrBswaq8Vvg_Qo_tuQ":{"text":"Delicious food and great atmosphere! The outdoor seating is very nice and sometimes has a ","useful":0,"cool":0},"KixhX7iCo8_cq1tAxSNPrw":{"text":"If you ever step foot in this place you have to try the pepperjack boudin bombers.. they a","useful":0,"cool":0},"ldNWmOlvPyFrP3Fl-lD0Kw":{"text":"Beautiful atmosphere but food is just ok. I ordered the queso and expected more flavor but","useful":1,"cool":0},"_WT6I_MuC9wUz_5JU6XMkw":{"text":"Get the Poke Bowl! It is incredible!! Located close to the WWII museum, this was a perfect","useful":0,"cool":0},"ae_Uy7124SHIQ1PIovuziA":{"text":"Cool backyard with lots of seating! Their coconut shrimp I have had in a long time. The bl","useful":0,"cool":0},"B3NzdiwUT1CeU2OciY_T7g":{"text":"It's a good place for a birthday or big group of people if you're under 30...\n\nAtmosphere ","useful":2,"cool":1},"77BWGzWTLCM5aRM4FmaJ4A":{"text":"This restaurant has an amazing brunch, not to far from Bourbon street a group of 15 walked","useful":0,"cool":0},"ZRxRSs_sGFCWS-qHAz5fuw":{"text":"Great place! I spent over 3 hours with my girlfriend the other night just talking and drin","useful":0,"cool":0},"E3UzG9rBuVew1zwuzQXJ4g":{"text":"Laura Lynn is the best server ever!! We went for a bachelorette brunch and she delivered. ","useful":0,"cool":0},"dYQhbxxVDE04A7PPVaBeIw":{"text":"This was such a fun little spot to come on a day trip to new orleans! We got the parm. Chi","useful":1,"cool":0},"0gS55mfWqYYNJvzCtv2wUQ":{"text":"Went here for my birthday. Server was super quick serving my large party (I made reservati","useful":0,"cool":0},"lhiugQBBc_kCsjE4Bs8mVA":{"text":"A great brunch with a superb server, Ms. Julia!! No complaints. I'd go if I were you.","useful":0,"cool":0},"Fcb43DeExmSQpjUfTTYVKQ":{"text":"today i came in to the restaurant and from start to finish i enjoyed my time. the food was","useful":0,"cool":0},"Ul0kI72O4HwRaJKsddnQWw":{"text":"My friends and I are obsessed with this place. It's my go-to for every birthday, Bumble da","useful":0,"cool":0},"bNzddTyFdtbtAMGOOyG1KA":{"text":"The best drink I had in NOLA was the pineapple upside cake. So good! We also had an app of","useful":0,"cool":0},"SfkdQAsPk9NsZCEGsKLhHQ":{"text":"An early New Years dinner was a blast despite the rain thanks to the amazing staff here at","useful":0,"cool":0},"A-SeKZ3B-eK023IyVmKg5w":{"text":"I've been dying to go to Flamingo a-go-go for a while now. So me and a close friend decide","useful":0,"cool":0},"usdO1VjgqxpKmQ4njMqChQ":{"text":"Read some reviews before coming and saw that people had experiences with poor service. I s","useful":0,"cool":0},"9_Q3dJhhE9EoHzTwxFLraA":{"text":"Flamingo A No No! I was super excited to finally try this place. A group of about 10 went ","useful":0,"cool":0},"hjnWKjPh1Qj2fGux_lv5rw":{"text":"Chrishante was wonderful! Amazing waitress. Very attentive, and gave great food advise on ","useful":0,"cool":0},"ZUbKHICj5Jyv0FLnl2YfNg":{"text":"This place is a hide away, and when I say hide away I mean you can't really grasp the spac","useful":1,"cool":0},"HtbWZHE3GiTh_xcImfyoKw":{"text":"AMAZING atmosphere, food, bottomless mimosas, and service. I'll be back EVERY time I'm in ","useful":0,"cool":0},"1JjKUqiBQk6CQHJf8lAmEg":{"text":"Great brunch spot! Delicious food and great service. We loved Chrishante  definitely will ","useful":0,"cool":0},"yMB0jCngZXauYxKOPmaNCg":{"text":"The food is mediocre and they do not answer the phone for a call in order.","useful":0,"cool":0},"oaM61I2fAU3xCjefgI7wJw":{"text":"We loved the food and the atmosphere!! Great service and management. We tried 4 of the 6 a","useful":0,"cool":0},"sKjpwYe3iIYz0GyGS9jtzw":{"text":"cute atmosphere. great drinks--highly recommend the frozé. food was pretty good as well. o","useful":0,"cool":0},"jO-iydUraJn9mFbMda773Q":{"text":"I was home visiting my family and my Cousins decided to try this place because they had bo","useful":0,"cool":0},"4_-47z3bpJ4_G8YVYH2obw":{"text":"Thank you Jordon. Your suggestion for the burger was spot on!! The fries are amazing and a","useful":0,"cool":0},"uflOrQDFxFi7GaBllQ6wdw":{"text":"The Parmesan fries, and frose were great! Definitely go on a Thursday because they have al","useful":0,"cool":0},"zD4wPhdIGWvLwijO7KPPYA":{"text":"I definitely enjoy this space. They serve bottomless mimosas, bottomless frozé, and bottom","useful":1,"cool":0},"UfkUYbEP-uEhmoPxqhyfug":{"text":"Casey helped my group and I get lit as a tit. She did not fail on the job of keeping my ma","useful":2,"cool":1},"BmlFqif-l6rmZcgV1yZqaA":{"text":"Drinks are awesome and they have a great happy hour, their food... not so much.\nI haven't ","useful":0,"cool":0},"w0u0TLh3xfFQagyrUiw6Hw":{"text":"Awesome vibes, indoor and outdoor. Mallory was our server and she was perfect! We got the ","useful":0,"cool":0},"Q_YRtEslIYPRRcSVKCm1gw":{"text":"If you've seen the Snickers bar commercials, then you'll know how I was feeling last night","useful":6,"cool":4},"UqN7w9e7EDYriFb1DckW9A":{"text":"The place met our expectations. The Fried Havarti Cheese was great.  For our entree we had","useful":0,"cool":1},"SYblwoUslJkIZ-FrM-8lpw":{"text":"They are charging different prices than their menu states. They claimed it was due to old ","useful":1,"cool":0},"W4t0HZo8iipzG8tyCuyZEg":{"text":"It was so much fun. The food was great.  I loved the atmosphere.  Not many places where yo","useful":0,"cool":0},"_w7RYL5ZzQcS54_20-12kw":{"text":"Omg. What an amazing place to go to. David and Erica were beyond exceptional! Will be back","useful":0,"cool":0},"t7XbfDosvHw2OkU1I6u21Q":{"text":"Flamingo A-Go-Go (or I should say Flamingo A-Go-Cold) was splendid but... it was cold. The","useful":0,"cool":0},"hEcptmSOrnzNcWvnfuOoWA":{"text":"Being from Wyoming it was a hot humid walk to the Flamingo A Go Go. We were seated close t","useful":0,"cool":0},"cNkLStX8XMONU5jrtwkeJA":{"text":"Great location & drinks. Poor management. The food was below average. We ordered a burger ","useful":0,"cool":1},"jcqECW0EtxxuZ7nyoTr0hw":{"text":"Funny name, FANTASTIC food!  We thought this was some sort of art gallery, with all the vi","useful":3,"cool":1},"CB_PEZsbgGSsjOHDAH44WA":{"text":"My first time eating here and the food was amazing! I went on a Sunday and had the bottoml","useful":0,"cool":0},"S9rnlnahcwxQJHngA7PKkA":{"text":"Great great place to eat. Awesome flocktails! Server Hailey was the bomb.com 10/10 would h","useful":0,"cool":0},"fDTRu5toHGCui51iajSm9A":{"text":"They had a frozen flocktail, I think called a pineapple upside cake and I had two of those","useful":0,"cool":0},"BWqyB65BI0WgOqgagO3m6A":{"text":"I rarely write reviews but this place was so bad I had to. I would say you can just get dr","useful":0,"cool":0},"0s-5CVlprZ9A72bFqBnF8g":{"text":"It is a great place for parties and young people to have a good time. It is also a great p","useful":0,"cool":0},"VW2RTupGEAwiJCSQPBrHpw":{"text":"Aidan was amazing excellent drink specials and happy hour! Very ig worthy courtyard !","useful":0,"cool":1},"MtYafGzZv6vwhgQLp_oA0g":{"text":"Kasey was our waitress! She put up with our loud crew and was so attentive to our needs! A","useful":0,"cool":0},"xoQmM4J_qfneuJtNkHtAAw":{"text":"Came here for quick late lunch after our museum hopping. We got some recommendations from ","useful":3,"cool":1},"efhbXST8_cOdvz27iUnlcg":{"text":"The atmosphere here is amazing. The staff was friendly. On a Saturday evening, to say that","useful":0,"cool":0},"RAAsB4G5LkwsVEoI74kkdg":{"text":"@desiree she's awesome, Service, atmosphere and food was outstanding. Chicken rotini was a","useful":0,"cool":0},"s9LefWbtDJFkTww6P2SFyg":{"text":"Came here on a Saturday morning to grab some brunch with friends. Showed up early to make ","useful":0,"cool":0},"eeL4fUDJNMzN8nfBcQTQgg":{"text":"Let me  preface this by saying this was one of the most negative dining experiences I've e","useful":0,"cool":0},"zyKpD2vdWEwoRXQTiYa4dA":{"text":"First time visiting New Orleans and sadly disappointed in our first stop here. We felt as ","useful":0,"cool":0},"bVUTZML-zqmd889b3OkhOg":{"text":"They couldn't get a burger order in 45 minutes. Beers are lame.  Mixed drink was good.  Ot","useful":0,"cool":0},"kESOp6pLJNsKBnM24dyQnA":{"text":"Loved this place! The bartender was great, food and drinks were excellent! Came on a littl","useful":0,"cool":0},"6-sPUhbN-iajgvKDzSRWnw":{"text":"Stopped by after work with a few coworkers for snacks and drinks. We abs a good time sitti","useful":0,"cool":0},"AnwVtWu6CyAZHn66RonUOg":{"text":"I downloaded this app just to make this review. Food. Amazing. Server: Desiree. Amazing. H","useful":0,"cool":0},"zITnxgpAW7xXFnvNC1xmpQ":{"text":"The atmosphere is great, everyone is so nice, the food and drinks are awesome and the dess","useful":0,"cool":0},"SP9es0Z2prVs0wRN7uAk1w":{"text":"We had a great meal and great time here. I really doubted the place but my wife wanted to ","useful":0,"cool":0},"IP7cHLQYqlMmvoJHyS10ZQ":{"text":"Loved this bar/restaurant!! The endless mimosas are worth it just wish they had a little m","useful":0,"cool":0},"FpanUdxWHL0ewPZzR40NHQ":{"text":"SO MUCH FUN!! Amazing food, great service, great drinks, and such a fun, upbeat atmosphere","useful":1,"cool":0},"zDcfwDDCvQlbe0H5Bdo1aA":{"text":"This place was so much fun! I came with my bestie and we had the best time! All the food w","useful":0,"cool":0},"SbEz110dMfPUjAiYd2duDg":{"text":"Joined some friends and colleagues here for dinner.  The place was empty when we arrived, ","useful":1,"cool":0},"S-_YHV4cFcHERyK8e_yy9w":{"text":"This place absolutely has the worst servers that I have encountered. We waited 45 minutes ","useful":0,"cool":0},"0KLWw_K8H8SsHLVdQ60Yiw":{"text":"Fantastic!  Friendly and efficient service, we had made a reservation online easily and we","useful":0,"cool":0},"LTHDKY17pz7g3dRkKSL-PA":{"text":"We were recommended to have lunch at Flamingo   A-Go-Go, and we weren't disappointed! We s","useful":0,"cool":0},"UbIrfgJuaB815sXAPZf3tg":{"text":"I'm a local. Made a reservation for a mothers and daughters brunch. Not where I wanted to ","useful":0,"cool":0},"CngRB02DoSAsJZA8q-KhvQ":{"text":"Came in at 145 on a Wednesday and the a/c wasn't working in the upstairs sections. Moved t","useful":0,"cool":0},"3oxghBRT21T-rrTyC2VDhg":{"text":"So happy this restaurant has survived Covid. It's a favorite of ours.  Food is always good","useful":1,"cool":0},"qdKnDqh2Sujeyi7_DsWo0g":{"text":"I flew in from New York to visit family and my dad for Father's Day and we decided to give","useful":0,"cool":0},"D4Cu_VA1bR18i--wLYZ5xg":{"text":"Fun atmosphere, great food, drinks and service, and dog friendly! The patio is perfect for","useful":1,"cool":0},"JfbN-vT3S65DVvGHaqbMUQ":{"text":"I visited this restaurant this last weekend for a friend's grad party with friends. I will","useful":1,"cool":1},"FG3DgmwxE_6IACsixqWlEg":{"text":"Ask for Emily. She is literally the best. So fun and makes great conversation. We were the","useful":0,"cool":0},"npKQpwSvCGNP27lMgOLqPg":{"text":"The service was AMAZING! Our server Danielle was very attentive and took great care of us.","useful":0,"cool":0},"toGZOrvgp5C94JcBm7WcBw":{"text":"Great Vibe and Service (5-star)! Definitely a place with great drink deals (Bottomless Mim","useful":0,"cool":0},"QygotsM81N8yuA0CZXeliw":{"text":"The restaurant has a wonderful setting. The food & drinks my party ordered was great, but ","useful":1,"cool":0},"KGTLzdPwPZCc0JA2a9BXig":{"text":"Patio is huge and amazing vibe. Kayla was super sweet and attentive. Sad It took me so lon","useful":2,"cool":0},"lQM-jU4UYMIl_fb8Fml8GA":{"text":"Right in the heart of all things central downtown and good things to eat, there is flaming","useful":2,"cool":1},"gbPSpXEMTMsx0mj_sHVpSA":{"text":"The food here is much better then the reviews lead on. The french fries with garlic were a","useful":0,"cool":1},"qcgsrBi40-EFvVEXD0rxbg":{"text":"This is the long awaited re-opening of this spot that has had several incarnations over th","useful":6,"cool":2},"ScXeKsgoS94i0998UiZUmQ":{"text":"I was in town for the Christmas holidays and looking for something new to try.  I heard MA","useful":1,"cool":0},"-kPXY-8UhJadobY4LwtbSQ":{"text":"7/17/2021\n\nTo say that the service last night was absolute shit would imply we actually re","useful":1,"cool":0},"sWJGp17OwhA_Lr3pcI_X3g":{"text":"I've been here a few times since it opened and really enjoyed it as a bar. There's a great","useful":2,"cool":1},"0aLLo16Eh95Bu_0nD4HQxw":{"text":"Me and my sister went here for Sunday Brunch. We had a great time . It started off rocky b","useful":0,"cool":0},"IcD8URyY7QYlXhK00wp4Zg":{"text":"Drinks stay full all day\nMorgan is the best server in this joint \nFood is amazing \nKyle is","useful":1,"cool":0},"VpHaS40zd6TEa8005HGa7g":{"text":"Basic Bitch Headquarters! \nAll bachelorette and birthday parties full of young drunk chick","useful":2,"cool":1},"Hj99O80-rjqPyI0OlCuQ9w":{"text":"Simply put terrible.  Ate he before my family and I went to WWII museum.  Was told wait wo","useful":0,"cool":0},"TKI2rASj0C0_pS3zEfilVQ":{"text":"Incredible customer service!!! I went on a Monday night. Shante was my server, I will requ","useful":0,"cool":0},"RK9i9Od0BOJ6U7KWzDY2ww":{"text":"Our waitress LATALYNN was amazing!!! She was soo nice and helpful. She knew the food on th","useful":0,"cool":0},"rgzja-PtlTk35-27-lLcvw":{"text":"I tried this place while in New Orleans. We were there for a couple of hours and did not h","useful":2,"cool":2},"nzgtMAcQq1asHIhfPT_6qg":{"text":"Crystal was an EXCELLENT server!!!! The food and atmosphere was so awesome I'm planning th","useful":0,"cool":0},"kRnIu-uYw-kEPXcxCKq1sw":{"text":"Overall experience was great! Good food and a nice selection of drinks for the ideal brunc","useful":0,"cool":1},"pSO0xxAQdldKpO5m-pIhRQ":{"text":"I love this place!!! Our server Alan or Allen (sorry)was absolutely amazing, he listened t","useful":0,"cool":0},"oPvOTCyAuuD6GDanraEcRA":{"text":"Chante as our server and she was so great! Made our experience so much better. The food he","useful":0,"cool":0},"PHchzOusRaTo2spu5JiZYg":{"text":"This place is just not good. I would have enjoyed a cup of microwaveable ramen instead. On","useful":0,"cool":0},"BrmuRLTBgW7SrofdBTsGMw":{"text":"A few friends and myself and wife went here as a meet up spot around 5:30 pm for a quick b","useful":0,"cool":0},"ibc6K4XBxE9DbAKFcv8yrQ":{"text":"Had such a great time at this wonderful establishment! Service was amazing Tory and Daniel","useful":0,"cool":0},"FkzwfG1KunjCHBrQxm5whQ":{"text":"This is a must go to spot. Went for a late dinner and drinks last nighr. What a great expe","useful":0,"cool":0},"u3vXSxPRZn2-CjFA6R_YIg":{"text":"I'm from NY and took a girls trip down to NOLA for my besties birthday we did our research","useful":0,"cool":0},"YWkI2h1ICSn0sNUzkDZ9Yw":{"text":"We came in on a Thursday around 5:00. The place is beautiful, it's very affordable, the so","useful":0,"cool":0},"s4_QrhtxK0jCAI7-EF9jfA":{"text":"Laralynn was an amazing server! I had the best time here everyone is extremely friendly an","useful":0,"cool":0},"4e2YDHkplaq7EHBJlD1H8g":{"text":"If you're looking for affordable bottomless mimosas, this is the place to go - it's only $","useful":1,"cool":0},"sqh7OCpeOWGOyqT8qgG8ww":{"text":"I'm disturbed because you have a restaurant full of people and no one is required to wear ","useful":0,"cool":0},"qKK2DAEdMDXqHqXzNJuvUA":{"text":"Not bad if it's the only choice you have on Christmas Day, but when everyone else is open,","useful":0,"cool":0},"zKhm-pTZSJEMHb5NcBIlcw":{"text":"Mallory was such a great waitress! She was very attentive to our needs, ask the right ques","useful":0,"cool":0},"1luLUSWguXMal4q6MKbj4g":{"text":"Wonderful experience! Went to flamingogo for a light brunch and had the loveliest of servi","useful":0,"cool":0},"fkUkfeL6rWSjhw1AG49qWA":{"text":"Wouldn't suggest sitting at the bar if you're eating. I'm not sure exactly why but we were","useful":0,"cool":0},"83QxKw5fn8Ot2I1vVbcWoQ":{"text":"This was def a great eat! Mya, the entrance receptionist, had amazing energy + was very kn","useful":0,"cool":0},"N2iTUK8goR7LZB1xa8f-GA":{"text":"Honestly Delanie is the best. Great service. Awesome parking sweatshirt. Super friendly","useful":0,"cool":0},"9-6O76N_y_p-Ed-dSukUJA":{"text":"Laralynn was an amazing server for a group of 13 of us. Phenomenal service and amazing foo","useful":0,"cool":0},"MyZT36rRgbq63KfCnNrczQ":{"text":"Great service! Loved our server Michael and the manager David! Shrimp a go-go is always a ","useful":0,"cool":0},"n5PsDCDgEjJdQINJRNPB_g":{"text":"In New Orleans for the weekend and came here at the suggestion of our hotel desk clerk.  D","useful":0,"cool":0},"b_a6SXXRebx8h5B3_aux9Q":{"text":"My experience at Flamingo was awesome . We we're taken care of by Allen Jay who was an ama","useful":0,"cool":0},"U3MlHKvQ3dAazBJU4R029A":{"text":"This place was recommended by our Hotel staff (the Modern New Orleans) and I wish we'd com","useful":0,"cool":0},"GWF5UnZ1X4HRgVW8w-AWvg":{"text":"My fish was overcooked and tasteless. Someone one else got frozen ahi in their poke. Slooo","useful":0,"cool":0},"VGoW-dfwD8I5CQOnT33qLQ":{"text":"The waitress Miss Randy was amazing! Awesome service skills and she has such a bright pers","useful":0,"cool":0},"d2iD4SgazMnfOema-sU6sQ":{"text":"Expected a long wait but was surprised that we only waited about 15 minutes.  Ordered the ","useful":0,"cool":0},"BzI7jtxsOtAqCzQwxpn9Ng":{"text":"My husband and I came here on Christmas Eve after the saints game. We were glad to find th","useful":2,"cool":2},"7fjNkaUs1HoBA93VUilW-g":{"text":"A great place for bottomless brunch! Food was delicious, great service, tons of place indo","useful":0,"cool":0},"WZoa1dVObPGNzumo903jnQ":{"text":"Crystal and Amanda G. were awesome. They were very attentive to our table and they consist","useful":0,"cool":0},"5d21N0D9VQ-wmCjhCqSFrw":{"text":"I LOVE THIS PLACE. amazing food and drinks! Everytime I have company come visit me I take ","useful":0,"cool":0},"uN0XC01fpuWMvvQIe9WPgg":{"text":"Great food.  Terrible service.  We ordered drinks and entrees at the same time. The bar to","useful":0,"cool":0},"9E4jVwMm2vXnFt03ay_r4Q":{"text":"I don't even know where to start. So first of all my reservation was at 3:45. It took 15-2","useful":0,"cool":0},"4Qqot7fQLAjCyB-PhlOPtw":{"text":"A great place for bottomless brunch and the managers David and Kyle definitely care about ","useful":0,"cool":0},"T74wwvO3QR9AxN8DuFdChg":{"text":"Ended up here based on pictures on open table because it looked like such a fun place. \n\nF","useful":0,"cool":0},"xsYjuqCdkj-vF4eVsdKkVw":{"text":"This is a really good restaurant. I'm a regular, To everyone who rags on this place, give ","useful":0,"cool":0},"KCPYyfooO1kMWvb5ekOs0g":{"text":"Came here Saturday AM with a group of six for my friends bachelorette and we had such a bl","useful":0,"cool":0},"TTiqY4J2FghWR3t4aasxjw":{"text":"This was an amazing experience! The drinks were flowing, music was diverse and SARAHHHHH W","useful":0,"cool":0},"luUkEr_hIPHW9sn_x54Wbg":{"text":"Went with a friend to grab a quick dinner. We sat on the patio outside and it was terrific","useful":5,"cool":3},"9D79HhNYm5WK5OmBSRL_oA":{"text":"We went for brunch today and it was fantastic. The service was great and the food was grea","useful":0,"cool":1},"wm0YkJKc58LX-Q3sQMCzXw":{"text":"Cool vibe in here. We had an excellent server. The feel is like a college bar, student run","useful":0,"cool":0},"PkcNTF78D4OsxuOU5j1-eg":{"text":"Casey was the absolute best! We came into NOLA for my friend's 21st birthday, and wanted t","useful":0,"cool":1},"l0glAIMjZXgkE2bILoF0tw":{"text":"I've been to this location four times and have only experienced great service once. This i","useful":0,"cool":0},"BMskQuGZTSdUFSfbA_p6nA":{"text":"The service was amazing! 10/10 recommend. Our table had the Redfish, Jerk Chicken Burrito,","useful":0,"cool":0},"32GBExiLC-NMWRLhucLDaQ":{"text":"I had a great experience.. from the moment I walk through the door the hostess, Mya, was v","useful":0,"cool":0},"7Dpxz5l-8mebyYVbbXLx4Q":{"text":"After giving this place a second chance for their bottomless mimosa brunch I have to say i","useful":2,"cool":1},"AusI5WUQRAgVlq3vd0_c8g":{"text":"I've never felt more deceived in my life after coming to this place based on the cute phot","useful":0,"cool":1},"b8zpBcwLjgf8UrP7EtzaQw":{"text":"It is not what you see in pictures. The interior was like a cafeteria with 3 balloons. The","useful":0,"cool":0},"dm26EwdjTq4ihn77shly_w":{"text":"We came here for Sunday brunch a few weekends ago and had a great time. The restaurant was","useful":1,"cool":0},"IIfLXzOqUobVS6pH1P3cfg":{"text":"This place is great! Went here yesterday with family in town for their first, my second ti","useful":4,"cool":1},"iYMGq1RnpDQkBvSoZgaAlA":{"text":"Second time here after a year... boudin bombers were  *chef's kiss* so we ordered 4 more t","useful":0,"cool":0},"WqhQvWLkSUcyJL2HFES1cw":{"text":"Downloaded yelp just to reciew this place, for me, perfect dining and socializing experien","useful":0,"cool":0},"qSxG8bQU2KAFXWWYl31x0A":{"text":"This was a MAJOR disappointment.  Traveling here with our family of 5 it was hard enough t","useful":0,"cool":0},"R7YU9lovAssyztajZpnaVw":{"text":"If I could give 0 Stars I would. The only good thing about our experience was the older La","useful":0,"cool":0},"96GNxRsejhWpkbkxzLUZcA":{"text":"Food was amazing. This is now my go to place to have a bite or a drink at anytime of the d","useful":0,"cool":0},"XnYBv5q0wwiPzt9lcXcGmA":{"text":"This place was so much fun! The atmosphere was so vibrant it's the perfect place to have a","useful":0,"cool":0},"V8AfobJSsPLMaxvRkV9cZw":{"text":"Awesome place, great food and drinks with a dog friendly courtyard. Super busy today with ","useful":0,"cool":0},"XpIOwmKqwO1QbYVN89_zgg":{"text":"Updated Review:\nAbout a week after my original review, I ended up going back last minute b","useful":0,"cool":0},"9T3QT9E1vqirP6AIFag14A":{"text":"Amazing place to have a bottomless brunch!!! Great hospitality! We had a blast here and th","useful":0,"cool":0},"mAAnRqO5olCBe48xvgnEJQ":{"text":"My server destiny was so great. The food is amazing, the drinks are awesome and it was a f","useful":0,"cool":0},"iwaEr0oGh98XcHOGcJ-9Dw":{"text":"This was a great spot. The mimosas and food was perfect and the service was wonderful!!! I","useful":0,"cool":0},"m7g8itrtJpgZ7GCbZYkaOw":{"text":"The place is awesome great outdoor area, the food was descent but the service is crazy bad","useful":0,"cool":0},"yKAwysprYMrH74i5FN7nsw":{"text":"We had reservations for 6:30 and weren't seated until 7:30, which was kind of a buzzkill, ","useful":0,"cool":0},"5dbhuN3hcM561nDQDOREWA":{"text":"Let start off with the Good! Ambience and drinks were amazing!!! Food was just okay (I ord","useful":2,"cool":0},"Uj9NFMhbkgxkV_97N3Tphw":{"text":"Great place to eat! Really fun environment and great place for cute pictures! Bottomless i","useful":0,"cool":0},"p9NfscN4odUtC1tbHZ15ng":{"text":"Love this place! Our server Rian was amazing. So sweet and always filled up my mimosas pro","useful":0,"cool":0},"ESmndvD5ipEkDMVCGRa2ug":{"text":"Great time ! Great food ! Laralynn is the best !!!\nI came for a birthday brunch and she wa","useful":0,"cool":0},"QTQJlQ700qb4nHWXqHA7ow":{"text":"I'm not sure why there are low reviews bc this place is sooo delicious and nice!! The serv","useful":1,"cool":0},"SG9XmQuZgguBiW6_nsomgw":{"text":"I had an AMAZING time for my Birthday Brunch! The drinks were great. I had the Sweet Busin","useful":0,"cool":0},"G0DJvmn3b_d5jIoPNqiZDA":{"text":"I went to Flamingo this weekend with a friend and we enjoyed the atmosphere and food sooo ","useful":0,"cool":0},"sMcTmRwSNo86JWgEZzei9Q":{"text":"We went here and had a great time.  This place had great food and a fun atmosphere. Our se","useful":1,"cool":0},"m8mrU0-vd5k1_3AjS9VHUw":{"text":"I'll be honest, I've been a little more than spirited each time I've wound up here, but I ","useful":1,"cool":2},"wUfNdiJyWq3EgyKevyZQ_Q":{"text":"Early New Year's Eve.  Great venue for casual dinner and drinks.   Ate at the bar with fro","useful":0,"cool":0},"PR72Kn4ZfTrQ4UBNippY1w":{"text":"I stopped by for breakfast on my way to the WWII Museum. Walked right in and was seated be","useful":4,"cool":0},"OUL8ATbbE-PdtMdzC7KoJg":{"text":"Ryan (our server) is so cool and shit.  We really enjoyed our afternoon meal here and will","useful":3,"cool":2},"DVsNFsSMb5VheV7hmSh7Qg":{"text":"I really wanted to love this place. First, because I thought the previous tenant (Warehous","useful":1,"cool":0},"gA06_RBipu1gpMHaq4-nWQ":{"text":"I will not lie - I initially wanted to check this place out because the drinks sounded so ","useful":2,"cool":0},"ipSZNOSyXqEk4RtA5WnVzg":{"text":"This place was nothing shy of amazing!!! The atmosphere is so relaxing! The workers are su","useful":0,"cool":1},"rXvs3DgNdJKf5I_g97Z4RQ":{"text":"This is my 2nd time here and the service is the same as the first time. Delightful waiters","useful":1,"cool":1},"yXPBufV2a2G3omYYa_8GSw":{"text":"New great, atmosphere to check out for brunch. I like the eclectic design different from w","useful":1,"cool":0},"X3w4fZW0bjofXXXROOcAnA":{"text":"So my son made a list of places to try. One being this place. So little did we realize tha","useful":4,"cool":2},"G3ku-BvxA6Li1FRqh0gH1w":{"text":"Hmmm, well, the good thing about this place is they serve bottomless mimosas. Just drink y","useful":0,"cool":0},"LNbkgniiGizqIyB5spLL_w":{"text":"Their mimosas are delicious. My best friend had a margarita that was delicious also.  I re","useful":0,"cool":0},"NksvFJwle5a23MHAw4OtmQ":{"text":"Really cool art inside the building and such a fun atmosphere. I was walking back from the","useful":2,"cool":2}}