{"b8AJltKTyjFAJzgqPpvtvg":{"text":"This is my favorite place to get a mani/pedi!!!! They have the best prices. The pedicure i","useful":1,"cool":0},"OrWpS1-3Ml5wDgl2paQIEg":{"text":"My go to place. Professional, exceptionally good value. Tim is as good as it gets.","useful":0,"cool":0},"tnv9zbaaUzFOwvzIb4HPzQ":{"text":"The owner immediately contacted me after my unfavorable experience with scheduling. The si","useful":0,"cool":0},"CmFdlrRZeLmTFjU5tVS6lA":{"text":"My nails are looking great! Nylien was wonderful. She really did a fantastic job. \nI calle","useful":1,"cool":0},"WXP3YHjVh5vCO-mjmnu21g":{"text":"Went here for a gel manicure. The polish started peeling a week later. Waste of $30; will ","useful":0,"cool":0},"QRC-OwHHW8SSbGHnVG1M4A":{"text":"I love this place.  It's small and simple, and that's what I like about it.  I get a gel p","useful":0,"cool":0},"SoFO9erfDKo0jM47YhPFHg":{"text":"This place is great! Very low-key and not 'fancy', but they're very professional and clean","useful":0,"cool":0},"SE3Ib-LHmWrWpqqtfbVecQ":{"text":"I tried this nail salon based on the previous reviews and availability. The salon was much","useful":0,"cool":0},"EutTQFrKUzdZl65CpFr14g":{"text":"I live a few blocks away and took my daughter and her two friends for mani/pedi's over the","useful":1,"cool":0},"0H1bnuV1bo8p6-QYyNQUig":{"text":"Great prices, friendly staff, and clean! Can usually accommodate walk- ins but better to m","useful":0,"cool":0},"5gZMAOaMpIrIT9BeVY1vyA":{"text":"City Nails was highly recommended to me and I am pleased I went with their suggestion. The","useful":0,"cool":0},"CgzlbyM78zruYTGVguEgZg":{"text":"I wasn't blown away. Still looking for a great place to get my pedicures. I don't like a m","useful":1,"cool":0},"eXtvW4sIlkLagdlLu1IRDw":{"text":"Today, I got my first pedicure ever and I will say that I'm hooked! They were so sweet her","useful":0,"cool":0},"WvQo1zt0ygWiT6lMiD5xoQ":{"text":"I found this place on yelp and it had the best prices and reviews for the area. It was eve","useful":0,"cool":0},"qjxgmBLQ5VOQqBaYEJmg6g":{"text":"Love this place! The spa pedicures are amazing and if you're looking for a good acrylic fi","useful":0,"cool":0},"NI-TL6sxxjjYdEeyKjhGLw":{"text":"Amazing service and perfect nails every time I go. I like that they really pamper you and ","useful":0,"cool":0},"m-neBXP0Y45KLUryWs-MPA":{"text":"Back to this place again and I love it!  Great service and tons of variety of colors at re","useful":0,"cool":0},"kXA3Nfh5XlsDkGY2IqAVwQ":{"text":"The best mani/pedi I've had so far! She recommended me the deluxe pedicure and I'm hooked.","useful":0,"cool":0},"4lQAmueCyfYandxkbGFJ_A":{"text":"Super friendly and nice here. I love the customer service, and my nails looks great. I hig","useful":0,"cool":0},"0JBY5GyA0PdzZdmLeoaLXA":{"text":"Came here for a pedi thanks to an ad I saw on Facebook. It was a very pleasant experience,","useful":1,"cool":0},"pqlCKgoxeiTMBqHtaa6dNQ":{"text":"The mani/pedi combo of $35 is a true bargain.  You can either walk in or make an appointme","useful":3,"cool":0},"E9_svJLXuTp8gJrXtBtbUQ":{"text":"Cheapest nail place i could find! Its $25 for a basic pedi and this place has massage chai","useful":1,"cool":0},"N1TRWtGYG3UOuounIrLyxg":{"text":"The best Nail Spa in New Orleans, they take care of you all the time make you feel special","useful":0,"cool":0},"O3eQbGv8kcQmMBAgJkK4IQ":{"text":"I went here after seeing all the positive reviews here on yelp. I got a Gel Manicure and a","useful":2,"cool":0},"onOgHLSi6ZG5b0b3RCibWQ":{"text":"Fast and clean service. Great massage included with pedi. Prices are great - $25 for a reg","useful":2,"cool":0},"UNYf6UofQVDNv-0mOcPLrA":{"text":"I am in town for work and did a quick search for a mani pedi. So glad they were able to fi","useful":0,"cool":0},"mh1KjXH5AKPz0pbp6UExfA":{"text":"City Nails & Spa is my Number One Ranks Nail Spa in New Orleans, which comes from a Top 5 ","useful":9,"cool":4},"vyI1A4NT1wC-MoBg7JMMGw":{"text":"Best Nail Spa ever....they always make you feel special on each visit, and you're offered ","useful":0,"cool":0},"j1SNuPHli1FTh_mxtwQXZQ":{"text":"this place is pretty basic and i love it. however they know how to please me...they got to","useful":2,"cool":0},"h93Flv7NWAAkC_ZksIqKag":{"text":"Had another really good experience at city nails and spa. Went got my mani pedi with my si","useful":0,"cool":0},"ACjOSMmGKcvWpcuJhWSntA":{"text":"I got a good pedicure here a couple of weeks ago. After relaxing on the massage chair and ","useful":1,"cool":1},"RsloRYFwOy-0B0o8_nNLew":{"text":"Been a client here since this shop has been there. 10+ plus years ( former owner and since","useful":0,"cool":0},"fuGeVmBVi0fcyUoLaqNjRg":{"text":"This place is great. I went with a groupon, and I also was a little surprised about the at","useful":2,"cool":0},"lDtIenkEj_RwsY9uKGg-QA":{"text":"Best place to get nails done! Wouldn't go anywhere else! Absolutely love the staff, they a","useful":0,"cool":0},"Jz7O9JLEmpn1FXx3tCEVqw":{"text":"Love City Nails!  I had been going to a different nail salon in Lakeview and decided to tr","useful":0,"cool":0},"ZHxpuIlhHHgCMIElH_VDaQ":{"text":"I absolutely love this nail salon! I've lived in New Orleans for 4 years and I've been to ","useful":0,"cool":0},"UzYhx9OKrE6O68iudq0jWg":{"text":"Tom!!! Can I take you back to Los Angeles with me?? They had an amazing selection of color","useful":0,"cool":0},"gzIzgELatjj7s3Tn6bbk3g":{"text":"Such a great nail salon. Super sterile and efficient. Always honest about their hours and ","useful":0,"cool":0},"hJu0Ty07Y4SJD3gx8_zngA":{"text":"The deluxe mani/pedi was to die for! The moment I walked it it was quick service, almost a","useful":1,"cool":0},"tUD2yZ6QXcDAD6iOrgegtA":{"text":"I enjoyed the manicure and pedicure. You must need an appointment. Very small place with n","useful":0,"cool":0},"0rYIkqJ5IWV3rbuG76nv6w":{"text":"After having my daughters nails done elsewhere for an event, we were lucky to end up at Ci","useful":1,"cool":1},"OCVz9ofTdXxWzZZgYmwzaA":{"text":"Love getting my nails done here. Professional quality with competitive prices! I had a bas","useful":0,"cool":0},"1J9KraCVC2IVveLc63Nq0g":{"text":"Great little salon with the the nicest staff ice ever encountered.  They took such good ca","useful":1,"cool":1},"8_s_ySVaoIlSvSBels0NZQ":{"text":"Terrible Service !!!\n\nThe staff is rude and the work is subpar. I've been going here for a","useful":0,"cool":0},"k1Aka7RQXOK-iLld813oZg":{"text":"Don't be deceived by the small size of this nail salon for they do a great job on nails wi","useful":0,"cool":0},"ZslKP675MPU6mcyQiAICfg":{"text":"Perfect place to go. The employees are super sweet & the prices are great. I go every othe","useful":0,"cool":0},"5hv7X6I9K0IB31i4TNPZtw":{"text":"I love, love, love how the staff here treated me.\nThis was my very first time get my nails","useful":0,"cool":0},"BZnfYBf-Rt6FuMnb8Oixsg":{"text":"This is my favorite nail spa.  Always make an appointment.  They do a great job and it's v","useful":3,"cool":1},"3A2R0RQ2xGuHaxN692wdWQ":{"text":"This is the BEST nail place!! I have been getting my solar nails done by Tim for about 8 y","useful":0,"cool":0},"wEx7IhRcDEaCw1fXNnnyQQ":{"text":"Fantastic. Definitely would recommend making an appointment. Got the deluxe pedicure and i","useful":0,"cool":0},"hWWSNQ6Qcjijw8vHuvUL4A":{"text":"Based on the stellar reviews I stopped in here for a gel manicure during a week long stay ","useful":0,"cool":0},"_-QMkecnJa351COYki75Lg":{"text":"Iv'e been going here for two years now and love it! They are always able to fit me in for ","useful":0,"cool":0},"0uPpQ-CyN_oZeUDGx5Kbfw":{"text":"Excellent service and the best pedicure in NOLA. Will need an appointment--small place and","useful":1,"cool":0},"wgjxYYolcxwwLkUWlFuy_A":{"text":"Love this place! Been going for double years. Everyone is super friendly. Always book an a","useful":0,"cool":0},"GGaw7V9PYIwya-mKBY3H0A":{"text":"Very important to make an appointment when coming here. I will say if you live in the area","useful":1,"cool":0},"hxX1JimFbD0oZHDp1Z6vbw":{"text":"I've been coming here for about 6 years maybe longer. I live love love this place. Best co","useful":3,"cool":2},"ia1NCWqIpTuILuJhudwo3Q":{"text":"Close to my house. Small but mighty. This team is good at what they do. I normally schedul","useful":1,"cool":0},"r01hz-nW9_q1wm5Wqiu3YQ":{"text":"This was my first time at City Nails and I must say I was very happy with my mani/pedi. Je","useful":0,"cool":0},"Cui4Jd9Lw7WSjb4PYDgCzQ":{"text":"I went into this place for the first time today. I came in for a full and a design. I show","useful":1,"cool":0},"_EQ7S96MGEYwfJdsDWQ2Wg":{"text":"Great nail place and always friendly staff. It does get busy and place is small so I would","useful":0,"cool":0},"vOrNvhQqnEHJlbisNCauLg":{"text":"What a wonderful new nail salon that was recommended to me by a co worker. Staff are very ","useful":0,"cool":0},"hWwVyxZ4arcaBVPXZ_N3Xg":{"text":"Jenni is the best! I have never had a nail tech be so consistent with quality work! She ta","useful":1,"cool":2},"LxEY5Av1sXG1WcR349O9lg":{"text":"I can appreciate a place that actually sticks to the scheduled appointment times. I walked","useful":4,"cool":2},"kK8LSJMKJUTDIqOVwvA16g":{"text":"Jenni is the absolute best!  My nails have never looked so good and they last forever.  No","useful":1,"cool":3},"H4IGUJWJTaJW0LAKiW-w3A":{"text":"Called ahead for an appointment and was able to come in right away. Came in for a pedicure","useful":1,"cool":0},"RpcJM7tAmXOZaBkxTDYrIA":{"text":"I have gone here twice now and both times were amazing. Everyone who works here is extreme","useful":0,"cool":1},"d_RBGdiBNf4pDpM3rS-7_g":{"text":"a bit disappointed in last weeks visit. i know i went there a day before christmas, howeve","useful":0,"cool":0},"AFWSS0G8BOzaY9IVBp5T1Q":{"text":"Im in town for the week and I came here to get\nmy nails done (I live 9 hours away). We fou","useful":0,"cool":0},"CCPNT4PliFRFs1qIdMWGPQ":{"text":"This is my second visit to City Nails. My first visit was 3 weeks ago with a friend. We bo","useful":4,"cool":1},"kgcM20xOb2qwBD5cDccCmA":{"text":"Jennie is amazing!! I came in with a Pinterest picture and she was able to recreate the lo","useful":0,"cool":1},"fmu-U_wC7_vOuL85KYY9UA":{"text":"I have become addicted to dip manicures as part of my self care routine and routinely get ","useful":0,"cool":2},"AUahGQnTbYq8FD0MUQbY5w":{"text":"It's now been a couple years and I'm still a loyal customer.  I have found my two constant","useful":1,"cool":0},"itEJTFQwEz9iV7EMkuhLJQ":{"text":"Heads up, the website pics and the in person visual differ.  The place is small and narrow","useful":3,"cool":0}}