{"QdBLVwYiIyXOrzDiOuaaUg":{"text":"We were sitting next door at a local bar wondering what to do for lunch. I got on yelp and","useful":0,"cool":0},"vu3PIJUOl5fPGHfnHfZ5Dw":{"text":"My friends and I were staying at the W New Orleans and wanted a quick bit before going out","useful":0,"cool":0},"C7-gSQTnOjaU2ZhzJwv3Mg":{"text":"This place has an old apothecary vibe and has antique medicine bottles in all the windows.","useful":0,"cool":0},"qxr_FkwCHLOf4i0TKkAMTA":{"text":"Beer taps right at the table!!  Food presentation was great and flavorful.  Skirt steak an","useful":0,"cool":0},"JG2XC7QusoxwG2Nrg-kQ3w":{"text":"Hands down some of the best food I had in New Orleans!! The cocktails were great. My 4 fri","useful":0,"cool":0},"rmqqRK4dmYR2G-xsQ4v3cw":{"text":"Ate there April 2018, our server Brian was darling. We had the seafood gumbo, crawfish bis","useful":1,"cool":0},"Z6i97E_ZBfg4Dh6dft73fw":{"text":"I had Chef Juan Carlos' tasting menu, which came with a \"Rowdy Hawaiian\" cocktail, which h","useful":1,"cool":0},"76PWUA_8y0kLbJ0IDpRSvA":{"text":"When we were here a couple years ago, this was an Italian restaurant next to the W and we ","useful":0,"cool":0},"rRXt03nYMy0TyE3D61fJ1A":{"text":"Contrary to all of these other reviews, I thought that the service was great! Our server w","useful":3,"cool":1},"jS3uGt8M4NImES4mp0R3kA":{"text":"Called ahead to pay for my sister's drinks on her wedding night. Manager took my call, exp","useful":0,"cool":0},"NXDtfNmSMo_fFqMloxiBlw":{"text":"This place was fantastic. The chicken is some of the best chicken I have ever had - someth","useful":0,"cool":0},"WXMRAjOjoYhcNod0DidA8g":{"text":"Came for lunch and came back for dinner!  The food was delicious. The beignets made that c","useful":1,"cool":0},"SWHG9Ir5C_lyactYJN9-4g":{"text":"I'm giving SoBou 4 stars because I really enjoyed the food I had for lunch.  I had an oyst","useful":1,"cool":2},"t10rC0BeYFI9krHn2Okz8A":{"text":"Excellent cuisine in a high end but casual setting. The look and feel of the restaurant is","useful":0,"cool":0},"Ww3GS7wUCBT4AhGH07m9NA":{"text":"Sweet potato beignets stellar. Gorgeous modern decor. Staff friendly and attentive. Perfec","useful":0,"cool":0},"WHfdoZl0QMJ7U6tQiBxpTg":{"text":"Absolutely wonderful. Sobou's menu features an eclectic mix of items, paired in unexpected","useful":2,"cool":0},"AGoLxFfTqLoMO8NPEoR-Fg":{"text":"Wow. Just wow. SoBou is creating the most inventive food in New Orleans and some of the be","useful":1,"cool":0},"rLpsV6Jfz7Qr55_7eVYzjA":{"text":"I've been several times and ALWAYS EXCELLENT!!! Alex is the waiter you want and the Yellow","useful":0,"cool":0},"iTKFgIO8Kw32RJd1PpTwPw":{"text":"\"SoBou is a twenty-five cent martini.\" \nFood: 5 (whoa)\nAtmosphere: 5 (plush)\nValue: 5 (mar","useful":2,"cool":2},"vXIParcM_OUrV-br1kveRQ":{"text":"Cool decor, slow and rather disinterested service.  Interesting trendy takes on Southern d","useful":0,"cool":0},"9wD7kTpcA4bT6YC81Xrmyg":{"text":"Best cocktails on Chartres St thanks to our amazing bartender, Trey! Bring on the bloody M","useful":0,"cool":0},"_sZriSnOaHMndaTvFGqHnw":{"text":"I went to SoBou while traveling for work in New Orleans!  I was blown away by the food and","useful":1,"cool":0},"gjjMZAlaq89agPhoy54fzA":{"text":"Ambiance:  5 stars.  This place is nice, clean, and modern.  The noise level is just right","useful":0,"cool":0},"X_CLGGi6KIkWyprKT_ElJw":{"text":"Go early for drinks because they keep grandma hours and will be closed by 10. Such a trage","useful":0,"cool":0},"DbwqWcZ2fW3yHCv2vD7Dkg":{"text":"We stay at the W hotel every time we come to New Orleans. Made reservations on Opentable. ","useful":1,"cool":0},"IV495EdkM-ntpvzGHfSZdw":{"text":"Very beautiful decor, friendly staff, mellow scene, and the food is AMAZING! Had the Gumbo","useful":0,"cool":0},"paLHOexFIlR4JNOke8TrGQ":{"text":"So happy we stopped in during our stay in Nola. The lighting creates a chill atmosphere an","useful":0,"cool":0},"l8yYR708etoU4ghNqMlnJw":{"text":"SoBou created an exceptional New Year's Eve dinner service. Not only were dinner reservati","useful":0,"cool":0},"Y8wsPtp9WnyLZEzg66-OsA":{"text":"Atmosphere - 4.5/5\n\nFood - 5/5\n\nService - 4/5\n\nTip: Don't miss the ribs with spicy cotton ","useful":1,"cool":1},"GyPgoQ-QtEEUHqkKHlyptQ":{"text":"Unfortunately, I have a very bad review of SoBou.  I was very excited to go here especiall","useful":0,"cool":0},"VmtNXGrjbOG_W6akFN8ygQ":{"text":"The restaurant is located within the W hotel and comes with my highest of recommendation. ","useful":0,"cool":0},"78ZSVd_38Ga6UOc0tV0VWg":{"text":"My best food experience in New Orleans. Shrimp & tasso pinchos on grilled pineapple are si","useful":0,"cool":0},"RukZa1sXGcdkufuQCS9QrA":{"text":"I went on a Thursday afternoon on a break from my conference. The person who sat me at the","useful":1,"cool":0},"A277_zfZJy6n1lmnPi46kA":{"text":"Ehhhh, no. I'm confused about how this place has such great reviews. I'm sitting at the ta","useful":0,"cool":0},"VwugqWxJVyXpTzXAkJqRNw":{"text":"So glad we happened upon this great place for lunch! Delicious food, perfect portions (a l","useful":0,"cool":0},"2og4z_NZvLOaPqEMPklOGA":{"text":"I should finish this long languishing review of the SoBou bar now, since the lovely Abigai","useful":4,"cool":4},"LCKatqn7BqR-jMLLQEldxw":{"text":"Excellent food and service. Had the heirloom tomato salad and pork bun and both were delic","useful":0,"cool":1},"n5-hkhAlidxUnohoyp_ETg":{"text":"Husband and I went here for lunch and really enjoyed this place.\n\nThe interior is pretty t","useful":0,"cool":0},"PQDsjzt-v4yKeLhG_Ty3Rw":{"text":"Dinner is phenomenal, most of the dishes were delicious, the gulf fish is exceptionally am","useful":0,"cool":0},"43oWc7Yu82Iss5hHRmupRA":{"text":"We ate at sobou the other night with a party of 14 people. The food and service were amazi","useful":0,"cool":0},"dUM9FO5ryVojqLo-QP-6bQ":{"text":"My husband and I enjoyed a wonderful weekend in New Orleans and we stayed at the W in the ","useful":0,"cool":0},"Jpev1ZnYVkq0OANGKqvV0w":{"text":"Sat down for a nice lunch, waited 10 minutes and waiter never showed , so we left. Weird v","useful":0,"cool":0},"FpuaK4GURpQ82aviSYnn3A":{"text":"Service was ok, not amazing. Food was ok, not amazing. Decent flavors but nothing that ble","useful":0,"cool":0},"Gpclwr9BTViTaLl1n1FY5A":{"text":"Awesome atmosphere. Some of the coolest most original dishes I've had in New Orleans. I ca","useful":1,"cool":1},"T4NuV6FdTvDDIY3FM-B9Fw":{"text":"SoBou was great! We had a reservation for 8:30 and was seated very quickly. There wasn't a","useful":7,"cool":7},"PTwq7oCYT3m6mIGPzF19Dw":{"text":"Foie Gras burger, Boudin balls, sweet potato beignets & Yellowfin tuna cones (amazing!) an","useful":0,"cool":0},"9JRYpoYVBUWB3BMYacmUbQ":{"text":"We spent our last night out in New Orleans dining at SoBou. It was a great experience. The","useful":3,"cool":1},"T477QVe6qTpWB_-drrD18A":{"text":"SoBou was a lot of fun, great small tasting plates.  We had no problems getting a table bu","useful":1,"cool":0},"N6md9oDwsDc421lt87XJwg":{"text":"I can not say enough good things about Sobou. We had amazing service with very attentive s","useful":1,"cool":0},"2edqFCvapKEwK4209M6_eg":{"text":"Order the legs and eggs! The chicken is fantastic. The blackend drum and fillet combo was ","useful":0,"cool":0},"AElJNkMTIPgX9XkVDliuMA":{"text":"Best biscuits in all of New Orleans!!!!!!!!\nThey are only available for breakfast so be su","useful":1,"cool":1},"3gEELeggKwTUdvP4CxNaww":{"text":"Service was terrible. We walked in and were told it was a 20 min wait and there were sever","useful":0,"cool":0},"o0Tco9xd-d3bz0gwviuAhw":{"text":"Everyone in my party was very happy with our experience at SoBou. The food was great, very","useful":0,"cool":0},"6lq4GSdbILAIBVFHUtvAbg":{"text":"We came by for dinner based on Yelp reviews and were very pleased. I called 30 minutes in ","useful":0,"cool":0},"ib0hLoCpDcS6tNMKy3j1ug":{"text":"The menu is small but in our party of 6 we managed to get a great sampling of the entire s","useful":1,"cool":0},"TP-UC6mmr6fSoJYzW6DqMg":{"text":"Food is phenomenal!  Service was very friendly, but very very slow.  Lots of fun, unique c","useful":0,"cool":0},"8ID_bheuALCtUPortnipAA":{"text":"I feel awful giving this place a 2 star review, but that is exactly what it was- a 2 star ","useful":0,"cool":0},"gpxPC5m9OndN1-wQaTvSPA":{"text":"Amazing. Absolutely amazing and delicious. I came here with some coworkers for coolinary d","useful":0,"cool":0},"nDFRYRPx-NEmlYENa7spjA":{"text":"Everything was great at SoBou. I had the funnycide and old fashion as cocktails and ordere","useful":1,"cool":0},"GDdOaWrk3Ip_UHyEDkCj9Q":{"text":"Went during \"coolinary week\" and got great deal on a 3-course meal. The place has a cool a","useful":0,"cool":0},"qwZZkfNZx2FSDKQl9qZPpQ":{"text":"Had a party of five at SoBou during a conference for dinner.  We ordered family style so t","useful":0,"cool":0},"AXIPUOtRzVG6cZMmQjMFxQ":{"text":"I booked reservations for NYE about 2 months in advance. New Orleans food is amazing--I me","useful":2,"cool":0},"uND6Zf7ojkKGCVyYhtEFPg":{"text":"My husband, our friends and I ate here on our first night in NOLA and WOW!  What a fantast","useful":2,"cool":0},"IZK05WDwaXCygo61KVBZAA":{"text":"We ate at SoBou for dinner on Saturday night. We called ahead to see if seating would be a","useful":1,"cool":0},"f-GQUPb68BQzU0Tr5L6AuA":{"text":"The menu is a little different but I loved everything I tried. The decor is so modern; nic","useful":0,"cool":0},"1N3YKK-tAGVqsYFMrnu06A":{"text":"Wow! What a special meal. We called in advance to inform the restaurant we were joining th","useful":0,"cool":0},"zFIkznbkPIycILOjqAclkw":{"text":"The gang behind the bar are all fabulous, happy hours specials were a deal and all delicio","useful":0,"cool":0},"RDcjO5pIeyJP1huvEQ3gbw":{"text":"Solid 4 and close to a 5.  Great space, great service, great food on all counts.  The best","useful":0,"cool":0},"Vi5rP9Twp-60VGYviUAqtA":{"text":"Minimalist in décor and menu.  Our table had fried chicken, SoBou burger, mac n cheese, fr","useful":0,"cool":0},"EYQmEDT4gq0arIttzkOL2w":{"text":"Stopped in for a drink and an app. Loved the Rowdy Hawaiian! You had me at cilantro gin. T","useful":0,"cool":0},"sSGYFooH1sNJYpDFO8QmfQ":{"text":"Food was amazing, best gumbo I've ever had! and Jimika our server made our dining experien","useful":0,"cool":1},"jKujWCYJSAYrw_Kp3fyzgw":{"text":"It's hard to only give this place one star because the food is fabulous. However the servi","useful":0,"cool":0},"MBJj_XOymua6GWEiN6UdfQ":{"text":"Happened to have lunch here with a friend after passing by it often. The overall aesthetic","useful":0,"cool":0},"pbx2eLwV5Jye8rOK2sk57A":{"text":"I was extremely disappointed in this place. I'm from richmond Virginia and found this rest","useful":0,"cool":0},"LRsia5v7DNVVbbcs7gXfmA":{"text":"First time I have made it to SoBou but I will be back, namely because I think we ordered a","useful":6,"cool":3},"SrvJiNsaeWmFInAfczzaEQ":{"text":"SoBou?  Don't you mean SoDelicious? (sorry, had to be done)\n\nI recently had an excellent m","useful":3,"cool":0},"Ma7LLzkOwNc2Puqpot_7YA":{"text":"Stopped in at the end of the night for dessert and bubbles-bartender was funny and very ni","useful":0,"cool":0},"jwFsAdRo3QodXaeEaEMiyw":{"text":"Came here with a large private party, family style meal. Each dish was amazingly full of d","useful":1,"cool":0},"eGYkVYpqshYudERM2P4Rkg":{"text":"This was a place I have been pining to go to for a long time, and I'm glad I did. The deco","useful":9,"cool":3},"EUvxglsrfF_N8r2w_BA_sQ":{"text":"Went went here for our anniversary and probably should have made a later reservation. Serv","useful":1,"cool":0},"rdKvENiaji7GquWeRKJtUw":{"text":"So this may be the best dish I've had in New Orleans, if not the best, definitely Top 3.\n\n","useful":0,"cool":0},"Nfr32ZeydwHe2eVuFOnssA":{"text":"Burlesque Sunday Brunch- Legs and Eggs- all the way!\n\nThe bartenders...the staff...the foo","useful":0,"cool":0},"6KA3tdF0B-1F4g5YRYLcpA":{"text":"Two of my favorite bartenders, Jared and Michael, serving up everything from amazing house","useful":0,"cool":0},"CEe_UQ9GhjNmjCN1m3I_Rg":{"text":"it was a cold and windy winter night.  we, a family of five set out through the french qua","useful":2,"cool":1},"nL-dDtIAUpBBpEBth_3vgA":{"text":"Fantastic cocktails and excellent nosh at the bar. And the bartender was fabulous.  Can't ","useful":0,"cool":0},"abq8OB8qur4Cq-M25strQw":{"text":"So So Boo! Torturously mean potions. Recommend you eat something before you dine at Sobou.","useful":0,"cool":0},"jvaYQZUY1ykikzuTokj4Ug":{"text":"I came here for an early dinner Friday night and absolutely LOVED our whole experience.  F","useful":3,"cool":2},"VpmH6rxttcnJvqILzilCfQ":{"text":"Overall, great meal & good cocktails w/ friendly & responsive service. Highlights: sweet p","useful":0,"cool":0},"O68O3KlzjWRTYI2kZ2Icog":{"text":"We had reservations for 11:30am, which we thought would still be brunch time. This place a","useful":0,"cool":0},"hBoSnIrJYbI48w4FEg-LBA":{"text":"*****5 SOLID STARS*****\n\nSoBou was probably our favorite restaurant in all of New Orleans,","useful":1,"cool":1},"97zkOcKV9yklbxuO7SNPjQ":{"text":"Dined at Sobou for lunch recently. Dined at the bar. Bartender was friendly and attentive.","useful":0,"cool":0},"hshWQHT399JT2XyLtOLNhQ":{"text":"First of all, the dining atmosphere was very nice. The bottles wall was totally worth a vi","useful":0,"cool":0},"AT71wwURL0q3ysZKhBzunA":{"text":"The food was good but was given the worst service I have ever received. Don't go.  The res","useful":0,"cool":0},"7a6Rd7wTrCVoI_LkJcGbsA":{"text":"A friend and I wanted to go get a few drinks & food one day and decided to sit at the bar ","useful":1,"cool":1},"Suj248y2tzWjyfaW9JaR7Q":{"text":"My wife and I went on a Sunday night. We had some time before the Guns N Roses concert so ","useful":0,"cool":0},"gnWAqS8zcTZue_7a8LgXmQ":{"text":"Adored Soubu.  Nothing bad has ever come out of the kitchen and the  service and ambience ","useful":0,"cool":0},"ne1Mz2CS2Ru4OqRzu7VvYA":{"text":"Service was good.  But server brought us out a cheeseburger when we had asked for a hambur","useful":0,"cool":0},"qkabvyBhIa5zi40ZmdUS8Q":{"text":"Visit restaurant on 3/2/17\n\nI was really excited to check this place out since it appeared","useful":1,"cool":0},"FaVOJ4sv6PjQHeMrkA56pw":{"text":"Hands down the best meal I have ever had. Started the meal off with the sweet potato beign","useful":0,"cool":0},"jotQg279o3eq3w38zAtQYA":{"text":"Bar Tender was fantastic.... Great Bloody Mary's....the \"Beast\"  yummy....and brunch to di","useful":0,"cool":0},"mHGqGUkTgaeFnTwdhns8Cg":{"text":"We went on a Saturday for a burlesque brunch. It was pretty empty. The food is overpriced ","useful":0,"cool":0},"a-1YdJ48qOGJisxPkayPtQ":{"text":"I rented an air B&B apartment near so bou Restaurant. They had an incredible snack menu at","useful":0,"cool":1},"w8evcrmQmk1vCbHatXhFUA":{"text":"Not much to eat if you don't eat meat or gluten... nice but overpriced. Really good servic","useful":0,"cool":0},"JdXDU0coco1JTJSrjAAYGA":{"text":"We were very disappointed with our dining experience on many levels.  Took 45 minutes to g","useful":0,"cool":0},"EECQ9On_Ubz0fsVeoqMLDg":{"text":"Amazing brunch!!! Was actually my first time eating at the restaurant; I've visited the ba","useful":1,"cool":0},"87BgLQjKyojs3Lydq1Nqmg":{"text":"Came to New Orleans for a convention and decided to try SoBou. Loved the ambiance and the ","useful":1,"cool":0},"-p6OgTsB8yLM7FZjdpPfuw":{"text":"This place was fantastic! The food was awesome! The breakfast menu is small but all fresh ","useful":0,"cool":0},"gC1HBeHE9Bi-sFY2RflAKg":{"text":"I was so impressed by this place. Each course was more and more impressive. My favorite ha","useful":1,"cool":1},"UzCUlla6zt1VHJgoal4aAw":{"text":"Burlesque Sun brunch show was a bust! The show was to have started at 11:30 but didn't sta","useful":0,"cool":0},"RjVQ2Fr_yKrhgoJ5qGxO8A":{"text":"SoBou is EXQUISITE. I love everything about this restaurant... except for portion size! Lo","useful":1,"cool":0},"g1wCtwY1k8h7mve3CM3EJQ":{"text":"Cool bar. Quiet on a sunday night. I ordered the rowdy hawaiian and it was a really well b","useful":0,"cool":0},"8SjFwsJFCDwW6MdqqGrLsA":{"text":"Tasty gumbo. Enjoyed the unique mix of rich roux, meat on mashed potatoes (rather than ric","useful":0,"cool":0},"LL5n7Uqxym-Zzh6oDOvOUA":{"text":"We dropped in here twice for happy hour which runs daily from 3-6. They have a few bar bit","useful":1,"cool":1},"3y5aXDtetSfoW1-KClMQcw":{"text":"SoBou isnt a restaurant as much as it is a really great tapas bar. \n\nMost of the inventive","useful":6,"cool":5},"t4JZXUGMqOCNV605e3lJWA":{"text":"Desided to go to SoBou for dinner after seeing an advertisement for it on the hotel TV cha","useful":0,"cool":0},"--F2pA6U8LPKwgqDubU_QA":{"text":"Tried breakfast there. They were clearly having problems in the kitchen. The table next to","useful":0,"cool":0},"XloMZFxiA0Kjz1aXAlfLng":{"text":"Cool place.   Surf &  turf for two -  aka build your own tacos -  was outstanding.   The c","useful":0,"cool":0},"uTueQimjVpojowMBImjCBg":{"text":"Not a good choice for breakfast.  I don't think they do much business for breakfast and se","useful":0,"cool":0},"Es810RxdZQ4smk-EKaPIzw":{"text":"Came for drinks at the bar. The bartender Abigail was super friendly and very talented. My","useful":0,"cool":0},"boZpXRu8WBxsQWrmNBLpsw":{"text":"This place hit the mark in three out of four areas of dining experience: good atmosphere, ","useful":0,"cool":0},"88xbmkV3ELTjk9q6UpEr0g":{"text":"This was no wild bachelorette party, but a group of women looking for unique dining as par","useful":1,"cool":0},"_3yn0WDqyT5komAzPe69Og":{"text":"Everyone was super nice, but sorry, our 5 dishes were really not up to par. Foie gras burg","useful":0,"cool":0},"U2m-KAyhK56YF0pp9VWWZQ":{"text":"Here's the facts. This place is very trendy, nice and probably famous for there interestin","useful":0,"cool":0},"vmfXmLM7-hPpmEIbbsymLA":{"text":"I recently came her while on vacation, and I'm giving 5 stars because it was the best dinn","useful":2,"cool":1},"JQsOYN3wDM4nKf_vEG-tjw":{"text":"After a few days of wandering around the French Quarter in search of traditional Cajun far","useful":0,"cool":0},"69Ed95CgEP8qVUQUHucVtw":{"text":"Totally loved Sobou.  The food, the cocktails, the ambiance, it had it all.  Reading up on","useful":4,"cool":0},"MPXQVtlvCK3q6iUF-mTcoQ":{"text":"Came the other night for dinner and went back today for brunch. The Burlesque Brunch was A","useful":1,"cool":0},"6GjN29nKkAM7qSXgxcYFsw":{"text":"Dropped in for breakfast as it's attached to the W hotel.  Super friendly staff, super slo","useful":0,"cool":0},"X_Hok13_c2MBttrBcG1l2Q":{"text":"The food was amazing and very reasonably priced for how nice it is. The restaurant itself ","useful":1,"cool":0},"3odrvoARl5h-QNj02Ejmug":{"text":"Surprisingly good restaurant at the W.  The sweet potato beignets were hands down my favor","useful":0,"cool":0},"Np-b7M5ToJc3foCrsJkt2Q":{"text":"Had this restaurant on list of places to visit in NOLA and it did not disappoint! Great co","useful":1,"cool":0},"vPTNbNgBPxP0Be6CvqFJ8g":{"text":"Legs & Eggs Brunch\nThe ambiance was great! The dancer and the band make the experience per","useful":0,"cool":0},"BkhK6JumStxjLM4dbPSepA":{"text":"To start with our waiter Alex was above and beyond the best waiter we have ever had.He had","useful":0,"cool":0},"TvLOrtQPRCPWy-ZJ8nJGPA":{"text":"Disappointing all the way around.  Tuna cones weren't good and was brought 4, they're tiny","useful":0,"cool":0},"gXTehp0IxGW4uFq7RrjFgw":{"text":"The food is really outstanding, but sit in the bar to experience Mike and Laura's talents.","useful":0,"cool":0},"rSZpGWYMtkP3XjY7blEBcw":{"text":"We were here for my boyfriend's 40th. Very interesting decor in the restaurant. It took ab","useful":0,"cool":0},"AON2dgE5KOIpoRr8H0kWrQ":{"text":"Food, atmosphere, price, and service were all excellent! Alec was our server and was very ","useful":0,"cool":0},"9jueWVEjSpBuaW3nB_aEcA":{"text":"Great Ambiance and great service.  My daughter had the best chicken fingers at this restau","useful":0,"cool":0},"pzCOQOmqyjKhcj3fkxrLLw":{"text":"Went here for dinner before seeing a play at the Saenger because it's pretty close. Excell","useful":0,"cool":0},"M4BK8bbLjqynZ5vzmYCW7A":{"text":"We had dinner here one night and left impressed. The bar was set high after we ate all wee","useful":0,"cool":0},"lL1DIeL2neNJ-N3aLqjdZQ":{"text":"Don't go here for breakfast!!!! They were not prepared when we came to eat around 9:45 AM.","useful":0,"cool":0},"h37wGIB0mLKQsGp3BNdoAQ":{"text":"I have dined at Commanders Palace for a while now. They have always been one of my most fa","useful":0,"cool":0},"i45l5zanZwj-lXMySnzIcQ":{"text":"A great, chic restaurant at the W in New Orleans...enjoyed a shortribs dish as well as a s","useful":1,"cool":1},"qZyPJRism3cy-DPA4VJq-w":{"text":"If I could give 0 stars I would. We had a large party. We called ahead and they told us th","useful":0,"cool":0},"ZPusOL3oSBiMfgS4nME8SQ":{"text":"We only came here for a cocktail or 2 but I really wish we would of had time to eat. The c","useful":0,"cool":0},"e5T8z1g64JmelS7S6VD6Hw":{"text":"Bartender Laura from Boston is a cocktail wizard!  They get the classics right and have al","useful":0,"cool":0},"hxsdNHc1qEVqAHB6IAakPA":{"text":"Came here with my friends for somewhere to eat for our first day here ! Came during happy ","useful":1,"cool":0},"ipsvJjd-cgZMzH9RmVd_iA":{"text":"Be aware that it's a LOUD space but the food is good, cocktail and wine lists are nice, an","useful":0,"cool":0},"PsXIeBfbQWHZZdi4Kuu5TA":{"text":"5 stars for the ambiance. This place is great for an intimate dinner. It's very low lit wi","useful":0,"cool":0},"muT4zORU1RZ6FyqvsODbeQ":{"text":"Stepping inside Sobou I was immediately blown away by the ambiance. Colorful, glass bottle","useful":1,"cool":0},"XBLsV_FimueTBORsP8_m1g":{"text":"By far the most amazing experience we've had at a restaurant in New Orleans! Our waiters S","useful":0,"cool":1},"jXKW4-Ooj0tUAbnB2hcpTg":{"text":"SoBou was absolutely amazing! The food is so delicious.  The atmosphere was casual chic an","useful":0,"cool":0},"qTBnQKqop1vl6DDHr-RQrA":{"text":"Was here for breakfast and also for drinks. Solid choice and good offshoot of Commanders P","useful":0,"cool":0},"YeoPz2z6897UMXOGIILbvA":{"text":"I sat at the bar during a very slow lunch. The bar staff was extremely attentive and helpf","useful":0,"cool":0},"Mc8lr3spF2Ou5faPHkUiMw":{"text":"Such innovative, interesting and DELICIOUS food.\n\nApps I loved: ceviche cone w/ basil avoc","useful":0,"cool":0},"4iYaxXTs_NuYfhGOHtgMfg":{"text":"One should not leave New Orleans without indulging in SoBou's sweet potato beignets with c","useful":0,"cool":0},"10w_GN-9hqYfyMpwEZJHIA":{"text":"Quite the interesting and delicious take on creole food. If your stuck on traditional then","useful":1,"cool":1},"zAhfVf4bwBtOnjgYknAtCw":{"text":"Wayyyyyyyy too much salt and pepper!!!!! I couldn't stop coughing and sneezing! Never comi","useful":0,"cool":0},"DVKSFdReg1GuAgSXfzCPNg":{"text":"Stayed at the W Hotel this weekend for Jazz Fest, ate dinner twice at Sobu.  The staff was","useful":0,"cool":0},"AhcmEsM_6MLCxGEZj7XAxw":{"text":"It's so cold inside! But it's a great place for dates, drinks and creative food!\n\nIt's Cre","useful":0,"cool":0},"INhedupPBUbdWnMAKoIokQ":{"text":"Fabulous Restaurant at Mardi Gras. They treated us like King and Queen and the food is exq","useful":0,"cool":0},"Z9zCexoP4sbkTHVXRfv8Og":{"text":"Eating here confirmed my low opinion of hotel restaurants.  It occupies the space once hel","useful":0,"cool":0},"rnCZGVQDP-qWczvF7tG68A":{"text":"A  gourmet  twist  on  local  New Orleans favorites.\n It  specializes in small plates or t","useful":6,"cool":6},"aLcL9QYeMx2fU0IO6q5aOg":{"text":"Atmosphere from fiction filmed in New Orleans the location is Chartres St you eat outdoors","useful":0,"cool":0},"FOrUUpQL3D30fwXa4wHckg":{"text":"I went here for breakfast my last day in New Orleans. Simply put, it was great at every le","useful":0,"cool":0},"TVK4nJq1uxgePYNdiR8KfQ":{"text":"Had a bunch of small plates to try more items on the menu. Gumbo was very filling, but not","useful":0,"cool":0},"vecsrg5ymevoijXLUGDbVQ":{"text":"Tasty food but very small portions. I came and left hungry but at least the food was very ","useful":0,"cool":0},"gougHnKvM2OkTi-asTgB3A":{"text":"I visited SoBou on a Friday night with 5 people and no reservation and we got right in!  I","useful":0,"cool":0},"nZoFfpNpYCoalChianJgyg":{"text":"So 4 orders of yellow fin tuna cones later........ :)\nSeriously, you have to try those con","useful":0,"cool":0},"KvCRmSVo1jWEB0vYvV5d5Q":{"text":"Located in the W on Chartres St in the FQ.\n\nA good friend of mine took me here for a belat","useful":2,"cool":0},"0Qkre2bMsSAKFJkrn6wrXg":{"text":"Food was pretty good. Like the atmosphere, but can't say I would go back. Cheese plate was","useful":1,"cool":0},"Xeygp-LD2mEnNey8fd1Nbw":{"text":"Wow....that was super good and tasty. Def hit the steam bun, beignets and gumbo, enjoy ;-)","useful":0,"cool":0},"yi6NW-pj9jVgMJQhpRfKhg":{"text":"I found this place meh. Out of all the restaurants in NOLA, it's not my favorite. We got t","useful":0,"cool":0},"UGCpB31xI0AI-dRrq0q5iw":{"text":"Very trendy. I like the idea of small plates, but the flavors just didn't deliver enough p","useful":1,"cool":0},"8taSp4LaQxYv8q1NlEr57A":{"text":"I have eaten at hundreds, maybe thousands of restaurants in my life. Never have I been tre","useful":1,"cool":0},"GLITj2_3HOup2lnR_0wniQ":{"text":"Went there on Monday the 16th.  After standing for four hours at the parade and it started","useful":0,"cool":0},"Mb6Y4_dOs2vjc5XhdsT84Q":{"text":"Really interesting, amazing food. The atmosphere is fun too! Try the Shshto peppers, not h","useful":0,"cool":0},"fSOgEJrqRKF22Cy446QzuA":{"text":"An oasis of calm and sophistication in that part of the French Quarter. Didn't expect to g","useful":0,"cool":1},"FC2Rcc8dZZofIvbhMDbH1g":{"text":"Ate all over New Orleans this weekend.  Had great food everywhere.  Sobou for happy hour. ","useful":1,"cool":0},"TixTCfd-eoGc5YJpGi8hJQ":{"text":"Poor service and unreliable food. Watched our white wine warm up while our server did all ","useful":0,"cool":0},"W2F-DyHban1z5l1JSHtH4A":{"text":"I like the location and interior but the food was lackluster. I got the bisque and my date","useful":0,"cool":0},"HQecUiTXvkfdm8FOe1gumg":{"text":"Excellent foods. Here are the standouts:\n\nApp: foie gras duck confit, SWEET POTATO BEIGNET","useful":0,"cool":0},"RsO5vLvAtERdmoRYSbTLVw":{"text":"Such a cool bar right in the middle of the French quarter.  Very hip environment.  I belie","useful":0,"cool":0},"zM0adJ9H-iGzYjmO5e5r3g":{"text":"It had been a while since our last visit to the quarter so on our anniversary we opted to ","useful":0,"cool":0},"S1sqB9MvcyIPPkIcs6IblA":{"text":"I stopped in here to try their Blood Mary for the \"Yelp's Battle of the Bloody Mary\". Wow,","useful":3,"cool":2},"J-XIVjfVpWYlcah2UzIvaA":{"text":"This is a great little gem to check out. From the décor of the restaurant, to the inventiv","useful":0,"cool":0},"V5aAb1qEqxH601ZC6dMKqQ":{"text":"Sooooooo Gooooood!!!!! I went Sunday for brunch, didn't have a reservation and still got s","useful":0,"cool":0},"1XqUbZnj8agwzXs966d8xw":{"text":"Amazing food. Service was a little sloppy but the food was SO GOOD that I didn't care. My ","useful":1,"cool":0},"0rXzIdHhh8YDF63xouxeAw":{"text":"We loved our first dinner in NOLA! Our group is staying at the W where SouBou is located. ","useful":0,"cool":1},"wbVVHHaZ1D2tFjXh4Zg9YQ":{"text":"The quail was raw. See photo. The waitress apologized but still charged us for the entree.","useful":0,"cool":0},"oGHZEV5Jie-aXlSMSc-Ifg":{"text":"The food was all in all great!  Went for an early dinner and drinks one week night and was","useful":0,"cool":0},"pd5UJSIw6okeGnMulYGlTA":{"text":"Decor stunning! Food great! Gumbo was different in a nice way. Not the usual New Orleans g","useful":1,"cool":1},"F93MsWryQSEZPo5KhOpE2Q":{"text":"First star out is the table is dirty, and sticky, sorry, I can't stand it\nSecond star out ","useful":0,"cool":0},"chQszMPWb6mm3ktS-ex_qA":{"text":"This isn't a place you go to get full...it's more about trying several quality dishes and ","useful":0,"cool":0},"2GtS2TlIbIfWpCWpFWwsCw":{"text":"Long waits, terrible coffee, way over priced, the oatmeal was stale and bland and the smoo","useful":0,"cool":0},"_tBefSeETxIb7RHzYpMsIg":{"text":"Awesome place and nice service\n\nWe had the sweet potato beignets and they were lovely. Fol","useful":0,"cool":0},"NTFvF8dKU7clGYi_2GiQ3g":{"text":"I came here with my girlfriend and her mom on a Wednesday evening for a 6:45 reservation. ","useful":1,"cool":0},"_b76_CIf7oHyHLuwM96CUA":{"text":"This bar is awesome! I came in for the sweet potato beignets (totally worth it) and, staye","useful":0,"cool":0},"F7U_Yy4NMlcefpV2TLjF8Q":{"text":"The family went to SoBou on Christmas day because we wanted something nicer but not so fan","useful":1,"cool":0},"QqAb_SbkTgiNm_0vcOWGgg":{"text":"We went in on a whim while traveling and it was tremendous. Great vibe, trendy menu, conge","useful":0,"cool":0},"U9ytjFkBCl1Sh9z9NVYAJw":{"text":"Food was delicious, but not something to die for...\nLocated conveniently near bourbon stre","useful":0,"cool":0},"_kWjP0w5fduFlT4laRZzPQ":{"text":"So the boyfriend and I stopped by here for a late lunch. Sadly we arrived right at 3:00pm ","useful":1,"cool":0},"YbFqJ4rspEAJffeUOZVJFQ":{"text":"Courtney, Teraze, Ally and Dom did a great job. I really enjoyed the food and mimosas","useful":0,"cool":0},"013H9TCm0CJdrii4TfOdsA":{"text":"Oh my gosh WOW!!!!  I mean WOW what a surprise!  I was walking around this area on a Frida","useful":0,"cool":0},"7Rilq_aFUQhhV1-dadbyIw":{"text":"If you love well made cocktails, this place is a must. The bartenders are truly masters of","useful":0,"cool":0},"swhML1-SFzNoZjeScAy3Jw":{"text":"I was personally contacted by the manager of this place, offered a sincere apology  and in","useful":0,"cool":0},"Qt9lUDkPgFNT7CXCyzI6Ew":{"text":"The sweet potato beignets were tough and doughy, more like a hush puppy with over-worked b","useful":0,"cool":0},"9UngUh_aTp-EYITafUYFKA":{"text":"Wonderful food with a great atmosphere. The staff is extremely friendly and helpful. Also ","useful":0,"cool":0},"aWA_Mc163Ek1Wwm9hwOEJw":{"text":"Amazing service - the staff made the dinner an experience! Great food and very cool atmosp","useful":0,"cool":0},"sQrmPhNOWNzZQmB90c5SnA":{"text":"Cute ambience. The tables and chairs are kinda old, so they make noise. The waitress was v","useful":0,"cool":0},"Cd302vBu7XcYZc4dIL9yiw":{"text":"Absolutely amazing!  Drinks, dinner , wine, service!!!!!!! We are major foodies and everyt","useful":0,"cool":0},"pPW0c2aQ65cE4wTLGyfO7A":{"text":"My wife and I love this place!!  We first  went here on  Dr Gumbos food tour and loved the","useful":0,"cool":0},"q3snqZ1TWNwEplPULl_BHQ":{"text":"My girlfriend and I decided to come here based on the reviews, which turned out to be a hu","useful":0,"cool":0},"XSIvlol24XoYwzE-k4DivA":{"text":"A modern yet sophisticated ambiance with a great cocktail menu and delicious bites of food","useful":0,"cool":0},"-K0P_F9m6V45ENAjd-Y5Ww":{"text":"LOVE the atmosphere!  We were a little late for our reservation because we were trying to ","useful":0,"cool":0},"TN0CQm8712oEuM04hANjIw":{"text":"This place is fantastic. This is our first time visiting Nola, we have been to a lot of th","useful":0,"cool":0},"kc8Wc-X_pvVdzgFjaiAiZw":{"text":"We loved our lunch at SoBou!\n\nThe decor was unique and inviting.  Bottles lined the walls ","useful":0,"cool":0},"vMlAj9M4PTgZY14ALXs2JA":{"text":"Came here for dinner with my husband and we were impressed with our meals and the beer sel","useful":1,"cool":1},"wScNA68tPeH_DI6bNbo-Zw":{"text":"We are dinner at SoBou last night and it was AMAZING! Request Tina, she will take great ca","useful":0,"cool":0},"7wOovIvY5lxtztKFcgGZSA":{"text":"Dear SoBou bartending staff. There is an excellent article out on the interwebz titled \"Ho","useful":1,"cool":1},"pSdN10pBL2vNBL2IaObmWA":{"text":"This place sucks ass. Like really bad. Like really, really, really bad. I will never go he","useful":0,"cool":0},"y-xkqRMFupl4Fqc89FmzNQ":{"text":"The food was very tasty, from the cracklings to the sweet potato beignets, the crawfish po","useful":0,"cool":0},"DtyMzNsIMVPv4KalevHppg":{"text":"Easily the worst breakfast I've had in as long as I can remember. I didn't know it would b","useful":0,"cool":0},"40x3eFN5Rpgo6GJ9mlqpow":{"text":"last minute choice due to the late hour (8:30 is late for us). opted for several appetizer","useful":0,"cool":0},"G1xQUHbc7vDZ5oNRh6HmWw":{"text":"Really had a great lunch here! How bad could a Resturant be that has a beer tap built into","useful":0,"cool":0},"A-9w5OC29RSEIQ3zAurzYA":{"text":"Fantastic find in New Orleans!! Service was absolutely excellent and food was even better.","useful":0,"cool":0},"fuoym2-D0-PZr4qsPmCYLw":{"text":"As locals, when my girlfriend and I play hookie from our weekday responsibilities, SoBou i","useful":0,"cool":0},"kOLiylsvvbh2TIJBRm7_Ug":{"text":"Walked in from the rain by happen chance, delicious! \n\nHad the 2-course lunch with gumbo o","useful":0,"cool":0},"QUuv_rVhpuKSkvGYpm8ePQ":{"text":"Such a nice, quiet, and romantic place. We visited twice since it was within our hotel and","useful":0,"cool":0},"z7eOkPkjKTBL5t-QKPmwkQ":{"text":"Horrific! Ugh came here with a bridal party and the service was great! We had a really nic","useful":0,"cool":0},"YrCgXCdqHvHnlvmJVlxwEQ":{"text":"Our food and server were amazing. Our server, I believe her name was Brandi, went above an","useful":0,"cool":0},"K8c1YUqxUs6chjEiQNXyxQ":{"text":"The ambiance us very nice & I like the custom made drink menu, only thing is that it takes","useful":0,"cool":0},"uuoMfFDLtAcKD_cUERrfFg":{"text":"Between the personable service and the great food it was well worth the time here in the F","useful":0,"cool":0},"wmRFW0YaJoGyRluaTTSUeA":{"text":"Pecan, pork (cracklin) and peanut butter (whip cream) in a jar a la mode. \n\nThe best burge","useful":0,"cool":0},"wWIymacdoQ28DpXtJF9sGg":{"text":"Omg!!!!!!  Best \"breakfast\" sandwich I've ever had!!!  It's called Cochon de lait, bbqed t","useful":0,"cool":0},"bog1hEADMf6nss_chN2Auw":{"text":"This was a great place for my wlife de and I to have an afternoon snack, really second lun","useful":0,"cool":0},"PVNbrO2Q5pg38Z5jk7MevA":{"text":"When you are in the French Quarter, you need to try this place. The restaurant itself is b","useful":0,"cool":0},"hblhc-geyjS6ZjLOhbNhSA":{"text":"SoBou inside of the W hotel in FQ is a great spot to catch up over cocktails.  They make r","useful":0,"cool":0},"A9leQcmfD8wRvWj_Bvta2w":{"text":"It's been awhile since I've been here.. And for this dining experience, items just didn't ","useful":2,"cool":1},"Lj9dtKXRWdHmGfXDENtKjA":{"text":"I Come by every Monday to enjoy a good cocktail, Kevin is been taking care of me since the","useful":0,"cool":0},"V8KX0_5UGpUPi3WgjFYBtw":{"text":"Fabulous experience!  Food and service excellent.  I also enjoyed the ambiance.  Validated","useful":0,"cool":0},"jcIDYzE-rLcn_EoCihaw_A":{"text":"I had a funky, fresh dinner sat SoBou which was a fantastic start to my food crawl in NOLA","useful":7,"cool":6},"bFQ7CtjlXXXgyVJxU0umWA":{"text":"Loved the 25 cents martinis. I ordered the lunch special (pulled pork) and it was very tas","useful":1,"cool":0},"7uIWeR_HeLAR8L4-cRW2sA":{"text":"Wow this place was great! The food was very delicious and the atmosphere was great! When w","useful":0,"cool":0},"c9n0eD05s-2U--VwP9Pklg":{"text":"Ate at SoBou today,  Have to say was not that impressed,  our sever was good and knowledge","useful":0,"cool":0},"b5IOuGRDM9McYrbUScw_-A":{"text":"This was the first restaurant my partner and I went to when we flew into New Orleans, and ","useful":3,"cool":1},"-fT5NnPDgnwuFPWgLFk8nQ":{"text":"We came here because I love the courtyard at the W. When we first looked at the menu we di","useful":0,"cool":0},"A9pvwdjIm7IaeGu130RWDQ":{"text":"Centrally located in the French Quarter, Sobou is a one of many newer restaurants that off","useful":2,"cool":0},"JfehZZ0mTUyCUQ94ZABMwA":{"text":"Everything we had from the first course to the last was incredibly tasty. Great prices & $","useful":1,"cool":0},"Tor4FjCrY6O_S-Cscjiw8w":{"text":"We had an amazing meal. Brandy our waitress looked after us and was fabulous. We will defi","useful":0,"cool":0},"QKGERE4GUoodqBoH99cU_Q":{"text":"What a beautiful restaurant.  I visited on a hot summer afternoon and SoBou provided a com","useful":0,"cool":0},"s2BCRzT7GyEOTUAp75X9rg":{"text":"Lots of interesting options to try. We loved this restaurant. They even have a Happy Hour ","useful":2,"cool":0},"mRsbq1mBU6abF932tFCrug":{"text":"Loved this place, especially as a break from other French Quarter predictability. Sobou st","useful":0,"cool":0},"mTVeWIVB9iEwuj69M-v4tg":{"text":"Pretty little restaurant.  There menu is small and the food is small too. It's expensive b","useful":0,"cool":0},"6kHNxAS74QKMdiY69KsGFA":{"text":"By far one of my favorite meals while I was in NOLA. I was visiting over labor day weekend","useful":0,"cool":0},"RJ8qUGtqS18ilv5zv35ARA":{"text":"Great little place. Beautiful seating area lit up by old apothecary bottles and mirrors. M","useful":0,"cool":0},"_qf_zzFnfE14l-hh_4y2cQ":{"text":"It was a cold and damp morning in NoLA and I was starving.  Enter breakfast.  Enter SoBou.","useful":0,"cool":0},"hyopU_fifdMXz7QyBHuklQ":{"text":"Came here my first day of work at a new job with my coworkers. We tried a bunch of everyth","useful":0,"cool":0},"tE27Sn29v54X28gmrI4_3w":{"text":"More like SoBoooooo!\n\nWe've been here since 730. It's after 900 and our app plates just le","useful":0,"cool":0},"b3G-4FcLTJDFdLh1kJGG7A":{"text":"Great hidden gem in the W hotel. Nice modern decor and ambiance. They do tapas style small","useful":0,"cool":0},"nBBpnbmHzckXLb3_hUmEhw":{"text":"Great place with taps right on the table for self serving beer and delicious variety of ta","useful":0,"cool":0},"ZoqW2_6OhA_qmmQrrq7vHw":{"text":"Vegetarian loved the artichoke and mushroom tamale!","useful":0,"cool":0},"CGDWbYWp5K3V6xVYCztfiQ":{"text":"We went to Nawlins for vacation for a 5 night stay.  During this vacation, we went to Brou","useful":0,"cool":0},"V4dxQWo2MSZvkdrJzkmU9g":{"text":"Stopped here last week for lunch, immediately noticed the decor which i found to be pretty","useful":2,"cool":1},"AYYrN4EJfmFUrhFiptll0A":{"text":"Our dinner here was very good and the selection was creative.  After a heavy lunch a tapas","useful":0,"cool":0},"JPiRwe4wPTO2z0dyiDKTQw":{"text":"Just had lunch here and had to jump on yelp. The butternut squash soup was amazing, the fr","useful":0,"cool":0},"AqjYr71GrzLryTOqAqPpXw":{"text":"Made reservations for lunch on Monday but did not need to as the place was empty - not a b","useful":0,"cool":0},"cD4vHme8ieutoui60cpZLw":{"text":"Stopped in after reading the NYT's writeup on the NOLA cocktail scene: http://www.nytimes.","useful":1,"cool":3},"Ld9QQSSgHSjqvh9wZiwO0Q":{"text":"This review is geared towards the bar-the Bloody Mary to be precise!\n\nI'm not a sweet drin","useful":1,"cool":1},"_VoKtInqdZM6L_WmJ-zHxA":{"text":"Place costs about $$$$ not $$ and here better order only drinks. Two gumbos one beer and c","useful":0,"cool":0},"rX-svddc-k90rqXLISGUrQ":{"text":"Holy mackerel I love this place. My boyfriend and I went during seafood restaurant week, a","useful":3,"cool":2},"rswvGWOey68q5_BoWq9qXA":{"text":"Overpriced and overrated. We were just snacking so we stuck to the small plates here. Food","useful":2,"cool":0},"cyljx5hswsAqEfLllBuKWA":{"text":"First, the space is modern and beautiful. Wonder modern cafe ambience. Second, the kitchen","useful":0,"cool":0},"I5CDgKYqzh48BPnKTkJsDQ":{"text":"My wife and I enjoy exploring new options in our fare city, especially during 'coolinary' ","useful":1,"cool":1},"o6d5iecviaK6OQec2YCOSA":{"text":"Popped for a light meal \n\nService is above and beyond; no rushing, explains everything wit","useful":0,"cool":0},"9xE_X6WbJwR73P_6cHtDcQ":{"text":"There was something wrong with their billing system and the whole restaurant flow.\n\nWe cam","useful":4,"cool":0},"tKfhKnxsLqZoWp2R5GfikQ":{"text":"Swanky little place. Dont really have too many \"creole/cajun\" dishes on the menu but they ","useful":0,"cool":0},"5yWmNa2INtqeL31yRP6LJg":{"text":"Great service, atmosphere and everything we ordered was delicious. Winter salad, shrimp sm","useful":1,"cool":0},"KJcjnnuV0AfQS1GiQW-fjg":{"text":"The first night we were in town, we stopped by for a drink and we fell in love with their ","useful":0,"cool":0},"07eSmkn1o_I5oXE_mdyWRA":{"text":"I came here specifically for the foie gras burger - but my mom and I also split the boudin","useful":0,"cool":0},"tW5i0O-n0MuYTFpg4bLc3A":{"text":"Terrific food, but the foie gras burger is literally a slider. Order something else... Or ","useful":0,"cool":0},"uKB869REhzVa-xu2ORFaeg":{"text":"So, 3.5 years later, I'm back with my now legal drinking age daughter, her boyfriend and m","useful":0,"cool":0},"GczwXAh_KznNtqFokh_fgw":{"text":"This was the first meal we ate once arriving in NO.  We were so excited to eat at SoBou ba","useful":0,"cool":0},"rd796oH63TP1N3u2-uZqVA":{"text":"I have been debating leaving a review or not for this restaurant. I usually dread leaving ","useful":0,"cool":1},"MdO69PrSWfwM9xA2K89g4w":{"text":"First we ordered 4 appetizers, first one came which was delicious then we waited 20 minute","useful":0,"cool":0},"ElyJX-tqZGdVgg1zFeJYAw":{"text":"By far one of the best meals I've had in New Orleans to date! And on top of that the servi","useful":1,"cool":0},"9KnsEY71F7ucUAClpKYD0A":{"text":"Great happy hour! I went and had 2 glasses of wine and a crispy chicken small plate for $1","useful":1,"cool":1},"xQKdpD4ZIqhEII-bqTiUQQ":{"text":"This place has one of the weirdest appetizers I've ever had. They were little ice cream co","useful":0,"cool":0},"79kAJKA4LYOkUZs2XgEkkA":{"text":"Aaron was an amazing waiter and he took fabulous care of us. Had the yellowfin tuna cones ","useful":0,"cool":0},"mfXeoaY7ZCta6IIjVNgG1w":{"text":"Best meal I had in New Orleans. Everything was fresh and perfect smaller portions... The p","useful":0,"cool":0},"flZcxs5iNhwJdZZLrqbOHg":{"text":"Went here during my 40th Birthday trip, day 5. Had a massive hangover from the night befor","useful":0,"cool":0},"2dknV_WYH2cCRjxzBb5luw":{"text":"What a disappointment. Had to send my food back -which I almost NEVER do!  \n\nToo many othe","useful":0,"cool":0},"jZMr-sxREO0xwhKJE8USxQ":{"text":"The food at this restaurant was just okay. I really loved the pear and pickled grape salad","useful":0,"cool":0},"Cj5HO1NgUxDWjtj801gMvg":{"text":"Upon entering, you are entranced by the modern yet sophisticated ambiance. I was looking f","useful":1,"cool":1},"f7Lf5Y8-eek-RJyngBtmLg":{"text":"This place is amazing! It's such a cool mashup of tapas and New Orleans cuisine. Their use","useful":0,"cool":0},"N5isVlPd8u4lpju2trdWZQ":{"text":"Excellent restaurant, excellent food, excellent service. Deserves more than 5 stars. This ","useful":0,"cool":0},"gCe_Xdx3_ImEUa-EUJ1d3w":{"text":"Not the best experience. Two meals were cold and had to be sent back. Desert was dry and l","useful":0,"cool":0},"VCbnGpRmWvG1vexwIAiAYQ":{"text":"Fantastic brunch on Sundays called \"Legs and Eggs\"... three course brunch with a Jazz Quar","useful":0,"cool":0},"XLEZqeHFrOIRLV4NaEI3BQ":{"text":"We came to NOLA during a seasonal time so making reservations was a bit difficult. Anyways","useful":1,"cool":0},"cwx0XKxinBe_pBrPFEQY8Q":{"text":"This is THE BEST place in the French quarter. The food is actually pretty cheap, and it sh","useful":0,"cool":0},"utUK2HI8znJErfndlEBFJQ":{"text":"Legs And Eggs brunch! Ahhh it was amazing! The buttermilk donuts were to die for! The ente","useful":0,"cool":0},"dmxOFpwCfEjvPP0vgea5WA":{"text":"This is a phenomenal place to go for brunch. On Sundays, they have a burlesque show (\"Legs","useful":1,"cool":1},"yuJA_xZSJq70i8LEdOzXmA":{"text":"We've been here 3-4 times over the past 5 years but now (2018) the service level is 'off t","useful":0,"cool":0},"W1v0uqvUX6zgb4WpS71Qmg":{"text":"Don't waste your time or money here.  I dropped $30 for lunch and was still hungry!  The w","useful":0,"cool":1},"F1joXi4d8Tm6cOXY1MroVQ":{"text":"Had to have our happy hour fix and SoBou. The had the crispy oyster taco with the chicken ","useful":0,"cool":0},"hmIMJfUi_Pz8SxWrSQVneA":{"text":"After searching for some suggested Creol/Southern places for a more upscale-intimate dinne","useful":1,"cool":0},"Nvdll93YuYZKFctv432H_g":{"text":"The Boudin Balls were delicious, though I was disappointed that they no longer served them","useful":0,"cool":0},"1Kyl61S_aZh9QoQihGf8xg":{"text":"We had a great experience at Sobou; Alex was very attentive and made incredible recommenda","useful":0,"cool":0},"IxWDDXPFZSBV5gdX1Yl6Hw":{"text":"SoBou is great if you're looking for some high class, delicious, well-made cocktails away ","useful":0,"cool":0},"aVKVgLM1-gYRZFYv0f--bA":{"text":"Brandy made our family feel so at home!!! \nWe love SoBou and will absolutely be back!!!\nTh","useful":0,"cool":0},"ZAOTI_pLFKRr9ADBueUcQQ":{"text":"Avocado ice cream tuna tartare cones...order two orders as you will love this one bite app","useful":1,"cool":0},"XupVc2dsqaU3siBYlo-6Yg":{"text":"Delicious food, great service! Loved the drinks, boudin balls, ribs, and ghost chili cotto","useful":0,"cool":0},"Jc6bwa0WKvpYE3d_0POFWQ":{"text":"Everything we ordered was delicious.  I would definitely want to eat here again.  We start","useful":0,"cool":0},"zk_aHW6sl41gERY7Mo74Qw":{"text":"If there is a cocktail bar in Heaven, it's probably not as awesome as SoBou.\n\nI swam in th","useful":1,"cool":1},"exItN6o12SFJJ0TFryBriw":{"text":"My friends and I ate here for Sunday brunch the night after we ate at their other restaura","useful":0,"cool":0},"Yha2Cr9_JTscaYOpjUzJpg":{"text":"I had lunch at SoBou on a Monday. I did not know it at the time but it is part of the Bren","useful":0,"cool":0},"D66GuFcR4DmkISMIP2vOZA":{"text":"The last two times that I've een in New Orleans, I've been wanting to check this location ","useful":0,"cool":0},"U9tORhgKIKhh5QXC_YGyKA":{"text":"Imagine. A boardroom full of bankers and an owner trying to figure out how to do the impos","useful":0,"cool":1},"HwYaTEzOYayhFwcLupPODQ":{"text":"SoBou was amazing.  We went there for the Tales of the Cocktail dinner menu.  This was our","useful":0,"cool":0},"wk0WSimQQY7vXmxazpTu0Q":{"text":"Best breakfast burger !!!  I went early in the morning, wasn't crowded and was seated quic","useful":1,"cool":0},"Zefo2yrQHMDjYvKlUMwTdA":{"text":"Outstanding small bites - savory beignets, cracklin', shrimp, pecans. Amazing. Creative co","useful":0,"cool":0},"I0biw1GpTAN2QXuOwXfFyg":{"text":"-had chicken app and oyster taco\n-have been here a couple times and hadn't come back in aw","useful":0,"cool":0},"9Xp5DZZp64W46VhJRglX1w":{"text":"A group of 6 of us went to SoBou's Legs and Eggs brunch on Sunday to celebrate our friend ","useful":2,"cool":0},"zNK_uaV3dktH1R5-6TcUGw":{"text":"excellent service. delicious food. a must when in new orleans. check out the dishes posted","useful":0,"cool":0},"vaB3AwpoADnyKTMJo31_9A":{"text":"I actually went in there by mistake on one of my business trips a few weeks back and ended","useful":1,"cool":0},"cvwsDUs3U9mHKfsxoN6KVw":{"text":"Great vibe. Had a light dinner....butternut squash bisque was amazing! Next time I'll have","useful":0,"cool":0},"zLjjqo17SrRGGND4mMSJCw":{"text":"HOLY SHIT. Where do I start. The fois gras burger was F-CKING delicious. Like, a spiritual","useful":0,"cool":0},"nA-7fxG5ZukvJogq-3MyBg":{"text":"Hip and chic decor, delicious food and cocktails, fun and skillful plating.  Very reasonab","useful":0,"cool":0},"v-1MmkM1B7wRrmD8a5Hdng":{"text":"Sat at the bar and had wonderful service. The cocktails were legit. Highly recommend a Man","useful":0,"cool":0},"wfxqPsueOUf2Zk8nB5v7Mw":{"text":"Very trendy and difficult to get in but sorry not worth the wait. Sunday night experience ","useful":0,"cool":0},"6MFFcJRqpn5_6fUJQxoqfQ":{"text":"We were looking for some Cajun food with a bit modern twist and this place worked great fo","useful":0,"cool":0},"sBX8S55roXp-uh6N0eii3w":{"text":"Had lunch at SoBou, friendly service and delicious foods! Make sure to try anything that s","useful":0,"cool":0},"2qVpdq_opgN6ROvWSwiuyA":{"text":"Sobou is a very nice Resturant! It more like a small plates kind of place. Good place to m","useful":0,"cool":0},"B288CvX2s0hKoRsI-SyWWg":{"text":"My friends and I and searched for a really nice Happy Hour location that would be great fo","useful":0,"cool":0},"IDrqGCrD7BV9ZATZsvu8yQ":{"text":"I am absolutely shocked that this establishment is in the same family of restaurants as Co","useful":1,"cool":0},"0cI6UsjoRsnI5b1kNZ_rqA":{"text":"Amazing lunch special before 4pm! (If you come before 3pm there's 25 Center Martinis We di","useful":0,"cool":0},"Y4pcI6UVP6l_IPD2et_Klw":{"text":"Not enough superlatives for the meal I got here. Arrived during Mardi Gras, yet somehow th","useful":0,"cool":0},"5mruHe4gzmFaTm_lvtRdCQ":{"text":"Great place!!  Super friendly place. Yelp needs to take down the check in special\nThey no ","useful":0,"cool":0},"mgR3BrV8KcXKomu34gbbow":{"text":"We really ... REALLY enjoyed SoBou!!! I saw the oyster tacos on a cooking show but they we","useful":0,"cool":0},"jolRemwgzVHY3ZfO8o3EyQ":{"text":"Loving this place!!! Great atmosphere. Great authentic culturally connected food. Great se","useful":0,"cool":0},"r-ps62tXRlOJxvSvnmJmEQ":{"text":"Great food, great decor. Very modem and fresh. I had the conch fritters for an appetizer a","useful":0,"cool":0},"HCiC8byI7hC7J5TJqzAmvg":{"text":"Portions were extremely small, it took forever for us to get a drink. Service was slow. Yo","useful":0,"cool":0},"TGDu4ljRB5fV8ZNXXscaAg":{"text":"Ambiance is nice. Our server was great.\nBut unfortunately... Food was a lil' slight of the","useful":0,"cool":0},"0E_MKjvaLQKwwYGzSoIodA":{"text":"Very eclectic menu with pairings of flavors that you wouldn't normally see. Of course they","useful":1,"cool":1},"SQArVMPcloFORlMrAiXWQg":{"text":"This is a cool space and I am sure a great place for lunch or dinner, but I can't recommen","useful":0,"cool":0},"mxjTEHEiROJAXdQWtgZRpw":{"text":"I was surprised that after several days of dining at some of the \"best\" I.e. most famous r","useful":0,"cool":0},"DVjokdYXrYNx00bqjea3iA":{"text":"This was my first time here. My mother was enthusing about SoBou ever since she went with ","useful":1,"cool":3},"44S-u6DcveVIM7WL9INM-w":{"text":"Nice place for a gathering with your buds for dinner and drinks.  The coolest thing about ","useful":1,"cool":1},"1nH747V3z-KJhfg3cMRGPQ":{"text":"Came here for my birthday dinner. Everything was delicious. And their customer service was","useful":0,"cool":0},"3kjl1LE6ugj4NPYvGVvZQQ":{"text":"Dropped by here for a snack before joining a tour. It happened to be happy hour so I order","useful":1,"cool":0},"e0AZ4PXdSEE02qsBoUDbKw":{"text":"Came here for Happy Hour specials and also for lunch and 25cent martinis! \n\nHappy Hour Spe","useful":0,"cool":0},"mXFkMjaNc3p95p8JtDRN9A":{"text":"Sobu came highly recommended by a local. Although the food was good, I could only give it ","useful":0,"cool":0},"X5ZHGz3tjG67ve15OWkUSA":{"text":"Fabulous food and unique atmosphere. The food is mouth watering and adventurous! I would r","useful":0,"cool":0},"qvBe_PMlrV5xkcUL1yNITw":{"text":"Really upset with the fact that the menu on yelp, the menu on their website, and the menu ","useful":1,"cool":0},"C_c5_qz_TbtCmDZa1G5i_w":{"text":"When we arrived it was a really nice setting. Very warm, inviting and romantic if you will","useful":0,"cool":0},"6CljFd5GEhN3_O0Onl6Lvg":{"text":"Excellent service and attention to detail, this little gem in the French Quarter should no","useful":0,"cool":0},"DVa5qdAUoZlMYe8kAbkw6g":{"text":"No reservation no problem! Restaurant was only filled with 6 patrons all sitting at the ba","useful":1,"cool":1},"CvCahIgbJfnnU9Ozj0U37w":{"text":"We went in during dinner hour, saw a lot of empty tables so we thought we're good.  Howeve","useful":0,"cool":0},"h8Wn4LmcuJgwhMaKfBMc4Q":{"text":"I was wandering on my own in the Quarter during lunchtime and wanted to find a good local ","useful":1,"cool":1},"sMvzRNZAE8NXRgYzsPEjYw":{"text":"My friends took me to Sobou for something fun, new to them, but that also had some more cl","useful":0,"cool":0},"Czzn4JJfgKG1B0aIaIyQYw":{"text":"Great happy hour and appetizers. From best to really good:\n\n- sweet potato beignet\n- crisp","useful":0,"cool":0},"EA442VlkDA-soZlvwhyzzA":{"text":"Everything we had was great!  We ordered a variety of items.  Sweet potato beignets, crack","useful":0,"cool":0},"1EigKnkHocfzqmaEuzn1Yw":{"text":"SoBou has a Vegas-feel.  Polished interior with big design elements. Seems a bit out of pl","useful":0,"cool":0},"OR5Zr2yhw_x4ESeDtGJaVQ":{"text":"CC: gorgeous room & adventurous small bites. Not cheap but you can economize (e.g. $26 por","useful":0,"cool":0},"RGB5DEVj9qVRsXe7xw8qgQ":{"text":"I was incredibly impressed with SoBou before I even stepped foot in the restaurant. Planni","useful":0,"cool":0},"dDq8Z0x5o9BXuUHLHeY-hA":{"text":"This is the most disappointing meal we had while in New Orleans. It's very overrated. \n\nSe","useful":0,"cool":0},"vjrIY-Y4psbkByBbt8-a7A":{"text":"Truly fantastic food and a great ambiance. Ate at the bar, and the bartender was engaging ","useful":0,"cool":0},"vzqKKUVz4EpWLqzG_OPXiw":{"text":"Beautiful atmosphere and great service. The Happy Hours until 6pm are awesome... $4 cava, ","useful":0,"cool":0},"owkL-qQ1xLXNfzJx7Wv2qQ":{"text":"We came into South of Bourbon (SoBou) one late afternoon after hearing about their amazing","useful":0,"cool":0},"lpRU6C9VofiskFDwMtaugg":{"text":"The price fix three course with drink for $35 was the best value on the menu! Enjoyed EVER","useful":0,"cool":0},"ckckQ6UEcO754NfPdPAYAg":{"text":"Service on a Sunday morning was exceptionally slow. There were only 4 tables occupied (7 c","useful":0,"cool":0},"K_B7OtSJYHgcKR6P843QCA":{"text":"I didn't try much here, but what I tried, I liked. \n\nFirst off, their drinks are well made","useful":2,"cool":0},"aYdmJ_NsA0hQsVZo_yY1gA":{"text":"More of a 3.5. Lemon fish (Puppy drum) and Bananas Foster were delicious, but the pork ten","useful":0,"cool":0},"q1TTPONUGqJ0yuP3liVmLA":{"text":"Particularly underwhelming, considering the restaurant's ownership and relatively steep pr","useful":0,"cool":0},"ABc8wSEeeZ5Fke-06CQiAA":{"text":"Before heading down to New Orleans i of course did my research--Sobou popped up on a 'wher","useful":0,"cool":0},"ZrxJqz8wF4zoM4q-volCpQ":{"text":"I've been putting off eating here. I don't like the name and I could always hear techno pl","useful":2,"cool":1},"LhSBV_MIyyXxqwO-am94TA":{"text":"I'm a local that frequents restaurants multiple times a week. Living in New Orleans, there","useful":0,"cool":0},"ARXwYqzvjwE_OfH6_VVAIw":{"text":"Went ro SoBou twice one for lunch, six days later for dinner.  Was surprised that they hav","useful":3,"cool":1},"PL_THajGb4HaI5jZEYBsfA":{"text":"I came here as part of Dr Gumbo's cocktail tour.  They made the best brandy crusta ever.  ","useful":0,"cool":0},"XXPXx02BngV0lCRNutzVeQ":{"text":"I dragged two friends here with me to try the sweet potatoes beignets some of our friends ","useful":2,"cool":2},"5Q5n7jKoESu3nxxc9LxChw":{"text":"Really interesting place. The food was unique and tasted great. Great service as well.","useful":0,"cool":0},"Vb18uIhX9ehoWOdSD4-8wQ":{"text":"Bottles... bottles everywhere....This is a nice modern upscale restaurant and bar in a hot","useful":0,"cool":0},"UEbWH7TNS84YSF5kq7Uqhw":{"text":"So good. They have gluten free options too. Nice staff. Try the beignets. I'm a huge fan o","useful":0,"cool":0},"g7_biw4SdhW9yow7IYHatQ":{"text":"I can't recommend this place.  After all of the hub bub about this place...all I can say i","useful":0,"cool":0},"hLOW0_lFqdE3J8twoT25Hw":{"text":"This is a good example of funky Creole fusion. The service was great, and food exceptional","useful":0,"cool":0},"NqQAsG6tYueOb_znA-ylaQ":{"text":"We lucked out and were able to get a table walking in with a group of 10. Originally we wa","useful":1,"cool":1},"1OZ1hG4ooC-qXj4EmGXlhQ":{"text":"Went here the other night with a friend. Awesome experience. The male host greater us with","useful":0,"cool":0},"eDJartPoUXZkobLS1aWMYQ":{"text":"WOWZA! It's amazing. My friends and I ordered several appetizers and shared. We weren't st","useful":1,"cool":1},"WT9SDKwm-yq6lBcAiJwy2A":{"text":"Enjoyed some small bites and wonderful cocktails here at this uniquely decorated spot. I w","useful":1,"cool":0},"qdzb7ePNQjSUy1kaBelbsg":{"text":"On NYE and NY, they serve only their holiday menu so we were a little bummed when we could","useful":3,"cool":2},"hOkGF6Z5cGy1iLbUc3q8pA":{"text":"Restaurant at the W New Orleans......looks pretty new and the decor is very nice. Service ","useful":1,"cool":0},"R65KKWS0rw1GNvGHBNyntQ":{"text":"If you are hungry and don't have money to burn, don't go here. I don't mind paying as long","useful":0,"cool":0},"iEsPl_iJPhlvV0HapHwIrw":{"text":"Good for day drinking or night drinking - as long as you're visiting NOLA, you should give","useful":1,"cool":1},"XealxdcWsLxCEZD2EwYMSg":{"text":"This place was probably the best restaurant I've been to so far in New Orleans that wasn't","useful":0,"cool":0},"WnsiGTVvA7tWAIKZNfK8fg":{"text":"The Oyster Taco... it's, like, the dream of a taco. Absolute perfection. And the Pumpkin a","useful":1,"cool":0},"QSnGqPn0MggtotaynCMfLg":{"text":"Drinks are good. Our group shares the small bites and everything was delicious. Great serv","useful":0,"cool":0},"k7arsAUOk-AZaOI2UZ3DTw":{"text":"Food was OK... server was terrible. Food took forever and we cancelled our last few course","useful":0,"cool":1},"L8uH-4D2_LgoWa10jwcwBg":{"text":"We stopped in here for a last snack and cocktail before heading to the airport. We sat at ","useful":0,"cool":0},"U94yC9CU9Uf7mGKQIIVdew":{"text":"Food was ok，a good place to hang out with friends，just not a place for hungry visitors. I ","useful":0,"cool":0},"QY6K-jnrykT4DEtulAD4Tw":{"text":"SoBou is a bit like walking into New York's East Village in the middle of New Orleans. It'","useful":0,"cool":0},"3f_ZsKfxWbg6ktQPAKFCZQ":{"text":"With an atmosphere of the stars and drinks to match, the food did well to keep up.  Boudin","useful":0,"cool":0},"nbs5AZq_7e03CUm0fHO7kQ":{"text":"Came here for lunch with my partner and another couple. The place looked great when we wal","useful":0,"cool":0},"eAtxa9tCbSvG16VK9P9zeA":{"text":"Tuna tartare in waffle cone:  Deliciously spicy chopped tuna, mango salsa/relish, a scoop ","useful":0,"cool":0},"NPzuqzQi0NCd3hrjZ7nXGw":{"text":"Not not NOT impressed. We were early and the hipster server was phoning it in at best. It ","useful":2,"cool":1},"F-PgPOCeVCugbyyd7nGQfA":{"text":"We were in New Orleans for a girls trip for Mardi Gras.  This was the best meal we had.  W","useful":0,"cool":0},"gVotUc_FHOvqu08iE0V3pw":{"text":"Wow! Came to SoBou for New Years' Eve which meant a special and more limited menu, but I a","useful":0,"cool":0},"zug7I53VNCsFtobtq3XSyA":{"text":"Very good cocktails and great appetizers. The \"yellowtail cone\" app was a pineapple cevich","useful":1,"cool":0},"sOUHHZJTrMEpJCRHP3MMFA":{"text":"After booking a somewhat last-minute holiday trip to NOLA, I was happy to get a Christmas ","useful":0,"cool":0},"OlawoqCluCtIXMjJhikOzw":{"text":"Favorite new restaurant in New Orleans. Great food, great drinks, good vibes. Such a cool ","useful":0,"cool":0},"VJIA0KdSGHcxSNcxeANKSA":{"text":"Small plates are the way to go here.  Try the sweet potato beignets, lamb, and the mini bu","useful":0,"cool":0},"FyK8B6j5lfOnrEi8oGhFgw":{"text":"It's kind of gone down... Food and quality are missing the mark. I'll always have my memor","useful":0,"cool":0},"uzYpw2lMoomXJJNPnY6JEA":{"text":"Do you every crave carnival food but wish it were a little more elegant?  If so, you shoul","useful":4,"cool":4},"fQZ1Ysfy198W69WwSiyKJw":{"text":"I'm from Atlanta and I thought that I was Southerners knew how to do brunch. I have been i","useful":2,"cool":2},"-4mBqyDxSOkjZ1gibaObrw":{"text":"This place was amazing. They are very well known for their drinks and appetizers. Thaddeus","useful":1,"cool":0},"LwAbIYSf7DKKdTKS9QQQJA":{"text":"A little loud at first, but the hostess promptly reseated us to a corner booth which was m","useful":1,"cool":1},"TXmj6su9TVAlAOMao7mleQ":{"text":"First meal in New Orleans and it definitely didn't disappoint. They were very accommodatin","useful":3,"cool":0},"uF1Zf75YP6K9-h0ceDcbSA":{"text":"YUMMMM Try anything on the menu and it will taste amazing .. Steak was Perfectly seasoned,","useful":0,"cool":0},"TWns2ztsrLAmCJ8d1W41lw":{"text":"It has a cool vibe and is related to Commander's Palace, which we unfortunately didn't get","useful":0,"cool":0},"uolFtym6rjkyxYVqhKyTCw":{"text":"Delicious - pear and pickled grape salad, blackened fish and risotto - enjoyed a creative ","useful":0,"cool":0},"tcPkXSRn8wBl7aycOniGRA":{"text":"I came here for a friend's bachelorette dinner. The food was great and the servings were t","useful":0,"cool":0},"Xs7PbNXddYeu13ewnVxvQQ":{"text":"Very modern and cute decor. We ordered a bunch of different items from the gumbo to the fo","useful":0,"cool":0},"PB6WqxwYH0RGsiF58eVUJQ":{"text":"We went for lunch around 1 pm and the restaurant was winding down with less than 3 tables.","useful":1,"cool":1},"lkhBky4YhQH-WKEDHeOWmQ":{"text":"On my first trip to SoBou, I was really disappointed. It wasn't bad, but it wasn't great.\n","useful":0,"cool":0},"aVjA6P9VcEaRm5xaAH4stQ":{"text":"So we went here because of the 25 cent martinis. They make you order from their food menus","useful":0,"cool":0},"Z1sA6qg8DaoPy-8M-Dt_yQ":{"text":"Went to Sobou for appetizers and drinks before our actual dinner reservation somewhere els","useful":1,"cool":0},"vN-RrPpoKrj7xra7cis4lA":{"text":"Delicious cocktails and friendly bartenders.\n\nHappy hour is the best time to stop in for a","useful":0,"cool":0},"QbpQJTUNpyoCcXkVs3e2ZQ":{"text":"I walked in and immediately was WOWd until I got to the host stand....The hostess was so r","useful":0,"cool":0},"L3ijErYkEua3k39DKTYB7A":{"text":"Large ceramic tuba cones protruding downward as if to either loudly proclaim great things,","useful":0,"cool":2},"lNryOtNpfUI1QS5h53saDw":{"text":"This place is a special addition to the amazing culinary tradition in NOLA. Food is though","useful":0,"cool":0},"4AQfhbMD30Ax34bfnBulXA":{"text":"WONDERFUL food and service. From top to bottom.\nAlex was knowledgeable, witty and smart. W","useful":0,"cool":0},"8faRbr4jo6ubX5Db5HgH0A":{"text":"If you enjoy a properly poured drink, this is a bar for you; it's a great bar. My friend a","useful":5,"cool":2},"Tf8QlYrVjSK4ZxZo0QFl1g":{"text":"A couple of girls and I came to the restaurant for drinks and some light fare. We ordered ","useful":0,"cool":0},"BeMLrYcz53bw31-2xD5ncg":{"text":"Amazing. Such a unique restaurant with great food and engaging waitstaff. I've told friend","useful":0,"cool":0},"sC261p1AqS4fB7G7r262eQ":{"text":"We did Sunday Coolinary brunch, the most expensive brunch of the participating coolinary b","useful":0,"cool":0},"ekkDuUGcFSoEngBtcr0lAA":{"text":"A great concept, the design and ambiance of the place is amazing. We ate the two salads wh","useful":0,"cool":0},"qGgCw4NXKfbolCTwPzKMJg":{"text":"Self serve wine dispensers, beer taps in the tables and a wide range of small plates and a","useful":0,"cool":0},"3Z1cu6_rPTpVC3T_NBtFlw":{"text":"Don't go here unless you would like to experience the following:\n\n1. Cocktails that are so","useful":1,"cool":0},"c7_AShO0ZVVWowPrm_Aitw":{"text":"Really WOW!  I'm generally not a fan of fussy food, but this place is spectacular and the ","useful":0,"cool":0},"0iBVeZPWHeglPoDUj3fx6g":{"text":"Food was excellent. (Chicken&watermelon,tamales) Monday-Friday 11:30am-3pm $25 cent martin","useful":0,"cool":0},"-LPxjengzPYKD_4am1-51g":{"text":"Tuna cones: overpriced and flavors didn't work well together. They are also very small. \n\n","useful":0,"cool":0},"Z3v1pIeghniVYeEMPqD6_Q":{"text":"I stopped in here on Thanksgiving Day with my parents and husband. We wanted a snack and a","useful":0,"cool":0},"LrASHiXMULiAtTjIIPyTWQ":{"text":"Ridiculously delicious.  Recommend squash soup, sweet potato beignet and the Cuban sandwic","useful":0,"cool":0},"s44ryxuH9WnD4GIEgviqBA":{"text":"They are trying to be to fancy.  Understanding their menu took google and questions.  If t","useful":0,"cool":0},"eRc6-iHPhCkBtVU0XK-bQQ":{"text":"I have only been to NOLA once, so I don't know much about all the local restaurants, but I","useful":0,"cool":0},"rKEW3g2WiXEyvS42RP4O1g":{"text":"Associated with Commanders palace.  A TREMENDOUS VALUE..  Service from Whitney was second ","useful":0,"cool":0},"KcSfKjBY0K_FTbgCCiIzXQ":{"text":"Laura B is the best bartender I've ever had. Her Irish coffee was to die for, and every ot","useful":0,"cool":0},"qBS8Lvq5y_bOcDUuwrsVvQ":{"text":"So disappointed with our meals, we're visiting from Calif. And try to find good food on ye","useful":0,"cool":0},"Vw8ZapkC7xNonifys_SvAg":{"text":"Ok - so my review goes like this:\n\nExcellent service from the bar area.  My wife and I cam","useful":1,"cool":0},"x_7MHnpkin4BYFMGfcADbg":{"text":"To start with, they make the best Sazerac I've ever had. Forget about the overpriced, over","useful":0,"cool":0},"OauzB_3PGfl1CtGDl6pLgg":{"text":"I made a reservation for a party of 12 during Mardi Gras weekend and we were seated immedi","useful":0,"cool":0},"CZrV9ryDjQvTPsxnp1YQNQ":{"text":"Interesting place to get drinks...great experience except for the bartender that took 25 m","useful":0,"cool":0},"9CwHiLLSa-91Oj9PUyo_Bw":{"text":"We went for lunch and the 25 cent martinis. The food was delicious and the martinis were a","useful":2,"cool":1},"k2yyCTgo3yzLt8-Y3k3TWA":{"text":"No food, just drinks.  The mixologists really know how to put drinks together.  They are t","useful":0,"cool":0},"1wl-8zDolT7WN0fei9VMOw":{"text":"Great breakfast! I had The Who Dat Breakfast with a side of grits. Ask for Joshua Williams","useful":1,"cool":0},"4K954VeBhV03C21vIOImQA":{"text":"It started really rough. No one gave us menus and took forever to get our drink orders. Wh","useful":0,"cool":0},"-MXViyuGmMJgbV7Bxb4jsQ":{"text":"I was not impressed with Sobou.  The atmosphere is nice, the legs and eggs concept is fun ","useful":0,"cool":0},"mhTosh4EMu0c5gv9qg9pqw":{"text":"This was a delicious contemporary twist on New Orleans staples.  We had the mashed red bea","useful":0,"cool":0},"oTLJRbvApKYHNqlwcebaxw":{"text":"This is a very hip, trendy restaurant in the French Quarter. And i don't think that's a go","useful":1,"cool":1},"p1t-89LXzSjiqgqIIs86Sw":{"text":"Cocktails were on point! House on the time was amazing! Foie gras burger was so good. The ","useful":0,"cool":0},"GoYtE_AQBTxoDjmlWcVxrw":{"text":"I made open table reservations thru yelp. It only gave me choice for 5:30 or 8:30. I chose","useful":3,"cool":2},"rPwo2joZfB2XrJSvQb0-1Q":{"text":"Love, love, love Sobou! I bring every out of town guest here and it never disappoints.\nThe","useful":3,"cool":4},"SfcnCTjhSxp5FPAQHXcxTQ":{"text":"This review is only for the bar area. The restaurant was fill but were told we could eat a","useful":0,"cool":0},"Jeqy94_HEYwMNK1iDb9H4Q":{"text":"My friend and I popped in here for a quick brunch before leaving New Orleans.  A lot of ot","useful":1,"cool":0},"64ZJhYdvzKlnT1IUO7rMzg":{"text":"I wasn't able to try too many food options as I was there as part of a tour group but this","useful":0,"cool":0},"fhEOzIh5pSQU0yQr9V_GZw":{"text":"We could not have picked a more perfect Christmas Eve dinner spot.\n\nWe went early to have ","useful":4,"cool":4},"X27KD85V4GAf7ij-mJV9ew":{"text":"Went here for dinner with friends. Not many people in restaurant, yet did not meet waiter ","useful":0,"cool":0},"9WyCvhIAlx6EyqcdyEdoMg":{"text":"Great brunch location! The Legs & Eggs burlesque show is super fun and unique. Food is rea","useful":0,"cool":0},"kvjaryaNkN0NU6WnbMg5Vg":{"text":"Awesome restaurant, the atmosphere and decor is super cool.  Food was fantastic - started ","useful":1,"cool":0},"amtimTkBV62P8eMoCgCULw":{"text":"One, they had lots of gluten free options for my husband and lots of options in general fo","useful":0,"cool":0},"XXo-rKQCtq54AKc2OqS4nA":{"text":"Sobou... the ambience itself got me. The lighting is low, the decor very contemporary. Som","useful":2,"cool":0},"D7QQ6UzvJ8o3bMXwceEuxQ":{"text":"Definitely top three restaurants we visited on a bachelorette party to New Orleans. The te","useful":0,"cool":0},"Cn5Qp5TO5W8cwi8qwD1FQQ":{"text":"As I try to stay away from hotel restaurants, this is one exception I made and was glad I ","useful":1,"cool":0},"H_40oW2LuFBiRDaXfKTuOA":{"text":"Brunch menu has meals with names I don't understand but when it all comes out on a plate, ","useful":0,"cool":0},"oa-ekf-ZAbKGShevFBoFaw":{"text":"Awesome food. Fish was extremely well prepared and very fresh. Sashimi with avocado mousse","useful":1,"cool":0},"CgoBZiLgwCn8Ai8V4g9t1w":{"text":"We really thought this place is excellent. Starting with the Tuna cones, a great mix of fl","useful":1,"cool":2},"6rn2iONLgcsYmg4aFyanxA":{"text":"We stopped by for lunch and was immediately impressed with the upscale decor with bottles ","useful":0,"cool":0},"TvKPE491gsqyrwee_TBqBg":{"text":"Veggie tacos are delicious! They're not on the menu, so if you're vegetarian make sure to ","useful":1,"cool":0},"4VE4qQSlMpHL6VVDOKCFMQ":{"text":"We were in NOLA for a couple of days and we like the look of this place. We tried to walk ","useful":0,"cool":0},"HQIxRScBMXscqffqCv1lOg":{"text":"Loved the place! The Parakeet Nordine ( both of them) was Delish! My husband and I shared ","useful":0,"cool":0},"iN5bODIoBOWukt5pG9YGtw":{"text":"Went to Sobou for dinner with my husband.  The entire experience was underwhelming.  We st","useful":0,"cool":0},"wNVmPSAARGtDu08zmz770w":{"text":"EVERYTIME I SIT AT THE BAR I MEET FUN AND INTERESTING PEOPLE....WE SHARE STORIES AND OPION","useful":0,"cool":0},"-DyhKHixwWfvV8vgpOuuLg":{"text":"So good. I had a tomato basil soup which I love. This one had a smokey after taste which I","useful":0,"cool":0},"pahSDA5lH5GxJwUNRZEr2Q":{"text":"So, so good. We were visiting NOLA from NYC for a week, and had to stop here twice. Once f","useful":1,"cool":1},"9vhloWhgjtSRYJiqpHY0Xg":{"text":"Went here for lunch during a conference taking place downtown. I've been wanting to try So","useful":1,"cool":1},"fZsdP0tx3vhPxMdHT4cJPQ":{"text":"Came here for lunch and had a good time. Me and my girl got a lunch combo and tried variou","useful":0,"cool":0},"eC0_edZqWZ_UlVJStMNmHA":{"text":"Great service, very interesting food (and tasty!) food and pretty cool crowd. Bartender wa","useful":0,"cool":0},"JsfXJiLbc6P7HEEfB8ajYg":{"text":"We came here for happy hour. SoBou is a really trendy joint. It's upscale but the vibe is ","useful":0,"cool":1},"bN8Z8hKah83ieZVX-dPO3g":{"text":"Service was Ok. I was unimpressed with the Tuna tartar cones. Overall a good experience bu","useful":1,"cool":0},"laWy9_zh6ViHPxwvKhm2Kg":{"text":"We had lunch here on a Tuesday, and enjoyed it thoroughly. Cocktails: awesome. Staff: frie","useful":0,"cool":0},"HBxed-mitOioMr1VPOfKVg":{"text":"My husband and I came here with two other friends and our son. The decor was cute and serv","useful":1,"cool":1},"qBFq2RZAfKib_ZaqaDiADw":{"text":"We were fortunate to stumble into this place on Sunday before six to enjoy happy hour and ","useful":1,"cool":1},"gObAe7uB5vZWGu__f0aJEA":{"text":"The only really good thing about this place was that the interior looked cool. The 1$ pork","useful":0,"cool":0},"yLIhY9hyU7059-6DgzO0zQ":{"text":"This place was so delicious. I had the tuna escabeche and the soup du hour, a lobster and ","useful":0,"cool":0},"EbCXvpqHDMuPewWwyb0fFg":{"text":"Great place to grab a cocktail away from Bourbon Street. Bartenders are very knowledgeable","useful":1,"cool":0},"aGuVW2U27py9E6aBpL80Eg":{"text":"This place was pretty cool. Our favorite was the avocado tuna ice cream. It was very inter","useful":0,"cool":0},"rl2jJQwgvh4tXGwlTb0mgA":{"text":"Great smashed potato gumbo, the blacken red fish was superb with a nice and subtle kick.","useful":0,"cool":0},"_A8sGcKbHHyQbTFeREji-w":{"text":"Had an absolutely perfect dinner at Sobou last night.  Tried several small plates... Kale ","useful":0,"cool":0},"skQWKY7GaZy66dxbBPeUBA":{"text":"Friday night dinner in the French Quarter?  Better make reservations!\n\nSince we didn't, we","useful":0,"cool":0},"i0hTALf0_icB57AYRkAJ4A":{"text":"Their gumbo is one of the best foods that I've ever ate.  The decor is very interesting.  ","useful":0,"cool":0},"ltbhFyaoW5QPxMwVntCnTQ":{"text":"While I enjoyed my meal at SoBou, I feel like I would have enjoyed it a lot more if I hadn","useful":3,"cool":1},"Owu-Tw_b7vVQ2aUBeN9kpA":{"text":"Great food, atrociously bad service!  I would give the food 5 stars and the service 0 star","useful":0,"cool":0},"AcWIkZRLqVZAJD91YXBH6g":{"text":"This is a very interesting place and in a good way. The atmosphere is close to modern indu","useful":0,"cool":0},"pfb7TJHG2e5OyhVDXKeseg":{"text":"Huz says that SoBou Sazerac is the best drink with alcohol he's ever had, and the homemade","useful":0,"cool":0},"enhzsd6ivmnSqp4A7tj29Q":{"text":"Gumbo was out of a can.  Way too salty, no instance, more of a sauce than a soup.  Tamale ","useful":0,"cool":0},"_NqDZyHqHTspUDbu_OpTTA":{"text":"I was going through give them 3 stars but after I looked up our very average bottle of win","useful":0,"cool":0},"Ev35Lz5a82r96kGQhVXqZw":{"text":"I came here to try the foie gras burger and crispy chicken on bone but they didn't have th","useful":0,"cool":1},"H2VB8aAhFYrHmpUDVANm8g":{"text":"This is one of the best restaurants I have ever been to!   I love their small plates part ","useful":1,"cool":0},"Ka02D-toLeRtQiGLF_9HtA":{"text":"Beautiful cajun flavor without all of the typical over-fried over-greased stuff.  So DELIC","useful":0,"cool":0},"MuSxBCxAFJX2u7YZqoMmeA":{"text":"Extremely pleasant atmosphere! Everything we had was delicious. I especially LOVED the gre","useful":0,"cool":0},"RMN53WhzylPSbDvDEd0Ssg":{"text":"Love love love!!\n\nCame here for lunch on Friday with my bachelorette party. To our surpris","useful":0,"cool":0},"5AyQ3b2pokNex31mTo6x1g":{"text":"Came in on a whim for appetizers and desserts with my wife during happy hour. This place w","useful":0,"cool":0},"fpRIZ3laqTRIL-jlhocqDw":{"text":"Best place we went to in New Orleans!\n\nWent to have a good time and eat good food and our ","useful":0,"cool":0},"_Wo7g9YViwJDzhRtotZkpQ":{"text":"I came here around 5 pm with a friend and we were seated right away. The ambience is prett","useful":1,"cool":1},"9TvVd3cHmEatE-yt1kQWDw":{"text":"An AWESOME MEAL WAS HAD! I loved that this place has small plates which is great for shari","useful":1,"cool":0},"U7UFqZkYyPnCjpQwBX0mrg":{"text":"An ethereal contemporary atmosphere, make sure to stroll around and visit each seperate ro","useful":0,"cool":1},"w3wcqfz9g1Zw8Da1CmHvYg":{"text":"I have always walked by Sobou and been captivated by the lit bottle decor. I happened to h","useful":1,"cool":1},"u08dAqipqd2Kl5pd-XzTlw":{"text":"I love tapas! Best thing about tapas, you can order as many things as you want on the menu","useful":0,"cool":0},"eBAGWAQqY426YT-g34QAww":{"text":"Chic with taps at every third table? Trying to be a couple different things and it works. ","useful":0,"cool":0},"CoUcz_Nv-LJqi9fEyJV9zQ":{"text":"Sexy atmosphere, great for date nights.\nDinner and drinks were delicious and brought out q","useful":0,"cool":0},"QJjb2pA1OQYWVnJ65ynstg":{"text":"Just had an amazing close to a brilliant stay in Nola.  The food here is outstanding. But ","useful":0,"cool":0},"xn4Dy3co5HsKorC-epuuaw":{"text":"Very good, but not great and some hit-and-miss, food in cutting edge decor.  I absolutely ","useful":1,"cool":0},"eqcxWm1dztVdueMvuGBQBw":{"text":"The interior decor is amazing. So classy and fancy with glass jars on shelves. We went to ","useful":2,"cool":0},"S2KRFkxjTW1alWAdap5dig":{"text":"Great experience at the W hotel. We had the pork. The service was great and the food was g","useful":0,"cool":0},"i212HNmgdgz9u5h7Q99nkQ":{"text":"The food was very good. Had a hurricane and it was very good. If the title of the food sou","useful":0,"cool":0},"ou4hc0vhWQM8Lx4NXCqhJw":{"text":"Amazing food and service.  Let batetnder oder for me, her picks; oyster taco and a pork be","useful":1,"cool":1},"GRoavLI2ugzLTsYtOVs9-g":{"text":"Went during \"coolinary week\" and got great deal on a 3-course meal. The place has a cool a","useful":0,"cool":0},"yc1-PjNpdkgkJqRMM5HX0g":{"text":"5 stars for the cocktail alone!  The Waiting Room is the best cocktail I have ever had!  D","useful":0,"cool":0},"H3fg4fEFQB6PCCJw1hMyNQ":{"text":"The food here is as outstanding as their cocktails. May very well have true all of the app","useful":0,"cool":0},"Bar1esveFLrFjLSGg8sHsA":{"text":"Add an amazing dinner and evening at Sobu last night. Your waitress Shelby made great reco","useful":0,"cool":0},"GOZo_QMMcAy1BdnvHkmfgA":{"text":"Unique tapas French Quarter offering was a mid day retreat.  The manager on duty doubled a","useful":1,"cool":0},"Is0-B4W9llYORrO2RDWMmA":{"text":"Super basic, over priced food. You walk in and it's all hip and trendy but the food is med","useful":1,"cool":2},"mFi8Y9I0_4vrFvt0XdlyxA":{"text":"Don't leave without trying the following:\n\n1. Strawberry cobblers\n2. Foie Gras Burger\n3. B","useful":7,"cool":3},"W7jTEA8Abgeg3KpG0IoKtQ":{"text":"Eh.  Not sure what the hype is about.  Nice atmosphere and good food presentation, but the","useful":1,"cool":1},"5wGBl5sEaj5McMADlEyvgQ":{"text":"Came here for happy hour on Tuesday around 4 PM. Waited 40 minutes at our tablejust to get","useful":0,"cool":0},"96uxOCU_CGs6jIOjPLu0Eg":{"text":"Nice and classy. Great ambience and good location. Reasonably priced for the kind of resta","useful":0,"cool":0},"lP4Kcm7vHsopvta3JY9aUA":{"text":"Went here really late for drinks and desert.  I'd love to check it out for lunch or happy ","useful":0,"cool":0},"8Ew42kt6-DrX7ELZzTL7Iw":{"text":"Amazing food..\n\n\nHIGHLY recommend yellowfin tuna comes, beignets, baudin balls...\n\nFor ent","useful":0,"cool":0},"8I1MXvlOmZJFS_-OoNjmlA":{"text":"Wow. If I could sum it up in one word it would be that. I went to dinner with a group and ","useful":0,"cool":0},"cBX58fZFbGK7chUJ9pMuDQ":{"text":"SoBou is a very nicely decorated establishment. I think that's what draws a lot of people ","useful":0,"cool":0},"6d-wD_08zY7XhASWamOELw":{"text":"Yikes! The striking decor and good reviews drew me in for lunch. Then: incredibly slow, in","useful":1,"cool":0},"S8B-6yrZneSljdpPClilwg":{"text":"I would like to first off by saying I normally don't write reviews but after my experience","useful":0,"cool":0},"yayivHqjxHyQgCXBGnpbKQ":{"text":"Stopped into Sobou on my Old Fashion tour of the French Quarter. Watching my bartender cho","useful":0,"cool":0},"EqPE8Ki84lf1eYwgFIfp1A":{"text":"Whew great strawberry salad. Tamale. Soup. Biscuit. This is an excellent. Go for happy hou","useful":0,"cool":0},"z2suBM3xhJN87MbEOgcqTA":{"text":"This was the perfect \"first night in New Orleans\" dinner. The restaurant is super unique, ","useful":1,"cool":0},"bpnknEuyjQbA-zhaLpVzNg":{"text":"When it comes to a restaurant, this place has it all. Top notch service, various rooms to ","useful":2,"cool":0},"BPvSQzp3ZKupyeWmN_a2Yg":{"text":"Great drinks, friendly staff and a fantastic gumbo. What more can you ask for? Ambience gr","useful":0,"cool":0},"Z3BAQSSrIEqgKhfm6nJ2ng":{"text":"I tried Sobou while attending a food conference in the area based on the Yelp Reviews.  Th","useful":0,"cool":0},"Qqq2TEKmzLgd26scUgtBAg":{"text":"One, I'm starting this review while eating and partially blitzed because 25 cent martinis ","useful":0,"cool":0},"EtxiFmklGmoP32hq-e_RRA":{"text":"There is a bartender here who thinks she is in Pitch Perfect or the next contestant on Ame","useful":3,"cool":1},"ilVo5sVSUI1M0JNnpgItDA":{"text":"A few girls and I were here for a bachelorette party, and we all agreed that we enjoy tryi","useful":0,"cool":0},"cUH2HGjdQAQHGwpdLVbKEQ":{"text":"SoBou is awesome as were their bartenders Michael and Laura. Very entertaining, friendly a","useful":0,"cool":0},"JY04EZk4Xf-sOTQW85mCQw":{"text":"Amazing, creative New Orleans food with a New American flare as well as a Caribbean touch.","useful":0,"cool":0},"Po3pSqG8GgyJRWrjscsoBQ":{"text":"Best small plates. We had the yellowfin tuna cones, shrimp and tasso pinchos, sweet potato","useful":0,"cool":0},"VuTadZYtDUFUaOCF41wzgw":{"text":"This was one of my top 10 confusing restaurants experiences! The food was great - complime","useful":3,"cool":0},"mXJ_H_88-cw1I3r34_eCvg":{"text":"I'm picking up what Sobou is putting down. My favorites were the gumbo with potato salad, ","useful":2,"cool":1},"qusoPfse4FP3r-wGqz1AEA":{"text":"Amazing craft cocktails.  Decor is dimly lit and very chic.  Bartenders are friendly, atte","useful":7,"cool":7},"qOonidD-Jm7yfoDmzJh2qQ":{"text":"Upon check-in at the W French Quarter,  I selected the points as my Platinum amenity, but ","useful":1,"cool":0},"H_z0BKWtiiQXUHwO0gHakA":{"text":"We had the strangest meal here. The crawfish bisque tasted like it had been burning in the","useful":1,"cool":0},"zeniurIN43Wk1FKzMagu5w":{"text":"Nice room and very talented mixologists behind bar. Stopped in for a drink and appetizer a","useful":1,"cool":0},"EFz1bQBFmSA3M4SHYxa5oA":{"text":"Really nice ambiance with great drinks but they seemed short staffed so the service left m","useful":0,"cool":0},"Hx6ZmNP7CHQ-l4qOnmB6_A":{"text":"Expect great flavor! I had these tuna cones to start, super creative and tasty. shrimp sal","useful":0,"cool":0},"U2cHyvwGfpAyegwC9XP2Ow":{"text":"The food was okay, but the drink selection was large and impressive. Our large party ate t","useful":0,"cool":0},"D3lW2F3O2eU-TxkMJM5eUA":{"text":"It is not as good as the hype. Lunch and breakfast here as it is attached to the hotel we ","useful":0,"cool":0},"s95r5CkSirgk62Rea1kcBw":{"text":"The sweet potato beignet was to die for and the sweet potato beignet is delicious. The sta","useful":0,"cool":0},"3HDRnWalMbbQzqVUUb4j9w":{"text":"We had a really enjoyable dinner at SoBou last night. The place is quite stylish and conte","useful":1,"cool":1},"_950Qb4uFRGu_aXnRqG5yQ":{"text":"Would eat here again and again. The food was amazingly delectable! The yellowtail cones we","useful":0,"cool":0},"2tiQ_PMI_TZZyPBGpX4ACA":{"text":"The cocktails are amazing! I especially enjoyed the one with elderflower (can't remember t","useful":2,"cool":1},"SsUYGK6ZVCc-hFZF7h20-A":{"text":"Yummy !  Had the Blue Crab Mousse in a jar ,small but Delicious . The yellow fin Tuna cone","useful":0,"cool":0},"XLIDO6gTzrpr2X2JLeM3hQ":{"text":"One of the best places I've gone to in NOLA. Everything is delicious and interesting, the ","useful":0,"cool":0},"pDLk6TS4Q0BkaCW353kqGQ":{"text":"We popped in on an afternoon and was thrilled to find happy hour deals. The decor in the p","useful":0,"cool":0},"Qyv2PHyjsnUlm8Nje1WLXQ":{"text":"Came here with a group last night. Service was extremely slow. I ordered the short rib whi","useful":0,"cool":0},"PKQ3T6HJkdEqHVbtSoOA2A":{"text":"This was a rather odd lunch experience.  Had a reservation for lunch which I guess was tot","useful":2,"cool":1},"gDC4TrifNz6-1JuixdnmgQ":{"text":"Amazing atmosphere, but terrible food and service.  I ordered a mushroom pasta and it was ","useful":0,"cool":0},"Yg2Sn6F1igrLyOrGJrmj6w":{"text":"Super foodie must-see! Had the sweet potatoe beignets- sweet but not too sweet. So good. A","useful":1,"cool":0},"1b0S55dCj7Xy__dTe0QBzw":{"text":"We freaking love the crispy oyster taco here, they are so delish~  Also love the wine card","useful":0,"cool":0},"YV6f7GKPVxKysDB4HdyUVg":{"text":"This place is great. Delicious food. But the waiter was fantastic. Alex was possibly the b","useful":0,"cool":0},"ez9kIMMSL5UGKY6Lc-wPqw":{"text":"I love everything about this place. From the creative name to the lunch with 25 cent marti","useful":1,"cool":0},"5Ld6z7tqiXWMOapUmEw2qQ":{"text":"Sobou was awesome. I had the gumbo and sausages. Service was up to standards. Will be back","useful":0,"cool":0},"UlrqxLPuN-Wv9KqimaRPaA":{"text":"Very nice service. But the food is ... just so so....The tuna cones are yummy. 8 dollars f","useful":0,"cool":0},"053x1VYGs0ClNiOQ4U_G6w":{"text":"A very good, original take on gumbo BUT the wait for the food was indefensible. \nAs the re","useful":0,"cool":0},"mIkhwbv0vz7LnbpISn4Wgg":{"text":"Ate here for dinner on a Tuesday. Ambience is good, a little modern, quiet and my wife lik","useful":0,"cool":0},"kx86cvcwCr2c0s0Jh52Q1Q":{"text":"Such a cool environment. Love the glass bottles bottom lit across the walls! Cheeseburger ","useful":1,"cool":0},"geKRZScpQtKaAbTE4LkQqA":{"text":"Friday night and the place was less than half full.  Temp inside was 64 or so.   All the s","useful":0,"cool":0},"jR6SrkCJSDpTxoZZ37DnyQ":{"text":"Mmmmm. If you're looking for New Orleans food with a dash of modern flair, this is your pl","useful":0,"cool":0},"d4vAJgoijnKsSuf4NmPrQQ":{"text":"I planned my sister's bachelorette dinner here for a big group. Everything was perfect. I ","useful":1,"cool":1},"utDyCvM862Qwxz3Ikb_cdA":{"text":"Just did So Bou, this afternoon for lunch, with some reservations reading earlier reviews ","useful":1,"cool":1},"YUV8MpSCON-WSbQo3_tl2A":{"text":"I went to this restaurant with high hopes and left kinda disappointed. I went there for lu","useful":1,"cool":0},"iP2_xz9FwKzBhzn6o_pqtQ":{"text":"SoBou produced decent tasting food. I felt it lacked in options especially for this with d","useful":0,"cool":0},"a189Y6hOmn2YnRx3HbYMMA":{"text":"If I have a restaurant to recommend to someone coming to New Orleans this would be it. The","useful":0,"cool":0},"IzrSwjJ1AYylhi4EY_3S1g":{"text":"nice location. Quiet Inside in the late evening dinner dining hour. \nThe bar made us great","useful":0,"cool":0},"1dbshrSw8M6QZ5rg-vDJjw":{"text":"Beautiful decor and tasty food. I'm from the Deep South (Alabama) and am critical of south","useful":0,"cool":0},"w_hOkbAOEfG68YHPgasjmQ":{"text":"$6 sazeracs during happy hour - nice!  The punch was also delicious.  Friendly bartenders ","useful":1,"cool":0},"ceN2uHRZVxX8HCo8IBZLpg":{"text":"Top notch!!  Had the lunch shrimp salad and was fabulous.  Had loads of red pepper so may ","useful":0,"cool":0},"f-e0IQn4OGjwJ-kVmIKadw":{"text":"This is a great new-ish place in the Quarter, not to be missed. Creative, YUMMY food and f","useful":0,"cool":0},"HtTGNbSW6GkuRolWN8JZSw":{"text":"Because every once in a while I like to pretend like I'm a baller, you know a shot caller,","useful":9,"cool":6},"ByXsqILkutX5Pg8z4aOAyw":{"text":"Amazing happy hour! You must go! Enjoy the chicken in bone and the pork tacos with their p","useful":0,"cool":0},"dxtJgIB8g59MOalSwbrUFQ":{"text":"Jared is awesome! Literally the best old fashioned I've had in years! Great service, slain","useful":0,"cool":0},"71dmoXeYFfIvhbLjC5Q_RA":{"text":"This was the best meal I have had in the French Quarter and for that matter anywhere since","useful":1,"cool":0},"0qEZ6jCO-v5AUO_1zrrOcg":{"text":"The wait was very long and the portions were small but the food was very tasty. I ordered ","useful":1,"cool":0},"Q66Q63pVckesmMOlrrBtzw":{"text":"The service was great.  The ambience was amazing.  They even have tableside draft beers fo","useful":0,"cool":0},"9jgXKs8J5aEtWlUE18u1qw":{"text":"I think I really go here for the bottles all over the walls.  I just love the decor.  The ","useful":0,"cool":0},"gKueENZROjbkU8_LFAqrPw":{"text":"Food okay, service indistinguishable. I did not feel valued, like I do at the Starwood pro","useful":0,"cool":0},"X0wfp1MRZ14QceKNbsqjfw":{"text":"Yes, it was Friday night around 7pm and I was by myself. This was the only restaurant that","useful":1,"cool":0},"MLYBQ83cPrz8Vix1eIOmog":{"text":"Jared and Jeb were awesome bartenders! They kept us laughing and enjoying ourselves the en","useful":1,"cool":0},"OR1vxtfAZqO6557xw5g9-Q":{"text":"Stumbled on this place with some coworkers and we were really glad we found it. From the m","useful":0,"cool":0},"F7Y_jMm2WB4_YJ-Vbkjy0Q":{"text":"Let me just start off by saying FREE PARKING AT THE W (next door) if you eat here because ","useful":1,"cool":0},"SFqmh-p5L7iTp9YOX3ej4A":{"text":"Amazing fresh craft bar!  Tell the bartender what you like and they'll make something spec","useful":0,"cool":0},"LC3aM0KvjIAJTeLomh-1lw":{"text":"As a complete dining experience, SoBou was definitely the highlight meal of our trip. \n\nTh","useful":0,"cool":0},"U6OH9wYEQkgMSh_x3HSPxg":{"text":"My friends and I had a wonderful birthday dinner experience. Abigail, 2014's bartender of ","useful":0,"cool":0},"wnelJDl1f1kdrVNiXoy4eQ":{"text":"Hmmmm... all the dishes perhaps with the exception of 1-2 had something off about it (and ","useful":7,"cool":6},"xwnpygNDiP_orqbfLNwWFw":{"text":"This new restaurant just opened about a week ago so I came to check it out.  I was expecti","useful":5,"cool":2},"uiqax-uJMUqcfBGPlYGIGg":{"text":"Worst meal and service I've experienced at a New Orleans restaurant. From reading reviews,","useful":0,"cool":0},"28IqhPczrp-LjfjhbTFLZA":{"text":"Located in the W hotel, but not your typical hotel restaurant.  Only ate here for breakfas","useful":0,"cool":0},"Tz_rGj_Zemq3Wbyjssa4PA":{"text":"My husband and I went in for dinner to go while on vacation.  We had a couple of drinks de","useful":0,"cool":0},"PjCYw7SGsuJM9HKWe5qhDw":{"text":"We had a fantastic dinner here and would highly recommend the family style whole fish. The","useful":0,"cool":0},"zROKrebfL6E3etyvympd7Q":{"text":"We had a nice dining experience in New Orlean's French Quarter tonight.  Service was very ","useful":0,"cool":0},"31nxE93FW7fTrWrdhcX1zQ":{"text":"We had dinner reservations here for 8, arrived and were quickly seated. Definitely an upsc","useful":0,"cool":0},"kKvocg5lYr9l_WUeC2e43w":{"text":"Sobou is Sobad. You would need at least three strong 25 cent drinks to find the food prepa","useful":0,"cool":0},"cYuzJ-YtW4P8qig-t12VCg":{"text":"I love this place! My boyfriend and I came here after King Fish was fully booked. Clearly,","useful":0,"cool":0},"xqWqm6M7lobxcHAcvXVy3g":{"text":"Would have been 5 stars had waitstaff been a bit more attentive. Our waitress was busing t","useful":0,"cool":0},"rybk3o-G_BK-UnDrtY61WA":{"text":"This place is truly a New Orleans gem! Appropriate as its sister restaurant is the legenda","useful":0,"cool":0},"OeoTDiGAnGHRZdk4U8-pRw":{"text":"Friends and I chose this place for dinner/ drinks purely because of the cool bottle displa","useful":2,"cool":1},"0ST6fX-pPIEpSPeZsM9zKg":{"text":"This is a really great spot! I wanted to try even more than we could on the menu. They ser","useful":0,"cool":0},"RRBOrDNOCEBtRGPlUYuvZQ":{"text":"Michellin quality food. We especially enjoyed the sweet potato beignets with foie gras, an","useful":0,"cool":0},"KTVmVB5ASgeEvlZyZTG_Eg":{"text":"We came here on a Sunday night for dinner at 6pm. The restaurant was completely empty and ","useful":7,"cool":2},"lo5ztqsGyyJ3t1TRiiP2Yg":{"text":"Great comfort food with a modern twist and elegant presentation. Amazing food and amazing ","useful":0,"cool":0},"X-r0Z3GevzRktn1ka49cCQ":{"text":"Complete joke, first 3 entrees I ordered where not \navailable. Settled for a fish dinner t","useful":0,"cool":0},"PMo5VRGxrnUfi-JZ_SH2rg":{"text":"Meh... I really wanted to like SoBou for their Legs and Eggs Burlesque Brunch and their me","useful":0,"cool":0},"vjpEXcSGv_4spRcXY10ZSg":{"text":"I was impressed with this restaurant. I have had breakfast there the past four days with s","useful":0,"cool":0},"NRpepYy7mLKnv0iXsgzV9A":{"text":"Great place for dinner family style with smells bites, regular entrees and \"family\" style.","useful":0,"cool":0},"XETAclqS2Zash2FIQriLxg":{"text":"This place is amazing! Really cool atmosphere, incredibly friendly and helpful staff, deli","useful":1,"cool":0},"bfcm3KMwTFWc5yw7ozLEvA":{"text":"We visited the gastro-pub / cajun-saloon SoBou Friday night. The space is amazing, it does","useful":0,"cool":0},"NDXNfCLcu9iu4BA5V_425g":{"text":"One of my favourites! It's cosy, service is impeccable and so are the food and drinks. Plu","useful":0,"cool":0},"JZ-d4gyo6boq7vwCOSSc_w":{"text":"If I was reviewing JUST the bar, I would give SoBou 4 or 5 stars. The cocktails were extre","useful":2,"cool":0},"mBbMnoSLAq8wUkUObf1OtQ":{"text":"I will add a disclaimer: part of me wanted to love it (opened by Commander's) and part of ","useful":2,"cool":0},"Ig1U7R5jZuJwibrK1HB-lg":{"text":"I didn't eat here but everything smelled delicious and the cocktails were amazing. The atm","useful":1,"cool":0},"nRbDr95Lb4n1d-WsG2QCBA":{"text":"I wanted to love SoBou after seeing so many friends and Yelp-ers loving it, but to me it w","useful":0,"cool":0},"aePlrtAloWPNjn6MWMv8ig":{"text":"New Orleans, lets just say New Orleans is an interesting town, and by that statement, Sobo","useful":2,"cool":1},"6VLibZAfn4ubRzhyg2_4bA":{"text":"900 on a busy Wednesday night.  Good food, but tiny.  Service was pleasant, but a little o","useful":0,"cool":0},"DEkrqM-Ka5xvvZIVsr6Zzg":{"text":"I visited this place a year ago and can still taste the goodness. Oyster taco - mind you, ","useful":0,"cool":0},"_IFNEJBzcy4n0xG_LHBogw":{"text":"Came here last night for dinner. Good attempts at creativity on the menu but they missed t","useful":0,"cool":0},"SKX4WqNbHlAczpnBdBrgCA":{"text":"My wife and I love this place!!  We first  went here on  Dr Gumbos food tour and loved the","useful":0,"cool":0},"nN8F3r6EOOEhh61NnU8H7A":{"text":"Our waitress, Brandy, was amazing. So helpful and nice. Great cocktails, I would go back j","useful":0,"cool":0},"7aZR6ga5epGjKAekQrvRIA":{"text":"This review only applies to the bar. SoBou is in the W hotel of the French Quarter. Get of","useful":0,"cool":0},"9fc4prNueAnDbwccYtT9jQ":{"text":"Wonderful way to start our 3 days in New Orleans!  On somewhat restricted calorie regimen.","useful":0,"cool":0},"54jsElHXcIUqQtRcyZh4FA":{"text":"Gulf Fish for brunch... didn't seem to get a lot for our money. Was a pretty cool atmosphe","useful":0,"cool":0},"VbNHFtW2rJtww5YNVO92Rg":{"text":"I would recommend going here only if you do not care about customer service at all. The ho","useful":0,"cool":0},"2sgozY8He2C0MsAHezB3Vg":{"text":"Sobou is a great new addition to the fq! It has a younger, modern vibe which is at times h","useful":0,"cool":0},"-usRs3xpmx4Mo2bsEvjtmA":{"text":"We stopped in for a few smaller bites for dinner (since our lunches on this trip have been","useful":0,"cool":0},"FueGbQmt2vVdGm7m8LiTyw":{"text":"So it's always a hit or miss this place its either bad service good food for good service ","useful":0,"cool":0},"6EsMzfR_8zaR8XmOwHUYhA":{"text":"Amazing food! Great service! If you go ask for the baby chicken leg. It's not called that ","useful":0,"cool":0},"8uDT-VffAnjHdCwFTXY94A":{"text":"Surprised at the poor food and service. Ordered \"The Fries \" and they came out cold. The G","useful":0,"cool":1},"xoQhin5maxjDlT10iLNsqA":{"text":"Two words.... Happy. Hour. \n\n\n\nThis place has a wicked good happy hour! The bartenders wer","useful":4,"cool":3},"HQ7RFNtcrJNG-OtKg_X1AA":{"text":"I found this restaurant on my hunt for  foie gras.  It is banned in California, so my miss","useful":0,"cool":0},"TRXGa1PDwc7Q_QLHWNO78g":{"text":"Went to New Orleans for a bachelor party with 10 guys.  We got a reservation at SoBou on t","useful":0,"cool":0},"evZgWLJDCKK1RN8fa7ZbIw":{"text":"One of the worse restaurant to go. The food are mediocre and service cold. The drinks are ","useful":0,"cool":0},"Vgx3tnc0NMgpKIYLC6pEEg":{"text":"Great ambiance, great service, and good food!!! If you are a beer drinking definitely get ","useful":0,"cool":0},"q3UfBOTtI4S351EnZGzhaA":{"text":"The geaux fish is simply superb. The flavors and spices are perfect. The fish with the ris","useful":0,"cool":0},"MvvKhRzhrNFH_vvpoKAFGQ":{"text":"Ok... We did bites but def best bites!  The confit Brussels Sprouts were delish, lake sala","useful":0,"cool":0},"CnE3-6As-p2TLP6Nxyuknw":{"text":"We chose this place because some of our historic choices were closed - unbeknownst to us -","useful":0,"cool":0},"5ehIl4EGLwPZgrJLue6BWw":{"text":"We ate here twice while in town. Our first night we had dinner here on a Thursday. They we","useful":1,"cool":1},"1HUws34b5on7aJcai0FsUQ":{"text":"Terrible and booooorgoisesheeee. Foie Gras ? Man that's a plate of cruelty and I won't pay","useful":1,"cool":0},"j1ZVBwUQyRp9eh83m-MfIg":{"text":"I have only hung out at the bar....many times.  Though I don't think the drinks taste that","useful":0,"cool":0},"MgyIssAQ8v1gJasxDY1dUA":{"text":"Really well made food in a beautiful space. Food was thoughtful and fresh and service was ","useful":0,"cool":0},"QqfHKGHrgvM2tXTqG6nCWg":{"text":"Cold and wet Saturday night...early dinner at SoBou. Charming and quaint with a bit of art","useful":0,"cool":0},"-Uj6aBoz-WVXs5NZYv7F5Q":{"text":"Food was absolutely delicious and so were the drinks! When my sister and I went this past ","useful":0,"cool":0},"N2tVUvZMmthxi0G_pqypfQ":{"text":"Food was awesome, we had a bunch of smaller plates to share. Service was impeccable. The c","useful":0,"cool":0},"lWC6kcSI2_m-xNoW5ub1Jw":{"text":"Very good food and service - menu is a little eclectic but not the creole/Cajun as adverti","useful":0,"cool":0},"a4ENHdUAnY8JQ4l6FvfBgw":{"text":"Awesome decor, IPA on tap, and delicious food.  As mentioned by everyone, the Foie Grae bu","useful":0,"cool":0},"QUkUVsIvMxMcgweTK5G5XA":{"text":"4/5 interesting and tasty, great vibe.\n\nso i'm a sobou fan - i like the energy, the changi","useful":2,"cool":0},"upIf8wHJSAl1Pt_tO6DQ_g":{"text":"Wow they do NOT know how to host. Service is really bad. They weren't at the front to seat","useful":0,"cool":0},"XVT-_4106dkCVU7uO-4o5Q":{"text":"Was very excited to come to dinner here after seeing all of the great reviews and ratings ","useful":0,"cool":0},"fzyPd4-c8R8pO6zYUoBcRw":{"text":"The worst dining experience I've had in the last 12 years of my yearly pilgrimages to New ","useful":0,"cool":0},"iQHqftx47IWHvyVS8n7cVQ":{"text":"Fantastic place.  Was there with my underage daughter, so I did not dive too far into the ","useful":0,"cool":0},"2OA10f9bC1NxkquiB5KyGg":{"text":"Incredible restaurant! We got a bunch of appetizers to share and every single thing was ab","useful":0,"cool":0},"q-g60BDJVxZchvvB_2WzLw":{"text":"Our server was very kind and happy and did an amazing job. ThWe were about to leave when t","useful":0,"cool":0},"k_OCQ2aRD3BoaWdKSEbbtQ":{"text":"Has a salad ever completely rocked your world? No? Get thee to SoBou immediately and order","useful":18,"cool":12},"rdQQQYkdmObDNdB_Mh_-BA":{"text":"Cute concept and the food was exceptional, but a very limited menu and you have to order a","useful":0,"cool":0},"hYjBr8jGB3KSyengvWpncQ":{"text":"Please try the ribs and cotton candy! \n\nI had the pleasure of dinning here during Restaura","useful":1,"cool":0},"PLJAKf6mV-sDrbsi8XfrDw":{"text":"Good food and great atmosphere. I loved that it was good with local flare and that wasn't ","useful":1,"cool":0},"sD6ACJKXOQzyZuynPiQyQw":{"text":"DO NOT GO HERE!!\n\nMe and five friends came here on the second night of our bachelor party.","useful":0,"cool":0},"RZVM-OLfdVVBAUCgdt9uzQ":{"text":"I have a place in the French Quarter that I live in part of the year so I frequent Sobou o","useful":0,"cool":0},"fQTHIrKLj8psX1KPsFyRzQ":{"text":"While I miss Bacco terribly, SoBou makes up for that loss somewhat. We are huge, and I mea","useful":0,"cool":0},"Pr-LAMpThOOpL6YNqR0DRg":{"text":"In New Orleans for one night only, and SoBou was a great way to spend an evening in delici","useful":0,"cool":0},"OD0MFM-87HX22XFh0hOqLA":{"text":"A modern and very thoughtfully decorated restaurant. They have at least five rooms for din","useful":0,"cool":0},"9AhD3Wd1x2hyYd_QE_Alqg":{"text":"Second time here and the food was phenomenal. Love the atmosphere and the service was exce","useful":0,"cool":0},"B6nzfu5sq2f8D0W6_ZdiaA":{"text":"Since the owners are the same, I thought this was going to be like Commander's but in a tr","useful":0,"cool":0},"IiNuqP4kY0FfvobOdaovpw":{"text":"Terrible experience. Service was horrendous. Every course was delayed. Food was cold, unor","useful":0,"cool":0},"4oMa5JSd1tY8zJ-s8Jwixw":{"text":"The hamburger was one of the best, if not the best, I've had in my life. The French fries ","useful":0,"cool":0},"s_aJEnvyVPFk6KTrrQM1kA":{"text":"Arrived in town and ended up here our first night because we didn't have reservations anyw","useful":2,"cool":0},"W_uMqpsQlJ6tzBH0XVyTxQ":{"text":"Fantastic place. Wonderful service. PLENTIFUL food for a great price. Try the chicken fami","useful":0,"cool":0},"aKERs3VaxC9HqrG5DefbcQ":{"text":"Got turn away by the snooty host because we came in wearing shorts.  Plenty of places arou","useful":0,"cool":0},"WnHi4OfvVIVK0bg5UoZtlQ":{"text":"Food was AMAZING!!!!we were invited to a private party here. The atmosphere was sooo fun. ","useful":0,"cool":0},"MsWzdN3mnXoqtw8cBHH-Tg":{"text":"Ambiance was very modern and clean. Service was impeccable. The daily bisque was our favor","useful":0,"cool":0},"9PFAF83PWKYbFHoPTTYocA":{"text":"I don't even know where to begin with the commendations. Being a local it's very easy to g","useful":0,"cool":0},"VEHGpD3vOpERJXlmcf4pWA":{"text":"I was in with my friend celebrating her birthday on July 24th. Sarah was our server and sh","useful":0,"cool":0},"La_R-Xrt0txK4wIYQXLfIQ":{"text":"Lot of better restaurants in the area , not bad for smaller venue.  Burger was under cooke","useful":0,"cool":0},"Soh1EpavuA5AXn4S288CWQ":{"text":"So good. Thanks yelp for not letting me down!\nWe arrived at an odd time...3:30 or so. The ","useful":0,"cool":0},"xNklGLO5g-29JvwqAhYoHg":{"text":"Love the American Cajun/creole cuisine. Great ambiance. Loved the boudin balls. Could have","useful":0,"cool":0},"a6DhobMg1j_WGQ-2MaxUNg":{"text":"Kale salad and blackened fish were delicious! Finally something healthy in New Orleans :) ","useful":0,"cool":0},"LxMbZ16z8KfXx9HB25mfEQ":{"text":"Really cool spot for happy hour.  can't beat the prices and the atmosphere.  Had the pork ","useful":0,"cool":0},"uBi8tW41IY2MeaCyJvqDgQ":{"text":"Came in with really high expectation of this place based on the things we'd read on yelp. ","useful":0,"cool":0},"20N8bN-NxvBJliZ6d7StxA":{"text":"Our experience in the group of seven was definitely one to remember half of us would have ","useful":0,"cool":0},"M83LNsJkAVpqNWgV2aTyPQ":{"text":"Luv this spot in the W hotel! Nice vibes, great happy hour and food menu. Usually stop by ","useful":0,"cool":0},"G8bEwkePvZEmMSTWD_Rp4w":{"text":"This place is a must!! Here goes-\n\nThe tuna cones with avocado ice cream - it's surprising","useful":1,"cool":0},"-Ovd8RbhU81IT_vnvzW-3w":{"text":"Excellent food, but horrible service. We were ready for about 20 minutes before they took ","useful":0,"cool":0},"0bG1WLTQZ4-J5b_m4fX41A":{"text":"We dined here twice during our 5 day holiday in New Orleans and both times were great!! Th","useful":0,"cool":0},"f8dVEqqFnVG3DCOU-7fIEg":{"text":"Let's just say that the host promised it would take 2 minutes to get us a table and convin","useful":2,"cool":0},"fU1ePJiI1h04uJ7KhVs0Ow":{"text":"Found this restaurent on Yelp while we were staying in the French Quarter.  We wanted some","useful":0,"cool":0},"mX-l_yk4PSoujyl9TXz8-g":{"text":"Cool, trendy restaurant right in the French Quarter. The outside seating area is cool too,","useful":0,"cool":0},"B9BYlvTUiWKBTnDTbTTaRQ":{"text":"Our dinner at Sobou was fantastic to say the least. The ambiance was superb and food even ","useful":0,"cool":0},"AruNA0SWigVWZWTAgtu8-w":{"text":"Funky decor. Love the vibe. Exceptional service. Fun fun food. Tuna tartar ice cream cone,","useful":0,"cool":0},"GLUM1P33Bf7YnYFKYblh6w":{"text":"I came for an early dinner so the service was quick but on top of that very nice. I wanted","useful":0,"cool":0},"mKwRVg9sU-LYLRna84mElA":{"text":"Disappointing. Went here for lunch and left disappointed. The cocktail that I wanted -- wh","useful":0,"cool":0},"MDDtD7-SJOsCSpoBZWVBEg":{"text":"First of all, we thought the alligator sausage was fantastic.  Unfortunately this was the ","useful":0,"cool":0},"gzzF-9LHG52Ay-8mLd0b0A":{"text":"Fantastic place. Looks like it's only a bar but it's breakfast and service was amazing. My","useful":0,"cool":0},"G-OofPh7qJD3lXPe0-zrRQ":{"text":"If you are looking for average food but nice ambiance, this is your place. This is definit","useful":0,"cool":0},"tkM2m5wXMfds1XeWqleJoQ":{"text":"This was a very disappointing experience.  First many of the dishes on the Yelp photo revi","useful":1,"cool":0},"ed3MRLcnYdoKLCfCzZNmnQ":{"text":"We had a series of small plates, and they can be quite adventuresome - goat rillette, I th","useful":0,"cool":0},"PP2h41KqYDjdglNQoCGPow":{"text":"We came in around 5 for dinner. very stylish interior, and great atmosphere. \nThe yellowfi","useful":0,"cool":0},"FUvRlrI7AsQwuW3MXq0Zbg":{"text":"Waited TWO hours for main course and it wasn't much food and wasn't good. Server was overw","useful":0,"cool":0},"ppEN_lGyzwGLWDOqiV-lVg":{"text":"The food is hands down amazing. Probably the best New Orlenas eatery I have been in my mon","useful":0,"cool":0},"5mEOMe4CsBXKDp6F3n8zyg":{"text":"Food was awesome!  Just awesome!  Really enjoyed most everything we had.  Service however ","useful":0,"cool":0},"0PaxN376D9pIQcLWGaYYpw":{"text":"Good happy hour and the pork taco was amazing. Nice bar and tasty food. They do half measu","useful":0,"cool":0},"HQ1HQNF50fSOOq_rbUAtGg":{"text":"Great restaurant inside the W Hotel. Fabulous Happy Hour from 3-6.  Dr. Jared, our Rx mixo","useful":0,"cool":0},"1FUtf_ql9R8mbKAP5_qNdg":{"text":"All the dishes are like a delightful explosion of wonderful flavors in your mouth. Ahhhhma","useful":0,"cool":0},"jGpSrOmSxZYCzA9tLpPkvw":{"text":"If there was a negative star I would give it! We were just discriminated against at this e","useful":1,"cool":0},"aTlYaFvSGeaJlUZ6_DesJg":{"text":"Awful awful. We ordered the punch bowl; came in a giant flask (very fun). The cups they ga","useful":2,"cool":0},"WmTruY5R-zlxctRFyyJiYw":{"text":"Really loved everything about this place. We wanted a bar near our hotel in the French qua","useful":0,"cool":0},"CE7P7ePQg7xTzhOoZ_21Yg":{"text":"The food is good but definitely not your typical New Orleans flair. I would say if anyone ","useful":8,"cool":6},"8rabueF_DkmRqIPNhWh7IA":{"text":"Great place. I went once when I first moved to NOLA and was not impressed, but went back f","useful":0,"cool":0},"H5d9DetlXpIHBNkQzfu9ag":{"text":"Let's try to be polite first: The drinks were decent and the appetizer (Sweet Potato Beign","useful":0,"cool":0},"heo71yZajc-Qt9XFfH9vhw":{"text":"Had a great \"legs and eggs\" burlesque Brunch yesterday at Sobou\nWe were greeted warmly and","useful":0,"cool":0},"8FB_WwmvWC6SoXv-GTdsqw":{"text":"Made a reservation for a work dinner and it was a definite win! The food is very creative,","useful":0,"cool":0},"OkaGu_DdNmamzxltlOnBtg":{"text":"The gumbo was fantastic, and so was the bread pudding. I would highly recommend these dish","useful":1,"cool":1},"zAOsQS1AlMJuyr1QtTCoLg":{"text":"Great, modern restaurant. We had a terrific brunch. Beignets were excellent. The 'biscuit ","useful":0,"cool":0},"LF-zO_So7drSlvneYK3hjg":{"text":"My husband and I came here based on the stellar reviews on yelp, however we left severely ","useful":2,"cool":0},"8OM7kYo0t-iS24gwIkVUnQ":{"text":"It was okay. Came for brunch with 5 other ladies.  We ordered a little bit of everything t","useful":0,"cool":0},"FLiIvO-SQ1IKVUsAFbf5eA":{"text":"5 star service and ambience\n\n4 star gumbo\n\n3 star shrimp tasso pincho (where the shrimp it","useful":0,"cool":0},"GQBL0T63JGUQda__uHhiQA":{"text":"Extremely slow service. Ordered bread pudding with main order to allow for \"25 min\" of pre","useful":1,"cool":0},"tVn7BpUEFfnnzpTAD53Gkw":{"text":"This place is awesome. I came here for lunch on my birthday a couple of weeks ago with a f","useful":0,"cool":0},"qb2d25jYJ_0cBvoW9LYvzA":{"text":"Alexandra was our server and she was quite nice!  The atmosphere was cozy and chic at the ","useful":0,"cool":0},"b-HHLMFFp_j1rUFSzHKtaw":{"text":"I highly recommend SoBou, especially if you're in NOLA for a special occasion. I mean, who","useful":1,"cool":0},"xrfNOet8Ha0NgnwTqzwojQ":{"text":"Butternut squash soup, fried oyster taco and sweet potato stuffed quail were awesome!! Coc","useful":0,"cool":0},"bIwlTKjv5QoD_oDPL4tzfw":{"text":"So this was a huge disappointment. The place was empty except 2 seated tables. Our party o","useful":0,"cool":0},"z-TbdD2rTtf9hxnQ02-JTg":{"text":"I went for brunch. I really wanted to love it. It was just OK. They are trying to do too m","useful":1,"cool":1},"acIXsZSFjjbIbXAsNgah5A":{"text":"We came here for drinks on a recommendation from a friend who had been here earlier in the","useful":0,"cool":1},"ENX3sEmTPj8fmlSU0GgE6A":{"text":"I'm only giving SoBou a 4 Star because they cannot accommodate separate drink tickets.  Wh","useful":2,"cool":0},"jFtMqLsQ2NolDKdEBLBP_g":{"text":"Eclectic is the best word to describe SoBou. First - I do recommend reservations, though w","useful":0,"cool":0},"Y7UCSZIhciqTKZ87j3DE2g":{"text":"How do I even begin on this place.  I love going to New Orleans, I go every year for my bi","useful":1,"cool":0},"eYMrT47GQPci45J5WsZCiA":{"text":"Great ambiance. Great service. Great food. Amazing cocktails. Just a little pricey for wha","useful":0,"cool":0},"0DoeVVuKCcQ7K07hsbFJDQ":{"text":"GRILLED BLACK ANGUS NEW YORK STRIP!\nrosemary and manchego roasted Autumn squash, toasted g","useful":1,"cool":0},"p3rbjTga1Z1HbS4RYT8Nug":{"text":"We had the most amazing experience here. My boyfriend made a reservation for our anniversa","useful":0,"cool":0},"fng_MUGik2_qGyuKYqQrSg":{"text":"We have returned twice thus far in 2016. Service was exceptionally slow both times.  \n\nDur","useful":0,"cool":0},"pbdoeD7-4DP-uqNeselzqw":{"text":"We had a good dining experience; however, I could see how Sobou could be a hit-or-miss kin","useful":0,"cool":0},"wFcassPYoIvfbG2_QYPmIg":{"text":"We had our best meal of our vacation here at SoBou.  Maybe the best single dish I have EVE","useful":2,"cool":0},"YH8Y_kkdbEvnypqa3CSTgQ":{"text":"We had the opportunity of dining at Sobou last night and it was delightful! The trendy atm","useful":0,"cool":0},"iZIt8uwf6kz_JNIQnLRsNw":{"text":"New Orleans was never the top on my list of places to visit - not sure why but it never st","useful":0,"cool":0},"grLYAHWEwgjTJ3aGjcgfdg":{"text":"I want to update the readers on my experience with this place. Several people responsible ","useful":1,"cool":1},"uxYlNu7b3EGE0I9UUEgv1g":{"text":"Service was the highpoint.  Our server was attentive, friendly and helpful.  Food was time","useful":2,"cool":0},"REdKhByqEudGEB87m7Vojg":{"text":"I was very under-impressed with our experience at SoBou during a recent trip to NOLA for t","useful":1,"cool":0},"zus6077uMuJusfQaWWhtcA":{"text":"Nice bar, great good and drink options.  The shrimp and Tasso appetizer was amazing as was","useful":0,"cool":0},"BJ8WM0o2e79nvPgQeJPt1g":{"text":"I came here wanting to have something completely different and well... not Cajun/Creole.  ","useful":0,"cool":0},"CwBZgkDVGY17w3GxadnJEA":{"text":"This was hands down the best meal we ate in New Orleans.  It wasn't the traditional seafoo","useful":1,"cool":0},"LJ_g4c9-ngOwijkECDjqug":{"text":"So overpriced for what you get. Dinner for 2, with just 2 beers, was nearly $100 with tip.","useful":0,"cool":0},"-Yv3Rk3bqg2zMziHzrPi9g":{"text":"An interior design to match the unique menu, this restaurant situated at an approachable l","useful":0,"cool":0},"hjgp6f-1ZSc23tbAPaCqFQ":{"text":"Had no idea it was a restaurant in the W hotel. Which explains why portions were small and","useful":0,"cool":0},"Quedyh7Qkh9RYOaJRcFI-g":{"text":"Excellent, excellent food and service. I was waiting for friends while attending a confere","useful":0,"cool":0},"EBc3XtQMcFOv5PFsAC646Q":{"text":"Food was delicious! The fish was my favorite and bread pudding. Elijah, our fantastic serv","useful":0,"cool":0},"TNf3gHzwYVmeaJi04xg15g":{"text":"Tried to give them a second try but they swing and miss again.  An old fashioned served wi","useful":0,"cool":1},"Tp3TVjs0ZYEReiKvo9ftTA":{"text":"I usually dont do this. but i visited Sobou at the W hotel May 29 th 2016 early evening. S","useful":0,"cool":0},"FbeHdAWj3BGYdP0PslTTFA":{"text":"Bottom Line: This is a \"You have to try this place\" \n\nI happened upon this place on accide","useful":0,"cool":0},"_Z4G2oLFS9qCjtCRj8QW7A":{"text":"Wanted a little lighter quick meal, parked on the street, got in the restaurant at 11:20 a","useful":0,"cool":1},"4HDS3EOTWuoBlyMH091YtA":{"text":"We went to SoBou for burlesque brunch, legs and eggs. We were in a little bit of a hurry a","useful":0,"cool":0},"a5b8P0fiC5Bx1tw1xxfTLw":{"text":"When I heard that SoBou was taking over the old Bacco space, I was very skeptical but wow ","useful":1,"cool":0},"uX3RNmXOjRiC_GdslxUdaQ":{"text":"The atmosphere is very unique and classy , the food was also tastey but those play play da","useful":0,"cool":0},"5qflbw8rcDDOe-8xZv05IQ":{"text":"I liked many aspects our SoBou experience: sazeracs were wonderful, pork cracklins, boudin","useful":2,"cool":0},"2_wxCr18R8hDqhJDknpNQw":{"text":"My lady and I had brunch here on Sunday  and it was amazziiinnnngggggg. Tina was our serve","useful":0,"cool":0},"wekb2dxuTBfoBaOqg8_cyA":{"text":"Food is ok, service sucks, I  had to wait almost an hour for my food, and the place  was p","useful":0,"cool":0},"gcQKP3s4o4-zrcZNnxEIvg":{"text":"I went to SoBou on my trip to NOLA for my birthday.  We went for lunch and although there ","useful":0,"cool":0},"RpEJJnruON_WZK5DWyHElg":{"text":"Sobou has a fantastic happy hour, hands down one of the best in the area. While the appeti","useful":0,"cool":0},"MdsFz1i-x7THQhYNYjjgAg":{"text":"The food was delicious but very pricy. It's a great joint for a special meal. The service ","useful":0,"cool":0},"8zDSw8rZSb8Ac31dLia2RA":{"text":"Expecting something more traditionally Creole, this neatly upscale and tastefully appointe","useful":0,"cool":0},"SaI9Ox7GcvoACxjNho-HPA":{"text":"Food was great. Really was delicious.\nBut the service was so terrible. Got my blood boilin","useful":3,"cool":0},"CzxXRxRkXSqGAcRsfIhsRQ":{"text":"The food was awful and the service was worse! The waiter (older gentleman the night of  fe","useful":0,"cool":0},"cl9yhiu0ugqrUSDGVQxv7g":{"text":"First meal in New Orleans and my taste buds are bouncing with glee. The ambiance is modern","useful":0,"cool":0},"G4Tn6vjpbQS3o_PwM8fMsA":{"text":"I wanted to love this place but the weird food and very strange atmosphere made this a mem","useful":0,"cool":1},"_XY7QSp3WAKWvV2Rh_s6pw":{"text":"My wife and I enjoyed our dinner. Everything we ordered was tasty but the appetizer portio","useful":0,"cool":0},"LxZpPvJZA-h8lnnDdrbrxA":{"text":"I would not recommend smoked oysters, and why the hell would you put Frosé on them...? The","useful":0,"cool":0},"IKLZnST-psCeGZqNAWmLZQ":{"text":"Come here if you're looking for oyster tacos, pork cracklings, or sweet potato beignets...","useful":0,"cool":0},"qQNzEaull7N48i7cQkeFuQ":{"text":"I went here last night for a business dinner and I am pretty sure I will not be rushing to","useful":0,"cool":0},"yv_wTA55TCBi2aVjh6Urtg":{"text":"The decor is surprisingly good and the food is delicately prepared. All that at prices tha","useful":0,"cool":0},"CF30ARzhURySN4H6oKw7qw":{"text":"This is the trendy hip restaurant of the quarter that is attached to the W on Chartres Str","useful":1,"cool":0},"WDijXgJ-97Z-cpgS32sJdw":{"text":"Had a really nice lunch here with some great flavors - the gumbo was quite delicious and t","useful":0,"cool":0},"Pqz97VJlz4db3mXLHArtQg":{"text":"These guys do the BEST Dark & Stormy. The bartender said they make their own ginger syrup ","useful":0,"cool":0},"nN9pkvx4Wr9qNyChNOm6Hg":{"text":"Elegant, exceptional service, and excellent cuisine. The decor is stunning-- the walls are","useful":0,"cool":0},"6lXuXH5dr4ypeCK5oqzgkA":{"text":"My boyfriend and I had a dinner here that completely blew us away. We spent time at the ba","useful":1,"cool":0},"3FH7MzxAd8EYMlnEfy-bZw":{"text":"Wonderful take on traditional southern fare. We started with chicken and mushroom gumbo ga","useful":1,"cool":0},"jP6TS26SZQAtRa2BdrbAtw":{"text":"I've had the good fortune to get to travel to NOLA for work. Most of the time, I stay next","useful":0,"cool":0},"wEIB_mUOWN-SmmKxvb4T-A":{"text":"Came here on a Tuesday night at 9pm. I was seated immediately. The ambiance is beautiful, ","useful":1,"cool":0},"0J3OcvsHZ9Q0ngvbuG1Eng":{"text":"Wife loved it. Wants to go back. Foie gras burger - excellent. The foie gras float - weird","useful":0,"cool":0},"ZYCFBQdhTxXbExSuZwkzjw":{"text":"The food here is outstanding and the ambiance is very fun and enjoyable, but our experienc","useful":0,"cool":0},"lJ4sat0YrEZMDOHnYuXidQ":{"text":"Wow! 670 reviews, 4 star average rating! What happened? We must be the only one who got th","useful":0,"cool":0},"2D6vob1heIbkLfxSiv0GXA":{"text":"We ventured out to this restaurant not realizing that this was a WHotel until we got there","useful":0,"cool":0},"VW9t1xGf2fjO3uq78HKM9Q":{"text":"After some very hit and miss experiences Sobou was a bastion of class and calm! We popped ","useful":3,"cool":5},"AvBtRAD4CjF762yRFufK2w":{"text":"Don't be fooled by the fancy decor. I ordered the surf and turf - which was terrible. The ","useful":0,"cool":0},"qXRBHQz0LZLDkXHb198MUA":{"text":"Very disappointing. The dishes we ordered were half-interesting, half bland, and excessive","useful":0,"cool":0},"M8oJ17dCEET3P6rDQxdeRA":{"text":"SoBou had a wonderful atmosphere, fantastic service, and delicious food and drinks. \n\nWe c","useful":1,"cool":0},"uVAKyiDQTymTm6FiZjJkuQ":{"text":"Drink! \n\nSit! \n\nEat! \n\nSit! \n\nSit!\n\nMeteors! Cats! Jared and Jeb are the Double J duo of d","useful":2,"cool":1},"z-AqjHK4XK9CAYkZ1BLvSQ":{"text":"Service is rather poor and inattentive.  Also they had an extremely limited brunch menu wh","useful":0,"cool":0},"F__WMiuvsedktVGjjdHYkg":{"text":"A frequent diner in many fine eateries in New Orleans I had not eaten here before. Friends","useful":1,"cool":1},"cQgElFG_7LsmvAPlwT2jsA":{"text":"The food was absolutely delicious and timely. From the sweet potato beignets to the Tuna i","useful":0,"cool":0},"EzF2zaciadBi1uOMTRGYFQ":{"text":"Went here with a co-worker for lunch on a visit to New Orleans, we loved it! First of all,","useful":0,"cool":0},"f5l3a-npI-a1P2BBTvNrGw":{"text":"Well after trying to come here for almost months of planing just to find out they had a sp","useful":0,"cool":0},"pmiqmoe7Vw0bPUYax3tKSA":{"text":"My fiancé and I went to SoBou last week to try the COOLinary menu, and we were very impres","useful":0,"cool":0},"r50N6sZfYt1j0fj42wae2A":{"text":"I visited this place while in New Orleans on business. The atmosphere is modern and feels ","useful":0,"cool":0},"Q3sAKs2WdRQzd42LlROhbw":{"text":"We stayed at the W for a week and thoroughly enjoyed the bar.  Abigail loves her job and s","useful":0,"cool":0},"4stTmIuA42G01-GAitas4Q":{"text":"This place is amazing!! Brandy was a fabulous, friendly server who recommended the soup an","useful":0,"cool":0},"sIgI_ZX2gHZ8zD4cmfJaOg":{"text":"The Chef 3 Course Special was overall great.  We had a late night reservation and both dec","useful":0,"cool":0},"cKStQx6Gzcfix1C82mNhUg":{"text":"the place was amazing the staff was great and the prices unbelievable. tons of things unde","useful":0,"cool":0},"nj7JXY4KRHZzeU_EC_DMBA":{"text":"This restaurant was just ok. They don't have ginger ale which was surprising. Service was ","useful":0,"cool":0},"vJAw0ktEGvQhI2igrNjQqw":{"text":"Modern, Upscale, and Souless. We made a reservation for a Sunday night dinner and really s","useful":0,"cool":0},"Ingz9SYTvTI_2E-L9xLIbw":{"text":"I was tasked with finding restaurants for our girl's trip.  I decided on SoBou and it was ","useful":0,"cool":0},"GDGPTvRh-cyumFVJB5y1Tg":{"text":"I had this record in mind: those lovely tapas that you share with everybody, it was 2 year","useful":0,"cool":0},"chaUfktEOKJfPcN2lGwP1Q":{"text":"Oyster taco was outstanding. Reasonable prices good food.","useful":0,"cool":0},"vCiNQpWaqwGQWrO2i3Y7fg":{"text":"The food was excellent, the service at the bar was excellent. Tried several small bites an","useful":0,"cool":0},"EA6FOXdabqCU0xSK_CuCNA":{"text":"Hunter is great, very good drinks and amazing service! we waiting for bread pudding will u","useful":0,"cool":0},"DUb3mucGaRDhzqHhvlxlFg":{"text":"Went here while staying at the W - prolly wouldn't have gone in if we hadn't been but glad","useful":0,"cool":1},"owxZxxtfVLmwNQhoo4jykA":{"text":"\"Maybe my expectations were too high after having breakfast at Atchafalaya, and lunch at P","useful":0,"cool":0},"PtqAP3o2X1lkPPcCFYI8iA":{"text":"One of the best meals I have ever had.  The sweet potato beignets with fois Gras sauce was","useful":0,"cool":0},"EayPRIonkZxjutrwQ-W2Qw":{"text":"Came here specifically for the drink happy hour right when it turned happy hour time (3-6p","useful":5,"cool":1},"qzC4HW4VcyLejHJW2S3Yxw":{"text":"Great for Happy Hour and appetizers, the decor is amazing and they were willing to seat 12","useful":0,"cool":0},"erbI9EuhMs6xSQ9K8W2DDQ":{"text":"Had a great time at this place the other night - we've been here a few times for a drinks ","useful":0,"cool":0},"Anta9rDvAPfsA1HOPzYhGQ":{"text":"We came here on a Friday for lunch after making reservations about 2 weeks in advance. We ","useful":0,"cool":0},"zw-79TD313oG3mGAzxgL1A":{"text":"First stop on our vaca just happened to be the hotel restaurant at the W in the French Qua","useful":0,"cool":0},"IvoqoV1PR5IyXwdYcFj2BQ":{"text":"We came here for a friends getaway weekend during Mardi Gras and the dinner and service wa","useful":0,"cool":0},"-aD4LXVoHRAvbDKYcFqD2w":{"text":"Three words: Sweet. Potato. Beignets. \n\nAfter spending the morning on a 2-hour walking tou","useful":4,"cool":1},"rSKF8f62624MBAjv2Eo8Bw":{"text":"Their happier hour is worth a stop in!\nThe drink specials are decently priced for the leve","useful":4,"cool":2},"LFD-4XGC5PsjPjCO97liig":{"text":"Once again, came to this place with a large group of girls, and we loved it! The food was ","useful":0,"cool":0},"JK1XqFOghdbPztrP3Gywtw":{"text":"So....I came to New Orleans for a weekend of culinary exploration and fun.  After my first","useful":1,"cool":0},"PBV1YWsZ9XQq3TaTOhNoBg":{"text":"Great place in the quarter! Very low key but great atmosphere. Food was fantastic (get the","useful":1,"cool":0},"uF2B5PqwFxBfsnyFD9fcvg":{"text":"Food: The sweet potato beignets are absolutely amazing !!! We tried the pork belly sticky ","useful":1,"cool":1},"S36UrTj7pbnU-czqFpQMSQ":{"text":"The food and service was good. Went for brunch on Sunday and the seating area wasn't very ","useful":0,"cool":0},"0soTX04j7qVaBP5iqI5Wow":{"text":"Best:\nGreat specialty cocktails. \nDuck Beignets\nMarinated Olives\nCubano \nAtmosphere \n \nGoo","useful":3,"cool":0},"NgxvcVKXhuMvZFmt4evd_w":{"text":"I truly so wanted to give these guys 5 stars, and after my first experience I would have. ","useful":2,"cool":2},"l7A0IYnBABajNmA5Hzgs1g":{"text":"We walked in and were told the wait was 45 min, but we booked a reservation on OpenTable f","useful":0,"cool":0},"d-dhhfzC-0INQWXhz9rX0A":{"text":"I stayed at the W hotel for 3 nights so I experienced the most recommended restaurants in ","useful":0,"cool":0},"Zranzq2YD5kW0XuZlYxLQw":{"text":"The hubs and I took up SoBou for our Thanksgiving dinner this year. We were lucky enough t","useful":0,"cool":0},"fn3jGsLdAjmkSp-KEWVtng":{"text":"Service - Exceptional, the staff here had the upmost hospitality and our waitress was supe","useful":0,"cool":0},"C4SDUcmT4hiej9580Ak8mg":{"text":"We really wanted to try this place because they were doing some really amazing small bites","useful":2,"cool":1},"lWwx7NAKOqkYEYyBMKGqaA":{"text":"We came here for Xmas dinner and the food was outstanding; some of the best we had in New ","useful":2,"cool":2},"JnPBh1PSxg2x8mjlrVllbw":{"text":"I liked a lot of things about SoBou! Unfortunately, most of the things I didn't like was t","useful":0,"cool":1},"WsgGNTWux2O_B8-HyEGT0w":{"text":"Get the crispy whole fish for two. Very good however needed a little spice for kick.  Serv","useful":0,"cool":0},"G5Y46TO5LyKKa5Eov1PtWw":{"text":"When we walked in we immediately noticed an odor of vomit. The restaurant looked clean- bu","useful":0,"cool":0},"uhbLMJzqR-8i9zT2cmX-cA":{"text":"I came to review the bar at SoBou and after reading some reviews I'm kicking myself for no","useful":1,"cool":2},"EuuTNEX2IidcOZ-X8-Q99w":{"text":"Food came super fast! I tried three small plates (their specialty). Crispy pork belly (to ","useful":0,"cool":0},"Za7HqGaprAtUH27hDkOs5w":{"text":"Came here for drinks and a few snack before dinner.  They had some nice happy hour special","useful":0,"cool":0},"M8GFzxMiD1EGOOWleunHyA":{"text":"I came at 4.30pm on a Monday and it was dead. Don't let that fool you. It's a super cool s","useful":1,"cool":0},"9CuW39zxN56fzBiyMm1zwA":{"text":"This was the first restaurant we tried in NOLA. Our reservation was for later in the eveni","useful":0,"cool":0},"cz9sgn-G5vbOmUwszuLAug":{"text":"More than a little disappointed.  Here for breakfast, INCREDIBLY slow service. First coffe","useful":0,"cool":0},"6gIwvBzzJm9JGR9QaW1ZEQ":{"text":"Worst service ever received... Server took 45 minutes to get us our receipt. Food was sub-","useful":1,"cool":0},"wLNuVOXzPn2RXr0mVqWUzQ":{"text":"The second I walked past this place, I knew I had to give it a try, brightly colored bottl","useful":1,"cool":1},"XjDLOki4-LukYs4hzI6i9g":{"text":"I've dropped in to this place on a few occasions. I've had some drinks and some hors d'oeu","useful":0,"cool":0},"R7_KjQzVqdvlhb41tnxbqw":{"text":"I'm sorry but I did not like this place at all. The plating was beautiful and so was the a","useful":0,"cool":0},"8h_8Sb_f-Ludi9UM1YTv4g":{"text":"It took over an hour for our food to arrive, and the portions were tiny and I left hungry.","useful":0,"cool":0},"c55pfkKxk_j5j3v6KdkJJQ":{"text":"Awesome food! Gumbo was awesome, but the best thing on the menu was the yellow fin tuna co","useful":0,"cool":0},"mk0IQqy2A4ubaENUdsmC1w":{"text":"Thank you, thank you, thank you Dominique (and Allie) for making my birthday lunch so spec","useful":1,"cool":0},"SFemY3ggy0XEm7vgriK9XA":{"text":"Attended a dinner with clients at SoBou on what was their 3rd birthday. So happy birthday ","useful":0,"cool":0},"QoQ3DPMEETNHA57m8D2J1w":{"text":"Had such a great experience there and defiantly recommend. Our waitress was Brandy and she","useful":0,"cool":0},"rOXofvuxHCX7BKkFTVGitQ":{"text":"My girlfriend and I's 2 year anniversary was yesterday and the team at SoBou made our date","useful":0,"cool":2},"eiUaApRpAz9Y_UHexFC1UQ":{"text":"Great cocktails. Great service. But, the food and atmosphere were not great. Half empty re","useful":0,"cool":0},"87jG0xeLkhENX2yOXlazEw":{"text":"The first thing you notice when you come in are the bottles everywhere.  Not wine bottles,","useful":0,"cool":0},"X6z0gGqlbiArO49OpRLq1w":{"text":"Fantastic service!!! sat at the bar Hunter makes the best drinks great food, fantastic foo","useful":0,"cool":0},"ns95uZVaS6MBc7FMyhCilA":{"text":"Great atmosphere, a little classier than the rest of the area... Food and service was grea","useful":0,"cool":0},"moWtc1sXRJFlgWHnVP3TJg":{"text":"Started with the Sweet Potato Beignets (would not have ordered because I didn't think I wa","useful":0,"cool":0},"kIH7NBuV0RKkUrU_TMcEPw":{"text":"I was thoroughly impressed with this restaurant. I had a window seat so I could enjoy the ","useful":2,"cool":2},"bdTmBuVnaBPc9Rp6lHdYLA":{"text":"The food was delicious, the service was excellent and the atmosphere was savvy and modern.","useful":0,"cool":0},"na0VzlBS7Gk1ej7GVPCJtQ":{"text":"The bartender at Backspace Bar noted SoBou as a MUST for tourists, and I can't say enough ","useful":0,"cool":1},"D27lQUpOYHtDDxSsuq-jHw":{"text":"Barbecue shrimp beignets tasted like hush puppies. Service and ambience was great. Restaur","useful":0,"cool":0},"74twK4_fHD_n4Ijz17kt2g":{"text":"Very flavorful small plates concept, chic enough for hep cats but comfortable enough for f","useful":0,"cool":0},"GWlqGCC4TixBHcfKbvz3bg":{"text":"Great staff, very knowledgeable and quick.  Food is good with some unique takes on local t","useful":0,"cool":0},"c5sEmczlpXKdg7es8ZOYDw":{"text":"Loved the atmosphere. The tone of the restaurant was just right and our server was friendl","useful":1,"cool":0},"iQgP3wxVJfYYbj4jr_owDg":{"text":"Went here for a dinner while on vacation for a bachelor party. It's not easy to find a pla","useful":0,"cool":1},"0C_e-X0vPDST90iDo-4jCQ":{"text":"This was our last \"fancy meal\" on our recent trip to NOLA. I took away a sense that the ci","useful":2,"cool":1},"x6MhbAAHIBq_eVcm8pE6TA":{"text":"Terrible service and attitude, long wait time for food. I would give it zero star if yelp ","useful":0,"cool":0},"D8gUYB_YTjm4IusnI44wFg":{"text":"My mom and I visited SoBou this afternoon for lunch and we were both disappointed. Maybe w","useful":0,"cool":0},"QqNdqwrBvnsDr91mZfEALg":{"text":"Went to SoBou at 4:00 pm on a weekday afternoon. It was just myself, a 50-something local ","useful":0,"cool":0},"v-rYPMjfbbkKIUwMtag27Q":{"text":"If you're from NoLa, stay away from this place! There are so many other amazing, and frien","useful":0,"cool":0},"wTDQjDWmTfpnzexuo_Y2pg":{"text":"Don't waste your time here. I usually stay away from hotel restaurants and now I remember ","useful":2,"cool":0},"OIRFwmiv2k5pozXmbx7JxA":{"text":"Frankie is legit the best. Honestly the most important reason to come here, he made the ni","useful":0,"cool":0},"1i28nqIIbYRIbktLUhVBFA":{"text":"A group of 8 of us ate here this past weekend. This was our large group dinner during Jazz","useful":6,"cool":0},"LuBbKV1ve4PCVsMiagGnwQ":{"text":"Loved Sobu! Thank you Yelpers for posting great pics that sealed my decision to stop in. W","useful":0,"cool":1},"q4WUk8lRyM_uYGFwJr1ghw":{"text":"Ambiance seems very formal but it's a pretty casual place. Food in general is delicious. B","useful":0,"cool":0},"I8vK2HzoRb8EcbAoMGBW6g":{"text":"This restaurant was wonderful! The atmosphere is fun and the food was delicious. We had an","useful":0,"cool":0},"t9F8iDFeM9Vo-UM4ZpRuJg":{"text":"Small bites in a hip atmosphere. Worth a trip just for the oyster taco.","useful":0,"cool":0},"P18ksCwsLadGG1qm_sw-nQ":{"text":"We tried gumbo everywhere and who would have thought the best would be in our hotel?  Deli","useful":0,"cool":0},"lPhWzbaFKgqAXkwiQkHJ3w":{"text":"Great restaurant! Wonderful service and gourmet food. We went for our anniversary for lunc","useful":0,"cool":0},"a-FW6fsAcc28K7JJF4GnqQ":{"text":"Thank You! .....to Arla and Michael at the So Bou bar for making our first lunch in the Bi","useful":0,"cool":0},"TISckmDBtF1FHH1p60ZsHA":{"text":"SoBou was out featured dinner destination while in New Orleans. Their tuna cones, sweet po","useful":0,"cool":0},"FiTIZtQ-e_tjM3qCZY66fg":{"text":"I went here recently to check out the W courtyard for a wedding being planned. Since the r","useful":1,"cool":0},"PiUCOnqh1ibpXUQ2J0qWuQ":{"text":"Went during red dress run for lunch and ordered a bunch of small plates, here' my review o","useful":8,"cool":4},"XV3rgk0pUhwDxo5iuYftdw":{"text":"I came here for breakfast while visiting NOLA and although the breakfast menu was small, i","useful":2,"cool":0},"bQfcLsAxKPpCGxWwdkBGlg":{"text":"Great lunch in the heart of the French Quarter! Adrienne was an awesome waitress - very at","useful":0,"cool":0},"mKMD3BbKdJeZDT3yWDqUdg":{"text":"The atmosphere when you walk in is hip and trendy. Not out of place in the French Quarter,","useful":0,"cool":0},"BeMyRhk6SjRQl_YLYXWZkA":{"text":"Being in NOLA over Mother's Day weekend made it quite difficult to get brunch on Sunday. L","useful":1,"cool":0},"PYVOh9JnUqJAVpGm5FPRIA":{"text":"This is my favorite spot in NOLA!! We had the house of rind and their special lunch and th","useful":0,"cool":0},"RlKTZmNrTu8n3OVNSrAAzQ":{"text":"I was in New Orleans for a conference and had a Wednesday night dinner slot where I ended ","useful":0,"cool":0},"el5zrpnWRfMongyI-Gt15A":{"text":"Was in town for business and looking for a solo dinner spot. A friend recommended Sobou fo","useful":0,"cool":0},"VMaI__3CpBHiWj7ZJQPh7g":{"text":"In town for a conference, went here on a recommendation of a friend who had not been there","useful":0,"cool":0},"eWlMAeFc7qfRE71XuQLiag":{"text":"Update to my previous 1 star review :\nWent back for a second try.  Everything was MUCH bet","useful":1,"cool":0},"ghXTv770_4OCLXm7gw7doA":{"text":"We had reservations at SoBou and we're really looking forward to a new dining experience t","useful":0,"cool":0},"mBjyH7TNkQnUXjnk4zfFfg":{"text":"Was recommended by our hotel concierge. Amazing ambiance and enjoyed a great dinner. The f","useful":0,"cool":0},"7N2VqHZy-CqGJy4-_dC5Ug":{"text":"Trendy ambiance!  Mixologist bartenders!\n\nWent here with a couple of my girl friends.  It'","useful":1,"cool":0},"uqGGTWJcnAeIb2ymdhgw5A":{"text":"I really enjoyed the shrimp tassi and the cocktails are very strong. I will definitely be ","useful":0,"cool":0},"2vfNisYYswVRislEE4HILQ":{"text":"SoBou was by far my favorite restaurant in New Orleans while I was there on vacation.  Fir","useful":0,"cool":1},"bkWtiAb2R1yCV5qICCRByg":{"text":"We enjoyed our meal at SoBou immensely. The food is distinctive and delicious. The dishes ","useful":1,"cool":0},"WBL4swHK5SiVAfYNJQwTHA":{"text":"Writing this review finishing our lunch at sobou. We ordered gumbos, were served the butte","useful":1,"cool":0},"dIDhw4mZCDqZmedNVtSqaA":{"text":"Nice set up , but food was very disappointing. . Tried 4 Appetizers , nothing worked . The","useful":1,"cool":0},"A55Jn2tscWPMlVggggIXug":{"text":"This place is amazeballs!\nI hosted my husband's 40th birthday dinner here.  I had a bit of","useful":0,"cool":0},"zxHfkeravQXw-Ai9cFtE7w":{"text":"Wandered over to SoBou in the French Quarter W for dinner on Friday Night.  Although this ","useful":8,"cool":2},"KtfX_8xHgO3-BTikkT2lQQ":{"text":"Came through with a group of 6.  We were a bit rowdy, and our waiter adapted just fine.  E","useful":0,"cool":0},"i1qWBOuujUDBFSVe0VYwTQ":{"text":"I was worried because the place looks super pretentious, but the food was outstanding, and","useful":0,"cool":0},"rifAWwl5XcJbmfQL3B4w0Q":{"text":"Small and Large Plates - not an actual tapas place, but nice to taste a few different thin","useful":1,"cool":1},"kgpCBlK9CsZoa_PwtknseA":{"text":"Still waiting for food. Waitress brought one water for two of us. Coffee is now cold. Had ","useful":0,"cool":0},"koB2JsHuBXsr2wBtT-xG9g":{"text":"Come see my girl Tina, she took care of us like we were family and the food was amazing. #","useful":0,"cool":0},"vTTzUd1LU44wKrDVH8mZNQ":{"text":"Food was either a hit or miss. We started of by ordering three small bites. The yellowfin ","useful":0,"cool":0},"2ZVbDMqU3BQnA8m3jK17ZQ":{"text":"Last night in NOLA food review. The service was excellent Kai had a wonderful personality ","useful":0,"cool":0},"mIJ8Fl6BKfDO8PYF0nPteQ":{"text":"As you walk into this establishment you can feel the warmth and true Southern Hospitality.","useful":0,"cool":0},"tzB1zDJtDiA6ODsdZV22yA":{"text":"This place is beautiful. Drinks were phenomenal and innovative. The bf had heard a lot abo","useful":0,"cool":0},"DMOsbA_tdLUQmD9cjNHo_w":{"text":"The drinks were fine but the service was terrible. As I went to the bar to pay, since our ","useful":0,"cool":0},"lRTKjEhNmaqd-DDgaJkyug":{"text":"The 8 oz Ribeye is really a less than 6oz piece. The food taste is ok. But the service, th","useful":0,"cool":0},"RAtNvRHWgWafELzuL7EfTA":{"text":"LOVED this spot.  So unexpected and the decor was impressive!  It was such a cool experien","useful":6,"cool":5},"4sSEk8a7gxUiutdawr3I7g":{"text":"Loved it! The service as good but the food was even better. The tuna cones were every thin","useful":0,"cool":0},"kgcUmdEeMvlotfOo_BmIkA":{"text":"One of my fave spots since moving here a couple years ago. I always recommend SouBou to pe","useful":2,"cool":1},"GdBDqMCbiofBQ-J_njuoqg":{"text":"WORST SERVICE EVER! We ate there last night at 9pm and got assigned in the section of the ","useful":0,"cool":0},"IhvNb1sPGwpVo8PDBI6Edw":{"text":"Two words: Okra. Mayo. Sobou has a wonderful happier hour deals and the food is delish. Tr","useful":0,"cool":0},"aF2JK9A9QYcx7GT7cBF5Fw":{"text":"One of my favorite meals in New Orleans. I recommend getting a number of starters to share","useful":1,"cool":0},"ok0bE2V-GLxU7BgmXQAPKQ":{"text":"Tasty Experience!\nMy husband and I tend to over order when we are in NOLA so seeing the sm","useful":0,"cool":0},"9IxpDTFvUaDytcWtVWybpg":{"text":"Awesome bar!! Chris and Jeb are awesome bartenders and the reason I will come back!!  Than","useful":0,"cool":0},"PmE7WSTMZXn9yX9_FHfF4Q":{"text":"For dessert: both the chocolate and the bread pudding where the best I had of my last ten:","useful":0,"cool":0},"1e3IWy57eeUmiolOly0rxw":{"text":"Stopped in for drinks and apps.  Fantastic drinks!  I had the \"sunset in the courtyard\" wh","useful":0,"cool":0},"uV0KfQFBFpweOzpx-iKYPw":{"text":"Exceptional service.  I've probably said that was the best burger I've ever eaten a hundre","useful":0,"cool":0},"6BjkSpMqel4SmpFN9AQP3w":{"text":"My friends and I went to SoBou for the last night of my bachelor weekend. This place is sw","useful":0,"cool":0},"BGH6Ep_JEfJ8zejV0kIsFA":{"text":"Really great night at this beautiful restaurant. Staff was incredible, especially host Tho","useful":0,"cool":0},"Xn_eJQG6ZWO226ooFlU7kQ":{"text":"2 for 1 special on drinks when it rains and since the sky bottomed out that worked in my f","useful":0,"cool":0},"XaDII43HJTMrljdLzKwADQ":{"text":"Great place with and awesome burlesque legs n eggs brunch! The atmosphere is comfortable a","useful":0,"cool":0},"jj_OOLgz9H4JXbP_eh_xAA":{"text":"The ambiance is great and perfect for group meals (but beware of the slow service!)  The m","useful":0,"cool":0},"1hZ5uGMVKeEmRnc3PN5hzQ":{"text":"What an incredible lunch experience we had on our first morning in New Orleans. We were on","useful":3,"cool":2},"9mubnupltunZOPwmRNoFjQ":{"text":"This was pretty terrible. We are from New Orleans and come back during the holidays to vis","useful":0,"cool":0},"gCLAbjQ6FaA8y6WJ6w5xVQ":{"text":"The food was delicious and our waitress was spot on! The ambiance was romantic and highly ","useful":0,"cool":0},"D81cOY8MN1_Qi5zsmp-o0A":{"text":"It's a great place to eat. I was here with my parents and Maritza, our server, was great! ","useful":0,"cool":0},"8mF5WRes6kSwZU9H8ysNtw":{"text":"My wife and i had dinner at SoBou and came away really impressed. The plates are smallish,","useful":0,"cool":0},"q93jjAE0Y7OKo0dMNjvBnw":{"text":"The food was good but the customer service really puts SoBou over the top. From the answer","useful":0,"cool":0},"-kDck8wYdBnMDKnT81r-7g":{"text":"Popped in for a quick bite mid-day,, Tina was our amazing waitress.  Had the Sweet Potato ","useful":0,"cool":0},"9xbcuUkXcM4gqKoUDgVRRg":{"text":"Brought my family here for a birthday lunch and was pretty disappointed. We had a variety ","useful":2,"cool":0},"LAg4ZcJZnGaDpPrD2LoY8w":{"text":"A \"see and be seen\" atmosphere, and not very \"NOLA\" from an atmosphere/culture perspective","useful":0,"cool":0},"DE8PI04NUzX3nxUVl0kAwQ":{"text":"We came here for the burlesque brunch during mardi gras weekend. I was slightly disappoint","useful":0,"cool":0},"ivLM6ymyq7zdgYETzdU4JQ":{"text":"Skip this place.  Service sucks.  There are only 3 tables and no one will come by to refil","useful":0,"cool":0},"mZM5yhJhb_QtuB6DR_xZvA":{"text":"This place is fantastic and very lively. We went for the \"Legs and Eggs\" brunch and were v","useful":0,"cool":0},"gW3cObYxP0-kYDgNz9v60Q":{"text":"This place has great food and I love the decor. It's location is central and the service i","useful":0,"cool":0},"ZunZruHD-KYYAmhEqhNIKA":{"text":"I was totally impressed with this charming restaurant. Very creative cuisine and an eclect","useful":0,"cool":0},"93Wb1tNEMz9CnbIErFQZ1g":{"text":"Disappointed with this place food and service were subpar, not what I'm used to at a Comma","useful":0,"cool":0},"phhETedm85SzHZfNgKDlRg":{"text":"We ordered the Cracked Olives, which were a perfect pairing to our drinks (I ordered the S","useful":0,"cool":0},"bRk_Pla7ZBSprGdV6qvvGg":{"text":"This place was so great, we returned for lunch the next day!  We has epp very appetizer on","useful":0,"cool":0},"B4aiv-1q1iUm4B0X9R5kHA":{"text":"Stopped in for a few refreshments and sat at the bar. The staff is extremely helpful and p","useful":0,"cool":0},"ke5gMvk1vr7MQEhvzdgntQ":{"text":"Great for a night out but not for a jaw-dropping meal.\n\nService was kind of slow and inatt","useful":0,"cool":0},"6YvVTxIBwA47ABkHz_rBaw":{"text":"Cool location, kind of hip but not too trendy.  Nice but limited menu.  Kind of pricey win","useful":0,"cool":1},"KUEZzgvqyG9Gtco8XqIb2Q":{"text":"I really wanted to like this place. I went here for a late night Saturday dinner years ago","useful":2,"cool":1},"Vkz8WfIdGb-4idGPh51LkQ":{"text":"Went for thanksgiving. Food was very good. Waitress didn't really have it together at the ","useful":1,"cool":0},"_nCJKLhjlGaHLDI1rQs2kQ":{"text":"The breakfast was good and very tasty. The customer service is excellent. We came back for","useful":0,"cool":0},"dyTwbJr-XTl_J7rB0gejJg":{"text":"Very cute restaurant! Came here during Christmas holidays, and it was a really great resta","useful":0,"cool":0},"-yPOx2Sol5NdFUu-NrsoxA":{"text":"This place is super cool inside! Plenty of seating and decor is really nice. Felt a little","useful":0,"cool":0},"C7w8ffHAE7nSNCURqI5bSQ":{"text":"Unique decor but food was just so so. Service was ok. We had fries, crawfish salad, oyster","useful":0,"cool":0},"nMCFfVgXuNPcoOyX4NgCyw":{"text":"We've enjoyed several evenings here and tasted a number of their dishes. The Creole Chili ","useful":0,"cool":0},"caOgF0fkbDNyA-bEPHxvyQ":{"text":"We had made dinner reservations for a Sunday night.  We had requested a booth but were tol","useful":2,"cool":0},"axkxynE0YGkuYxf7HeirVg":{"text":"Very good service. Excellent cocktails. The only dish I did not care about - bureaux bridg","useful":0,"cool":0},"Qo0o2d9CyfeupCHsOQ96xg":{"text":"I'm mixed about how to review this place. It looks lovely, the food was really delicious b","useful":1,"cool":0},"R0fAcxhUN4Macp6onEuIPg":{"text":"So ridiculously good! I will definitely be back! We had the redfish with shrimp and the st","useful":0,"cool":0},"MQormcdXXOmfKHgQ_MiQRA":{"text":"Great ambiance and very clean.  Drinks and food delicious.  Location is close to everythin","useful":0,"cool":0},"BwrvOzyLkYZ3QEDK6j-HwQ":{"text":"South of Bourbon was an amazing restaurant, hands down the best food of our trip and very ","useful":0,"cool":0},"1CHP4dXGFSWtUj6QgVfesw":{"text":"Nice ambiance and great food, but service was not great, leading to the lower score. Food ","useful":0,"cool":0},"obqR5-LR2DeJ9QTxh6R-Vw":{"text":"We left before we could order. The menu is limited and the seating is clearly about number","useful":0,"cool":0},"-9ajypLAZrbU8XeQEr87Lw":{"text":"Good for the adventurous! Most items off the menu were not things you'd find just anywhere","useful":0,"cool":0},"1NvbvTRZXgrd7cwv4FCYKw":{"text":"We were so happy that we got a reservation at Sobou. It's basically tapas style dining whi","useful":1,"cool":1},"Vji_3J-x7u0Fp2HT6b_u2g":{"text":"We had a small group celebrating a birthday/ a bachelorette party.  We had a blast. The fo","useful":0,"cool":0},"knTU9Qug_XPuRUC11uajRQ":{"text":"Had a great lunch here -- wish I could give half stars...  we enjoyed the 25c martinis to ","useful":1,"cool":0},"FrHV5USjr6V4tOHdizutww":{"text":"This restaurant is lovely! We started at the bar first  and enjoyed some happy hour bevera","useful":1,"cool":1},"TKj04pZ4BBXcv0dI2UHb0Q":{"text":"I've had most of their specialty cocktails, and they are all yummy! Our bartender, Jared, ","useful":0,"cool":0},"8LTIw7Urtpq8PQZC7N7Z0Q":{"text":"Our meal was absolutely fantastic. We ordered the beignets and then decided to have anothe","useful":0,"cool":0},"1K2ejntj123ijtkw5u9ijg":{"text":"Amazing drinks and food.  Next time I'm in New Orleans, I'll definitely return and I'll su","useful":0,"cool":0},"oi2OTU2xtXYKD2o2eOo8iw":{"text":"We had a less than stellar experience with both food and service. The first round of drink","useful":0,"cool":0},"SuVTQ-dEAleQwdju8H9wRA":{"text":"Y'all. I'm distraught. I'm beside myself. In my feelings like the young boys say. I need t","useful":1,"cool":0},"2Vyv8bY21p5h711u0KFDcg":{"text":"What can be said of a place in which the host tells you straight-faced that there is not a","useful":1,"cool":0},"Sa85-nAHzgGD9fMci0LteA":{"text":"Are you looking for a typical French Quarter experience - live music, cheap drinks, gritty","useful":1,"cool":0},"UVYs49cosgXgBvEcyGEBtw":{"text":"Great place for a quite breakfast. Enjoy the court yard before dining. Breakfast here was ","useful":2,"cool":2},"GQDo8omN8CQ_kLm_n7sL9A":{"text":"Spent Easter brunch here with my girlfriend. Booked a reservation well in advance for 1 pm","useful":0,"cool":0},"Gg3vBxusDO1-ChLLotX3fw":{"text":"While the pork belly Bao type buns are pretty bland and dry, everything else was excellent","useful":0,"cool":0},"gnuWpFsxao9yIU7fqLvCwg":{"text":"The only thing saving this review was our server and that some of our food was pretty awes","useful":0,"cool":0},"4FblxstyIAHGjD6Nnx29Ag":{"text":"Huz says that Sazerac is the best drink with alcohol he's ever had, and the homemade ginge","useful":0,"cool":0},"C99Z6U6JmBrulAGEpsXh8g":{"text":"The management team at Sobu reached out to us after our visit asking for additional feedba","useful":0,"cool":0},"M5byXY7FXFNRD-9w3RCYQg":{"text":"The service was excellent. Shelby was so sweet and had lots of great recommendations.","useful":0,"cool":0},"mP6mz39i3oDxwCKEfAS-lQ":{"text":"Great food and Tina provided EXCELLENT service.   SoBu is a must visit. All of the entrees","useful":0,"cool":0},"gZoyuutiVE0x2So399hoRg":{"text":"I came here to kick off a food tour.  The place was super busy and has a burlesque brunch!","useful":0,"cool":1},"Yeu7u3WhRPGcKGOD8DUhng":{"text":"There was absolutely nothing wrong with this restaurant. We walked this awesome ambiance a","useful":0,"cool":0},"N-_9FyG-_GuoPV26vMXyJA":{"text":"Wow! There are so many choices in NOLA--but this one is special! The food quality and serv","useful":0,"cool":0},"ybY3N2BCsjX-26IVtvhIow":{"text":"Wow!!! We were passing by and saw this place. I checked it out on yelp and we decided to g","useful":0,"cool":0},"sBkJdkF3Ss8tTrAmHraUbQ":{"text":"Hands down... great service, great food, and the BEST BREAD-PUDDING I've ever had! My husb","useful":0,"cool":0},"RxcG61GtLroosf77XJ0brg":{"text":"Honestly the food was just so DELICIOUS, our waiter was great. def order a lot small dishe","useful":1,"cool":0},"KtJWIIr-GW4kcvuplUxIxw":{"text":"Shelby took excellent care of me while I was on a break from work. I had some phone tasks ","useful":0,"cool":0},"v9wRZaIkHESi6LwWCywc7Q":{"text":"On our nosh night in NOLA, we included Sobou for the third (and last) time. If they could ","useful":0,"cool":0},"3BCOmnN7szxQukKlzJHp9A":{"text":"Amazing dinner! Sam, our server took such  good care of us! Trey, the manager came by seve","useful":0,"cool":0},"RlkJsaKze6-MJcVJysQUHQ":{"text":"Great scenery and nice calm dinner. Waitress was very helpful with their menu and cocktail","useful":0,"cool":0},"F_mTEPcWvpoU_yM8-LNl1w":{"text":"We had an inattentive waiter which dulled the experience considerably but I will chalk tha","useful":0,"cool":0},"0d9NnRTs8jgJNNTbb3y6-A":{"text":"Hits head grilled cheese was excellent. The gumbo very good. Service was very good. Specia","useful":0,"cool":0},"NSdxBmTrs5Ow5cI60BPvLw":{"text":"What an absolutely incredible experience! All the way from the ambiance to the staff to th","useful":0,"cool":0},"AOvkC16MBtSl9dpASH_m9A":{"text":"Excellent atmosphere, food, and fantastic service. We ordered so many dishes off of the me","useful":0,"cool":0},"bp71JEFycoN5iXA6lx7bPw":{"text":"Simply awesome with eclectic food pairings and self service wine and beer taps. Check out ","useful":0,"cool":0},"Z000xtmoMK8hzjslwrRvNw":{"text":"Honestly it wasn't worth the money! Got a whole red snapper,yet still got fish scales on i","useful":0,"cool":0},"7YuiJEQMtLVZGikDwfHssQ":{"text":"The beautiful Miss Abby was present at the bar as I ordered two of her famous punch mixes ","useful":1,"cool":0},"auD7eE_oHv-oQ6SLFygqjQ":{"text":"Donte was our waiter and he gave us wonderful recommendations for what to select. Each dis","useful":0,"cool":0},"nLIuxQOhJRiwaIqonx7pfg":{"text":"I had to write about my experience at this restaurant. I came in on Valentine's Day with m","useful":0,"cool":0},"PMxgu2cBFv-eZvz5Hehi9w":{"text":"I came here for a late lunch. This establishment is quite large especially their bar. I fo","useful":0,"cool":0},"GyaTub5l1NjADgwP_no2kg":{"text":"I always have fun at Sobou's happy hour! I've been a loyal customer of Sobou for almost 5 ","useful":1,"cool":0},"4cYVmttHe0tckrNjrJa4-A":{"text":"The food is excellent!!!  Not something you would expect in a restaurant connected to a ho","useful":0,"cool":0},"dqxJ1KnDxcmS0wZZOuH9vA":{"text":"Okay-  all the trappings are gourmet.  Fancy menu, fancy prices, fancy decor.  If you're l","useful":0,"cool":0},"ulTcQOUvcmSdadTjmYsHEA":{"text":"Very creative menu.  We went for brunch and had the smoke salmon, bacon, poached egg and c","useful":0,"cool":0},"0tlEDYGq2zMC8pHTlPoMuw":{"text":"Unique creole restaurant in the French quarters. Tasty food, but not with a wide selection","useful":0,"cool":0},"TWeiMbNwAKneld43eCVWyQ":{"text":"legs and eggs brunch! Food excellent, service and entertainment-terrific. Would definitely","useful":0,"cool":0},"4OizrjWVaA7mA0mCZzKAeg":{"text":"We stayed at the hotel this weekend and visited the bar quite frequently. It was very conv","useful":0,"cool":0},"iAQYJ8dO05VwnJtMSS4EEA":{"text":"Three words... Yellowfin Tuna Cone.\n\nYes, tiny ice cream cones with fish in them were a hi","useful":0,"cool":0},"S0mLWRE49JFuSPbbL3i92A":{"text":"The staff here all seemed to be pissed off last night when 7 of us came for drinks and din","useful":0,"cool":0},"ELW7kCeCwad84RaZdCN6qw":{"text":"Really great food. The wait may be long, but it's legit good. I will come back if I'm arou","useful":0,"cool":0},"3jU8My196Dg-SiMncGE8AA":{"text":"Fantastic restaurant that is open all day (in case you get hungry between 2pm and 5:30pm m","useful":0,"cool":0},"DZvDI2EojAKxfREf92NOeg":{"text":"Went to go eat dinner by myself last night and it was lovely! My server Erika was really w","useful":0,"cool":0},"4nn09iDdeXDH4UL45ieiQQ":{"text":"Located on Charters Street, Sobu has a nice ambiance and very tasty food.  Try the Gumbo a","useful":0,"cool":0},"9ZifpPYUQLAwdggFhJqPDg":{"text":"Nice ambience! We got 9 reservations  they close at 10. We had to be mindful of the kitche","useful":0,"cool":0},"4VDCfOT5gd02jVeyOddBwA":{"text":"This is a very late review from our trip in March 2015.\n\nThe food was excellent, the ambia","useful":0,"cool":0},"ucSJbS70XOg5l1HNoTMKfA":{"text":"Sobou is a Brennan's restaurant that is modern and carries the excellent customer service ","useful":0,"cool":0},"5GYfBNZoQlmKR5PAByP0zg":{"text":"Absolutely one of the best restaurants I've been to incorporating food, service, and all a","useful":0,"cool":0},"C9bojOhChG-TQegMtCbx7A":{"text":"Oh SoBou I love you! I'm being overly dramatic but not really. One thing about being from ","useful":1,"cool":1},"I2d7er3FEj_GmjQ58Tm-sA":{"text":"As we walked in the restaurant, my friends and I loved the look and atmosphere. We had mad","useful":0,"cool":0},"GBGfLAv0KlOv2fgn36r3DQ":{"text":"Loved our bartender Brandy she is the meaning behind good staff make a place great!!  Will","useful":0,"cool":0},"wkI6l3hiRaEuFPcCjI_W7Q":{"text":"Lunch is incredible! From the smoked chicken and mushroom gumbo to the crawfish remoulade ","useful":0,"cool":0},"JD9IN2r0S7rD5j9IMGh66g":{"text":"Didn't get to eat, but went to the bar for a little while and walked around the place. So ","useful":0,"cool":0},"6EMbJ2YSdl5c4u_O3yyjJA":{"text":"We had a very enjoyable happy hour with small bites at SouBu.\n\n The best part of the exper","useful":1,"cool":1},"j4wyQY-z2e4jg5gyMP7MaA":{"text":"Had an amazing meal at Sobou but more importantly received great service and great patrons","useful":0,"cool":0},"SL9up2oQn_tt5FdyCmdTag":{"text":"NENE IS AMAZING! She went above and beyond to make sure my bachelorette brunch was TOP NOT","useful":0,"cool":0},"sASrweTx5XjxnGeS93pmnA":{"text":"We went into SoBou for lunch on a Thursday and were in for a treat. The lunch special was ","useful":1,"cool":1},"Edbw4dkBVI_nhnm4M7mpfg":{"text":"One of my better meals of my life \nPerfectly cooked beef \nFresh tuna \nPerfect crispy fish ","useful":0,"cool":0},"-lsJi2ctB7bYfSIameRGmw":{"text":"As ardent fans of Cafe Adelaide (and let's be honest, the 25¢ martinis) we stopped in for ","useful":1,"cool":2},"UewixnYOvRqLKF6CDOoakQ":{"text":"Super impressed. I've been making my way around the commanders palace sister restaurants b","useful":0,"cool":0},"xLdgf5xm0-VOv_plcxBg_w":{"text":"We had a great time with our server Brian. He was knowledgeable about the menu and was a g","useful":0,"cool":0},"MLANR9_bIX62uH4q9_AeDw":{"text":"After reading a number of excellent reviews from SoBou, my friends and I dropped by the ba","useful":1,"cool":1},"34ouOvOrM2hXH9B4oJ2PvQ":{"text":"We came here for sunday Burlesque brunch. We got to pick two courses. For the first course","useful":0,"cool":0},"XzP4RHfwZxzk3jElqxxkVw":{"text":"We wandered in to SoBou one afternoon for lunch, at the recommendation of a friend, and af","useful":0,"cool":0},"29zhpIDBcBSj3jx-fMCq5A":{"text":"Wow! Words escape me when describing my amazing experience. \n\nFantastic service from Kelse","useful":1,"cool":0},"-v0CXXVNc3vf2S7SFt_wgA":{"text":"This place was amazing! We stopped in a few days earlier and had a drink and we fell in LO","useful":0,"cool":0},"VlnIkyt5wU4_pc1AhuR_HA":{"text":"The food was amazing and very reasonably priced. The service was also excellent. Our serve","useful":0,"cool":0},"KA7MKdSs7JRCv0Tnj4C99Q":{"text":"Our friends from Alaska came in to visit. My husband &\nI are from Louisiana. This spot was","useful":0,"cool":0},"zoyHvD9Wsi-laopRVBhLyQ":{"text":"Christmas fail! We were excited to visit SoBou for dinner on Christmas. What a disappointm","useful":0,"cool":0},"4mGiz65SGz-ciUBjzdR-YQ":{"text":"Tried SoBou when it first opened and have been back at least ten times since.  Have nothin","useful":1,"cool":1},"p4uPjttL8nbuEqd6ue6fjw":{"text":"Happy Hour (Not really a \"Happy hour\" based on savings, the portions are what you pay for,","useful":1,"cool":1},"5VWvypPTDPMRieF3K3k0dg":{"text":"I needed a pick me up and decided to stop and enjoy a cocktail. The ambiance was great and","useful":0,"cool":0},"o9h566PrxQPEVsD87oJSdA":{"text":"Excellent find in New Orleans! Loved our service at the bar. Great sazerac and delicious d","useful":0,"cool":0},"tkVDAOEZdM6sSSXSFL2WkQ":{"text":"Excellent breakfast, try the egg white frittata!    Loaded with Veggies that you would nev","useful":0,"cool":0},"T3gh6BvY0kzjXjhX1vgUIQ":{"text":"Very nice staff, great cocktails. I checked the online menu and booked a birthday dinner, ","useful":0,"cool":0},"D9fKKxwmhP-EFmqXev61kQ":{"text":"Oh my goodness! There aren't words to describe how delicious the food is here! The small p","useful":0,"cool":0},"oYOZK9PIBjeCruXW6wA1iQ":{"text":"Great evening. Everything put in front of us was delicious, but adding to the event was ou","useful":0,"cool":0},"plwsW39ySYgHQlEJBfzAlw":{"text":"Horrible Horrible service, flies everywhere, waited 45 minutes for food, super small porti","useful":0,"cool":0},"fO2BBG2N0xgUbPG71Veerg":{"text":"This was my favorite meal in Nola! I came in with a party of 4 for a work trip. Lively, tr","useful":0,"cool":0},"Po8iYvr74hGN17bhvURldw":{"text":"A group came here for the Legs and Eggs brunch. Food overall was delicious although all of","useful":0,"cool":0},"oVWLuWzcHcINCuhbm5r-pQ":{"text":"Tanielle had the best customer service. Food was delicious. And so were the drinks. \n\nThe ","useful":0,"cool":0},"ylUdykSIvymkAjCCjznQww":{"text":"Their chicken and shrimp gumbo is delicious. If you happen to go in during a rain storm, c","useful":0,"cool":1},"iAqOV373WNxwVByznv6yug":{"text":"Wish I lived in New Orleans so I could enjoy SoBou more often!\n\nI was there for a celebrat","useful":2,"cool":1},"se7g3ESlLdozP9mRBefSmA":{"text":"Come in to take a break from the crazyness of the french quarter.  Stay for the $1 martini","useful":0,"cool":0},"3EmIS5i_c-4OmFX4b1JXUg":{"text":"Brandy our server was amazing. She made my bday experience one to remember. Great food gre","useful":0,"cool":0},"thZ2bJn5Z7wDuvVW-MM2dQ":{"text":"Just ok. But not worth the price. Great staff and if you're looking for very unique, go he","useful":0,"cool":0},"WvfsJkfv3rg1r68gidT-Aw":{"text":"Amazing restaurant! I would define it as a fusion new Orleans restaurant with impeccable p","useful":0,"cool":0},"6cSHCorGUGTd2p1Ts-Oj3g":{"text":"Bar staff is fantastic.  Cocktails are terrific.  Love the Cajun Boudin Croquettes - pork ","useful":0,"cool":0},"a-Er7k7EYc8olRt3zZ9c0Q":{"text":"My boyfriend and I celebrated our 1st anniversary here today for brunch. Our first time he","useful":0,"cool":0},"x7tKFr2UBH5EvqpWmJJm3A":{"text":"They took the mac and cheese off the menu...when I asked the waitress. She said, yeah, I d","useful":6,"cool":2},"UbhH-k2Yjz7H6b4WLRKNHA":{"text":"It was our first night as (almost) residents of New Orleans by way of NYC. We were staying","useful":1,"cool":0},"hRej8MgSHrN9PMUiBNEhCg":{"text":"I've been here many times for cocktails and it's a must stop. Hopefully when you come here","useful":0,"cool":0},"sQELs6MRuEz-Y1e2jrpJZA":{"text":"Having lunch at SoBou, eating their fixed menu. I chose the Pickled Grape Salad and Caribb","useful":0,"cool":0},"Phe5CZGOcGOQs3AEntVBrA":{"text":"First place we tried on our vacation to New Orleans. They were running a \"Coolinary\" menu ","useful":0,"cool":0},"qtgoLgp7JMRanL3-akSbrg":{"text":"Was looking to treat myself in my last day in NOLA and the staff were super kind offering ","useful":0,"cool":0},"wT3cwtIsr-As-jbrL84N9Q":{"text":"Food and drinks were incredible. Ordered the gumbo, steak and eggs, and the brownie and th","useful":0,"cool":0},"Ind3amWdrf1v1UJdp1r7ug":{"text":"I love the Louisiana street food concept, but was pretty disappointed in the actual execut","useful":0,"cool":0},"TLFYSDblTY4LpFOvT0A54g":{"text":"The service, meals and drinks were the best we experienced on our trip to New Orleans! The","useful":1,"cool":1},"GTM4iZ1sszWzyC3JKPESoA":{"text":"I loved loved loved this place! Came here for dinner as we were celebrating a bachelorette","useful":0,"cool":0},"otTndYZWfYHqlTt_rfLUYg":{"text":"This place is amazing. I sat at the bar and hunter was very nice and attentive. The happy ","useful":0,"cool":0},"nSL235NHkdxxXWcRYfh4OA":{"text":"I made a 7pm reservation on a Thursday night, but shockingly would've been fine walking in","useful":0,"cool":0},"n2Bvf3sSo_mBnsQd6_uSnA":{"text":"SoBou is a great option for something a bit different from the typical New Orleans fare.\n\n","useful":0,"cool":0},"nMFuN-8BONAYXIjGyASuFQ":{"text":"A group of us (12) decided to try this restaurant for brunch on Sunday.  It was really bea","useful":0,"cool":0},"zB8WBO57xuvI8ERTJhvo7A":{"text":"This place is just ok.  Sent back 3 drinks, the Cosmo tasted like grapefruit.  The price i","useful":0,"cool":0},"MP2HGSEagjxyYwq-1XjcJg":{"text":"Great food and service. Drinks are also very good but the menu was fairly small. The atmos","useful":0,"cool":0},"uLraJ70zbYKEyBLInsQj2w":{"text":"Great food, but really tiny portions and service was very slow. \nIt was freezing inside to","useful":0,"cool":0},"ba267-2S1BIXRYDivLtZ1g":{"text":"We started with the happy hour at the bar. The bar was full which, is a good sign, so we s","useful":1,"cool":0},"yQR3a1VrQHhWJsVvv1Ieuw":{"text":"The Tuna Cone with Avocado and Basil Sorbet, with a mango Sriracha sauce inside, Come On M","useful":0,"cool":0},"dVZ6po_l7AIgp7MFdf2r0A":{"text":"This was my first trip to NOLA, and SoBou was on my \"To Do List\". After visiting multiple ","useful":0,"cool":0},"ze_n-Ic73skLItEioY346A":{"text":"Ate here for dinner the other day and the whole fish was greatttttt. Drinks was wonderful ","useful":0,"cool":0},"CQ8KR29MJJWIrQyUgZmAdw":{"text":"Last night my husband and I ate at Sobou. Omggggggggggg. You guys have to try the pinchos.","useful":0,"cool":0},"FuZASNeVRXnsl4xuNsmSWg":{"text":"the food was delightful.  the sweet corn soup was out of this world.  and don't pass up th","useful":0,"cool":0},"SE5eea2YtAniZjuXBbGR9Q":{"text":"We had a late lunch and do a smaller size entree with a soup or gumbo and it was delicious","useful":0,"cool":0},"zXbVjNJAR2OgHLszUmJ2HA":{"text":"I'd eaten here several times in the past and always had really good service and food. We c","useful":0,"cool":0},"q4_Avy45hDREaUDZy4_H1Q":{"text":"I visited SoBou during COOLinary, and was pleasantly surprise. The ambiance and décor is v","useful":0,"cool":0},"3iDnXIBby1aFpmDiAxoIiw":{"text":"This little restaurant gem was a delight! The menu changes frequently so what we experienc","useful":0,"cool":0},"5jwwlINyU8jtSjDWGRMAQw":{"text":"Food was terrible according to new orleans standards. Won't waste my time or money on this","useful":0,"cool":0},"9bn0_iyqkJO5QJzWlCH5dQ":{"text":"The food was excellent! I came in during Mardi Gras. Although it was a packed house our se","useful":0,"cool":0},"e21X_e2WfnZzOnnc9dGF_A":{"text":"Came in for apps and a quick drink.  Had the gumbo, and yellowfin cone.  Plus a house mart","useful":0,"cool":0},"ztvYy3OZ87cVF8llEqywWg":{"text":"Funky, vibrant, modern New Orleans restaurant with delicious food, a lengthy list of prete","useful":0,"cool":0},"56PbHbsMfUmv-DUJMxLfmw":{"text":"Holy cow, where to begin. The food is insanely good! It's unique, flavorful and smooth. Th","useful":0,"cool":0},"JlshBQgK7795OLJfpBf1IA":{"text":"This bar has really cool atmosphere, superb drinks and so-so food.  I say go for a drink a","useful":1,"cool":0},"lyfVE064RR_o-h2FUQOPAA":{"text":"Good food with great staff and service.  Some miss the Happy our crispy chicken and Sazara","useful":1,"cool":0},"QDCkzymLK7bjkqiyaw-gNg":{"text":"Great wait staff, sophisticated yet laid back atmosphere, great takes on traditional NOLA ","useful":1,"cool":0},"28Qb-S249NYb96xDPjF8cA":{"text":"We had a reservation for 11:30 lunch on a Wednesday and were seated promptly, however it t","useful":0,"cool":0},"7q3HLiZIu1Trs-6oF0yUbg":{"text":"Great place for food and drinks. Celebrated a friends birthday dinner at this amazing plac","useful":0,"cool":0},"QFzOB6AzgiFwcy58XySagQ":{"text":"Wonderful food and service. And amazing slider burger with the topping of egg and duck bac","useful":0,"cool":0},"zDGvWSYf13C5WY1eW-SC_A":{"text":"Visiting New Orleans for the Thanksgiving holidays with my family and we decided to stop i","useful":0,"cool":0},"VmhTk6iqQnEmGCfUczchEA":{"text":"Kandice is amazing! So accommodating and knowledgeable about all the menu items! Really fu","useful":0,"cool":0},"WVMGPe1vJck7tkOFlTM4EQ":{"text":"Being a NOLA veteran a restaurant has to be exceptional to get 5 Stars out of me. It began","useful":0,"cool":0},"IyDc2r-pAY1O4UN9PImyJA":{"text":"The design is amazing. However the small plates are just one bite. Not good for the price ","useful":0,"cool":0},"gdcB5Zghts3PQiOVj7kiTg":{"text":"Had to foie gras burger, which comes with a side of foie gras root beer shake.  The shake ","useful":0,"cool":0},"sGQLBpgv0vFOY15X6zCGAA":{"text":"We went to brunch at SoBou during Mardi Gras during a bachelorette party weekend! Our serv","useful":0,"cool":0},"H-3mB-pEl6xhcoBzH3Ibkw":{"text":"Food is good. But you need to be very patient for the food to be served. Maybe a great pla","useful":0,"cool":0},"neXiBKaKPyvYs-3cxhQ1Nw":{"text":"amazing food, friendly service, great ambience. \n\nMy wife and I came here for our introduc","useful":0,"cool":0},"wYdMvViy_OUJLPuk7NBjPw":{"text":"It's been a great place to grab an appraiser. However, the minute the waitress lied about ","useful":0,"cool":0},"PMyCTBRxzbHVDP_wd7g0IA":{"text":"We wandered in here late one afternoon, hoping for better food than a couple of the places","useful":0,"cool":0},"_L--1AFXMAYgvlbdcAemAg":{"text":"Do not miss this restaurant! I had the most amazing  dinner there last night. It was an un","useful":0,"cool":0},"r_t4gmZUmCBwWYtbUk6PJg":{"text":"We have a friend group that goes to NOLA Every year for Halloween, we normally eat at SOBO","useful":0,"cool":0},"O_eL1vMcFFFfXw0ZYpqqDw":{"text":"Amazing dinner! Great service, great food and our server was the best. Stop by and see Adr","useful":0,"cool":0},"E5KLhBXWLXzWpzxzHgS20Q":{"text":"I went back here twice during my visit to New Orleans, because the foie gras burger is the","useful":0,"cool":0},"PAJoPUUmcy2kdHPXoKoHmQ":{"text":"SoBou is a cute lil' place.  We were there during the Burlesque brunch.  Our waitress was ","useful":1,"cool":0},"Xn2mi-5pYiHEdqo5PhJ5Pg":{"text":"What a phenomenal spot!  We dropped in for a quick bite and drink!  Hunter was our bartend","useful":0,"cool":1},"srI4Ia-LxEvbRnJE5xBnHw":{"text":"So glad I tried SoBou.\n\nWent with two friends for a celebratory lunch. Great lunch special","useful":0,"cool":2},"WnWR8sVGK1oio4GtAH30xA":{"text":"This place has so much potential, but they really need to get their act together.  Long st","useful":2,"cool":1},"H93lKe3p-w9jdQXkras5AQ":{"text":"UPDATE: This place isn't what it used to be. Everything was really fresh, and every dish w","useful":0,"cool":0},"tfucYaK2RM08BRCwJDL2zQ":{"text":"SoBou was such a treat and lived up to the hype. Jacque, our waiter, was so sweet, attenti","useful":0,"cool":0},"MKojYQrsGqVuTkVSgUUm2A":{"text":"Incredible brunch experience! Came here for a bachelorette brunch for our last day and it ","useful":0,"cool":0},"GkYLaLTuO2AEgv5FdCo34Q":{"text":"My fiancé and I were looking for a spot to grab a quick bite & drink before we went on a g","useful":0,"cool":0},"3bnZP7P5DnNI0f7eXcqgUg":{"text":"We were in NOLA for my husband's birthday. We ate our way around the city and decided to s","useful":1,"cool":0},"PzfFGssUT-SXG0CixArOww":{"text":"This place has some unusual and tasty cocktails. I recommend the Georgia O'keefe, the Elys","useful":0,"cool":0},"Q_nDKL1ED82NXEoiP_CRNQ":{"text":"We came here on Valentine's Day. They accommodated our family on one of the busiest days o","useful":0,"cool":0},"rDM4ebdtrNnHfo_D1QTCCw":{"text":"We had a great experience here for a bachelorette dinner. Accommodating management, to-die","useful":0,"cool":0},"c_rSf6bey8evY60jc9V-zA":{"text":"Our waitress Kandice is super bright and nice. The food is fabulous, especially the bread ","useful":0,"cool":0},"OM1l4Xfwgd8p9EeKXxZR9w":{"text":"With its warm, glowy lighting and clean, apothecary-inspired styling, SoBou is every bit t","useful":10,"cool":8},"qbJlIF1ITIJvrni9TqjSsg":{"text":"This restaurant is amazing! Food is great and service is top notch. Sweet potato beignets ","useful":0,"cool":0},"SYxkIUKF8QYMw2sIqeZqKQ":{"text":"Had dinner here tonight for my bestfriend's bachelorette party and we had a really great t","useful":0,"cool":0},"pkovbzQFwARTF3uNrdCYUQ":{"text":"Decided to try out New Orleans Coolinary tonight. What a disappointment. \n\nCoolinary choic","useful":4,"cool":1},"AX6ejSmWzTLcAY6Q9_ggQg":{"text":"this place is right next to the W French quarter, where we stayed so it was super convenie","useful":0,"cool":0},"IuifyNA0Iv-ED9-zhVO3Vg":{"text":"I went to SoBou with a group of about 12 for lunch the Friday before Mardi Gras. The servi","useful":1,"cool":0},"jtPlwtGTWd5MCH6_Gu7aog":{"text":"They have a wonderful happy hour during which you can try a few of the SoBou favorites lik","useful":0,"cool":0},"qDCmrHEnH0nZG1fN6nrjlg":{"text":"I'm giving this five stars for the bananas foster French toast alone. So good! Cute little","useful":0,"cool":0},"MU7Z3DFBbOlFqkx_Ml2vuA":{"text":"Lots of options in the Quarter-this is one of the best.  Cuban sandwich was outstanding an","useful":0,"cool":0},"BT_TBlse99BGU-yGjnWB0A":{"text":"I must say I was extremely excited when my sister decided to have brunch here for her birt","useful":1,"cool":0},"Qo9tPNN9qLesyU_T5TKx7A":{"text":"Oh, man... I just, I want to forget, but that tuna ceviche ice cream cone. It was one of t","useful":0,"cool":0},"FbWgpZiSgJ82VzsrPIXlfQ":{"text":"Local here! Jared and Alec were our bartenders. Service could not have been better. This p","useful":0,"cool":0},"oYwAgT7P3JHW6O9xiFkhzg":{"text":"If you are in New Orleans visit Brandy at SoBou in the W bar. She made my New Orleans visi","useful":0,"cool":0},"xeyoc_AezzrjGbYEpd2Lpg":{"text":"This place exceed my expectations...the food was awesome and the staff was even better.  I","useful":0,"cool":0},"sfOf3LQ5zru4sCWyPi7cnw":{"text":"Obtained a reservation on short notice and place was mostly empty early Friday night.  We ","useful":0,"cool":0},"uOOmqxf_MiVn1hb6SYxtRw":{"text":"Went for dinner last night and had reservations. Here's the breakdown:\n6:45 walk in\n7:06 r","useful":1,"cool":0},"M-igqRLtH9b8ehMra_zG0g":{"text":"Nene was fantastic! And the food was right along side! Great atmosphere, staff and food! T","useful":0,"cool":0},"oTA2_mpTUy2LP6wl1kolJQ":{"text":"Great food! Live music and burlesque dancing during brunch was a blast. Nene, our waitress","useful":1,"cool":0},"1sDSKdL6BjzNi0W68rSYZw":{"text":"Came for dinner but only stayed for a drink. The modern front and back dining rooms are ro","useful":0,"cool":0},"jW6iishqjuT0xano2NSe_Q":{"text":"Richard Lee is the man! I call him Mitch. After the hootch punch, man and Rich made Mitch.","useful":0,"cool":0},"HjZjt-v-jW67YWfP5agQZg":{"text":"SoHo feel in the French quarter. Reasonably priced, great wait staff and delicious cocktai","useful":0,"cool":0},"6vaevr3dEeQjW2jxCN08Hg":{"text":"Went to SoBou on a Weds night, we ordered the following dishes\n\nBluefin Tuna Cones, I thin","useful":1,"cool":0},"cHIfU6VmLlEO5H-bC3SMxw":{"text":"Opened by commanders palace restaurant group can't be bad right?! Wrong.\n\nI had very high ","useful":1,"cool":0},"b47JYzZT9L1eOyI1h5Yyww":{"text":"This place is pretty spectacular! We loved our food and the service was on point! The food","useful":0,"cool":0},"vARr4Bx-4HFH6aejdzXlOw":{"text":"In a word, the food and service at Soubou is AMAZING. \n\nThe piggy puffs (pork cracklin') i","useful":1,"cool":2},"TsgA0v8dyH00HEnY1R0EpQ":{"text":"Great food and wine. Our server Tina was very attentive and friendly. I recommend this res","useful":0,"cool":0},"e_ZesuhzkiyqdI1QrflnJA":{"text":"SoBou clinched the top spot for us on the modern NOLA cusine category...great presentation","useful":0,"cool":0},"bntm3okSwMSmLTz6Ddjz3Q":{"text":"Wish this review could be about the food, but unfortunately my party of three (3) was neve","useful":0,"cool":0},"ZgptFLVCrURmmntfLHuvjQ":{"text":"A fantastic venue with seriously the best service I had in my life!! Sam was our waiter, w","useful":0,"cool":0},"SK00FPGpmm1TrV7BsbnhUg":{"text":"My girlfriend and I decided that a Wednesday seemed like a very reasonable day to have mar","useful":2,"cool":2},"lwUaiPpoF8CjBkA1BYC2ew":{"text":"What an incredible meal!!!! We had the gumbo du jour, peach and grape salad and redfish. U","useful":0,"cool":0},"K6FIhuV9EKqVd6tPfnBnYg":{"text":"This happy hour is lit! Located in the W hotel, the bar is spacious and comfortable. Sit a","useful":0,"cool":0},"oCGIx60MA2iiPisMqzoVEg":{"text":"Tina was amazing!!! Our food took a little longer than expected and she brought us all com","useful":0,"cool":0},"PbzidCHDUv0gzpXq_jo9ZQ":{"text":"A group of friends gather monthly to attend brunch. This month's brunch was at Sobu.  Legs","useful":0,"cool":0},"cUSQEk1-FXUMAI7YF8dDjw":{"text":"We went here for dinner. I highly recommend making reservations. Don't worry about parking","useful":0,"cool":0},"llIF0aT0SVLeYSRJu4UKoQ":{"text":"We just left Carousel Bar and were looking for a spot to grab some delicious food and drin","useful":0,"cool":0},"Tsuuizw3ueND2Sw_X5lu-A":{"text":"Elijah was amazing! He's so funny and full of local flavor. I'd come back just to sit in h","useful":0,"cool":0},"h5j1URIonEz2SYebjL9dtA":{"text":"Gave this place a try, base on reviews I read. The food was good. The place was well decor","useful":0,"cool":0},"6yzfhPrLaTCgHStWIcMmag":{"text":"The food here was fantastic! We did the 2 course lunch. We did the beignets and the Cuban ","useful":0,"cool":0},"HQD88cCU09tRfqkxWh0u4A":{"text":"We just returned to the hotel from eating at SoBou's and could not wait to write this revi","useful":0,"cool":0},"6v6IoeiU2o8HV6LfZ8Stqw":{"text":"Heirloom tomato salad, ceviche ice cream is the way to start. Still reeling from how good ","useful":0,"cool":0},"87hhKJ-s7gQqrm6oQn5BNw":{"text":"Kamryn was the best waitress had, highly recommended!! The food was amazing and so was the","useful":0,"cool":0},"ABJbtLXUuKSkiMqnZwDVig":{"text":"Amazing cocktails... and knowledgeable bartenders. We stayed here for hours to rest after ","useful":0,"cool":0},"7JPVT0eXHRGaJ7D5tCvkjQ":{"text":"Went on vacation to New Orleans and this was my last stop with my friends before heading h","useful":0,"cool":0},"wxueNpAu-_fqDFT98or6Ww":{"text":"This little sister restaurant of the highly regarded Commander restaurant is kicking her b","useful":0,"cool":1},"M2p4oUojhrIkKgIDa_5N0Q":{"text":"Loved the Legs & Eggs brunch!!! So much fun. The burlesque dancer was so good, too! Food p","useful":0,"cool":0},"aZRqmdxBxWSCl6pkswBAaw":{"text":"We remembered Sobou as very special from our last visit. A great place for light hors d'oe","useful":0,"cool":1},"wAEJfRZlrBa2mh5G55OCHQ":{"text":"Brandi is the best! She served it up, served me right. The food was UNBELIEVABLY GOOD. One","useful":0,"cool":0},"r0TZFhB9SDRhwietgh2NBw":{"text":"We had the whole fried Redfish that came over wilted spinach and roasted cherry tomatoes. ","useful":0,"cool":0},"wdYc22ytvMGnz6eijD1GgQ":{"text":"Love this place! In town visiting and decided to stop in based on a recommendation from on","useful":0,"cool":0},"eQKnOykA2g_PrU5lEBk3wA":{"text":"The food was good at SoBou, the service on the other hand was executed so poorly that it p","useful":2,"cool":0},"O-pALgUPwq06JY-Mx6Ubdg":{"text":"Made a reservation on open table via Facebook. Walked over and got in earlier than expecte","useful":0,"cool":0},"eSFjr2-D4nMsM1UBv_R1qg":{"text":"Soubou (South of Bourbon) certainly wins points for creativity and is a great place for fo","useful":1,"cool":0},"ZJ_Cgxut0F-qnXDfTqYXdA":{"text":"Stopped in SoBou for an after dinner cocktail and we sat at the bar. Jared was the bartend","useful":0,"cool":0},"XiLs2oYlk_PDeyoWAGl15A":{"text":"Food was delish and it's such a fun atmosphere. We absolutely loved it!!! Also our waitres","useful":0,"cool":0},"Aq3D3PMDO3dBrEuU-ba2rw":{"text":"This place was amazing!! A great break from bourbon street! We got a couple small plates, ","useful":0,"cool":0},"oYOnYLzwtnoIDXAuUMbxCQ":{"text":"This place is great !!!! Right in french quarter , Amazing and very attentive  waitstaff, ","useful":0,"cool":0},"u2LHw-nvlcEDg67MVYgq6g":{"text":"Ordered at 9, by 9:50 no food had come. Waitress didn't check on us once. Manager finally ","useful":0,"cool":0},"3614-bW5HLcJe44qve5V-Q":{"text":"One of the best meals I've had in New Orleans. Our waitress was amazing and gave great ser","useful":0,"cool":0},"mMHRUq74CxSg6UQijqev0A":{"text":"Head in for happy hour and enjoy small bites and drinks at the bar- located at the W hotel","useful":2,"cool":2},"Vthx6qYa3v-Q4pRIVoBPig":{"text":"Fancy.  Part of the W hotel.  If you are something with more causal and lively try acme it","useful":0,"cool":0},"6jz7M4mUjpDsBhtl05aRMw":{"text":"We went for happy hour, nice specials.\nWe tried the tasso  and shrimp corndog style, the c","useful":0,"cool":0},"VQz6C8EoYXUejGGojIMBkg":{"text":"This place was delicious. Service was excellent, Nene was such a great server. So personab","useful":0,"cool":0},"F8obc4AnBgt7HDGTPMRxbw":{"text":"Drinking a true New Orleans drink with Mulberries and Chicory. It's called a Slow Prophet.","useful":0,"cool":0},"ZJ7s22SLT7DuQSiBfGF_yw":{"text":"tying a new place for me.  The waitress, Brandy, suggested the sweet potatoe beignets.   T","useful":0,"cool":0},"61P1FgBuq2G87erevK4yOw":{"text":"Friendly and attentive (not overbearing) service and subtle flavors made for a very nice l","useful":0,"cool":0},"t7VkEg5DDKYE89_GeQHiFw":{"text":"One of the only places we could find open during hurricane Barry. Talk about a stroke of l","useful":0,"cool":0},"ndd7X6l6-ay9pyfoHIUOGA":{"text":"What AMAZING food!!!!!  We thoroughly enjoyed our meal & apps, however service was very ve","useful":0,"cool":1},"5ayL78CxkWNz3qTSi0uCFg":{"text":"Excellent food! Service was pretty good. Loved the rustic Cajun gumbo and the duck confit!","useful":0,"cool":0},"Kk7hBO5wkD2DFNlpi8h3uQ":{"text":"Sobou not only met my expectations but exceeded them! The food was incredible, the band wa","useful":0,"cool":0},"RClSb6hPkwwR3wVZCVfWJg":{"text":"One of the best meals I had while visiting NOLA. The burlesque show was awesome, and I lov","useful":0,"cool":0},"pMRewLhwgVF0T6X7V59o4A":{"text":"Fine creole dining in the French Quarter. I came here for Galentine's Day with a few girls","useful":0,"cool":0},"LH_N8nl1m_2gzn2VP_aWhg":{"text":"Hands down the best meal experience we had in New Orleans! The space is very hip and clean","useful":0,"cool":0},"8I0paZIjLQP1rermCLZc9g":{"text":"I visited SoBou for happy hour with 2 friends and I really enjoyed my experience! Happy Ho","useful":3,"cool":0},"pgdd1b-F0-CLN68MT8nFxQ":{"text":"I came here for my best friends birthday and they definitely made it a good birthday with ","useful":0,"cool":0},"dKyZq2zTXshJ10_zbuvoKw":{"text":"NENE was the best waitress I have ever had!!! She made me feel at home in a state so far a","useful":0,"cool":0},"7zky3lKjDBGTYqMP-jWhLg":{"text":"Really delicious food.  The surf and turf tacos were excellent; the pork was perfectly pre","useful":0,"cool":0},"LI17IC3IxGqYsShGOvUopw":{"text":"I'm writing this review while I'm still at the restaurant. I came here to just sit at a ta","useful":3,"cool":1},"wwuZQhET7qM4jdPSPI8pFA":{"text":"A solid 5 stars! SoBou was one of the best meals that I had in NOLA! we came here for Sund","useful":0,"cool":0},"rnRpH83Plf_c6OUplmJJ_g":{"text":"So excited to go to SoBou for thanksgiving dinner. So disappointed in the menu. Even more ","useful":0,"cool":0},"9EJQ3yCve7mpTtdjNxzEXA":{"text":"This place is great! I had both gumbos and they were awesome! The staff was quick and atte","useful":0,"cool":0},"hg5c9vXKxqg1fgXASf9OWA":{"text":"Big no no for me. I was excited because of the other reviews. We were seated in a drafty w","useful":2,"cool":0},"RCm-kKgY2XU54L7-xYQj1w":{"text":"Slowest service ever. This is a hotel restaurant. Cute decor but empty, not a good scene.","useful":0,"cool":0},"v8AKJV58RVM8RVjk6917WQ":{"text":"We had a wonderful time eating there.  Our Server, Candace was super friendly.  She made e","useful":0,"cool":0},"2my8VlPAVC8M9893h2R4DQ":{"text":"SoBou is a pleasantly designed bar attached to the W hotel.  The bar offers all the typica","useful":0,"cool":0},"nh64cFdDksinP03TxSss2A":{"text":"Ok...if you eat here you're getting a food experience...not simply a dinner at a nice rest","useful":0,"cool":0},"IiJE0l0DQSx1_At8SQ-Wrw":{"text":"I came in for dinner on Thursday. Had to wait at the bar for a few minutes for the rest of","useful":0,"cool":0},"SmuYWpKH14mT1x9N5nsL-g":{"text":"The food was great had the Oysters tacos and soft shell crab... the service was wonderful ","useful":0,"cool":0},"i5tiP-t4qDBUL9IfZapjLA":{"text":"Brandi and Rita Alexander are the shit. Can I say shit on Yelp?  Well... I did. ‍ anyway..","useful":0,"cool":0},"Bqos8_YBPorSQX5YZUMV4Q":{"text":"This is a classy bar. The space looks upscale, but one needn't dress up to enjoy it. The s","useful":1,"cool":1},"JrP1vmgdh9najkCDm07SYA":{"text":"Brandy is the best waitress ever. The most fun and down to earth person I've ever met. Inv","useful":0,"cool":0},"ViTuS8l42OvOdluVDoZHFg":{"text":"I thought the food here was just ok and nothing amazing. We got the beef tenderloin and it","useful":0,"cool":0},"Ck1bKJDWxWrP9hNLUHF1yw":{"text":"We chose SoBou for their thanksgiving menu offerings while we were in town for the holiday","useful":4,"cool":1},"2tkXQ-b4aDKjDjhqpqfbkA":{"text":"SoBou was a find on local reviews. Charming restaurant with friendly happy staff serving t","useful":0,"cool":0},"4SQ2vLOOq_10wrPef4zX4w":{"text":"We went here for drinks and a few small bites before a late dinner reservation. What a mar","useful":2,"cool":1},"Nb6mkubmb96gBLZcVwLjPw":{"text":"Went for lunch on a Friday. Very slow service. Even for getting water. Food was good altho","useful":0,"cool":0},"nojXdmYdgKXG7pJV3JLOgg":{"text":"Sazarec was ok point and the bar tenders were so friendly and nice. We had the happy hour ","useful":0,"cool":0},"ZTthzl49E4TlCEvV2ixhPw":{"text":"So originally, reservations were made at this location given it's relationship to Commande","useful":0,"cool":0},"UkIxXis1er1f9lSBTSzjug":{"text":"Had a fantastic time a SoBou. The food, drinks, and service were all top notch. Nene was g","useful":1,"cool":1},"cEcGcz4OAh-2u7WkavOO2g":{"text":"Another terrific offering from this great restaurant group.  Commander's Palace and Cafe A","useful":4,"cool":0},"OiSaQex1RgoZrZQ0Ke0eRA":{"text":"My boyfriend and I came here for dinner on Fat Tuesday, it was the perfect spot. Reservati","useful":0,"cool":0},"C-zr9jHzzMz4zqkAkVEHdg":{"text":"Super, super yummy lunch. Love the prices and just so tasty! Would eat here all the time i","useful":0,"cool":0},"PRyoyhVfsOrMjL-Y0BazXQ":{"text":"First time at Sobou. Place was not busy so I thought to leave but stayed. Tina was my serv","useful":0,"cool":0},"MIecCohJUTX5SzOr4i60ZA":{"text":"My wife & I visited SoBou for the second time yesterday and they never cease to amaze. Cus","useful":0,"cool":0},"oLTMcJelGkbr7ZJSbbj53Q":{"text":"Not bad. Interesting twists on gumbo (with potatoes!) oyster tacos (nice and spicy) and sw","useful":0,"cool":0},"i6sy_2X0sr0lmqJsOVhUsg":{"text":"If I could give it 1/2 star, I would.  We were a party of 2, and made a reservation becaus","useful":1,"cool":0},"Qa2SL3UrnqZjxfN_PAIIiQ":{"text":"This was an amazing thanksgiving dinner experience. Our serve Brandy was incredible. It's ","useful":1,"cool":0},"7r5w5apfrqCR5eGmzEl4vQ":{"text":"I was visiting from Los Angeles and was staying close to this spot so I decided to walk-in","useful":0,"cool":0},"Ut8twLZMUdVcwxCkG3Nuhg":{"text":"Dishonest employees and sub par food. Would NOT recommend or go back. I called in takeout ","useful":1,"cool":0},"26Dm7_1iZzVlbcfGP85sxQ":{"text":"The atmosphere is very nice,  especially when you have Arla serving you her marvelous crea","useful":0,"cool":0},"_-6CDjS7uTjzzbnwIFMvNQ":{"text":"Went to lunch there last Friday for the first, but not the last, time.  The hostess was gr","useful":0,"cool":0},"L0MgHzK4MsnAUwybzQXnyA":{"text":"When the waitress starts the night off by bad mouthing the receptionist and is scratching ","useful":0,"cool":0},"56YoU2rK08ub9SvH85DgHQ":{"text":"Came here for dinner tonight with a big group and it was truly a magical experience. Not c","useful":0,"cool":0},"cB6PJrOzvz-nDofh9Y3EYg":{"text":"Worst service ever paired with an unimpressive menu. Went to dinner on Christmas eve with ","useful":0,"cool":0},"3VyV8702Z2X8KtJG9wz7Gw":{"text":"We went this past Tuesday and loved our server. we decided to do small plates with drinks ","useful":0,"cool":0},"wwDqohouP8sHu3IG6iBA9A":{"text":"So I finally checked in at Sobou, after failing to do so about 20 times. I blame the weird","useful":3,"cool":1},"qCRy8tANA8gKPLkRH96mqQ":{"text":"SoBou is a great mix of traditional New Orleans food, American food and some unique add in","useful":0,"cool":0},"Kfj_mUgfc5kN4fbAvm5V8A":{"text":"Tapas concept of light foods that we shared were lusciously satisfying and slick modern de","useful":2,"cool":1},"kO7iunS8wZrEsNy4Bnju1g":{"text":"This is my first time staying at the W New Orleans. My stay at the at the hotel was ok. Bu","useful":0,"cool":0},"0GxXIjOUK5CdEAWaCfynrA":{"text":"First real dinner during my NOLA trip. Typically RWs do not bring out the best in food qua","useful":0,"cool":1},"kV1luRzRqDbfVNVSPW9k_A":{"text":"I was looking for a quiet place to watch a Sunday afternoon football game after a long mor","useful":0,"cool":0},"EmHtGKL4oktDY9Si--zWzw":{"text":"Stepped in for Sunday Brunch. Not a huge selection of entrees, but what I had was incredib","useful":0,"cool":0},"CrT1mqk5NKzLfLXEwLntLw":{"text":"Dropped in here for a nice dinner a few days ago! i got a salad, which was very good, not ","useful":0,"cool":0},"2jSqEnyhggRx58OGXMHE5w":{"text":"Good was delicious and so was the service.\nGumbo, crawfish bisque, brisket sandwich,  Cuba","useful":0,"cool":0},"Cry57ZVuKEO9GIDQp2840A":{"text":"Food was really good but WAY over priced! The portions were far to small for what you paid","useful":0,"cool":0},"Gyz7RWWYRi8MSxMdWKYfGA":{"text":"Located right next to the W and has a great fun atmosphere. There is a bar where you can g","useful":0,"cool":1},"0juBCC0kZMHRWf6S9SUT3Q":{"text":"Sobou is a very sleek, attractive space. We ordered drinks at the bar and enjoyed them in ","useful":0,"cool":0},"hPrbeg6dkv-u80GOrXAl1Q":{"text":"A friend who goes to MSY many many times recommended this place as a \"must go to\" when vis","useful":0,"cool":0},"E-4J4IUbeUzo2Q-bdHo9vA":{"text":"Really enjoyed our dinner at SoBou. Parking was a win because you can park for free at the","useful":1,"cool":1},"o11z2ugixIkcDuxV__hLwg":{"text":"We were looking for something Creole but with an upscale vibe, and oh boy, did we find it!","useful":1,"cool":1},"OPDSLJjwtQUBNx_3iJLsmg":{"text":"Very Trendy Spot in the heart of the French Quarter! Very nice ambience and super chic lay","useful":0,"cool":0},"t9OJ5V23ubDTdajriGIJCw":{"text":"We had a very good experience here! The food was excellent -we had yellowfin tuna & caviar","useful":0,"cool":0},"iJ-PC0xQea8s4yCzwaRzKg":{"text":"Great atmosphere indoors with a beautiful patio outside to relax by after your meal. We we","useful":0,"cool":0},"sNBeAC2wayQNg6pi_u8SEw":{"text":"There's what I remember the place to be and what the second try turned out to be. Either w","useful":1,"cool":0},"kjTf9O5mUDkqwUZal1-wmg":{"text":"Solid cocktails, solid food. Trendy and fun, pretty good. I felt like I was hoping for mor","useful":0,"cool":0},"uJR_D6P8z38DnTFJWp1sNg":{"text":"Came in for happy hour and was pleasantly surprised.  When asking where the bar was I was ","useful":0,"cool":0},"hLsNjx1QAICYJE-YZ2cM6Q":{"text":"Had the fixe prix menu for Restaurant Week. So glad we tried this restaurant. Our appetize","useful":1,"cool":1},"lYm9Gp0JpOmxNGq1wRb87w":{"text":"Really great vegan options! Some of the best pineapple fried rice I've ever had :) great a","useful":0,"cool":0},"UlR1a1ruVneIdTXM4rKiMA":{"text":"Beautiful restaurant. Loved the 1st plates. We had the shrimp corn dogs. They were fantast","useful":0,"cool":0},"en2OnYunna0NF305bCk81g":{"text":"I stopped in for brunch and received my favorite meal of my most recent NOLA visit. \n\nFirs","useful":8,"cool":8},"v4xJ0mwQZHAis06iEhUNVg":{"text":"The menu is somewhat limited and the service was terrible! I don't really blame the server","useful":0,"cool":0},"n4LXCcxkPJwOXWODeqJMOA":{"text":"The Cochon de Lait has to be the best pork dish I have ever had at any restaurant. It was ","useful":0,"cool":1},"JBlv_YJoiUY4XAIWJ7k6lQ":{"text":"Nene was amazing! She has flare, pizzazz, and was quick. She had excellent menu knowledge ","useful":0,"cool":1},"bWBMyVEORIKoj-Oz7BmxbA":{"text":"Stopped by here for happy hour with two friends. To drink we all had the punch of the day ","useful":1,"cool":0},"78SRTVkemjHWaqXltbaCJw":{"text":"We normally avoid hotel restaurants but we won't avoid the SoBou in the future!  Great bru","useful":0,"cool":0},"wtGeI3_uim4HJsKR0EMfhw":{"text":"I really feel they have the best gumbo (I had the rabbit). I tried a lot of places only to","useful":0,"cool":0},"-GV6_0OgBHmhQgd2NHnn_g":{"text":"We went for the Legs and Eggs brunch. Who says no to live music, cousin, bubbles, and burl","useful":0,"cool":0},"KGC8ctRiQVSLiK8M5-zQ6Q":{"text":"My girlfriend and I walked in and was immediately told that they weren't sitting any walk-","useful":0,"cool":0},"h3NQf8f-r9X6iXitJMrZOQ":{"text":"I am a Titanium Elite I have been to many locations. My friend and I had the most amazing ","useful":1,"cool":1},"SkR3_GEd_kg4L65U32qT5Q":{"text":"Erika: tall, curly hair and super awesome. make sure she's your server. the chicken on a b","useful":0,"cool":0},"LnNPH5hQmmc0cmsHjrqytA":{"text":"Dang, I had so much fun at Sobou's burlesque brunch! The atmosphere is classy, but not pre","useful":0,"cool":0},"ix3jSKEawLuUnBIPVzmU0A":{"text":"I love this place.  The food, cocktails, and service is excellent.   For starters, try the","useful":1,"cool":1},"hwd1D1-tnbai0nJLamVEFg":{"text":"We have been here a few times and it's time for a review.   We arrived for appetizers and ","useful":1,"cool":0},"SmazoV1RzBuSUj33w6VyAg":{"text":"I work nearby and have come to SoBou numerous times for lunch and for happy hour, but have","useful":1,"cool":0},"D4TsyQeCOXafKiVeLl2kOw":{"text":"The highlight of our meal at SoBou  Restaurant was our server, Tina. She helped us navigat","useful":0,"cool":0},"s8Ax6INM8mfrBJuM6D4Rqg":{"text":"If I had written this review before we ordered, it would not have been good. First the con","useful":0,"cool":0},"-NScAVK1HTYIN30VRdIS-Q":{"text":"En dejlig fredelig og yderst stylish restaurant i New Orleans. Min kone og jeg spiste frok","useful":0,"cool":0},"jixkVQ7HbF867EB3fVPM1Q":{"text":"AMAZING BRUNCH!! This is everything you need and more. From wonderful, flavorful, well por","useful":1,"cool":0},"vBDbTa1NISpekyimxWcnHA":{"text":"First time at Sobou and it was great. My server, Raven, was all I love about Nola and why ","useful":0,"cool":0},"_cREx02oWTTgLImETiiiug":{"text":"We came for Happy Hour. The Geaux Fish was to die for. The Crawfish Bisque was unparallele","useful":0,"cool":0},"ei-mY9xzpuDS2q9749Wc9A":{"text":"Came here for Sunday burlesque brunch. Pin this place for your NOLA trip!!\n\nThe 2-course a","useful":1,"cool":0},"RdBrGg0UN651K_ExkP8G9w":{"text":"Wow...people really love this place, but I have had better, and at a much more reasonable ","useful":1,"cool":1},"FpW57ntDOF3OWtWfzXOAdg":{"text":"Absolutely amazing! The best food and service we had in New Orleans! Tina took care of us ","useful":0,"cool":0},"2VjXRAntZnNt_GfzGOSMjQ":{"text":"Candace was a terrific waitress, she gave us a very descriptive and honest response to our","useful":0,"cool":0},"OidK8Zo7THrEqEiX3qdyZQ":{"text":"Enjoyed the happy hour specials at SoBou.  Bartenders Arla & Michael were awesome.  Very f","useful":0,"cool":0},"eXNAIFyvylCofUChbpzpag":{"text":"Interior is nice and service was good. My biggest complaint was the portion sizes. The \"ge","useful":0,"cool":0},"X_AJCF6Lk-_Z9NuBomYexw":{"text":"Good location, validated valet parking, fun ambiance, but the food was average to below av","useful":0,"cool":0},"P_asCvCFzie_pJbiAYSO9Q":{"text":"The gumbo was delicious, maybe the best I've had. The duck was not too bad. They were busy","useful":0,"cool":0},"M8wXUdzYJNqARg-RT7595g":{"text":"Stay her at the W Hotel on Chartres.  Great boutique hotel, part of the SPG chain.  Cozy b","useful":0,"cool":0},"8T1yM6Kvvhww4akE0JvRjg":{"text":"Three words: sweet potato beignets\n\nThat's all it took to get me into SoBou. These beignet","useful":1,"cool":0},"OmLIgZ-ywRz0z0z2G0dNSg":{"text":"Had the legs and eggs burlesque brunch and the food was absolutely delicious!! It was a 3 ","useful":0,"cool":0},"urYiBq26QOiIfjNmUE7gvg":{"text":"Ordered: \nGeaux a la plancha\nGumbo\nHoney Buzz Milk Punch \n\nGreat kick off to our 1st night","useful":0,"cool":0},"4XhEwuoyhGMt0-PgZKgb8g":{"text":"Came here after a longg day looking for some happy hour deals and really kind of felt more","useful":2,"cool":0},"_sqwEb5AihAaxGlS8a8DsQ":{"text":"Food was great, full of flavor! Waitress was extremely knowledgeable and recommended both ","useful":1,"cool":0},"VR043XJ6nRyJBGh4vhVRmw":{"text":"This was a very nice surprise in the quarter! We had a large group arrive for the Legs and","useful":1,"cool":0},"jG4-MpZg_ox6_dObM23gaw":{"text":"Not our best night in New Orleans. I was looking forward to going to SoBou, a restaurant w","useful":0,"cool":0},"2JuiYOPus5WNMse3y2uq7Q":{"text":"Appetizers at this trendy spot did not disappoint. 2 words: foie beignets.\n\nFood: 4.5, atm","useful":1,"cool":1},"2SUmMjvv2C7QhToOSnfiew":{"text":"Had fun there.  Didn't eat a meal but had to try the gumbo with my drinks.  Had the chicke","useful":0,"cool":0},"zNKmnx3vgw0eYT7vM_pdQg":{"text":"Three of us found this place while walking around the French Quarter. The decor is trendy ","useful":0,"cool":1},"QBammivXDEtfnpRhWj6nNA":{"text":"Fun, tasty, & best part is you don't have bones on the ribs so you don't have to worry abo","useful":0,"cool":1},"O28VAE1vwKN_iS9TEHJdiw":{"text":"I ate lunch here after checking out of the hotel and had a fantastic fried oyster Caesar s","useful":0,"cool":0},"cojBes9FiNOEjjyYlquabg":{"text":"We were a group of 10.  When we were ordering we told the server that we were splitting th","useful":0,"cool":0},"-AEYSTcqulLjVE_7juWLfg":{"text":"Was very excited to eat here being a Puerto Rican as the chef, but was inmensely disappoin","useful":0,"cool":0},"Ugg9eEDG5KtfGyyVu4pLaw":{"text":"Although we were late to arrive for our reservation, the host was very kind and found a ta","useful":0,"cool":0},"ai31-8Jga-eDmt0--Z2MQg":{"text":"What a wonderful discovery on our last trip to New Orleans.  The food in delightfully crea","useful":0,"cool":0},"MCmm8R88218BHeioOmAB-w":{"text":"Stated at the W, good old fashioned at the bar. Burlesque shows on the weekends. Had break","useful":0,"cool":0},"DcOw61B0CgumkOt2SB9fBw":{"text":"Walked in off the street - what a wonderful find.  Service is fast and friendly - Sharlene","useful":0,"cool":0},"WJIV1Heikl0CZ8cwZ4yK9g":{"text":"The restaurant was good:\n8/10 stars for cuisine\n8/10 stars for ambiance and decor\n12/10 st","useful":0,"cool":0},"GP6HTH1omIyQlyPUah0vww":{"text":"First trip to NOLA and Tina was our server - and she was amazing and is the reason our exp","useful":0,"cool":0},"MzZBx3dHMw3YU6LdkhBHrw":{"text":"We had a surprise 40th birthday party and rented the private room. Brandy was our concierg","useful":0,"cool":0},"rhvxEwUgLy5fKw3yQCyHug":{"text":"I wanted bread pudding without all that extra JUNK (raisins, cranberries, yuck yuck yuck e","useful":0,"cool":0},"RcbOPlSCgyJBna0osYV4Qg":{"text":"We came for Sunday brunch. Our waiter, Richard, was exceptional and very friendly. Exactly","useful":0,"cool":0},"h8C1qJew0x2r8Df2SgQfHg":{"text":"It's a lovely restaurant with good food. I'd not bring a 3 year old that's looking for nug","useful":0,"cool":0},"nMTQzASL3Ot3v7tL_9hb5g":{"text":"Wow! The food is top notch! Ambiance is very romantic.\nWe have had lunch and dinner here a","useful":0,"cool":0},"x6DiNm-27zvIXfau8IWkwQ":{"text":"On Saturday, I November 24, 2018 I had the good fortune of choosing SoBou Restaurant for d","useful":0,"cool":0},"zpJbXtuzWvFdBA40R6fQaw":{"text":"Any great restaurant starts with caring people. This one, on my husbands 66 birthday, was ","useful":0,"cool":0},"gAr3Ey1n7SP_qrqwig8SBQ":{"text":"Unfortunately I didn't snap any pictures but this review is getting 5 stars because of the","useful":0,"cool":0},"NGLFDskH32Lc211cg70l7g":{"text":"This was a great choice for a special night out.  We had the $39 tasting menu which does l","useful":0,"cool":0},"s8JkcxKPq6qAA3QimPE_eg":{"text":"After walking miles we decided to go somewhere, put up our feet, and get some lunch.  We w","useful":1,"cool":2},"Gba_be787aDJQX1-RIa6zQ":{"text":"Went in on a Monday night.  Place was empty and hostess told us we couldn't have a table w","useful":0,"cool":0},"9GpvqM2WFRq0SWuAVcy9DA":{"text":"Michael and Hunter blew our minds ! Luxury interior and personalities! Fresh hers in the c","useful":0,"cool":1},"PCgCx7Nd27mamBalkULGbg":{"text":"Very very elegant and awesome happy hour my server was very friendly and helpful. I loved ","useful":0,"cool":0},"pQehuE5nnQJfz-tydqBx6w":{"text":"If you're in New Orleans... Don't waste a meal at this place. While it is gorgeous inside ","useful":1,"cool":0},"XvLVJ284ypP4eO9ujzq7gQ":{"text":"Beautiful decor in this French Quarter restaurant next to the W. Fun drinks and good food.","useful":0,"cool":0},"ez1fgxDiPgA29CqZq8uo0g":{"text":"When my group and I first arrived, the host wasn't being too polite. We had a long night o","useful":1,"cool":1},"lpZazlbAL9s_FAf32LV2mQ":{"text":"This place went from 5 stars to 2, which is just so disappointing.  My husband and I went ","useful":1,"cool":0},"-EPAV0xJKjjX7XGhbFcHlQ":{"text":"Amazing brunch with Eggs and Leggs burlesque show and three courses for the price of an en","useful":0,"cool":0},"AVEsWFc1iGFDyzMDa1r5TQ":{"text":"Stopped in for lunch and a drink. The crew behind the bar took great care of me Micheal, A","useful":0,"cool":0},"8nInSH11V5cmSPl8fhrNhw":{"text":"This was my favorite meal during jazz fest weekend in NOLA. I appreciated our waitress' un","useful":2,"cool":1},"fULv9LJreh6TPi3npxLB4g":{"text":"After walking around the freezing cold French quarter my fiancé Ronald and I stopped into ","useful":0,"cool":0},"HuRi7NEagO4kQOt_6pUgCQ":{"text":"SoBou, I dig you! \n\nI'm updating this review to reflect my experience here having dinner a","useful":13,"cool":9},"DCmhFaIQSlKCeNEWVuuHKA":{"text":"Our group was treated very poorly at SoBou. The very delicious food and nice servers doesn","useful":1,"cool":0},"u1PuVcL38JBGerOmkX1E1w":{"text":"We love Sobou! Everytime we come to New Orleans this is a staple  for us. I could go on fo","useful":0,"cool":0},"YPj5faB_DNtKmeL7Hw7KMg":{"text":"I am so thankful that I was able to get to SoBou, before the rain came and before they sto","useful":0,"cool":0},"6lrtg0EGb3_zbXXqr9vnRw":{"text":"Overall good experience, If it's your first time going definently grab the Hooch with your","useful":0,"cool":0},"f_jXl2W_OVRQdB82Wofn9g":{"text":"We did a Father's Day Brunch here and it was really fun. The burlesque, the live band and ","useful":0,"cool":0},"2ASWwCs3tMuq8WTxIqtcTA":{"text":"Came here and sat in the bar seating area for a French 75, the drink was good, but getting","useful":0,"cool":0},"GQOg8DbW2WYH3OIB4vLasQ":{"text":"The food here was amazing. We had three different appetizers: Pork Cracklings, Boudin Ball","useful":0,"cool":0},"Cy0Rl-Bqbj4d30hpWnP4YQ":{"text":"I've heard that this place is all the rage, but I'm not sure I felt it. I stopped by for a","useful":2,"cool":1},"eWlj-cC1xuX4n6r0O49cYQ":{"text":"No reservation and dining solo meant I sat myself at the bar.  But this proved to be no ha","useful":0,"cool":0},"F89c8OczEwSul3Mtf1XKNg":{"text":"Great foodie date night spot in NOLA without breaking the bank. Highlights included:\n\n- Tu","useful":1,"cool":0},"6rnmphWKF-TjSyd4177m5w":{"text":"Nene was the best! Very friendly and gave great recommendations! This was a great to way t","useful":0,"cool":0},"MBIXlKDaouVaYofRLoO0KA":{"text":"Richard Lee was incredible! He definitely  made this Sobou experience one for the BOOKS!he","useful":4,"cool":2},"sbXL-aDgd6ARW8ecEi8r4g":{"text":"Came here on Thanksgiving. The special menu was great- classic thanksgiving dinner with a ","useful":0,"cool":0},"fDMj3A7eSlubXRt1d6vviQ":{"text":"My server nene told me to make a review to share my experience and that exactly what I'm d","useful":0,"cool":0},"ihOjgAtueyTV9RwRUvjqpg":{"text":"Hands down best dinner I had in FQ while visiting Nola. My boyfriend and I got the followi","useful":1,"cool":0},"0jxX8HbHaApHXkoAR_HwMg":{"text":"So tasty, really amazing food. Me and a few friends split several appetizers and a few mai","useful":0,"cool":0},"m_JGTSAisyvx86wS9QOFBw":{"text":"Good food but not on my list of places to return. Service was a little slow even though th","useful":0,"cool":0},"nNe0oM-A5bHAnf03-YS19A":{"text":"Always a safe bet for a solid meal.  Great place to come for apps and creative cocktails. ","useful":0,"cool":0},"2WdXojNW8V9VTkcTUFDABg":{"text":"Modern but casual feel. Good food, great service and reasonable value. Enjoyed our experie","useful":0,"cool":0},"p9SqAJK9bgnCBHXR5BvRHw":{"text":"Laura, Michael, and Keenan were great behind the bar! Laura started us off with some Absin","useful":0,"cool":0},"vWPwloTzDfZHizSLlOwejA":{"text":"Cheese plate...YES!\nApple and pear salad with camembert cheese and salted pecan tulie...Yu","useful":1,"cool":0},"O7-GxM_44MAwENeqGW6dcw":{"text":"This is definitely a restaurant worth trying if you're in the area! \n\nSoBou was surprising","useful":0,"cool":1},"JtroWHuM4_HKJqKajxZIuw":{"text":"A friend and I came to eat at Sobou for Mardi Gras day, despite the craziness and hustle a","useful":0,"cool":0},"0aDU6aEocdy9yLUkNn6guw":{"text":"Dinner this evening was amazing. We had been here on a \" Culinary Walking Tour\" and had bo","useful":0,"cool":0},"ebAUAd9HmzzEPLXbj9KdjA":{"text":"We ate here for dinner, brunch, and had some cocktails here.  First of all, don't trust th","useful":0,"cool":0},"55LZmBpMbBEjGplz0BtmDA":{"text":"The worst place I have ever eaten. Went on Sunday evening. Almost empty. Bartender forgot ","useful":0,"cool":0},"AlhUflRZyUR2CjBeY9vR-g":{"text":"I don't really write reviews because there's no such thing as perfection but they definite","useful":0,"cool":0},"3AVitKD4_Dy3V3WRQ2GmXQ":{"text":"The service, decor and food receives 5 stars. The staff is extremely hospitable and the fo","useful":0,"cool":0},"YA8w-d-skycxavFf4f5kwg":{"text":"Three of us came here for happy hour. We ordered a cab, french 75 with cognac, and an old ","useful":0,"cool":0},"7QEfvCCg_99YepMVKNOYUg":{"text":"This is a review for Saturday burlesque brunch. One of the best brunch experiences I've ha","useful":0,"cool":0},"cA6Yy1G3HpuI8lno0SP7iQ":{"text":"My food was super delicious. I ordered the pork buns and fish. The bartender was some youn","useful":1,"cool":1},"WZs5WhXL2xipX9CJvfk5Gg":{"text":"First time in New Orleans and Brandy Zito made us feel like home with her southern charm a","useful":0,"cool":0},"8kFPHpcMNOV5JdAriD0kxQ":{"text":"Absolutely delicious! I ordered the Cochon de Lait, which is braised pork shoulder served ","useful":0,"cool":0},"xWPhdu3disE-HwXX-TYpOw":{"text":"You simply must try the absinthe, but only if Hunter is serving it! \n\nHunter made our time","useful":1,"cool":0},"XkaXeft2p0AUwqA5QMGZIw":{"text":"I really enjoyed eating here!! First of all, our server Brandy was awesome. She was super ","useful":0,"cool":0},"LBscvxH0uhVMODohTxTrlw":{"text":"Came here for dinner with a few work colleagues. So glad we did. Best meal I had while in ","useful":1,"cool":0},"-6fbrIq8oFbqyFxygC1FpA":{"text":"Nice setting, but food was very salty. Portions were small. Not worth the price. The whole","useful":0,"cool":0},"gLu2K66Seep0RwQfDC2odg":{"text":"The decor is very appealing! \n\nWe were seated right away. Having eaten all day long we wan","useful":0,"cool":0},"Vk9KoqtxWPFgMDhKJ70FNg":{"text":"We only went for happy hour and enjoyed the specials -Cajun Gumbo, chicken on a stick and ","useful":0,"cool":0},"sxa4Y1KgurTBLPsaww71qA":{"text":"Adrienne E was amazing! Very attentive, quick as she could be (due to all the tables she w","useful":0,"cool":0},"kBuN8mp7eBKQPz1oE2m7aQ":{"text":"Go for the Happy Hour and try the chicken leg.  It is absolutely the best thing I have eve","useful":0,"cool":0},"gbJ5MYK4YaZWHoZQE7xXWA":{"text":"Waited forever, but our server Brandy was phenomenal! She was super knowledgeable about th","useful":0,"cool":0},"e1JWqqCVDcYzNmJ9_DPfEQ":{"text":"Based on the happy hour selection only; I did not get an entree.  $3 Abita Amber draft is ","useful":0,"cool":0},"WlqockbpCur-oeaa96mdIA":{"text":"Went to Sobu last week and I cant say enough good about this place.\nThe atmosphere was gre","useful":0,"cool":0},"px99fhx984plmelC9U1Evg":{"text":"It was raining so we decided not to go to our original planned spot and decided to stop by","useful":5,"cool":4},"CStZ7e9D9wAWB8T2xKfh3A":{"text":"We came to SoBou for our anniversary lunch around 3 pm (lunch closes at 3) but were reassu","useful":1,"cool":1},"Z16YJOt6W9uaVCCVRCq8oA":{"text":"Even though SoBou (named for South of Bourbon) has its own entrance, it's part of the W Ho","useful":1,"cool":1},"GbcUjDZ8129a9xVYJmJ__w":{"text":"Sweet potato beignets where awesome! Very nice atmosphere and service","useful":0,"cool":0},"9RHocSaR5HEfkUwRoQ2qAw":{"text":"Discovered this place through Yelp, and so happy we tried it! Like most of the other revie","useful":0,"cool":0},"FX5ZgLmtSMBR7mHs8X0FEA":{"text":"I've only tried breakfast here since I stayed at The W Hotel attached to it, but let me te","useful":1,"cool":0},"iog5kMWgvA313MofOP3Flw":{"text":"The food and service was amazing! The burlesque show was awesome...she interacted with the","useful":0,"cool":0},"GZmZ6Z2UNJHDs2K_aK6-JA":{"text":"I didn't have a bad experience but I think this restaurant may be overrated. We came here ","useful":0,"cool":0},"Hf_Sas2TIsB9fbxO3pYbrw":{"text":"The place was great. Everything we had was great and the service was over the top. How kne","useful":0,"cool":0},"UaWuaIPTRt3KdW_p41IyXA":{"text":"We went for \"Legs and Eggs\" on Sunday Burlesque Brunch. The band was absolutely spectacula","useful":0,"cool":0},"2ZNdxKlRw-PDBXHVsFCSoQ":{"text":"Loved this place! We were in search for gumbo and we finally found it! After a day of walk","useful":1,"cool":0},"vL3tpNufTgpozPIpC5uITw":{"text":"Amazing place, love the ambience and the whole fish, man it was worth it 1st time seeing s","useful":0,"cool":0},"GJdU6vEfM5BGCXnwg-1DOw":{"text":"Waitress provided great service, very knowledgable but to be honest, she was too attentive","useful":0,"cool":0},"xm0n__Jzqba4MPSyG2t6rw":{"text":"This was an amazing experience and i would recommend it to anyone.  The food was fantastic","useful":0,"cool":0},"I5pXxR68hqcQ6PYBrutf_Q":{"text":"Lovely dinner with my daughter. Tuna cones, artichoke tamales, Cochon dlate gumbo, duck de","useful":0,"cool":0},"G9851UjgnuoZmjggWJSFfw":{"text":"We came to New Orleans for a girls weekend. Came here our first night. Picked this place d","useful":0,"cool":0},"MMVbae6bEjD1SAyMrhpqPg":{"text":"The food was decent, for the price you pay and the portions you receive it really wasn't w","useful":0,"cool":0},"dKCISvlSOqli3ZLnksw6Hw":{"text":"My husband and I never go to the same restaurant twice on a vacation but we had to come ba","useful":0,"cool":0},"d-FMGlOdBe2mrzWkPSSGCg":{"text":"Had lunch and dinner here while at a conference. The lunch  was delicious. I had crab taco","useful":0,"cool":0},"_2Qu3dd1-5iGwAB36AhTZQ":{"text":"great ambiance and staff but the menu needs more variety. My boyfriend and I each got the ","useful":0,"cool":0},"2VykPvry54R3iAD7SA7lGw":{"text":"A close friend recommended SoBou, and I'm glad I listened to her. It was our fourth of fif","useful":0,"cool":0},"veOtvgfUVT5bDmWKvXvqUw":{"text":"Nene and Darius were excellent host. Food was really good also. Ambiance was nice as well.","useful":0,"cool":0},"-GVLG5rQXWMovFezJwUN0Q":{"text":"Our favorite intimate New Orleans dining.  Always interesting changes to the menu.  Excell","useful":0,"cool":0},"KtgKTNztWoUgm2tqk8LnDA":{"text":"The burlesque \"show\" was dismal. The band was great, but there was one dancer who dances f","useful":0,"cool":0},"u0icVblHRwBqqpXgF7OdIw":{"text":"I had a delicious sandwich here. I can't remember its name because the wine list was also ","useful":0,"cool":0},"S0T1NMtjKmXQGi7OWEUOcw":{"text":"The food is amazing! I had the duck and my family had the surf and turf tacos,Vietnamese P","useful":0,"cool":0},"2omZNugcpLn0_owO47HWog":{"text":"Worst experience ever. It so Sad cause the server that welcome us to the restaurant was so","useful":2,"cool":0},"uVqzDkhno5kp7vW-0ImOGA":{"text":"Delicious!!\nGreat staff!\nWe all had a three course meal. Spinach salad was amazing!!! Perf","useful":0,"cool":0},"UZ71z07NDnCbxVSb4HdHiw":{"text":"Not really impressed. This place had good reviews, so we tried it. The service was fast an","useful":1,"cool":0},"d2_zE9ojCdQQkC-WulZgLg":{"text":"Went to this restaurant on its second day of opening back since the beginning of Covid. Ab","useful":0,"cool":0},"Aykj7WEttumGO9ImYsRRdA":{"text":"Delicious food. Traditional NOLA food made with a contemporary flare.  Small plates availa","useful":1,"cool":0},"M51xSN-T5jZpxn3MxjGyFw":{"text":"Great place and location in the heart of the French Quarter. Food was delicious and our Ba","useful":0,"cool":0},"0xin14nloV0IQkAqtnLAGA":{"text":"Erika was an amazing waitress... Everything she recommended on the brunch menu was AMAZING","useful":0,"cool":0},"zpNVXzv4adU7pbm2k8iNAA":{"text":"Sunday before Mardi Gras, boyfriend and I visited SoBou for brunch. We were starving as we","useful":1,"cool":1},"UpB1dpMjSPETzPkx1Mwy9g":{"text":"Excellent restaurant. The staff NeNe and Darius were excellent. The food was excellent and","useful":0,"cool":0},"Tb1I2pgHPwFw5o7XbGUWHg":{"text":"Our waitress Shelby made this a five-star experience! We had a reservation for two at 7PM,","useful":1,"cool":1},"auB6HTGjC3OVmV70zsSFvw":{"text":"Came here for Sunday brunch for their Legs and Eggs Burlesque show and it was a great time","useful":0,"cool":0},"PAzGF5tCVVspkYj9wIquZw":{"text":"Came here for the Legs & Eggs Brunch (Sunday Jazz Brunch with Burlesque). The most amazing","useful":1,"cool":1},"QyQ3UltYFZ1EV7EditwRpQ":{"text":"Ohhhh. \nSo Bou.\nYou almost had me at Hello, but unfortunately the waitress with the multi ","useful":5,"cool":2},"ZgIPuepPBTiXqA08DcwjfA":{"text":"My fiancé and I had reservations for 13 people for our joint bachelorette/bachelor party t","useful":0,"cool":0},"tgc2qpU8LYbi-WsjM-78hA":{"text":"My date and I came here for brunch on our last day in NOLA, and it was such a fun and deli","useful":1,"cool":0},"rgH1MbI-Ske3LsbV2qKwEg":{"text":"SoBou's bar offers a nice ambiance. Quaint and lively. We visited for happy hour. Seafood ","useful":0,"cool":0},"Gu0kftBMSWgzxxc7BFA3Eg":{"text":"I wanna keep this brunch all to myself--but, I can't afford it every weekend, so I'm askin","useful":2,"cool":3},"J9zMY638tiDlKmu6qvra5A":{"text":"Two words: Happier Hour. I believe it goes from 3-6 with great prices on delicious snacks ","useful":0,"cool":0},"iok2ZSGloj3ts0XtxdMxbw":{"text":"I absolutely love this place I had a very nice dinner here with some friends appetizers lo","useful":4,"cool":3},"aDdJFe86dI6HjqWuiKKq5g":{"text":"My husband and I stayed at the W and received a free breakfast voucher. We waited 40 mins ","useful":2,"cool":0},"J-W2sovZ_0CKZXFvkbSv1g":{"text":"I've eaten here twice for lunch and today had their happy hour which included a .25 Blue C","useful":0,"cool":0},"-R6_ir96nqRXyCvdvIl2lA":{"text":"Yes, it's a hotel restaurant, but it's a really good one. The three course meal is a good ","useful":3,"cool":1},"U8NB-Gb74V_kEyS9IM51Bw":{"text":"Here's the thing.  I dislike giving anyone one star, but I feel like SoBou earned it.  \n\nI","useful":16,"cool":1},"FUkhbaDHHRhxPd9Z7vh68g":{"text":"Although I am only giving SoBou 3 stars, I want to make it clear that SoBou definitely has","useful":0,"cool":0},"ORg4dgLEfkuzb87eBtauGQ":{"text":"We wandered in too Sobou, it was on my list, around 2 on a Saturday afternoon. So we stood","useful":4,"cool":1},"X8vsHL3o6qVv2pllvXy5PA":{"text":"Excellent bartends that are always knowledgeable. Good mix of classic and more modern cock","useful":0,"cool":0},"VGAT9wsO-aO0xTIhMg54qQ":{"text":"Good food & service. 3.5 stars\nReally like the decor and the feel of the place. We ordered","useful":1,"cool":0},"-S8kr44Y8T-xAq-CYgG5Zw":{"text":"Came for Legs and Eggs Burlesque Brunch on Sunday. I was thoroughly entertained and the fo","useful":0,"cool":0},"ArufcryU7zBxwSpP5EG65g":{"text":"Tina ROCKED our night! We brought in a table of 14 ladies for a bachelorette dinner - whic","useful":0,"cool":0},"wwswZko_qG3axT5m_pZm7g":{"text":"Restaurant looks pretty cool, but service was not great on Christmas Day.  Super slow.  We","useful":0,"cool":0},"Po_OiTbU1oKK0RC2k-Hq_A":{"text":"I returned here again last week and once again this place earns 5 stars. The manager Jerry","useful":0,"cool":0},"k83GfX-l_SrUhSSsttts3Q":{"text":"Visited SoBou to check out thei Happy Hour specials.  Enjoyed the Bar Bar's punch which wa","useful":0,"cool":0},"aIUBxrHP397X1PW8Z4TkMw":{"text":"What a disappointment!  The menu is what drew me in, but the food was just plain bad.  The","useful":1,"cool":0},"OlQeebbLgDARv9L0bSW4Yg":{"text":"Went here a few friends from out-of-town for a Friday night dinner. I can't say the food w","useful":1,"cool":0},"p25ZhB_DLhqMC4QtM2QtAA":{"text":"Butternut squash beignets.  That is all.  You eat them and you live.  Your life begins.","useful":0,"cool":0},"R6ZNH23BASs2ESLD5v9tsQ":{"text":"Great food, great service. A must to try, when you make your reservation ask to have Tina ","useful":0,"cool":0},"EO42CxiJm6Jyi6roT99qHg":{"text":"Ask for Brandy!! Amazing and awesome, super genuine server! \n\nWent in a group of 5 and we ","useful":0,"cool":0},"1woe4lUoYw_I7sXp4ZQKKQ":{"text":"Thanks to Kathleen and Stephie reviews that steered us here on a Sunday morning!\n\nI had th","useful":2,"cool":3},"8eU9yviMh-vy-Q6sEoVI6Q":{"text":"Stopped in for cocktails and appetizers before heading to dinner elsewhere (have I mention","useful":1,"cool":1},"CI4_dy2xFdvV4yN0BGbjCg":{"text":"We went last year for our anniversary while in Nola, happened to be superbowl sunday (Seah","useful":2,"cool":0},"Wpdvhqx3LKkNhhDa0ked2Q":{"text":"Lunch at SoBou was amazing! I loved the atmosphere and hip feeling of this place, such a g","useful":3,"cool":3},"kUDQIZ3BSPfpDUxvbO4x1w":{"text":"Found it on Yelp. Decided to try it, I asked to make a reservation but family said no need","useful":1,"cool":0},"sIQmMto_BQzFBsZ_ZNBcgw":{"text":"Although we were 20 minutes late to arrive for our reservation, the host was very kind and","useful":0,"cool":0},"jNOOzktnGnbymvZnKzeDcQ":{"text":"Easily the best $50 dinner I've ever had. The pork shoulder was delicious, and the service","useful":0,"cool":0},"XZUvqGAGkL5RfiWIOOTs8g":{"text":"When I tell you that I will not be staying anywhere else but the W New Orleans, it's becau","useful":0,"cool":0},"OSiyzHlWYQY7dtauhfOjLw":{"text":"This was my favorite part of my New Orleans visit. The food was excellent.   The Mardi Gra","useful":0,"cool":0},"NukPMtGiqLvU8eW7xG5kuQ":{"text":"What a delight. Aaron was our server and was a total delight! He does yoga but lets you ea","useful":0,"cool":0},"DjqYkO8TOiKgU9DxzJrCYA":{"text":"Got the shrimp salad and was presently suprised that for once I enjoyed arugala the salad ","useful":1,"cool":1},"wR9mwNCu_PRQMR8UmnklPQ":{"text":"Having enjoyed my share of wine at lunch earlier in the day, I didn't try any of their sig","useful":4,"cool":3},"GJdNketuwHfb-2YDkhN9hQ":{"text":"First of all, let me say about Nini, she took care of us with 5 stars customer service. Sh","useful":0,"cool":0},"9ShAOJC4jkyzw7Al-74p8g":{"text":"I really wanted to try SoBou, but unfortunately the service was horrible.  We had a 2:30 p","useful":0,"cool":0},"5D0QiedC-Ol0vvrbYQv0DA":{"text":"I had been looking forward to trying the food here for a while but it was a huge letdown. ","useful":1,"cool":0},"db8b7z9XthQyxOxej6W8ZA":{"text":"Great service. Food poisoning.\n\nI think we caught this place on a very bad night and had a","useful":5,"cool":0},"yi88t0x-aN7hoCyBN3Fcag":{"text":"Amazing - the restaurant was almost empty -I don't know why. Service was excellent and the","useful":0,"cool":0},"Ch4TAOyo4jQ5GoWeQXwHMA":{"text":"There a few times that I can recall when a meal has been an experience that is not only me","useful":1,"cool":0},"MFjJ0mzRccqPDlJngW7dKQ":{"text":"CHRISSSSSSSSSSSSSSSSSSSSSS!!!!  Sit at the bar...he is kind of low key...but super knowled","useful":3,"cool":4},"m4ScdTWnHzcroAshgEZJ0g":{"text":"The drinks are wonderful. Highly recommend Tourist Visa. Spicy and delicious. Food takes t","useful":0,"cool":0},"60uNiqQzraQfeTgd7Wv3GQ":{"text":"Sweet potato beignets are amazing and decadent. The BBQ Shrimp Shortcake was easily the ta","useful":0,"cool":1},"cfZG61AnefQyGrQSB-7UaQ":{"text":"I have been visiting Nola in the past five years and just discovered SoBou. Tucked away in","useful":1,"cool":1},"e1Ck1A1v_UmS2jTEe3mqcA":{"text":"Loved this place! I had the best experience here! My waitress was Stacey- she was awesome.","useful":3,"cool":5},"CCZ2ZfI3xwf7xUtKSvb-_A":{"text":"Amazing food and amazing atmosphere. Tina made our night! Tina is New York bound! Cant wai","useful":0,"cool":0},"JGL8SL_o_WfL6uB93ez63w":{"text":"I attempted to go to this place on three past trips to NOLA... I guess the expectation was","useful":1,"cool":1},"q8oB7-KHV4so9XUEf-xXQQ":{"text":"This place is amazing. Between the show and brunch it is truly an experience. I am plannin","useful":0,"cool":0},"5qtREOsWoLrvTLH8QHrdJw":{"text":"Wow. This service is something to remark about. While our server was lovely - when she was","useful":0,"cool":0},"MfAmDBxVRs-SAHcO6d5JnQ":{"text":"The overall atmosphere was very nice if you are looking for that kind of experience I woul","useful":0,"cool":0},"sdEpHau6d5Wq5tt2kBsvig":{"text":"A fantastic meal starts and ends with great service.  More on that later. \n\nSolo on a Frid","useful":0,"cool":0},"7dXK5sl3qGNKhdjeyl_9cQ":{"text":"This restaurant is located inside of the W Hotel in the French Quarter. \nThe vibe is very ","useful":0,"cool":0},"12cKjzwBLXwPR82RMUnx7Q":{"text":"The Fois gras burger was very good as was the shrimp and pinches. I highly recommend both!","useful":1,"cool":0},"GCb_m7HZ5T5d2ZUNVVsTDw":{"text":"After what seems like hours of exploring, I arrived at SoBou for a much needed lunch. Plac","useful":6,"cool":3},"9UQSWD-3c03qli-zj5Dwgg":{"text":"Loved the decor, service and drinks. We visited at lunchtime and everything arrived prompt","useful":0,"cool":0},"Aljvnt-9qUVn2MlzKAnt5Q":{"text":"I went to SoBou for the last day of Coolinary, which is a month long August event in which","useful":0,"cool":0},"NGWZ22dDupTdW6PBc9aZgg":{"text":"First, the menu was not what was advertised online on their website. Second, it took five ","useful":1,"cool":0},"lP8k9E3QhL0SBNijYIV0uA":{"text":"This was my first taste of cajun food and all I can say is yum.  And a half.  I had the co","useful":1,"cool":1},"ieZZJr-4E8ULjFHogz1RZg":{"text":"Went there last night. The girl bartender was being an obnoxious bitch. My bf asked for a ","useful":0,"cool":0},"yx9ImT4-o8zycMOedlT0rw":{"text":"I may have come to SoBou on the wrong night or right after they decided to change up some ","useful":3,"cool":0},"MdztxRqnuXEogVZzW7b4Yw":{"text":"Tina was amazing!! Went here for a Bach party of 14 and never had an empty glass or stomac","useful":0,"cool":0},"bRYVkXDh1tsLsFqvBau1gg":{"text":"I called to make reservations and Darian was very pleasant to talk to over the phone. \n\nWe","useful":0,"cool":0},"uRjHZFEfwuDJarYjMOTlcA":{"text":"This is the best place in town. We ate a variety of small plate appetizers. The gumbo will","useful":0,"cool":0},"cEADRAPLKmR2X4oLGSJQ4A":{"text":"This place has a great bar and sit down restaurant with a great menu. In the heart of the ","useful":0,"cool":0},"UAR_gqPNrQOW1dgpNAGrMA":{"text":"We came for happy hour and they pointed us to the bar. The bar was full. So we mentioned s","useful":0,"cool":0},"19-9ykeMsn_0DefFp-cu1w":{"text":"I was soooo hesitant to try the yellowfin tuna cones...who would have thought ice cream an","useful":0,"cool":0},"4Gx7Igb2g7WW_ozkqNUUlQ":{"text":"Food is amazing, amazing, amazing!!!! We had gumbo and shrimp appetizer, followed by the r","useful":0,"cool":0},"pC49kByMpoLXB2j-UiLDDg":{"text":"Great place all around! Our server Perenthia took wonderful care of us for our Legs & Eggs","useful":0,"cool":0},"YYbrIX31_rq_VBEZl_QD-w":{"text":"So....boo. \n\nI haven't even left this place and I'm giving a review. Extremely slow servic","useful":1,"cool":0},"h3Xy7Sy9-s99utjF2p4R8g":{"text":"Best place EVER!!! If you are looking for a classy, delicious, best service in NOLA type o","useful":0,"cool":0},"Fb4GtCq9QNQfYmr6n6IoRA":{"text":"SoBou has been on my list for years, so I finally  decided to visit on a Friday evening. I","useful":3,"cool":2},"_fTrdqbjhkQ9dFfIbKJ44Q":{"text":"Celebrated with the besties and Reveillon dinner is AMAZING You get so much food. You will","useful":1,"cool":1},"Q6zrhI9n9FJhPE_9VPsNTg":{"text":"I wish I could give it zero stars.  The worst dining experience I have ever had in NOLA.\n\n","useful":1,"cool":0},"wSW9y7ykVLVnEquUyBHL5w":{"text":"Maître d' was polite and welcoming. Server was not confident/knowledgeable about the menu ","useful":0,"cool":0},"k3qUENgx68HCLBlv8DZBiA":{"text":"Ate here for dinner in last night in New Orleans. Very cool interior design and dimly lit ","useful":2,"cool":1},"zio3kq1cB0gg5OahtHoWhg":{"text":"Attractive, sophisticated bar and restaurant -- a respite from the French Quarter madness.","useful":1,"cool":2},"cXGVL_5Ekg6da1XDHNUNKg":{"text":"Food is ok not great. Had a table for 4 but they had a tv on which was disturbing. The wai","useful":0,"cool":0},"K_zXvqBilLNpYFVmjvcE8w":{"text":"Nestled next to the W hotel in the French Quarter, is a cute restaurant and bar with a twi","useful":3,"cool":1},"li3wa2ZrIPxckBFPR-ilNw":{"text":"This place was highly recommended by my friends when were in town visiting. We went for th","useful":1,"cool":1},"vdB9yHAUg2KvQEGZaO6ZcA":{"text":"We were in town from Chicago and found SoBou. We are very covid conscious so were happy th","useful":1,"cool":0},"tWwAu3hUegvi5AKa8NT1BA":{"text":"My boyfriend and I came on Thanksgiving night after a spot suddenly opened up on OpenTable","useful":2,"cool":3},"H9Iyrt2jcRTjScTl068cHw":{"text":"Happy Hour! Came down to the Quarter after work and popped in here to wait for the Yelp El","useful":1,"cool":0},"QfRY6b_F2qOje9MxOHUSoA":{"text":"BLESS THEIR HEARTS!  THOSE POOR SERVERS...\nThe positive energy and teamwork among the wait","useful":6,"cool":2},"inAQbkeQkM7VUO_BVgBbMw":{"text":"SoBou is a place that has run hot and cold for me over the past few years.  I went to lunc","useful":2,"cool":1},"oEVem-VZUa1xU_esVY89bA":{"text":"Service was poor, but the food was very good.\nHad a great autumn salad, very unique and di","useful":1,"cool":1},"HFhaARHoEbcbe4fDJZjQog":{"text":"I was here a couple weeks ago when we were on vacation in NOLA, primarily because I saw tu","useful":2,"cool":3},"IRUSMXhly6uhDugdCCbyPQ":{"text":"Not what I was looking for in New Orleans.   Felt like I was in New York or Chicago.   \nOr","useful":1,"cool":0},"uDRqMPaO2sqEMp2JEvxyHQ":{"text":"The atmosphere this restaurant brings you is like a romantic getaway; with great food such","useful":0,"cool":0},"eiQ9TCjVbvMwaLo8-pgevw":{"text":"Visited here with my brunch group for Legs N Eggs with the amazing Bella Blue as the Burle","useful":0,"cool":0},"YByzaDRryLRfI5YCtBCZ8g":{"text":"Loved this place, can't wait to go back. The food, cocktail, and ambience were all great.\n","useful":3,"cool":2},"-g-2QMrTq-aGBhRV9NNquQ":{"text":"Great atmosphere , food and service - recommended Sunday branch with a pleasant burlesque ","useful":0,"cool":0},"8riJHHNk-msS9hSkC1j2HQ":{"text":"I love the aesthetic of this place and how they had a wall of clear bottles with open brig","useful":2,"cool":0},"N-pERPl2I94QpOzWUTTheg":{"text":"WEBOU? EABOU? it's toward the West Bank so East of Bourbon: the name's just odd;\n3-6 PM HA","useful":4,"cool":2},"vmNmpPYJw_cqFaxKYvc1Nw":{"text":"Amazing restaurant. Decor is unique and beautiful. Server Tina was great. Food was awesome","useful":0,"cool":0},"hKDc3p2_A5VKlnEJzvx4FA":{"text":"I was super excited to try this place out after reading so many awesome reviews. Unfortuna","useful":1,"cool":1},"9rjXdiiOOCwRAQ_5pS2Row":{"text":"Went here for the burlesque brunch on a Saturday! The live jazz and burlesque dancer made ","useful":0,"cool":0},"UJcBO5fH9ALHBrHt5y8LZQ":{"text":"Terrible service. Let me start my saying that we had a reservation at 9:30. We got seated ","useful":5,"cool":0},"3rEMeL-pAzFqGHv8ZFmWxg":{"text":"People will forget what you said, people will forget what you did, but people will never f","useful":2,"cool":0},"MG35I2fqk3MWgcDOsxnugg":{"text":"Honestly one of the best brunch we had their this pass weekend ! Our server Erika was amaz","useful":0,"cool":0},"Ozd_09gjLAB5NdFWXpjYNQ":{"text":"Dined here earlier this year. The breakfast was good and our server Richard was excellent.","useful":1,"cool":0},"ExkciV9wwdSBEhTHs5i0LQ":{"text":"We loved SoBou! However, I was a little disappointed that I didn't get full. I had the Shr","useful":0,"cool":0},"8uFeFuVjIl9W6D-e3r5zxQ":{"text":"SoBou So Cute! The walls and decor of this place is hip and trendy. The host and waitress ","useful":1,"cool":1},"Ns5749VjOP3n57-TWQRXXw":{"text":"Are there better food options in Nola? Probably. Could their service been better? Definite","useful":2,"cool":1},"fegLfKgXZg9MQG5jCR9wLA":{"text":"Very nice spot. The decor and ambience are nice, the backyard outdoor seating area is pret","useful":0,"cool":0},"-CEhzsLYpOY-ws70BaRjdg":{"text":"We ate here our first night in NOLA for our anniversary trip and we loved it! Loved the mo","useful":0,"cool":1},"u3OIgunUCOItgpiE5d9dwA":{"text":"So, I went to the Burlesque Brunch at SoBou. It's advertised as \"Legs and Eggs\". There act","useful":3,"cool":2},"cFNHsfPJOnRLyXCF8u7bMA":{"text":"Promptly seated, loved the jazz band that was playing for dinner. Service and food very go","useful":0,"cool":0},"WnZ2lftjwwyBjG93Jl07Ig":{"text":"One of my favorite meals ever, yes ever, in NOLA.  I lived here for almost 9 years and vis","useful":1,"cool":0},"3zmdSoAQ4eLdEAK3dBm3qA":{"text":"Uppity restaurant that doesnt belong in the French Quarter.....I thought I was walking int","useful":2,"cool":0},"XQp_0WL6yzlnz0NANcQTNw":{"text":"We went to the Burlesque Brunch, and it was amazing! The food was so good. I started with ","useful":0,"cool":0},"joPUN_10SgZMTw7lAbQ1XQ":{"text":"I'm so sad because this restaurant was on my nola bucket list. But honestly, it was very d","useful":0,"cool":0},"op0fbzY3AZw6Qy9FBpZ6qA":{"text":"Praline beignet\nI can never eat regular beignets ever again. The flavor, the cream. It was","useful":0,"cool":0},"RlMJhndSsBWq2DOuvS6YUw":{"text":"Would go back again just for the yellow fish tuna cones! Wonderful service, maintained soc","useful":3,"cool":1},"QKwjAdFV0u7B2URgqKu1MA":{"text":"My buddy informed me when we landed in the city that there were two ways to become famous ","useful":0,"cool":0},"QH4YECnHVbjHNZ1rbwFhqg":{"text":"This was awesome.  I didn't have a bad course.  We ate in the bar at the community table. ","useful":1,"cool":0},"89ZZP4Ad_6vVACK0BK4CsA":{"text":"Cool funky place!! Has a beat of its own. This place offers little plates.  There are a co","useful":1,"cool":0},"jDevR-GEbeGbxhVL2UcpRg":{"text":"Wow, we brought some out-of-town family here for drinks and appetizers last night and we w","useful":1,"cool":2},"LoX12aRc9dDHyPjhOLaH0Q":{"text":"We stumbled upon SoBou after a jazz show on Bourbon Street and are so glad we did! We shar","useful":0,"cool":0},"0vJmborVGMbtj0xwggXfyA":{"text":"I think we caught this place on a very bad night we had a very terrible experience here. W","useful":1,"cool":0},"xfo4s3n4ilkWW9PF6EiC7w":{"text":"Was excellent. A must try the tuna cone. We also had brussels sprouts, osyters tacos and f","useful":0,"cool":0},"ggh23Z5WiA4-vMoA7ubkTA":{"text":"The food was incredible! And the ambience was really nice. It was the Best steak I've had ","useful":0,"cool":0},"lNRRtChx7xzRVUwyQZjWgw":{"text":"Such a mixed bag - we were staying at the hotel so we ate here one night and met in the ba","useful":2,"cool":0},"h1UEy6A-IWEs1mFTkcmjhA":{"text":"Very disappointed here.  Service was provided by a gentleman that smelled of smoke and did","useful":0,"cool":0},"ReYvNxFOQfGVRhw1JkhMgA":{"text":"This place was pretty interesting! I liked the food I had. The tuna cones I just had to tr","useful":2,"cool":2},"4Gf_O-NDOw8QdWReHXplgw":{"text":"My husband and I had a great date night here on a Friday night. We really enjoyed our food","useful":0,"cool":0},"zB_Ue3VhSzGbEGsy5uwI_A":{"text":"We ordered several apps + the pork chop to share and it was great. Sat at a bar table and ","useful":0,"cool":0},"rpwlOTeM2_Xrq1Q-HFP7uw":{"text":"Elegant and delicious! The bartender was amazing! He made me a custom cocktail that made m","useful":0,"cool":1},"QY9ZucBQOGvqWnRkMOnN2Q":{"text":"Used to be so good. Maybe they changed management. Food was really generic my re ent visit","useful":0,"cool":0},"tuWyDjUiY4gzjK9wJKGTMA":{"text":"It was nice to have unique tapas on our last night in NOLA instead of the typical fried se","useful":4,"cool":1},"yPO7FF_s0hUzOLbDi08q5Q":{"text":"***THERE WAS A RAT CRAWLING ACROSS THE DINING ROOM FLOOR AND THE MANAGER DID NOTHING***\n\nT","useful":6,"cool":1},"-TwkRBr6IqXgdXiG97g-qQ":{"text":"I went to SoBou with 14 ladies for a friends Bachelorette and we had the BEST time because","useful":0,"cool":0},"9OgwrXKhuVQZD2Eq3HHhWA":{"text":"We were greeted with the \"Hooch of the Day\" - a delicious combination of brandy, passion f","useful":1,"cool":0},"Lis0TF_vuk1guFCf4X5oVg":{"text":"You know when you really want to be nice but can't be cause it would be all kinda of wrong","useful":5,"cool":2},"2U4AoGw0v9ufjIskGG-25w":{"text":"I often feel like writing a letter to Ti Martin and Lally Brennan after visiting one of th","useful":2,"cool":1},"0TC2KALYqFD2GCoLSZtbwg":{"text":"A decent spot a few blocks off Bourbon Street in New Orleans. Was able to get reservations","useful":1,"cool":0},"gBHOvCn_vTP1ilPIAT9CRQ":{"text":"Really delicious updated creole / fusion. Beautiful decor, solid cocktails & wine list -- ","useful":0,"cool":0},"hYDTByCI-mDoUnkAqg9D3g":{"text":"The food was tasty but the service was awful. Our waiter was very good but 40 minutes on f","useful":0,"cool":0},"QWr7-qtM0NaXNiWqmmgF-A":{"text":"I have been dying to try this place for ages! It's attached to the W Hotel in the French Q","useful":6,"cool":0},"lNMAR5-trfJUQkyXW-C2Kw":{"text":"One of my favourite eateries in New Orleans! Pork belly...to die for. \n\nToday, I ventured ","useful":2,"cool":0},"w4pq0An28s2W-YXqMF3f0A":{"text":"This place was recommended to me by a friend from NOLA and I decided to give it a shot sin","useful":1,"cool":0},"mCWIiP_JUBBUF35CWWK9WA":{"text":"Born and raised here in the greater New Orleans area and I love to go out and eat. I love ","useful":2,"cool":1},"6YzWBpcZCQoW6fe1SCv9sQ":{"text":"Man oh man! What a disappointment this place was, the reputation & some of the reviews wer","useful":7,"cool":0},"yrUxUgW1Ao9L_wv9le0SRw":{"text":"Tried last Sunday night, around 630 no reservations, was told \"Sorry, no more walk-ins\". I","useful":0,"cool":0},"d4JBzB8-okO01Gd4eo8Smw":{"text":"Burlesque Brunch = Disappointing\nThey offer a 3-Course Brunch\n\nButtermilk Biscuit Donuts: ","useful":7,"cool":3},"mbPZ3O3qAgLPfKamgZPAlA":{"text":"Our dinner at SoBou was an up and down affair. I'll start with the Good. The place looks a","useful":0,"cool":0},"5FWKhyS7RxWfGNo-JMiy5A":{"text":"Nice place, a little pricey for the amount of food, but quality was great. Don't miss out ","useful":0,"cool":0},"pPT5iieqs42BIls080hWkw":{"text":"I was in town visiting and I had one goal in mind...dessert. Where were the best places an","useful":81,"cool":83},"4frcuLlNY0qdBgOLKRkcGQ":{"text":"Don't show up a few minutes late for your reservations because you won't get in. We called","useful":0,"cool":0},"74nT5hvcu9xNv441CiWCXw":{"text":"I'm not in the mood to even type up a negative review because the experience was so exhaus","useful":0,"cool":0},"BhQVzqjPDaHwmI_pOuOMFg":{"text":"Omg! Soooo good. Food was delicious, especially the blackened geux fish that our waitress,","useful":1,"cool":0},"4tpMoUc4UAil3Xot2hakrA":{"text":"While the food was good, the ambiance, table, service and bathroom cleanliness were a huge","useful":0,"cool":0},"LXSWOjPs47DwRvyFgUQKMg":{"text":"Wanted to love SoBou but slow service + a few complaints about the food = three stars. Tha","useful":1,"cool":0},"poZ76du5UwlUYXfL8CIatg":{"text":"If I could give this place 10 stars I would!!  Absolutely loved my experience both times!!","useful":4,"cool":3},"ymtr-znXn6b9l8IwJRzV_g":{"text":"So good! I got the sweet potato beignets w/fois gras ganache, and they were to die for. Th","useful":0,"cool":0},"sDcD7Nr3B2Y-4jYZ90m6tg":{"text":"Legs and Eggs aka Burlesque Brunch is bound to be a rowdy good time! I opted for a bottoml","useful":1,"cool":0},"PRO64wwfmKvAl4LwbLov8g":{"text":"Awesome experience. Great food. Good service. Unique presentations. Which is unexpected fr","useful":1,"cool":0},"qr6C6DMyBmbKQbADl_ASvA":{"text":"Love the ambience. \nThe Tunafin cones were def. an acquired taste. I loved, however, the a","useful":0,"cool":0},"zRjxXIU5gEzwtk-yYnxH8A":{"text":"Fish tacos and the cheeseburger were divine during my lunch visit on a recent NOLA trip! -","useful":32,"cool":29},"JwgtWBCMToIwEverRQA2_g":{"text":"Incredibly slow service, even during lunchtime when place was empty.  Took almost an hour ","useful":0,"cool":0},"pQw353Blqfw71jnVmbjXMg":{"text":"Wow.. SoBou was absolutely fantastic!! Stumbled across here for a friends birthday dinner ","useful":0,"cool":0},"a8NrbB0l3WZ2UXs8LgBkpg":{"text":"SoBu had such a beautiful ambiance and very amiable staff! Our server was very patient wit","useful":0,"cool":0},"VGsVEZoDJUWvia-sslm3TQ":{"text":"Ended up dining here because it was the only restaurant with seating in the quarter, but i","useful":1,"cool":1},"xeQ4YDvyTcDPs-KX5G-KlA":{"text":"10/10. Highly recommend.  Brandy, by far the best server. She's attentive, friendly, funny","useful":1,"cool":0},"diPDWcYycrWWkFaR9lVUjw":{"text":"Chris and Jeb are awesome!  Took my mind off the horrible customer at the hotel.  The drin","useful":0,"cool":0},"ZYiSLZ4x1myjUDDPX4kszw":{"text":"My husband and I chose this place for Christmas dinner our first time in New Orleans.  Men","useful":0,"cool":0},"5iMEKlPERJGmVkoVEL1b9A":{"text":"Beautiful atmosphere. Food was terrible. They were trying to hard to be different instead ","useful":0,"cool":3},"z4Z2P_8Sv08Do87Y0kZfOg":{"text":"Went based on good reviews tonight but I have to say it did not meet up to expectations. T","useful":2,"cool":0},"3TF2g_WZVoZMIZMDlB2RRQ":{"text":"Good ambiance and food at a reasonable price point. Great drinks. The chicken gumbo is fan","useful":0,"cool":0},"BhEYvvw9kxfLpCJ5LoqGkw":{"text":"They say you never forget your first... And I shan't forget my first meal in NOLA. Yes, it","useful":10,"cool":13},"EVo4f1fb310KUwUt2FWf6Q":{"text":"Went for Christmas lunch- good experience. Small plates as well as large plate options. Su","useful":3,"cool":1},"Hoj3Yxd0jonmS_bftqPsQg":{"text":"My husband and I came here for dinner in Halloween because of the good reviews it's receiv","useful":1,"cool":0},"HaROORPBmi1c2vkUeXZUrg":{"text":"I was recently in town for a conference with some colleagues. We stopped at SoBou for a qu","useful":0,"cool":0},"pe8vHEVM9obw-nXLRsQ_NQ":{"text":"We came here after I read that this place was the sister of Commander's Palace. Prices are","useful":0,"cool":1},"SMgFRrdqfFcCweKk_GmCkA":{"text":"Our experience at SoBou started out a little rocky.  We weren't handed drink menus and whe","useful":0,"cool":1},"eWMbm7stCBId4gAvG-wbTw":{"text":"Candice was amazing we went there one day and had to go back a second time for her. The fo","useful":0,"cool":0},"LLE8sOhqC8lqVz2XCnpVqg":{"text":"Amazing food with just as amazing service! Came here with my girlfriends for a nice and fa","useful":1,"cool":1},"x04y0WwTKSwA6PhKdC3K0g":{"text":"I thought that I had written a review but I guess not. This comes after 2 trips earlier th","useful":0,"cool":0},"CfFmdjae4i-P2r57rFTfKg":{"text":"We went to SoBou for the burlesque brunch and our group really enjoyed it.  The wait staff","useful":0,"cool":0},"T16i_q3YGAgbM45lnj7V6w":{"text":"This was sort of a last minute dinner choice for me and my family, so we already were a li","useful":0,"cool":0},"X-fHgBow4d9VRg08wp6uvA":{"text":"Go for the burlesque show, get a drink skip the food. It's a 2 menu breakfast menu so an a","useful":0,"cool":0},"Ny4k5QjkN81pqr89hDey2g":{"text":"Nothing wrong, but trying too hard to be edgy and weird. Had a decent lunch. Fun drinks.","useful":0,"cool":0},"7CYt0Kpdn6PgvmHYYyOM_w":{"text":"It was my moms birthday and we were disappointed from our visit. We were excited to try th","useful":1,"cool":0},"rHchrN6gN6DpUU1XaQBGZg":{"text":"Went here late night for some snacks! We just ordered 2 things. The Duck and Sweet Potato ","useful":1,"cool":0},"_OxxkNJRWzHMMJiZb0JGqA":{"text":"Went here after a long day of work for cocktails and tapas with a friend. They definitely ","useful":2,"cool":1},"opt9tooC5Jgjdcc2dLBc0A":{"text":"Absolutely fantastic.\nThe head bartender made me an off menu drink based on my drink prefe","useful":1,"cool":1},"x8PuFmFxOrBefimBjxqgZg":{"text":"Pre game meal before Baylor won the Sugar Bowl game!  Good service, food was on point for ","useful":0,"cool":0},"290kEQBxSuGvOAXULr3pkg":{"text":"Where do I start. I am sure our waiter was 12 and it was past her bed time. It was a girls","useful":0,"cool":0},"E1aNx0jCN-fx3slv7D-sGw":{"text":"It's been a few years since I'd been in, but SoBou still ranks near the top on the  \"chic ","useful":19,"cool":18},"XhLoW4nNToqk8DilwY8S4w":{"text":"We have hit and miss experience in New Orleans, and SoBou was a huge miss. Mediocre menu, ","useful":0,"cool":0},"-f74ZQ4fjijIDm_0wvWn9A":{"text":"What a great little find! The small plates, large plates, dessert, wine, cocktails, servic","useful":1,"cool":0},"5XfsD6lGzmw4Py8ccGI5Qg":{"text":"My girlfriend and I were so excited to come here because of all the reviews. We walk in at","useful":0,"cool":0},"YisZAOI9EBOjT4YGgkvKMw":{"text":"Food was delicious. Service was not good. Errors on drinks, food did not come out at the s","useful":0,"cool":0},"UDmy7ceq0sC0ANoXeevZvQ":{"text":"This place is very creative with their meals. I highly recommend the avocado/ceviche ice c","useful":1,"cool":0},"hzHqxKhNhSJuhPJS5yowuw":{"text":"I would like to give a compliment to our server Dominique.  During me and my friend's visi","useful":0,"cool":0},"-7UYRYqkI_2QYDffjF5RwA":{"text":"Unique, specialized menu that caters to the slightly-more-adventurous eater. \nWe came to S","useful":1,"cool":1},"Y5_ar4vP4yOhBJ9XKXsQ_A":{"text":"We wandered into SoBou on my birthday because we were too tired to deal with trekking to t","useful":3,"cool":2},"jrCnSrI8oCIlWFQmEKREtg":{"text":"Nice dark roux with a deep flavor. More of a soup, with a few, but great bits of chicken a","useful":0,"cool":0},"S9sPniBdpurFj5jVfVco1Q":{"text":"We went there for Christmas Eve dinner.\nThe menu options were very limited. The food was t","useful":1,"cool":1},"p8B6zbWqYH6bZBvHtQRjgA":{"text":"Our small group of 3 came here during a girls weekend. Every drag show we tried was cancel","useful":0,"cool":0},"8Xf2YdwXJaYlpMrG5zpkMw":{"text":"Incredibly slow service, even during lunchtime when place was empty.  Took almost an hour ","useful":0,"cool":0},"vo8gxn_ue4LlEeHA-riPvw":{"text":"The week before my conference, I called the restaurant to make a reservation for a group 1","useful":0,"cool":0},"yED6S2C2PxFBXRTwLHbGlQ":{"text":"The place is beautiful. The bartender named Hunter is amazing. He made me the best Old Fas","useful":1,"cool":0},"dhBp5NFChElUyY22G652AA":{"text":"I'm only giving it 3 stars for posterity's sake, because it really deserves a 1. SoBou use","useful":1,"cool":0},"3kWRxbqLtXLs1inEEyQAJA":{"text":"Ugh.   This review is for delivery. But this order was so disappointing.  Shrimp and Tasso","useful":0,"cool":0},"q6Lqpn1Zx0cDEScOY6VqKw":{"text":"I had another memorable meal in New Orleans, this time at SoBou. I had the two course Chef","useful":1,"cool":1},"5cc7j7cxr6QL0YZ3Q57vRg":{"text":"The short ribs are insanely good.  I would eat this every meal for the rest of my life.","useful":0,"cool":0},"cdNQR7uzaY1KflKeojMC6Q":{"text":"The second picture on the SoBou yelp page of the strawberry shortcake mocktail hooked us i","useful":14,"cool":14},"XEl_Aw_xKKD4NRk-DCSk3Q":{"text":"Can't say nothing bad about anything here. It was a cool evening and they got us a table w","useful":0,"cool":0},"F9hH_JBdLQxaEdGGAD7lZg":{"text":"This restaurant has some of the most unique food that you will find in New Orleans, and I ","useful":2,"cool":1},"MB8H6EHeVj1RMdib9zR53w":{"text":"Their Gumbo is unlike anything you can find. A must try! The presentation and service comp","useful":0,"cool":1},"kY20SmdEwxhbdKXROKwfSg":{"text":"I came here today for the burlesque brunch. I took my aunt and she definitely wasn't expec","useful":9,"cool":9},"hqF5-wEPqja9ok3iB11jMw":{"text":"I enjoyed a long lunch at Sobou on Ash Wednesday.  Sobou had been on my bucket list for si","useful":0,"cool":0},"Xr6cQyEoXdTGx_UGr3ii9A":{"text":"Cod was delicious, customer service was excellent! I just suggest the waiters still wear m","useful":0,"cool":0},"w7BZmPzaI4PycHK_FE71aQ":{"text":"Commanders Palace has long been the dominant name in NOLA restaurants, so the opening of a","useful":1,"cool":2},"UK0qQPsllynF5RKx-CJ1rw":{"text":"I was pretty disappointed with my meal here on Valentine's. I ordered the Duck beignets an","useful":1,"cool":0},"uNDHf9O2GcO00uPVDpY-Jw":{"text":"I love this place! I can't help it but every time I'm in NOLA I try to catch the Burlesque","useful":0,"cool":0},"Lv0vBT7by0R_9Nv3sw_XvA":{"text":"Stopped by the bar for a quick drink and dessert. The place is very modern and sleek, love","useful":1,"cool":1},"tTPLrwvDlSRdcKvqOh25_w":{"text":"In a city full of amazing food SoBou is a standout restaurant in my opinion.  My wife and ","useful":1,"cool":0},"Bbm-4sok02YN5wXUozxPfg":{"text":"Came here on a whim.  We were hungry and it was getting late in the afternoon.  Great AC b","useful":1,"cool":2},"iv2rtyYyGC0sSASgRdEB-w":{"text":"Came here for dinner on Halloween night with a friend to celebrate her birthday. We made r","useful":3,"cool":0},"BxE0_jY0oCkf8AGKsdYF2g":{"text":"One star for service, one star for atmosphere. Nothing else was good. The food was very ov","useful":2,"cool":0},"Db38BCq9rerfYm356utMMg":{"text":"Let me start by saying that their alcohol policy is strongly enforced. My little sister is","useful":1,"cool":0},"e1WxvUdyGSbBibBquI9bXA":{"text":"OHHHH SoBou... this was truly the perfect first meal in New Orleans. \n\nThe menu is tremend","useful":8,"cool":6},"3H_Ismk213jut38YHYAt9g":{"text":"Great spot for sharing New Orleans style tapas small plates and handcrafted cocktails!!  T","useful":2,"cool":2},"TvyPhqrkJsXUyei4O9eLcw":{"text":"We had reservations here for Christmas Day Reveillon Dinner. It was supposed to be a 4 cou","useful":0,"cool":0},"xEeuE7Fdp2hD5yyJlWJktg":{"text":"*******4.5*******\nI found this restaurant thanks to the N.O. yelp elite page...I made 7pm ","useful":1,"cool":1},"QWSLgLyXm6y4DudTBHJ37Q":{"text":"The food was not good. I ordered the fish and it was way over cooked. It had no flavor wha","useful":1,"cool":0},"yOm44-eCTg5INYQKilmcwQ":{"text":"I came here with the recommendation from a local. The food was delicious ( Brussels sprout","useful":1,"cool":0},"wKrQXwy7QhzOK6zIuMsf3g":{"text":"Stopped in because Justine was closing and they recommended. Service at the bar was great,","useful":1,"cool":1},"SwW9OyJAnyadx3_tykYPnA":{"text":"We met some friends here for brunch- had reservations at 9:15 for 8. Part of our party was","useful":1,"cool":0},"y8KUE5HsyF2ETHNAN9ePAw":{"text":"Just came back from dinner here, and we had such a great night. The service was absolutely","useful":1,"cool":1}}