{"5qMscQxw9KBtUPIKJTzlBw":{"text":"Found this place on Instagram and have been curious about it for a while. I love that you ","useful":0,"cool":0},"4cPuCMaxWC0nmGZesf9AvA":{"text":"Crazy! That place really feels like an urban market. Different food stands provide you wit","useful":1,"cool":0},"YPdw2pFh249_LjpxN_vUgA":{"text":"I love everything about this place! The food, the cocktails, the people, I could spend all","useful":0,"cool":0},"klpiA9GV8NRPwvfKwARTLA":{"text":"Ate at Elysian Seafood. I ordered the seafood tower. It was very delicious and fresh. The ","useful":1,"cool":0},"2Rwl0Vf5eil-9IPEe0HpUA":{"text":"Good food at this restaurant incubator and building redevelopment in the Bywater neighborh","useful":2,"cool":4},"Y44myotBKXJPTUZZjwFVvw":{"text":"I freaking love this please! The fact that it has several stations with unique foods is ou","useful":0,"cool":0},"BMb0UCHOIRnOt-xJ_oDx-g":{"text":"Really beautiful inside.  Wasn't very crowded for lunch...had plenty of people, but not su","useful":1,"cool":0},"9KtmBEITjxVlGhqO6iPlsQ":{"text":"I've eaten there twice. Lots of selections and all the vendors are very friendly. Both tim","useful":0,"cool":0},"RgpEyHhitzSuI53IVxCMuA":{"text":"Lots of variety at reasonable prices. Wonderful atmosphere. Full bar with GREAT spicy bloo","useful":0,"cool":0},"DhySITjdN3dMYWEPrUqBMA":{"text":"This reminds me of Anaheim Packing District. Hipster place located randomly in the neighbo","useful":0,"cool":0},"kfUxdaSma6a08dBKrPGg4Q":{"text":"This place is super great. Even though the ventilation is terrible, the food is delicious ","useful":0,"cool":0},"TRVJCCxiJnRom_usxBnTkA":{"text":"Awesome food, local produce and other ingredients, really strong drinks, amazing tempura s","useful":1,"cool":0},"NtPooQELffj1Vf4cB9sXyA":{"text":"Loved the atmosphere and the food was delicious. We had Juice Nola, Lagos and koreole. Eve","useful":1,"cool":1},"3-ZFbFE1haTzbOyZIofkXg":{"text":"The market is super cute! We came on the recommendation from our friend, who compared it t","useful":0,"cool":0},"MN8Pmd5RCXpfzwQmUsSGFw":{"text":"Ate at the Haitian Restaurant in here. I love the concept of the place. Take the whole par","useful":0,"cool":0},"LmW0eka8LkE1DQcnHNLmsw":{"text":"Wish had more to offer...didn't feel safe walking in the street close by.","useful":0,"cool":0},"1ZhDb9QDkbmQBq-YPFs7-g":{"text":"Loved this place. Fairly easy to park. Crowded, naturally, but still easy to navigate and ","useful":0,"cool":0},"zFKiSVTj8UXYH1U1G0BDPg":{"text":"St Roch Market is spot on! It's definitely something to try -- they have awesome food vend","useful":0,"cool":0},"sqbCm-8Z67TfBQ6sQDOclA":{"text":"Me and my fiancé came here for a weekend trip. At the urging of our uber driver we headed ","useful":0,"cool":0},"GLbXO75zTCaUkgdid02jdQ":{"text":"Lots of interesting options, but you need to find the one place that serves red beans & ri","useful":0,"cool":1},"zwy5HvfEMEvcROEwozWBpQ":{"text":"This place is GREATTTT. You walk in and it's like a food court, but way cooler. You have s","useful":0,"cool":0},"WGBGZ69WWr4ms6C33-FVUQ":{"text":"We made a pit stop here to grab a quick snack and recharge from our excursion out to the f","useful":0,"cool":0},"6ryV6biwZ7-lPoKWfA1JEQ":{"text":"This review is mostly for Coast Roast as that's where we've been hitting for cold brew eve","useful":0,"cool":0},"-Be3YAy7L3zx0xz0mfSrlg":{"text":"Yes, this is an overpriced, hipster place....so, take it for what it is and enjoy it (if y","useful":3,"cool":0},"a2li5Wz6WH1XIf5PAMXjkg":{"text":"A collection of vendors inside a marketplace. Some are good and some are not so good. I re","useful":0,"cool":0},"jFCXs5WztJUbCw_1kFfTKA":{"text":"Cool concept, when you walk in it's bright, clean, and inviting. There are multiple vendor","useful":4,"cool":2},"1wpi1DDTclbqnP81eZDgVw":{"text":"An oasis in the middle of an industrial neighborhood where you can consistently find a yum","useful":0,"cool":0},"2hJIziUdum696lstLb17DA":{"text":"Great place to go to try a bunch of different food. We had the oysters, gumbo, and bao bun","useful":0,"cool":0},"-arXbAwhRMl6dURRJ5U9Cw":{"text":"Love this place! It's in old building that was renovated a few years ago so has character ","useful":1,"cool":0},"CX1zL7GS4fshCne7kLMx2Q":{"text":"Very cute place! Lots of different things to try. From a coffee shop, Mexican food, New Or","useful":0,"cool":0},"ZJmSGI5Eprml8ex8DfMiUQ":{"text":"Check this place out!!! All the vendors are ridiculously on point. I actually wound up wal","useful":0,"cool":0},"WSac0kv-hDp2bPjpvFgtsw":{"text":"We were seeking out something different for lunch prior to our friends catching a flight b","useful":0,"cool":1},"OaPaHXVRh18h5sDJm1GIog":{"text":"Went here twice during my stay, and I'm so glad I did. If you're in the area definitely st","useful":1,"cool":0},"y0VCHlY4HskD2YiMJ8Xkjw":{"text":"Great market that gave an amazing feel for NOLA. Went with a group of friends and we were ","useful":0,"cool":0},"Wt7xYTef8t2SpyZGbcop-Q":{"text":"Love the concept, appreciate the variety. Some dishes are pricey but it's prepared pretty ","useful":0,"cool":0},"jzFuSBkOdSuATdVFjj-9MA":{"text":"Busy, packed and nice place for a variety of good food.\nWe enjoyed all the dishes we had. ","useful":1,"cool":0},"zg048wO5KkpQGMNGzo4HFw":{"text":"Visited the market yesterday. Very cool setup with almost a dozen food places and a cool b","useful":0,"cool":1},"x3Y5RdYjt5zCcDwvx8fYAw":{"text":"Very pleased with tonight's choice.  I'm not sure how I heard about this place but I made ","useful":0,"cool":0},"m2aphiOGkMe7t1sLt7HL9Q":{"text":"It's really a food hall or food court, not so much a market. We had food from the King Cre","useful":0,"cool":0},"HoePAa4K-SlwkTdL5_W3hw":{"text":"French toasted filled with Nutella? Oh yeah, it was absolutely delicious. If you are in Ne","useful":0,"cool":0},"eB4epX8WE5l7tp5rcKOTrA":{"text":"We came in town for a weekend vacation to try some good food. If you have a group of peopl","useful":0,"cool":0},"LvzvQeA2EuUw9fLd_0Vzxg":{"text":"I ate here every day for lunch (and sometimes dinner, too) when I first moved to New Orlea","useful":0,"cool":0},"MBQOOT_SGmwI8Asrm_nphw":{"text":"Stunning, modern, upscale food court-style eatery. Tried plates from three of the restaura","useful":1,"cool":1},"I8SYlACW0Eyzpon8uhaSCA":{"text":"Came here with family for lunch. It's a good place for a group with different tastes. Ever","useful":0,"cool":0},"k70o4ixkSTf2poT7_OjhKQ":{"text":"I have been counting down to the opening of the market for over a year, and had the highes","useful":12,"cool":1},"TnXeoo9hv-V8mSa90GOmRA":{"text":"The space is beautiful, clean and welcoming. \nIt could be likened to a fancy food court.\nU","useful":2,"cool":2},"SlEmJ2PeffLKbRG60WLHvA":{"text":"This place is amazing! Loved the atmosphere and interior. We tried the cauliflower salad a","useful":0,"cool":1},"1Q7MAW2dU00IQsnErb8Y9Q":{"text":",I love this place everything in here is pristine, different, and cool. The food is really","useful":0,"cool":0},"0Mh6Ruw1fFjVP2-aCaqA7g":{"text":"Great variety of authentic cuisine in a neat part of the city.  Had some raw oysters and s","useful":0,"cool":0},"wYfL1kY7uZTTpZOLn2a4PQ":{"text":"I take my friends from out of town here, I'm sad the BBQ place closed. Hard to get seating","useful":0,"cool":0},"UMBK0oatQ8fQ_I8TAwdTFQ":{"text":"Go to king creole and get their trio. I could eat it every single day! The red beans are i","useful":0,"cool":0},"KyEPoS-NALoWxLnbDLAvYw":{"text":"Great way to try some local fare without the touristy vibe of many places in the French Qu","useful":1,"cool":0},"PxivnO5w84mUU7BZIhtrSw":{"text":"I dunno. I don't get it. Sure people who live far away may think this place is ruining the","useful":11,"cool":3},"KtymZb0-dnpdYA_cW10TKQ":{"text":"you really should change your name to food court.   \nI am so glad tourists have someplace ","useful":16,"cool":6},"7_bd4srduPYQ-FvPxp_6pQ":{"text":"Great experience in NOLA. Wonderful selection of eats. Highly recommend the \"good bird\"","useful":1,"cool":0},"DJaIHYJFW8xfFXPR7u6tdA":{"text":"If you're in the area, this is a great spot to check out and try a variety of foods. This ","useful":1,"cool":0},"qspCfknm1VgHM6e5oGuLuQ":{"text":"We come to New Orleans every couple months and never miss a meal at St Roch. Literally eve","useful":0,"cool":0},"zbknoLFpYJFM8teJKnxM5Q":{"text":"The new Oysters at Elysian is horrible. Dirty hands, shells in the oysters, inedible.","useful":2,"cool":0},"LEKc4bTqYbK12JWTjmBblQ":{"text":"Nice concept. Food was good but small portions and pricey. It was very crowded the day I w","useful":0,"cool":0},"R41fXmRWQDS4FllF3weZJQ":{"text":"St. Roch Market is a clean, bright, hip eatery with several food vendors - think fancy foo","useful":2,"cool":0},"Kvsbcs1iBz8NK8xo416FEQ":{"text":"-i think everyone who works here needs to work on customer service EXCEPT the waitstaff.\n-","useful":2,"cool":1},"vltLzYiMgwxz-1lflO5YEQ":{"text":"Great place to go anytime; they have some great vendors and they all have quality food.  A","useful":0,"cool":1},"w8JtaVWCtJFGKFSBDrcjMg":{"text":"The fastest service I have ever had at any restaurant. The people are cheerful and the atm","useful":0,"cool":0},"zaGKvvJBuOmvOArRYLcy9A":{"text":"I went here for dinner with a small group and it was amazing.\nThe Mediterranean stand was ","useful":0,"cool":0},"DgTdn73FTY-Gn7N_6RJu-Q":{"text":"There is something for basically everyone here!\n\nThe set up is a bunch of different restau","useful":3,"cool":0},"HOZlOyHn4F_NsRxn5xwpcg":{"text":"People love to hate this place, mostly because New Orleans hates change, and this is the m","useful":0,"cool":0},"qvkuqQ4P1uYedpP1VqBAnQ":{"text":"The place is nice and trendy. That's all about it. On the other hand:\nEverything is so ove","useful":9,"cool":0},"nCy6m5taNmdfMdYFSsWyvw":{"text":"omg! I could eat here everyday. There is no question where you want to go if you are near ","useful":0,"cool":0},"IxKrkzKVG-WX2TuX2182BQ":{"text":"Visiting from San Francisco and unfortunately didn't have a chance to try this place until","useful":1,"cool":0},"xXWGW6LgEbnu5GZP7fcTWA":{"text":"Definitely one of the highlights of my visit to New Orleans. It's a little bit off the bea","useful":0,"cool":0},"PhubFNsVLjoIiJGHtKSx8A":{"text":"I've been here for happy hour and dinner a few times. It is a great concept and I've had a","useful":0,"cool":0},"MSy61TYdy-rLSDyhFmlkKw":{"text":"An amazing collection of small counters in the middle of the very cool Marigny neighborhoo","useful":0,"cool":0},"6Z7gmKBUkKmL4PcwtDacOA":{"text":"I was really disappointed after trying St Roch Market for the first time today. This was s","useful":3,"cool":0},"Hce-yA0CtJQVTvTrG3qROQ":{"text":"This is a cool concept in a really great old building - check out the old pics near the re","useful":0,"cool":0},"6DhIWRH3n78WN1pWVuKzbg":{"text":"Beautiful, naturally lit, and tasty. Definitely try the elote. It's delicious. But, there'","useful":1,"cool":0},"A1NqYZFWe97qI2P1oR7Ruw":{"text":"Let me first say that, living in St. Roch, this place has caused a lot of hard feelings.  ","useful":4,"cool":0},"m7VWVQ7-uPkiQKskpPHFbw":{"text":"After seeing the reviews and checking out the website, I imagined this as another \"Oxbow M","useful":6,"cool":1},"PQykhjyNGzkL5mYyBg7jbA":{"text":"This a great market. Beautiful architecture and atmosphere. Lots of great options and pric","useful":0,"cool":0},"7n-SqkKBMcCUpWbIV6cNsQ":{"text":"St Roch was a great little night out! Loved the concept of multiple options. I had the cra","useful":0,"cool":0},"DJc49daf_o2EEcgU6eiB0g":{"text":"Amazing Haitian food! Love the trendy vibe and mixed selection here. It's affordable and a","useful":0,"cool":0},"al76IxwHsZbFMYoLdt54ng":{"text":"This place is amazing! They have multiple vendors selling awesome food. I had the coconut ","useful":0,"cool":1},"FBzPmkODMsUD_nlnyQaGfA":{"text":"I love that we have so many options available here. I've only been here twice, but I liked","useful":1,"cool":1},"G6fJTiKRs9MxV_IcAl29JA":{"text":"Excellent quality and variety of food. The style of the eatery is reminiscent of a variety","useful":0,"cool":0},"S5b7-zzK8cQY9BeywPLhng":{"text":"Ate at Koreole place and thoroughly enjoyed the food.  NOLA has certainly been missing a K","useful":3,"cool":1},"jQ8ff87yzaqa3cEttecmcg":{"text":"This place is not for everyone. Not kid friendly and service is a one man camp around here","useful":0,"cool":0},"mrItxDi6g9v_h_QJAGCMGg":{"text":"St roch has been our go to for meals while working here in LA. They open early for breakfa","useful":0,"cool":0},"LGi_vLVzxg7w-lSAuywuvA":{"text":"I love this place! History and good food! Lots of selections for the undecided. Good drink","useful":0,"cool":1},"-w1WprVHWoxOFr6U9TvdRA":{"text":"The choices are astronomical !! \nVery clean. The proprietors were SUPER friendly and helpf","useful":0,"cool":0},"T4YCWqgKtyZ91x0MN-SnYQ":{"text":"An absolutely disgusting exploitation - that's the only thing that comes to mind.\nExhibit ","useful":11,"cool":3},"6nUENHauU3C6JsEfHNojEg":{"text":"Atmosphere is great. Works well for a bigger party as everyone has their own choice of foo","useful":0,"cool":0},"mcMvAOxyx4qYnzRjBO6vTA":{"text":"So much to choose from! I've eaten from numerous spots in the Market, none of them let me ","useful":0,"cool":0},"HLtSFeBvIml4ZZnwIbQXwg":{"text":"This place is amazing!  Too often, food markets like this have the same type of food in ea","useful":2,"cool":0},"tktIjFXQBBtnZdD0A-E2nA":{"text":"Great small market with a little of everything... Organic, bakery, seafood, meat, coffee a","useful":0,"cool":0},"tqN_v1t6qGWLfuGWfndzCg":{"text":"Fun to visit and grab lunch... quality... could've been better... cute to check out .. we ","useful":2,"cool":0},"stbDBV_5qJ2uDY9bN4e2Cg":{"text":"Love this place on St Claude.  It is a food court of sorts. Very healthy fresh options for","useful":0,"cool":0},"M-wUpBzgBzHnYzGfRkIAIw":{"text":"Love this place! Everything you need. Great people. Great place to meet up, study, do work","useful":0,"cool":0},"1s5oyHOVVPswNdNH9VLbsw":{"text":"What a gem! We found this place near our Airbnb and I wish I found it the first day. The f","useful":0,"cool":0},"7GxVbDzD4H5Y6zQiaHuUbQ":{"text":"I was disappointed by St. Roch Market. I love the concept but the execution felt too force","useful":1,"cool":0},"obuj9NA_bmf_WkFLbxcC2g":{"text":"The selection looks wonderful. Lots of tasty options. TIP: even though it says 7 days a we","useful":0,"cool":0},"-I611GJ2FnKBkS8HC3XsCQ":{"text":"St roch market is beautiful to walk into and delightful to look at all the menus from diff","useful":0,"cool":1},"__AzQkr1yrPif15M4j1ezQ":{"text":"I highly recommend St. Roch Market. I ate the Elysian BBQ Shrimp Poboy, and It was delicio","useful":0,"cool":0},"E2ZzDMBoJrA47Dppdf4EiA":{"text":"I'm happy with the variety of this place.  Its like 10 unique food trucks with a bar and k","useful":1,"cool":0},"DAEP4raDKTb2bpNeuX7jLw":{"text":"Pros: variety of food vendors to choose from, very Instagramable atmosphere, it's close to","useful":0,"cool":0},"gvBrjCVjeNl-genXr8_2dA":{"text":"Went to St. Rich Market for Sunday brunch.  The atmosphere is friendly and the personnel g","useful":0,"cool":0},"tFXmt2z2gjhVKe55KWPmgw":{"text":"Such an awesome addition to this area of the city! It reminds me of a smaller version of A","useful":1,"cool":0},"FffWsaS5uJQYOQnogTJ8jg":{"text":"Forget the negativity.... I'm a local and have been for years. The whole concept of the ma","useful":5,"cool":2},"3bgpSxL6PRABhCDpdXIK_A":{"text":"I have been wanting to go to St Roch for the longest time and have been begging Novio to t","useful":0,"cool":0},"A999MViiG-btZx54DXm_1Q":{"text":"Perfect pre dinner spot for gulf coast oysters and drinks. Happy Hours all around. I imagi","useful":0,"cool":0},"4Tm3XYSF4-_Hd_LVwce-UA":{"text":"Great place for breakfast, lunch or dinner may options. Great place for breakfast, lunch o","useful":1,"cool":0},"C8OT_A4sxGhosJy6m18S7A":{"text":"Very nice market . The building is incredible, charming place for a lunch break. very tast","useful":0,"cool":0},"qEyyQnf-usELwsqCGPoBaA":{"text":"My bf, drew, and I got here pretty early on a Monday so it wasn't really crowded. The inte","useful":0,"cool":0},"biRzIChoSLJXtKrcCUe8JA":{"text":"This place was our staple during vacation in NOLA.  All the places were outstanding.  Food","useful":0,"cool":0},"29lgJj6U295_7j7jXMuBNw":{"text":"Cute dining hall with lots of great food options and parking nearby. Husband enjoyed the o","useful":0,"cool":0},"TR_okJHvITteYByc_U1xnQ":{"text":"I think the vendors are doing their thing and a lot of the food is good.  I like the casua","useful":0,"cool":0},"ORqJLkuh4OHQUbc7Jx7c-g":{"text":"I love the idea of this place. The renovation is beautiful. There is plenty of seating, es","useful":1,"cool":1},"yRjqUF7Ai-vqgLVzO-E6xg":{"text":"Soooooo much delicious food surrounds you at St. Roch! Pick your poison and revel in every","useful":0,"cool":0},"Ps86C7z3Yyk7H4LPr2MahQ":{"text":"This a great place to go when you can't decide what you want to eat. It's also helpful whe","useful":0,"cool":0},"dH7JA_lufFiSBJQ-GIJ_Lg":{"text":"Wow, what a great find for interesting, unique, fusion food in New Orleans. This is a do a","useful":0,"cool":0},"AsKO5_56TZWeT07uPDnusg":{"text":"My appreciation for St. Roch basically stems from the fact that they have a lil bit of eve","useful":0,"cool":0},"CqP0ZLLrjCJ8peGUrFe1yg":{"text":"Calling this place a diamond in the rough is an understatement. A quaint market in a not s","useful":0,"cool":0},"PGZRiEP_h3KhCb267wqbJg":{"text":"My friends took me here when I came to visit and I loved it. This place has been hyped up ","useful":1,"cool":1},"COU07271xgf2LcS1r9Rk_Q":{"text":"I love the variety of food available here. There's vegan, vegetarian, creole, latin and or","useful":0,"cool":0},"ED5uXS62HORSXU8WCdqUyQ":{"text":"I love this concept. Everything I tried was delicious. It was a very cool atmosphere and t","useful":0,"cool":0},"OGUK8DeyTTR5NaJB8xLhDw":{"text":"I'm not a NOLA native, so I'm not about to give any insight on if I think the taxpayers' m","useful":6,"cool":0},"r7-2JaJfa1h2GNjurVW_UA":{"text":"My review was removed because it didn't include a substantive consumer experience. Well he","useful":12,"cool":2},"ktyCaFxbsuJ0-HQcLYOTkg":{"text":"We found this place on the last day in NOLA by chance, and it did not disappoint. We showe","useful":2,"cool":1},"TuM0vLbHfrQs3KpNTIJI1w":{"text":"Very cool, upscale food court concept. All local vendors. So unique. We had coffee and des","useful":1,"cool":0},"afwmNVyzVU04tV9zRoRBYw":{"text":"The oysters at Elysian Oyster Bar were gorgeous. At $15/dozen for gulf oysters, they're a ","useful":0,"cool":0},"DTJsdRCXrlCqH__95543zQ":{"text":"I think the market is cute but The Sweet Spot is missing sweetness.  I tried the strawberr","useful":1,"cool":0},"8w5Ebqid4Z9mQxSXKBFVYw":{"text":"Pretty cool place.  About a dozen vendors inside selling food and drinks.  I stopped there","useful":0,"cool":0},"D_shxF_D_Ir69glkzKwPNQ":{"text":"I had a great time here with some friends! Upon walking it, it looked very nice and bright","useful":5,"cool":2},"hJeIeIiwi9Qmv8iKTjqGDg":{"text":"Gentrifying unaffordable food in a space that use to be a fish market for Black New Orlean","useful":1,"cool":0},"jWF9LTH_Y3Ya7Y1LAVb19A":{"text":"16 different venders/food booth. It's a like its own food court building! Glad they have s","useful":2,"cool":1},"UPwpsdoi8xtp7DrLTQnRMA":{"text":"What's not to love about this super adorable \"market\"? Trendy, chic, delightful. Don't exp","useful":4,"cool":4},"wu8WkTM4kScIAL-_tPbOjQ":{"text":"This market was a dream! We are there everyday for snacks,breakfast or lunch and we're ver","useful":1,"cool":0},"SDIM2Vd6ZEfeKIMeOghMzg":{"text":"The atmosphere here is so lively. A great place to socialize and eat delicious food! Defin","useful":0,"cool":0},"JGL7F4Mx0cIeDxPpHcjqfg":{"text":"Social issues aside, it's a great place to spend an afternoon.  Beautiful market with lots","useful":0,"cool":0},"q6rh69yzcpYUtglWq6zB2A":{"text":"A great food hall, wonderful service, and you can get everything you need in one spot. I o","useful":1,"cool":0},"9ry7k84TeB35W9HuS2J64A":{"text":"I love this little market.  It's a long building bursting with independent little vendors.","useful":2,"cool":1},"yOiHmRVTWM8sB16a-BBzOA":{"text":"We visited NOLA and stayed in St. Roch and this was one of the best discoveries of our sho","useful":2,"cool":0},"JhfYI0D8cmMTiFzWXNheOQ":{"text":"Overrated and overpriced in the wrong location.\nBagel and lox $9\nBibimbap bowl $11\n20oz co","useful":11,"cool":6},"X7GQ7ZBHjivfHCzDSLcUdw":{"text":"This is my absolute favorite place to go when I'm home. I go in one direction and my mom g","useful":0,"cool":0},"JyknK_NyZHxt8XRaHwOP6Q":{"text":"New-feeling spot catering to the hipster crowd, so it's missing that old New Orleans charm","useful":0,"cool":0},"Sgpmu3lHmKtPmEKM0pqeww":{"text":"This place is a great restaurant with tons of options. I know some people are not into the","useful":0,"cool":0},"QCL6CIswUQ9mATP66LZZQw":{"text":"It's a lovely place to visit even the prices is little bit on the high end, the waiting ti","useful":0,"cool":0},"iK1jq_3g1_5LSM0pHvhuFA":{"text":"A must stop when your just turning a few corners in New Orleans looking for a variety of f","useful":1,"cool":1},"O3OxULYN8uXq8oUKcvjMhA":{"text":"One of my favorite places to bring people from out of town. Very nice clean and open atmos","useful":0,"cool":0},"Up4Wn2L84Qc7dEePytYEXw":{"text":"What a great find. I'm visiting Nola and looking for healthier options, a friend recommend","useful":1,"cool":0},"6F2burMK8BBComrzdglIlg":{"text":"Oh my goodness! So thankful my daughter wanted to try this place! A large variety of delic","useful":0,"cool":0},"TBo-tVmP-KR4qadullqr-g":{"text":"This place perfect for people that can't decide what they want to eat which is often the c","useful":2,"cool":1},"ujCs6SLDZkiUt02OCoRyBw":{"text":"My favorite destination in New Orleans. Wish I had one in my neck of the woods.\nI love the","useful":2,"cool":0},"8DuQjKy9uZIyQ1x3UsdMhA":{"text":"Your food is pretty good, I like the variety, some of the food is a little too salty, and ","useful":0,"cool":0},"Ds9ArymKlbTWxXl5y72uWg":{"text":"There's no better way to expand your food horizons with one trip to the St. Roch market. W","useful":0,"cool":0},"C9x2BEJz76SE3zPyidOJvw":{"text":"The oyster bar at Elysian seafood was good but a lot of the vendors that we had come to tr","useful":0,"cool":0},"l0bVHX01_jHul6DrGvqZXA":{"text":"I lived in New Orleans for a number of years and saw many places like this sit empty or ba","useful":4,"cool":3},"7u6HGeOWHbaXQk6DDdaJJw":{"text":"This place sticks out like a sore thumb in this area, driving there you would never think ","useful":1,"cool":1},"W8X5dfRHzfnrAlNFdk7B0A":{"text":"Food was actually really good and the new market is really nice.  3 stars are mainly becau","useful":0,"cool":0},"obSFZ88O7364T7gsfBfmiw":{"text":"This is the best food court ever!  The neighborhood is colorful, but was fine and we found","useful":0,"cool":0},"pEmKW0eacLLYG3a9Pl13uw":{"text":"I really enjoyed St. Roch Market on a stopover I had to the local cemetery. Everything loo","useful":0,"cool":1},"vofSoVpj6nAsvg9FGX4iAQ":{"text":"This should be more like 3 1/2 stars.  The building is awesome. The bathrooms with the sma","useful":7,"cool":3},"-SXPMYhqis17MgzsB0E3Lw":{"text":"Great for groups of friends, an airy food hall. Tons of great options to satisfy varied ta","useful":0,"cool":0},"j-KVEOA58qx5MXMajuOhWQ":{"text":"I love St. Roch Market!  It's one of my favorite places to go on my lunch break.  I have b","useful":1,"cool":1},"Efn0Hr6u7rEhOmI8q12avQ":{"text":"Great place to grab lunch with a group of people. With enough options to satisfy everyone'","useful":1,"cool":0},"HkMEf4Il8Mj8kWHItYYAZQ":{"text":"Almost like food trucks in a market. Great place to try a variety from coffee, sandwiches,","useful":1,"cool":0},"D_wUkafUllbdtn4WkxQ0Sg":{"text":"The Eagle Street salad from Good Market in the food hall. It was amazing! The chicken had ","useful":1,"cool":1},"0wcYnecymxJFPijhhUgJtg":{"text":"A great place. Individual vendors outdo each other with every kind of food and beverage. L","useful":0,"cool":0},"l1mk5k2YWUPBUMheelVgIA":{"text":"Not the real market residents all wanted and asked for (the property is city-owned and lea","useful":1,"cool":0},"uW9QffgP59SXfvVAzA3xQA":{"text":"This is a delightful place to go for both breakfast and dinner! \n\nWe enjoyed having the di","useful":1,"cool":0},"TgYr91KF5utOgG1Up81OTA":{"text":"Off of the beaten path for tourists, we found out about this gem from our airbnb host, jus","useful":8,"cool":4},"wDRgyoAoihx9YBL4idHD8g":{"text":"You've come a long way baby.  As time has passed this place has become better and better. ","useful":3,"cool":1},"atwJFXawSxseEYAv-RoZsg":{"text":"Veg-filled Vietnamese spring rolls, fabulous salads, Creole trio, oysters, gelato, & more.","useful":0,"cool":0},"toFsEK-coqYLXL82s-OCIw":{"text":"This place is so unassuming from the outside. I was pleasantly surprised as I walked in- t","useful":0,"cool":0},"cT8WMpbC9ItsS_Y0yJSR8A":{"text":"Great spot away from the French Quarter. We had the  Espresso Bean Frozen from the coffee ","useful":0,"cool":0},"QggoIKzya88dOpz_xaSIlw":{"text":"The atmosphere - lively, fun, friendly - is great. The remodeling is superb. The food, how","useful":1,"cool":1},"gprzh7x-PZN_d2NfWZdjBQ":{"text":"It was our first time, and it won't be our last. Unfortunately, the crazy, unpredictable w","useful":2,"cool":1},"T5rDpOQwx6vCCIulfYDz0w":{"text":"Sigh. As a Bywater resident, it is so very upsetting to receive a food court disguised as ","useful":6,"cool":0},"OR8RAMDdNLwvyWzlOhY8Tg":{"text":"I absolutely love this place. I come here for coffee and probably ate at all the vendor. S","useful":2,"cool":1},"mKkLfyEp8uUzsXF9jrA4ig":{"text":"There's a great variety of food, this place has lots of food stands to choose from. I got ","useful":0,"cool":1},"leB5gSz6le8MIX9ObtG_fA":{"text":"I love this place, My friends and I went here for a light lunch but then ended up trying s","useful":0,"cool":0},"X73XdyUczZ9I-fu0o1W-RQ":{"text":"Such an awesome idea and a great addition to our NOLA visit - really incredible vendors at","useful":0,"cool":0},"BexoboI88WtaFDOZITCuCQ":{"text":"St. Roch Market is a wonderful place to grab a bite to eat. It's essentially a food court ","useful":2,"cool":1},"t1GxQrzar4tzjRvwnG2akQ":{"text":"Great selection and variety! Feels like the food markets in Europe - wish there were more ","useful":0,"cool":0},"yLAhM_DzXdpSdW5_TE34cw":{"text":"Wonderful experience. Clean, gorgeous venue with a little bit of everything to choose from","useful":1,"cool":0},"ogil4xa9cyApVa5QiG06Cg":{"text":"I wanted to love St Roch Market. But I didn't.\n\nMaybe I just need to go back after a littl","useful":7,"cool":2},"FF8QV00xIwDElSfynX9I8g":{"text":"So basically this is like a higher end food court.  It has a cool vibe. Great coffee. Grea","useful":1,"cool":0},"kH_l4DyrKYbBPS3FNxpNcw":{"text":"I have a lot of mixed feelings about this place. It clearly doesn't belong here, this isn'","useful":5,"cool":5},"FPBNfiM6JkuTWKdoUdfXLg":{"text":"As part of a last minute change in dinner plans my husband and I went to St. Roch Market w","useful":0,"cool":0},"rxtOtcb1-rMzxt-kTKnURQ":{"text":"When your walking down new Orleans make sure you stop in at St Roch Market. With so many d","useful":1,"cool":1},"o_xmtwmiSKto7iM9pYVymw":{"text":"Delicious food and a huge selection to choose from! I would recommend ordering small from ","useful":0,"cool":0},"bL_1UtVf7jiIWevHW2kYDA":{"text":"What an amazing place! We were staying a few blocks down on St. Roch and our hosts recomme","useful":0,"cool":0},"0If5Rqywns22e0icMfyE9Q":{"text":"Went on a date with another couple and it was really an enjoyable night. We each got items","useful":1,"cool":0},"njJ4pj-akomSdTNADyqw0Q":{"text":"I was craving some good pork belly...so naturally my mind lingered to a good Vietnamese sp","useful":0,"cool":0},"IGA3XGTGQ1t0lXuPJyoY6g":{"text":"Worth it! One of my favorite places to hang out, read, and enjoy good food and great compa","useful":3,"cool":1},"L3LoLoNV5T1NYZLI_G5e7Q":{"text":"Went for the first time for dinner and really loved the whole thing--the different vendors","useful":0,"cool":0},"ialxHotvjABf6_qyQGEftA":{"text":"I love St. Roch Market. The market is both past and present. My friend tells me it reminds","useful":3,"cool":0},"ZoXnYnPjNszYCVTgsfKOtw":{"text":"The St.Roch Market removed the fresh food and produce area. The grocery section was never ","useful":1,"cool":0},"zFGW3-vYDuvc0l7TaoowpA":{"text":"Visited this space while visiting my daughter.  Reminded me of a much smaller Oxbow Market","useful":1,"cool":1},"l3IIYd4UbVqj9-hwqHTzLg":{"text":"I wish I was more hungry when I came here. We stopped here for a quick snack and drinks, b","useful":0,"cool":0},"_gcGLWC8gfwlnJmmWoxpcQ":{"text":"Big food court!  Big open space...plenty of seating.  Two rows of places to eat.  My first","useful":2,"cool":1},"8QBzUVrNVXPJCtmyP_wQBw":{"text":"St. Roch is a lovely place to spend a weekend afternoon. Many of the stalls offer both bre","useful":0,"cool":0},"J5ZGG8d21K8g231mNcYbpA":{"text":"Got a cold bowl vegetable bibimbop from Koreole. Delicious!  Tasted just like the Koreani ","useful":1,"cool":0},"fHrHiQUS_mZDeFc0wGL1ug":{"text":"Go to enjoy the best Nigerian food in town at the Lagos stand.  This is one way of enjoyin","useful":6,"cool":1},"C-ikC1RV8VAR7MIk5TpHzw":{"text":"Steamed bun sandwiches. Chips, guac & salsa. Crab mac & cheese. Budweiser. Mimosas. Smooth","useful":1,"cool":0},"oosFsfsAq6fX6jzZECbbNQ":{"text":"MUST GO THERE! \n\nSuch beautiful architecture and the space is full of great individual foo","useful":0,"cool":0},"DWCKBKB-4A1IZU5ZirxX3A":{"text":"Wonder for for after work. Great price for the shrimp roll . Potatoes are awesome from Fre","useful":0,"cool":0},"ODxTxyEWHugGpCvqoWL-Mg":{"text":"Kicka$$ food! Had the Trash Grits, Muffaletta, and Blue Cheese (etc.) Empanada. They were ","useful":0,"cool":0},"g1oNcfm4a76rNXYv-_H2oA":{"text":"As a tourist to Naw'leans let's just say this market is the perfect place to go to sample ","useful":0,"cool":0},"ePKb34AypsMe5n6gOFx-TQ":{"text":"I LOVED this place. We stumbled upon this market randomly during our visit to New Orleans.","useful":0,"cool":0},"WZTqTB26Pr-L8uFwm71ldA":{"text":"Excellent. Fantastic place for a group of people to get together for dinner. So many diffe","useful":1,"cool":0},"oBy9Z_VIx2hjZoq2xTNS4Q":{"text":"I love this place. The live music on Sunday afternoon was just lovely.  Drinks to start fr","useful":1,"cool":0},"iHSJUgyb8V__pq6u0qfFBQ":{"text":"I love a good market and LOVE the St Roch Market. They have about 10 vendors with options ","useful":0,"cool":0},"vCGbaPDd_aAr2lFrW34iYQ":{"text":"Many food choices. Food is excellent. Best biscuits and sausage is the best I've ever tast","useful":0,"cool":0},"EyNmC92AJb8U0XnAfW_yzg":{"text":"This place is really great. I have to admit, I did laugh at some of the other Yelp reviews","useful":0,"cool":0},"H8pcWyItBUSnPPI-ic2TNQ":{"text":"Innovative space.  Train station converted to an upscale food court.  Lots of foodie choic","useful":0,"cool":0},"DHg1EU4J-tbDRXaJ5e2wfA":{"text":"Frozen coffee, bomb ass eggs Benedict, duck gumbo, fat and juicy oysters, praline bacon wa","useful":0,"cool":0},"TcsksfGBsesqnTtWhX_mkw":{"text":"This is a great place.  Lots of different food stalls. All have good service and tasty foo","useful":0,"cool":0},"bYWeK7xHeSDOwBcPTx9pMQ":{"text":"The building is nice, which is why I gave it 2 stars.  I would have liked to review Shank ","useful":2,"cool":0},"bpo2yIDYuzvZLsqbffFntg":{"text":"We had: delicious, fresh oysters from Elysian and a trio of shrimp/grits, rice/beans, craw","useful":0,"cool":0},"o9imcuFfvig_nLBvm--dlw":{"text":"A little pricey and at times it's tough to locate where the cashiers are for the certain b","useful":1,"cool":0},"tG7mUP-9_22u7msoQgQA0Q":{"text":"Small but select market. Something like LA's Grand Central Market or the Ferry Building in","useful":0,"cool":0},"iyCTH59DjtaUgUYR8ZuvJQ":{"text":"Perfect for a meet up with friends or a business occasion. Many food options and I would g","useful":0,"cool":0},"oyPjdZMNlyJaGcQqXRz-0g":{"text":"This is the 3rd time I've been here and I ALWAYS enjoy it! \n\nRed Beans & Rice with Andouil","useful":3,"cool":1},"vekga-syASebTHSpa5myGQ":{"text":"Spent a couple hours here before heading out on the town. We enjoyed Haitian food- Eva's s","useful":0,"cool":0},"x3uRrf-jBAoSYumH69AdHg":{"text":"Yo my teeth was about to break on some overpriced dry chicken & waffles. 1 Star for the ni","useful":0,"cool":0},"JpdaZ0EMYOYjP0MP3W-xdA":{"text":"I've been there multiple times. The vendors are very friendly. The food is really good at ","useful":0,"cool":0},"PmLOvOTENyXv2HnDr3Fxvw":{"text":"First time here, I love the ambiance.  Very nice atmosphere, and a great place to hang out","useful":1,"cool":0},"-IhMnQglDPk4VIqRPkmLNA":{"text":"Options for everyone. White, bright and open; had a juice and avocado toast. Would definit","useful":0,"cool":0},"_-s1jPMv4iJPFMEr6WN1Ug":{"text":"WOW, fantastic place!  If you are even a little bit of a Foodie, you will love this place.","useful":0,"cool":0},"Dn4tH7ZTUQY95DxEv3BWUw":{"text":"i love it here! came with friends which was great for sharing; even so we each had two mea","useful":0,"cool":0},"YYajnFVk3QRwrahi6GO_Mg":{"text":"This is the greatest place for lunch since sliced Bread! It's like a local food court. It'","useful":0,"cool":0},"TlWMHfoGoWLdvcQq50nPAw":{"text":"Fabulous environment to dine in with plenty of food options! \n\nMy friends and I were renti","useful":0,"cool":0},"oM-36_rJYt7hAHpVIv_V7g":{"text":"this review is specifically for the Mayhaw cocktail bar in the Market. I visited on a mode","useful":11,"cool":5},"A7jl1NSqGaUvjZpep-gNwA":{"text":"Love the food choices, atmosphere, and seating options. This upscale food hall gets my vot","useful":1,"cool":1},"rfFwt1pbEPWxR1nGVnn5sQ":{"text":"This was our first stop upon getting into NOLA. We were very impressed with the whole plac","useful":0,"cool":0},"o6jp74_7YC9p65_ucBkYRg":{"text":"This place is the coolest place in New Orleans if you love the new mixed with the old , am","useful":0,"cool":0},"FJWqV8D8DNF1ij-5suQnIA":{"text":"Loved it!  PDR's Brisket with greens and beans was delicious. Espresso from Coast Roast wa","useful":1,"cool":0},"W_EOnWUI8fyGGCqGddWXyw":{"text":"The open-hall market style (à la Eataly) and the completely white, clean aesthetic transpl","useful":3,"cool":2},"ZoI5EdUwOUyh9X2LFnJGlw":{"text":"The Market:\nIt reminds me of Off the Grid in San Francisco where food trucks gather, but i","useful":0,"cool":0},"d-ivPFbxexHp3TFxSxo88A":{"text":"This place was supposed to be a neighborhood market and then they got too ambitious and de","useful":1,"cool":0},"cHi-1bCY5k7fZRKbBYBwpQ":{"text":"A great places to different types of food under one roof.  The atmosphere is very friendly","useful":0,"cool":0},"faSDFjH9ft3q0kByLIMBAQ":{"text":"Went for the happy hour but not a lot of options were given. They do have 1 dollar oyster ","useful":0,"cool":0},"EZbZqVBQEtrmrFOjgeOIPw":{"text":"Love this place. It's like a food snob's high end cafeteria. The Nigerian place is really ","useful":2,"cool":1},"e0FbBadAxNC5gNLXNoNCLw":{"text":"I have to update my review to admit that I do go to this place a lot and i love the food. ","useful":6,"cool":1},"Dnx57Du0Os5GM9t20q-PZQ":{"text":"Great place to meet for drinks, breakfast, lunch, dinner or a casual date. Also great on g","useful":0,"cool":0},"RU6kW-HjNUdTo0nOJmc1CQ":{"text":"Love this place! It has a cool old school style. It's open and bright and nice place to si","useful":1,"cool":0},"wB8Y2HJwpnezMgUtXk1z_Q":{"text":"Nice indoor setting. Was dead quiet when we visited on a Tuesday afternoon. Most of the st","useful":0,"cool":0},"3fRgTeJqBnuJGNATDh2xpQ":{"text":"Awesome place - grand (re-?) opening day April 10 2015. Great food, crawfish ceviche, shri","useful":5,"cool":3},"v56vRTQsXMvBHN8j2XwOsw":{"text":"Talk about everything you want in one place!! Mixologist in the back, great duck and andou","useful":0,"cool":0},"EnZK-AN1q7JjKmZo1TQmZw":{"text":"Love love loved this location to stop at for a drink, breakfast, lunch or dinner. Versatil","useful":0,"cool":0},"ZyS-GIzjpU_TjjqirYaVTA":{"text":"Both my mother and my father grew up in this neighborhood. Times have changed and the St R","useful":0,"cool":0},"c-gCk5NYWR2dy1JuliHk9Q":{"text":"Wow this is a cool place !!!  The only reason I found this place is the lady who's place w","useful":2,"cool":1},"EblOfj1hzbT8_9ofFok9Aw":{"text":"1 Star is for the pretty building and setup. \n\nAesthetically pleasing food hall but food i","useful":1,"cool":0},"_61MD7xE0AexXGcXR63eDw":{"text":"This little market will dazzle you with its selection of local fruits and vegetables and i","useful":2,"cool":1},"kNCHS4WFmOLtgG1094NZfg":{"text":"I'm glad we found this market while visiting New Orleans. It's a really great place to sto","useful":0,"cool":0},"Tnie6PRYCFxZzPqNWnsGKg":{"text":"Love! So many great options - a perfect place to bring out of towners or large groups as e","useful":0,"cool":0},"M7Auqok4d3w7ODZdnENNdA":{"text":"This is my favorite place in the city and will drive all the way here for just a snack. Ha","useful":0,"cool":0},"g1Ot3q3nOHtNJotOt7ez2w":{"text":"Ok, naysayers can warn about the gentrification coming...Armageddon on St. Claude....I say","useful":4,"cool":1},"kIvIh7NS0zBOSTwAvPd1jA":{"text":"I hadn't been in this neighborhood since I was in grade school.  It looks like it got a LO","useful":3,"cool":2},"FxRNCJaKzxuDTjbU1Fv2tA":{"text":"Went at lunch. It was crowded. It's a fancy food court not unlike Ponce City Market in the","useful":0,"cool":0},"0amMmKiBcR1bvh12UIW0fQ":{"text":"Good variety but would rather go to a place I'm being served considering prices. Loved the","useful":0,"cool":0},"YosKnZC4gzFgHe0EG9Yedg":{"text":"Thoughts: This isn't my normal review of a restaurant and I typically limit myself to thos","useful":0,"cool":1},"Bod55i9Rs83FwO5iQ47yQw":{"text":"A must stop when your just turning a few corners in New Orleans looking for a variety of f","useful":0,"cool":0},"rcP8qlZhw-8tQZ15hGI07A":{"text":"Really, really like this place. We didn't get to try as many food stalls as we wanted to, ","useful":0,"cool":1},"yNLqbVUOeSgWLw776QlgSA":{"text":"There's so many delicious options in here! If  I hadn't already ate lunch I would have bee","useful":0,"cool":0},"EzN2mMWs2qCe4tJ8T_mOsQ":{"text":"This is my new favorite place! The selection and service is impressive. The layout is open","useful":0,"cool":0},"YmIkFnCF8FC5vXixFXTQig":{"text":"Entirely worth the trip. Great food by multiple purveyors so whatever you're hankering for","useful":0,"cool":0},"7o99xfxgmghrqaVPA_517g":{"text":"My friends and I visited NOLA for the weekend and decided to have our last Cajun meal at S","useful":1,"cool":0},"xHU3jdt4TpDzY55eYiwFOg":{"text":"Reuben met us outside by chance and what a great connection. He walked us through the mark","useful":0,"cool":0},"bobqHsxNjBrQt11--4dEzA":{"text":"I love this place. All different vendors selling delicious, fresh food and beverages. We a","useful":0,"cool":0},"8B9Lzmr7fMsUHP2rP_SW5Q":{"text":"Very fresh foods, friendly service. The general manager took time to chat and described th","useful":1,"cool":0},"migEMmEN7-lQNT3oFhcFpg":{"text":"We chose items from five vendors: Coast Roast Coffee (hot chocolate), Elysian Seafood (roa","useful":15,"cool":5},"MjQcr02QTzp-AGM2LCL5XA":{"text":"This place was AWESOME! There is something here for everyone. New Orleans was one of the h","useful":1,"cool":0},"6C_d64pJ7JYQR1esnmO2vQ":{"text":"Lots of selection -- there's something for everybody. Easy to over-order, since there are ","useful":0,"cool":0},"WEa7wgiKz5LjuBDedFpLZA":{"text":"The concept of this place is really cool and an awesome place if you have a group and ever","useful":0,"cool":0},"_01r5DeK4yIHvFz8KDO_tA":{"text":"The cool thing about this place is that it is a market. Grab a cocktail from the bar (all ","useful":0,"cool":0},"qIpXdviIKL1erq0v04Q3xA":{"text":"One of my favorite places during my vacation to NOLA. Located right next to Rally's.\n\nSt. ","useful":5,"cool":2},"yZaigNux9b7_bwGiaExYQQ":{"text":"It's very probable that every time we are in NOLA, there will be a stop in at St Roche Mar","useful":0,"cool":1},"q_5Kle1FOeI4vQxT9pN4JA":{"text":"Beautiful spot full of various types of food that will satisfy anyone's taste and yet stil","useful":2,"cool":2},"uwP_l4GRbEcMVyXAy6lMmg":{"text":"This is a nice food court with a variety of options.  It's clean, bright and modern.  Ther","useful":1,"cool":1},"i_wAIwxC_p95ALE2XW7a0Q":{"text":"Oyster happy hour is awesome. It's next door to the bar. I also had the plantain chips wit","useful":0,"cool":0},"9tMOygBm1VmW0TKqWYJ_2w":{"text":"Local market with fresh made amazing food. Tons to choose from and more than worth the mon","useful":1,"cool":1},"5wE9aaeUjvGRsY_ZvgNkVA":{"text":"The atmosphere, concept, and food was amazing. Not to bad for the price. Will definitely b","useful":0,"cool":0},"XQSWxSUNHoo6ob_SfEuljw":{"text":"This place literally saved saint roch. \nGod bless the saint rich market.\nThe jalapeño corn","useful":1,"cool":1},"Tud7K9z5DPrUmEWn9vX5OA":{"text":"St. Roch Market how I love I can not count all the ways! Friday I got off work early and d","useful":8,"cool":3},"tZv1k85qDJU_vViDiuA0Cw":{"text":"Amazing food hall with tons of options for dining. One of the best fried chicken with grav","useful":0,"cool":0},"GOrfOcoEXmst_0GPeLglBg":{"text":"Had the grilled oysters.  They were just perfect!!! Would have ordered more but the person","useful":0,"cool":0},"9x3nV-xQyk9EYH10RBzgkQ":{"text":"I went here Saturday!  Looks great and the food is amazing and very reasonable with reason","useful":2,"cool":1},"qgebEr-1hti55ycnhG7JdQ":{"text":"It's hit and miss with the food quality and service at the individual restaurants represen","useful":0,"cool":0},"iwut3qlqDlh0aWLzFBQxyA":{"text":"We stumbled upon this place while looking for lunch.  It is a nice open market styled loca","useful":0,"cool":1},"qlJeYpXL8u48-w6jmbojSA":{"text":"Great place for those families or groups that all want different things. 9 or 10 individua","useful":0,"cool":0},"vDBewKWyvk49jNHQ3Oh9qA":{"text":"Our uber driver recommended this place. We were headed to the spotted cat food and spirits","useful":0,"cool":0},"eptLS1fKle9QnW5Cso7Pcw":{"text":"Brings a feel of New York with Top Notch selection of New Orleans Seafood and eclectic mix","useful":1,"cool":0},"__EVcVB9k-ZuXdcMhh31vQ":{"text":"Great food hall. Food was delicious. We got crawfish poutine which was phenomenal and I ha","useful":0,"cool":0},"7J0kvfQ0xq-GRWrXTbknLA":{"text":"Needed a break from all the creole food we had during on trip and was pleasantly surprised","useful":0,"cool":0},"Z-kOs78zDh6IuTZP9cfcEA":{"text":"Love that I can walk in at any time even on the busiest of weekends and not have to worry ","useful":4,"cool":4},"TdP4jKKdxfAiUlaEmmxogA":{"text":"Adorable, eclectic, hipster market that was not what I would expect from the outside. All ","useful":3,"cool":2},"QxzDSfmAN8uKvlUYlWxq2A":{"text":"Great spot for any meal. Casual. Good variety of food vendors. I loved the sweet cream col","useful":0,"cool":0},"Qu9lnW-2OCyaWzgKQpenoQ":{"text":"Love this place!\n\nThe juice bar's kale salad is incredible!\n\nBut what I really loved was t","useful":0,"cool":0},"BHLNcJshg6XU0mt29our_g":{"text":"There's something for everyone here... if you're looking for breakfast, brunch, something ","useful":0,"cool":0},"4OrYJAdYQ57d0YQkLphhYQ":{"text":"I've been wanting to try this place out for the longest and I finally got the chance to! \n","useful":0,"cool":0},"3Nr9tKs349ALnTvKgPTx9g":{"text":"A good array of innovative foodie offerings in a bright, clean environment. I am told the ","useful":0,"cool":0},"V3c7618KHU7_VvV8VlkwgA":{"text":"Fairly new to the Marigny and built in an historic 1875 market, word is that this upscale ","useful":0,"cool":0},"1qWwMEvnfxm1hQwldustrA":{"text":"I'm so glad I stayed in the Marigny area for my trip and found this gem. The St Roch Marke","useful":0,"cool":0},"0ov6xnqb-egYT63bkIWDag":{"text":"I had been told by several people to come by here for dinner, but it took me a while to ge","useful":2,"cool":1},"q6KTl1fYeN5s-BV1Ch198w":{"text":"This is an excellent concept.  A Houston type traders village done with food.  Upon first ","useful":1,"cool":1},"M-RThIUsScqQbOxc8hcB-Q":{"text":"Loved this food hall! Initially, we came here on our first night in NOLA looking for a mar","useful":15,"cool":12},"Z6cZ7Fo5aupyzqPpvUxQ7w":{"text":"I visited the St. Roch market for lunch today, and it was definitely an unique experience ","useful":0,"cool":0},"wirkqoODz9wErAjMF0Q72g":{"text":"Don't be fooled, this is a food court. But, all the food is really good and lots of differ","useful":0,"cool":0},"vJke6JYkosxMWzivr77I0g":{"text":"What an amazing place, we loved it for dinner and Sunday brunch. The food was fantastic fr","useful":1,"cool":0},"UMeTpHRJ4pVGRX77KFCEQQ":{"text":"Awesome place with a variety of food stalls to satisfy the picky eater! Also have a really","useful":0,"cool":0},"gPqFZVqS7KViRxv_gW8tfg":{"text":"We stopped in on a quick trip to NOLA and absolutely loved it! A very fun and European atm","useful":0,"cool":0},"pPgmnCUmjNsm4MKY--tvMA":{"text":"What a BEAUTIFUL place with gorgeous interior. The location is in a kinda sketchy area, bu","useful":0,"cool":1},"MKVxlQ2jlD3STKKY7K4gWQ":{"text":"Found this Haitian Spot in St Roch Market. Had the Fritay! The food was awesome and the am","useful":0,"cool":0},"IAEVUonIqrnMljDvDkUsqw":{"text":"You can't go wrong by eating at St Roch Market!  There are a gazillion vendors, each frien","useful":0,"cool":0},"1DNVRyPJ9aN59TnrCRgsgw":{"text":"Torshi's had super fresh, delicious food. I got the falafel platter. The falafel was crisp","useful":0,"cool":0},"pKgDSaX_dnUA1hhLTEKqRg":{"text":"I loved this place!! From the moment we walked in the energy just felt right and it did no","useful":0,"cool":0},"PMVFKrBemIkEjUE7qOGnoQ":{"text":"I loved the white, crisp look of St. Roch Market. Super easy to get here through public tr","useful":4,"cool":2},"MVUT2T5LXoexYH3lsOjG9Q":{"text":"My Tours By Locals guide, Cassandra brought me here. It's worth the stop. Coffee, grocery ","useful":1,"cool":0},"l41L8YCGgpE_pqYWz7hn4w":{"text":"Love it! Reminds me of a very small scale version of fisherman's wharf in San Francisco.  ","useful":5,"cool":3},"sUOypnvJamYzmPVYSb4N0Q":{"text":"I was a skeptical when they first opened. Basically because we, here on this side of Canal","useful":5,"cool":1},"VlTYECItOyVidkNj-1vwzw":{"text":"I like the idea of St Roch market but I don't like the environment. When I walk in I feel ","useful":4,"cool":3},"CTKQjpuMZPDZZz5YYycjTw":{"text":"Ugggggghhhhhh. I hate that I (sort of) like this place. I do. But here's how I see it: man","useful":5,"cool":2},"STzl_kd1oOfZz1bNv0mG6w":{"text":"An elevated food court, an indoor food truck gathering. A must stop if looking for good fo","useful":0,"cool":0},"PehCCf0DVpDZXD-n9c0gLA":{"text":"Such a cool spot in NOLA to get out of the touristy areas and try a bunch of different foo","useful":0,"cool":0},"gfmcCr9PDAAhulYklv3akA":{"text":"It's just as amazing as the pics! So many types of foods to choose from, local produce and","useful":1,"cool":1},"UsSPB8y6B8PmvUAMaFKiQA":{"text":"I was on my way home from work and decided to stop in and check out the restored St Roch M","useful":11,"cool":6},"b7gVMs14iL7jS6TKmUWQEQ":{"text":"Very vibrant, busy place. Love the atmosphere and different food options. Most interesting","useful":0,"cool":0},"aVfoNnoQaXLSS--h-lgqzA":{"text":"I have to admit, this place is the perfect spot for a quick meal by yourself or to catch d","useful":0,"cool":0},"pTGeSdynxoKGXYJ7MHR0aA":{"text":"I'd show you how good the pork belly tacos and pho are but it's too good to actually wait ","useful":0,"cool":0},"TXIPlqhjpprFgBhuCX84Dw":{"text":"We don't need expensive, yuppie, foodie, dining halls in the 9th ward. We need more access","useful":24,"cool":2},"WZ9CQfSETc6Qs3lzZt3YMA":{"text":"I first visited the St. Roches market well before Katrina when it was actually a seafood m","useful":0,"cool":0},"o1IFA1TBDIKc9OBI_Z-DTg":{"text":"I had the crawfish empanadas from EmpaNola and my husband had the Bird Man sandwich from a","useful":0,"cool":0},"UnkrgA5AaBd5Q8A0kp6P7Q":{"text":"Love everything about this place!\n\nInside the nondescript \"market\" (maybe it was a bank or","useful":2,"cool":2},"EzUOajwYfypT6meMBtVVGg":{"text":"It's definitely not much of a grocery store market but more of a small indoor vending boot","useful":5,"cool":3},"BSlhP1tpAKLFuwNNCgG7zw":{"text":"A huge improvement to a once dormant and run down market that gives the St. Roch Neighborh","useful":10,"cool":4},"Cz5ZOwUiqqhX064Y-vyVXw":{"text":"Loved it. Light and bright, airy and open style. Good selection of yummy food & drink. I e","useful":0,"cool":0},"pvOpZYTu2WiB_57sakcdjg":{"text":"I am checking out the Louisiana crabcake brunch. It looks ans smells devine. I am having  ","useful":2,"cool":1},"5e3Xsfu_UQ4temZOyOjDIw":{"text":"Lob love love this place! So many choices with the various restaurants! I had the barbecue","useful":0,"cool":0},"w2RD1nIOySUHwFAtWtZ9pw":{"text":"We stopped here as our last stop on our Culinary Bike Tour.  Under the roof, there are 16 ","useful":1,"cool":0},"befaDFMKNYy6NC-HII4JqA":{"text":"Loved this place.  We visited several times during our stay. The pelican salad is really g","useful":0,"cool":0},"TltP07euYz4RHYV3d9h3NQ":{"text":"There is apparently no limit to how gentrified the Bywater can become. The newly renovated","useful":17,"cool":15},"fUpwcBLHYoD6e7aTbEXLvg":{"text":"A dining hall with various small food vendors, it had its flaws. I wanted one stand but th","useful":2,"cool":2},"pVTtI-UoJXbVFTEcszBGSg":{"text":"I live right next to the Market, and today I went in for the first time in several months.","useful":3,"cool":1},"zYQa2fV_wi1lcds0gc6d5g":{"text":"Don't blink or you'll miss this treasurer. As soon as you walk in you're guaranteed to wan","useful":2,"cool":0},"wN-PxHtqdPBoGZckPD6ymg":{"text":"Chido and FriTai Cant go wrong. Few other places in there didnt really like. Busy but effi","useful":0,"cool":0},"prmxhTTKut8AJP6htgJ6Hg":{"text":"Very cool spot with much to choose from. They have small vendors set up inside of the mark","useful":0,"cool":0},"TOk6id2jsrS5iUGp-ECQkA":{"text":"Can't beat a place that serves pretty much anything you want, from Creole to Mexican to Aw","useful":0,"cool":0},"T1smqTY8G82t3IgINuUYoA":{"text":"Excellent choice if you like food truck-like cuisine but want/need air conditioning and a ","useful":0,"cool":0},"pFZm-YrzOqP986i0PCs3Rw":{"text":"You hear that? \nThat's the sound of property values increasing.\n\nThe St. Roch Market is an","useful":12,"cool":5},"I9Y6xVqnjMP_1m170psFTg":{"text":"Great ambiance  and food selection. Pho was great, Iced coffee with sweet cream was amazin","useful":0,"cool":0},"YmJuYU3CYzHMIoKFJbYp3w":{"text":"I loved my recent visit to St. Roch Market! The market is a southern food hall featuring a","useful":3,"cool":2},"QqeuC-eGKivsX5RmsjQ5FA":{"text":"Fun little spot. It seems like it's brand new but has also been there forever. Really enjo","useful":0,"cool":0},"40du91IS8QwNkshQIK1g9g":{"text":"So much to choose from! Multiple restaurants in one location and very diverse options. I w","useful":0,"cool":0},"DagM9ENpm61AbiaNX0-Svw":{"text":"If the St. Roch market were located Uptown or even in Midcity, I'd give it five stars. It'","useful":8,"cool":1},"YDdom1QEJ2EN7QT0D_eIzQ":{"text":"One of the best meals I had in New Orleans. I had great customer service and I didn't find","useful":0,"cool":0},"zNDvg-_k3zrsFVH13gS9ww":{"text":"What a little gem! This place was very unique and hip. I loved that there were so many opt","useful":5,"cool":3},"Xs6cDP2cFW2y3IW2DYwUzQ":{"text":"Leaving all social issues out of this review purposely and reviewing the St. Roch Market f","useful":16,"cool":5},"qCCnZTxqaS45jh2YcJx7zg":{"text":"I am a sucker for a good food hall. I mean what's not to love? A ton of different cuisines","useful":6,"cool":3},"_CTvQ_YwPGdvptiBm8NwWg":{"text":"Love this place!  Once we discovered it, we didn't really want to eat anywhere else on our","useful":0,"cool":0},"eOtv_159RAxFdmtmOul7Lg":{"text":"Top 5 reasons I give St. Roch Market 5 Stars\n1. More than 8 places to eat - in one spot - ","useful":4,"cool":3},"p-pZpGYcHRV_CtOCLhcM1w":{"text":"I cannot say enough about this little market! As many say, it's off the beaten path and is","useful":1,"cool":0},"OoyIulNvxN4uCRXlNqyDOA":{"text":"Ordered: Fritai and Gumbo Ya-Ya with a side of red beans and rice.\n\nThe red beans and rice","useful":2,"cool":2},"qLFhMtF_gsAR60Wiz3wzGA":{"text":"I think there were a great variety of food options at this market, and it definitely has g","useful":0,"cool":0},"CkeJbHew39Ak3I4Mbs_8ig":{"text":"St. Roch is one of my favorite food spots, and somewhere I take anyone who is visiting. Th","useful":1,"cool":1},"PdCQrhicZC4Xj03gu5WSSw":{"text":"Crowded after the reopening. Seats are hard to come by. Some good food, but service is a b","useful":6,"cool":1},"PHm5PLtSe_3kzgS_raZTog":{"text":"Oh what a joy to explore this place. 5 days in New Orleans and my number 1 dish was from h","useful":0,"cool":0},"r2XLJCtSPn0bu0m4qFlZIg":{"text":"Wicked renovation St Roch Market!  Really cool spot on St Claude begs you to come in.  Exp","useful":1,"cool":1},"OMiiQCGUWQL2q8xZwWJQyw":{"text":"Absolute MOST WONDERFUL spot to walk to from whatever AirBnB you're staying at. There are ","useful":0,"cool":0},"vzKkuQ0-erecfyzkG1Eo-g":{"text":"Me and my friends were visiting from Chicago and with all of us combined we were able to t","useful":5,"cool":5},"u0jEw5P2l0SX59ilq9orIQ":{"text":"Very large indoor space filled with black and white tiled floor that comes to mind wheneve","useful":1,"cool":3},"lpHrbyk5W-o7-zSY4ER0Cw":{"text":"I tried a lot of dishes at St Roch during the week that I was in New Orleans because I was","useful":0,"cool":0},"HturiyxGR1mE2udGzUL85Q":{"text":"A bustling market with plenty of food options. Tried a couple and they were pretty good, t","useful":0,"cool":0},"poZIKKZSuB3EabDT2tKooQ":{"text":"I am so happy we found this place before we left NOLA! It was the best meal we had while i","useful":1,"cool":0},"89Pz6QmPdR9L_xxUrd5vnw":{"text":"Love, Love, LOVE this place!! One of my favorite places to eat. Very touristy but also a g","useful":2,"cool":1},"iovxd48bUA9nVG_WxUxS9g":{"text":"This is the perfect place to come when you don't know what you want to eat because there i","useful":0,"cool":0},"G3Zf-ngnQqMpV9gsds9MJg":{"text":"Great selection and very tasting food...Although the dude at the Vietnamese spot seemed ir","useful":0,"cool":0},"53Cx-713Hh6iGLZGtjn93g":{"text":"Absolutely love this place, both for breakfast and dinner.\n\nSo many great vendors with dif","useful":0,"cool":1},"bomlA_UizGk7ypL1WbD6RA":{"text":"I was a big fan. I came upon this on accident looking for coffee and I was very impressed ","useful":0,"cool":0},"g_udnVg2HjEJq4Cmiv3wDg":{"text":"This place. This place looked amazing online. It kind of looks amazing in person too. But,","useful":1,"cool":1},"M61izchPoNagFD8OsGjn1Q":{"text":"i was so mad at my experience here that it was 2 months ago and i am still thinking about ","useful":1,"cool":0},"2RYfMEqdIlnO-m-CdBgS1A":{"text":"This food hall in NOLA is a pretty cool concept!\n\nOne star down for being kinda pricey, bu","useful":0,"cool":1},"ceZHnk7df1YwMbvRxf0SCA":{"text":"Nice arcade games \n\nNice folk\n\nA random lady came by and said hi and explained the pinball","useful":0,"cool":0},"8tCnZpErd80P_ACe5q94gA":{"text":"This is the place to go in NOLA because everyone in your group can get what they want. The","useful":1,"cool":0},"9gu5SO43NuxuIBioTQmiQw":{"text":"Love this spot. If you're from out of town it's a must hit for breakfast.  Lots of options","useful":0,"cool":0},"q3SEZ2bGXLp5Nndp0UHrgA":{"text":"Here on a Saturday - Only the Coast Roast coffee & tea is open at 7:00. Only 1 or 2 food v","useful":0,"cool":0},"8W9ZoGXxjRr7M2lr0odI9w":{"text":"I ordered a smoothie with added protein powder and it was absolutely delicious! I ended up","useful":0,"cool":0},"iuJZBlh1iczms-YHa4pGpw":{"text":"Try the sampler at Fete e Fete. So delicious. Their biscuits are light and airy. It's enou","useful":2,"cool":1},"6mwRVYW4UJWdMnBtjk74NQ":{"text":"This place is great for those who want to try various food items. Gulf shrimp curry is a m","useful":1,"cool":0},"CfcODTliryO5uJa-vzn_YA":{"text":"Great place to go to with so many good food vendors to choose from! We came here through a","useful":2,"cool":0},"az1HrZyMd4PNlPI71XKeoQ":{"text":"Awesome place. Totally tiresome from yester years. Food vendors are excellent. Something f","useful":0,"cool":0},"86Pun7RnBL1yCa-u1kP30w":{"text":"Thus place is great! They have a wide variety of food, nice helpful staff and a great atmo","useful":1,"cool":0},"yeA8xXS5bHmPsZALpvIgvg":{"text":"I absolutely loved my first visit here and I'm sure I will update this review after explor","useful":0,"cool":0},"dk09NNs8drCgZIu50Z2IQw":{"text":"By far this is the worst counter service yet--the people working at two out of three stall","useful":1,"cool":0},"Buw-uVXIEMDuLTFFWfp59w":{"text":"Great variety of vendors at this clean, trendy, indoor dining area. It felt like an upscal","useful":0,"cool":0},"WBtnS0f7R_ZI-M4G1s8XLg":{"text":"Obsessed with this place. It's so light and open and every single vendor is unique. I abso","useful":1,"cool":1},"lTwQ_igGz8lnc1fUf0VIcQ":{"text":"Great spot in the middle of an historic neighborhood. You've got your choice of a variety ","useful":0,"cool":0},"qcB0hHGxZTypLiFriC6QZg":{"text":"Honestly, this was my favorite part of New Orleans. I tried an AMAZING salad from Good Bir","useful":3,"cool":1},"00QXhZpRpUyer_ajyk-BYA":{"text":"This place is very nice, with a wide assortment of foods, and a excellent breakfast menu. ","useful":0,"cool":0},"VDHnrcGcIvU8wD7Rrt9suQ":{"text":"We were hungry, getting late. Saw people in front of the St. Roch Market. We were pleasant","useful":0,"cool":0},"TzQ70L1X1zz28oSGBfbiMw":{"text":"I came to St. Roch Marketplace 2 years since the last time I was here and I got.to say, it","useful":0,"cool":0},"24d2xH01e0RVwmNEsBBBUA":{"text":"I'm always checking out local food halls everywhere I travel, but the St. Roch Market is j","useful":6,"cool":3},"Nl3Dkzw7Yq86ZbHQrXyn7Q":{"text":"We stayed in the neighborhood and this was our go to.  Quality healthy selections for vega","useful":0,"cool":0},"bHEhnhL9JeQGVTMnEPAA7w":{"text":"It's a small indoor moderately scaled food court with about 8-10 vendors including a bar. ","useful":0,"cool":0},"dk2PRsgHwGpPLIfkVD8R3w":{"text":"This place is extremely overpriced and it's not even that good. Obviously the only thing t","useful":1,"cool":1},"c-ODoUlxYQnEVK42P-yAZg":{"text":"Visited around 8:30am. There were only a handful of shops open. Nothing really stood out a","useful":1,"cool":0},"40qPiflljwpIx0McvE4F1Q":{"text":"Great food market. Lots of variety and seemingly very clean. Was here during Chewbacchus w","useful":0,"cool":0},"hV7AZy6RF9ZrlGcR0y3Apw":{"text":"Ate here 4 times in 5 days. Huge variety, polite service, fair prices. I thank the Lord ev","useful":0,"cool":0},"R3OZAhtnPJBOeSMLR8GHig":{"text":"A 30 minute walk through the French Quarter from the city's main hotel strip on Canal Stre","useful":2,"cool":0},"r6Rvyo_jh6HyQK3rReO9Kg":{"text":"This is a great place to take a group of people who can't agree on what they want to eat. ","useful":0,"cool":0},"FQqDwh2CLDWFgVe93sUmNQ":{"text":"This market has several different eateries , coffee,seafood , Vietnamese, Another Asian sp","useful":3,"cool":6},"uW1P6kLX2Il3ypfZxAu4Qg":{"text":"By far the most mediocre dining experience I've had living in this city, and I've lived in","useful":0,"cool":0},"9E6-QrO684eOHlLZYEmYvw":{"text":"Fabulous choices for every taste! I highly recommend going to eat here. I started with a G","useful":0,"cool":0},"VMtZHjfxuVLoCn5MOUvZ3w":{"text":"Had breakfast this morning at St Roch and it was amazing. We ordered the Avocado Supreme w","useful":0,"cool":0},"7Yv5c0LOBEIcJj6a_aZYdQ":{"text":"This is an awesome place to come with a group because there are lots of different types of","useful":0,"cool":0},"9zNuIMtX1iFLJHTdjSlohw":{"text":"Another food court success in New Orleans. These street food/small pop up restaurants insi","useful":1,"cool":0},"Tn-5e0CAMACz-Ek3CrvJZA":{"text":"St. Roch Market just makes sense! My whole family can come in here and everyone is happy b","useful":3,"cool":3},"RRyJH7Fq8f1Blh2huZJs9g":{"text":"Now I used to be very against st roch market just because of where it's located and the hi","useful":0,"cool":0},"1CwSq-uXqbR2wWl6yOsTqg":{"text":"This is one of the best new additions to New Orleans IMO. We enjoyed it so much, we made a","useful":6,"cool":2},"f0QZSyftbBfrfSl7XuRyEQ":{"text":"Elysian Seafood at St Roch Market is delicious, tasty and good priced oysters! Wonderful s","useful":0,"cool":0},"ABefMqvGGVLEYHYzH01e7A":{"text":"A great selection of food to select from. I have to say the Gyro platter was without a dou","useful":0,"cool":0},"-pdvLgKywtg1W7mN4uB2xw":{"text":"Love the vibe, it was four of us and we all just ordered food from different spots to try ","useful":0,"cool":0},"s6ZngcENuCMMYa3S3jCq0A":{"text":"The atmosphere was ideal and the food options was perfect for whatever taste you desire. I","useful":0,"cool":0},"TrNhqZgnFJtTT1t_yEr3jw":{"text":"We went for dinner, at about 8 PM, and found the place to be chaotic and just, messy and s","useful":0,"cool":0},"2BEicv2_GC0OztAyDxDrYw":{"text":"It's a food cart pod that fixes the only flaw of food cart pods: the ambiance.\n\nThere are ","useful":2,"cool":1},"qoYUSsaQPRBvGURZzz1C8Q":{"text":"So many good options. I got a bbq rotisserie chicken wrap with chips that was really good.","useful":1,"cool":0},"xLcNeHu2vyPO2-KOovYfOg":{"text":"Like several fellow reviewers, I have mixed feelings about St. Roch Market. \n\nFirst, as yo","useful":3,"cool":1},"dxcjSIgeh34gMxL_zC94QA":{"text":"Obsessed! Smells amazing! Very open concept, cafeteria/food court like, just a little more","useful":1,"cool":1},"FAhTucaVaMKuUbTWy-PIpg":{"text":"This place is beautiful and I love the concept. The service was good and people are nice. ","useful":3,"cool":0},"ziQVw3gNhY-6sEmisIabGA":{"text":"I know half stars aren't real, but I think this is more like a 3.5 star review. Here's my ","useful":2,"cool":2},"uur9gq7kGruIRBnF5zIpZg":{"text":"Man. This space is magical. So open and bright and beautiful. Love the restaurant options ","useful":0,"cool":0},"b_mSPh4gD9YpzKLVNmbCrQ":{"text":"Great little \"food court\" to stop by for lunch. Many tasty options, good place to bring a ","useful":0,"cool":0},"kjOqxqyAOpo2_IbsOyMeAQ":{"text":"We braved a serious rainstorm to eat here this morning and it was so worth it. We got a pe","useful":0,"cool":0},"HfN6lu19d3KgBbOmzvP2mg":{"text":"Torshi Egyptian Food: \n\nPros: Beautiful presentation. Great service - the staff member not","useful":1,"cool":0},"jIKdSYpkFaCV_qO-KrLdsA":{"text":"This place has a great set up. If you're with a group the multiple options provide an opti","useful":0,"cool":0},"vm01T4pAoQCrztJgiJDB6Q":{"text":"Love saints Roch market! They have so much history in this place. \nParking is alright. The","useful":0,"cool":0},"8AWg4ZNtd5tH5PcC9qee0g":{"text":"Wow I just spent $13 at the new Mac and Moon set up here and was extremely disappointed.  ","useful":2,"cool":0},"JUrk5XJR9akoaBLq6HIaUg":{"text":"Initially, I disliked this market. This area is a gentrifying neighborhood that 10-15 year","useful":24,"cool":20},"Ao1xSKzLHU3_IFOix8jFVA":{"text":"I can say I tried it. It's wasn't disappointing but options are limited and it's unorganiz","useful":0,"cool":0},"d5jBkX_fRu5CtP3hLS4lTA":{"text":"Had oysters here that were awesome.. tempted to walk over there again. The Hatian Fritata ","useful":0,"cool":0},"gNEtWQRIiXrWrQWKXw_VlQ":{"text":"I really love the place and vibe in this indoor market. They sell good foods, there are di","useful":0,"cool":0},"wHjvz-n04QoJh2J8VlszGw":{"text":"This is one of my favorite hang outs in NOLA. Gets you out of all the tourist traps and al","useful":0,"cool":0},"xMO2dMt0c8dbrJbDnAwX9g":{"text":"Great place to go for a group. The is an array of food choices, so if you have some picky ","useful":5,"cool":2},"DUiP6rtBqCE7aavdAwHKgg":{"text":"Great vibes and lots of different variety. Kinda in the middle of nowhere so wouldn't sugg","useful":0,"cool":0},"tbGR4dpEX0-Kcnhcf7OmFQ":{"text":"I love a good food hall, so this was on my must eat list when visiting New Orleans. \n\nThe ","useful":2,"cool":1},"Rsn_h4vYnVjSr7yVAV7Ztg":{"text":"The guy shucking oysters, man his attitude sucks. Never did get any. I decided to quit wai","useful":0,"cool":0},"aWdchjjidSg439SCBi4xzQ":{"text":"I love food markets like this! I love being able to grab more than one cuisine before sitt","useful":3,"cool":3},"YnQoFq5zQU9BH8jY2yKX-Q":{"text":"The first time I've been here since it reopened, my friend & I tried almost every booth in","useful":5,"cool":1},"WFaZY3YQGNMXkQN1GSrvtQ":{"text":"This was my first stop in New Orleans, and it did not disappoint. Firstly, this market is ","useful":0,"cool":0},"pvKEjFStw49MVnQIVXqqqw":{"text":"JUST GO! You won't regret it! Whoever I go with we usually get several plates from differe","useful":1,"cool":0},"x5DqwUk5xIT6jVB1AvH2yQ":{"text":"So MANY options!  Love that we had such a variety of food to choose from for our group.  T","useful":1,"cool":1},"q14llCAD1afMS0wBrpr-CA":{"text":"We went here for oysters a few times over our vacation. They are fresh AND delicious.. not","useful":0,"cool":0},"T5n87cwbolTwL0YV6_VyKg":{"text":"This indoor market space has everything, Mexican Thai, mediterranean and Haitian to name a","useful":4,"cool":1},"PqFkC-ilG3Hc03vij1G16A":{"text":"One of the loveliest food halls that I ever seen. The building itself dates back to 1875, ","useful":13,"cool":8},"bmwR5VxarTKUUYHCo1TCDw":{"text":"Coming from the land of foodhalls (Denver), I had high expectations for this place and it ","useful":2,"cool":0},"kSBoyopRmvVVpFGMXjfYJg":{"text":"Just go and be blown away with its amazing ness! I have tried most of the vendors and have","useful":0,"cool":0},"hLW3lwGB-f-TvhOQW72P3Q":{"text":"Came here with a craving for a healthy breakfast after 4 days of gorging ourselves on pobo","useful":0,"cool":0},"5i4zRkGBbw_ReKDMcKWXDg":{"text":"Cool concept with tons of different places to chose from. A great place if your group want","useful":1,"cool":0},"V0AAyKI_RWu8kWYahlsSGw":{"text":"This is a great plabe for a meal.  An old market house that now features multiple cafe sty","useful":0,"cool":0},"VFJksswAJvNbDMKm45gH6A":{"text":"I actually really liked the ambiance of the food court. My friends & I went during lunch t","useful":1,"cool":0},"vD8cRCUTsXAFIMIGYNWNMA":{"text":"My Husband and I quickly left . May 21,2019 . The service sucks . Too many bad attitudes .","useful":0,"cool":0},"o4yKBab4C2HhPivDc17vVQ":{"text":"My Husband and I quickly left . May 21,2019 . The service sucks . Too many bad attitudes .","useful":0,"cool":0},"QR4Lob-xtlmqcUM9NprkKw":{"text":"This place has so many choices that even my inner fat guy named Lenny tapped out.  Started","useful":0,"cool":0},"XWQvUvuQ-nANQFhbpn_BQg":{"text":"This is a cool place to have lunch if you are in the St. Roch area.  It's a cool place to ","useful":13,"cool":9},"9ksvFYnYJ2fonuUThKWQ0Q":{"text":"Variety of different food options and flavors at reasonable prices, great Pho place, cool ","useful":0,"cool":0},"HdvyA9mRCeeijEns1k9RXg":{"text":"St. Roch Market is a great place to hang with friends/family where they provide plenty of ","useful":0,"cool":0},"VtL7IdTZShgFrr295XKZnw":{"text":"A friend had a gift card for this place, so we met there and used it up. \n\nIf you've never","useful":1,"cool":0},"UDnSeLPJq6pneezikX-OyQ":{"text":"All I can say is - Wow !!\nThis is one of the greatest Gems I've ever seen in NOLA and I wi","useful":0,"cool":0},"MvH9pLZX8gS6Aa52E4e5Vw":{"text":"We were staying close by during our last visit to New Orleans and this place is great! We ","useful":1,"cool":1},"oKDarfnIXra0TqcpzYWKnA":{"text":"Don't miss out on this place if you come to New Orleans. Best food ever all in one place. ","useful":0,"cool":0},"ZHzPTpHgp1bib4EeLKI7Iw":{"text":"I mean, I can see the appeal. The food is good, wine is nice, space is gorgeous.\n\nBut some","useful":19,"cool":8},"W_4F2boGc9WdO8vapxXWxA":{"text":"A simple explanation of St. Roch Market- bougie food hall with slightly pricey food in a a","useful":0,"cool":0},"A8Lb03ftLu95ffstX5Ciww":{"text":"Plenty of portions. Fresh, very bright, good atmosphere. A dozen or so choices. Great for ","useful":0,"cool":0},"Vz55DpkW4ViaUJ2VmJ9m5A":{"text":"It's been a few months since I've been to St. Roch Market, but I remember it fondly. There","useful":1,"cool":1},"HQOPjkkPDxG3bp-UMt-PXg":{"text":"This place offers so many great choices for eating. If you're in town and visiting and can","useful":0,"cool":1},"gSkVE1Y6UUna3hFcOXn5pg":{"text":"If you're a tourist, this place might appear off the beaten track. But trust me, there's m","useful":3,"cool":1},"DEl69zJMUnFepUAtq_it7w":{"text":"This place has something for everyone. Came into NOLA  for a work trip with a colleague wh","useful":0,"cool":0},"FREKFe2dyDMN66oX0XhyHQ":{"text":"Our tour guide brought us here and I was soooo excited as it was on my \"check out\" list fo","useful":2,"cool":1},"OJd4rDvOd-06O08bF4kcdQ":{"text":"Lunch today after cocktails.  Excellent time. I had udon noodle bowl and Lori net for the ","useful":0,"cool":0},"w08-28TEB68ytQQCPvG7gg":{"text":"This old market has 12 food vendors. Check out their website before you go to give you som","useful":0,"cool":1},"-DBCNHK0w6oELj6WiqStkg":{"text":"You have got to try this cute place! It has many different food places to try. You can hav","useful":0,"cool":1},"Cob-S_Rralix8HJPMNh-kw":{"text":"So much variety, so many faces. So much ANAZING food. ISIAH our oyster shucker...just awes","useful":0,"cool":0},"idMNZXp-Fun5_YlTUoM-Ig":{"text":"Bigger than what it looks on pics. No customer service and no legit food. Food was frozen ","useful":0,"cool":0},"mZNQVNsaCD64wNOz7XaA6w":{"text":"One of the best food halls we've ever been to! This place was just a couple of blocks from","useful":0,"cool":0},"lzLeASfJ5QbC1SriyxjHww":{"text":"This is my 2nd time at St. Roch market, and it was a \"must stop here\" destination while tr","useful":0,"cool":0},"_UnDWidpf5tNpIOGN4a-xw":{"text":"I love food halls, and St Roch is one of them! They have pretty diverse food options from ","useful":0,"cool":0},"79KphRkpIHpftvsvoEDDTQ":{"text":"I love St. Roch - Yet had a rude and racist incident at the Haitian Fritai cafe.  \n\nOne of","useful":0,"cool":0},"gXhH4UwZfCQcy3TzuQvq8A":{"text":"This place is cool! I know a few people are complaining that it's a little uppity for the ","useful":4,"cool":3},"yw7TG22OQHvJblWiboRDTw":{"text":"Came here for happy hour with high hopes and it wasn't happy at all.. the shrimp po boy wa","useful":0,"cool":0},"S34nE8pOLo6WKMRBwj_moA":{"text":"Came to New orleans for the 4th time. I usually keep close to the bourbon street area but ","useful":2,"cool":2},"cJYEHOWaQjWLsHUO-oxJPw":{"text":"We went for dinner at St Roch Market on their market day which has craft vendors out front","useful":10,"cool":8},"7hlzsVhwgMidcTop6ozj5Q":{"text":"This was my first visit to the St. Roch Market. I love the concept and atmosphere of this ","useful":1,"cool":0},"xnMPfo8CZI-HtBynDJR2GA":{"text":"Haitian Fritai Cuisine is so delicious, I'll definitely be coming here often! Imory is won","useful":0,"cool":0},"1Sdr7pp6icfJZgO150EiqQ":{"text":"My SO and I went to La Mezcla for our first experience at St. Roch Market.  The whole plac","useful":2,"cool":1},"BSvgr8sRhmNeXs2P8VKh2A":{"text":"Great spot (especially if you have a group with multiple different dietary restrictions) w","useful":2,"cool":1},"rgntVSyxt7Npz6aVfon_Gw":{"text":"Out of the 3 food halls that New Orleans has, this one is our favorite. This is predominan","useful":9,"cool":7},"V8cCzaiGh5wdaheAEsNgbg":{"text":"One visit for lunch.  This place was fine.  If you are close by and looking for a place to","useful":0,"cool":0},"4OTN49rxXzj1JBDgRt-rPA":{"text":"This upscale market features a variety of offerings including desserts and a full service ","useful":29,"cool":13},"OkMzfq3P35SzBUzBdz-E5w":{"text":"Tried the market on a Monday afternoon when my husband and I couldn't decided on what to e","useful":0,"cool":0},"F0MmBbPAu77QxnZbMPz1Xw":{"text":"This place is the best to take ppl because there are so mAny options! I love The Daily Bee","useful":0,"cool":0},"m5Yh3sUIwI2Ip07MPRH3nQ":{"text":"If you can't find something absolutely delicious from the 10+ vendors here you must be in ","useful":3,"cool":2},"9GliY4_TPMjfrbZ_mhw4-w":{"text":"Can't figure out where to take your group to go for a meal anytime of the day? Head over t","useful":10,"cool":8},"1wvV39Ote4wGclAelcUUIA":{"text":"Small food hall with probably 8-10 different food counters, including a bar, seafood, smoo","useful":1,"cool":0},"WjBfq0Ul1VvDlTVVHLTmAA":{"text":"After visiting this gem of a market yesterday for the first time, I will be back soon!\n\nTh","useful":1,"cool":0},"U0PRQDSwPqpuFZkEltsTsw":{"text":"Modern, clean, unique place to shop small restaurants and bars but all in one spot. Everyt","useful":0,"cool":1},"S7QQtf-5z9juuDY8EzS8Sw":{"text":"Awesome place\nGreat food of all kinds\nFun and nice bartenders\n\nThe gumbo was awesome \nI su","useful":0,"cool":0},"1uzR6DXQFD0KTisaVKBbzw":{"text":"Nice indoor market. Clean, bright, and airy.\n\nThere are about 10 or so drink/food stands t","useful":1,"cool":1},"sK4w9QAKqdnWYB66Iz-jrQ":{"text":"First the politics. I live in the neighborhood and I love this place. It's esthetically be","useful":3,"cool":2},"cSuL0Avpdc7VUVa2Ybl8pw":{"text":"St. Roch Market is a great model for how New Orleans can appeal to a younger and more dive","useful":0,"cool":1},"rJpEDNFApHyM5F7lNjYGLA":{"text":"St Roch Market is a great indoor market in the bywater. St Roch reminds me of an upscale f","useful":2,"cool":0},"4ibGi1Xhu6POXVsEFyr-eg":{"text":"What a fun place. Wonderful rehab with untersting vendors. Best raw oysters ever from cute","useful":3,"cool":1},"MXrliPsP4m1XLIuI1nKtxQ":{"text":"When St. Roch Market first took off, they had great vendors. I remember swinging in, grabb","useful":3,"cool":0},"40ntjUxyDMqEsYLcekdNwA":{"text":"Come check them out for the history of the building but plan to eat somewhere else.  Elysi","useful":0,"cool":0},"ET211skCE3RsJjQzOG54aw":{"text":"Very cool space with many food options. Perfect for a group where you all can't decide on ","useful":0,"cool":0},"B_RucOlfLC1r-8n14cq1BQ":{"text":"Stopped by St. Roch market during my vacation in New Orleans and we had to go back again b","useful":1,"cool":1},"FslgFnq1fxeaOz5jwmyOqw":{"text":"I love a food hall! This was a beautiful one located close to our AirBnB so of course we m","useful":1,"cool":0},"S0-aqJFM44Iyt5UiZXHLMw":{"text":"Was not as impressed as I was last time I came here. Some of the places were not open whic","useful":0,"cool":0},"x5OMnGfhKTmSzSBmFTQ6rw":{"text":"This place was great! It's a dining hall filled with tons of food options. We went once fo","useful":0,"cool":0},"xvAuRtHvIm_3HoQFAXZrTw":{"text":"One of my favorite places to visit whenever I'm in NOLA. Upbeat vibe. Different food & dri","useful":0,"cool":0},"Zs8exM3d2T0JqWJv9gX7yQ":{"text":"We went out of our way to visit this place, after reading the reviews, and were not disapp","useful":0,"cool":0},"mvGEse1Lc3y6pSbtsDGOtg":{"text":"Imory at The Haitian booth has the best food! She is so happy and beautiful and the coco-L","useful":0,"cool":0},"dCdOUHnL64ikWK6EBLyYyg":{"text":"Let's start with the appearance.  You walk into this bright cherry space that's clean and ","useful":1,"cool":0},"uJH4RzLe9OHHFFZBU6L8Lw":{"text":"Loved this little food hall. Went very early when they were just opening up. It has a real","useful":0,"cool":0},"DDrH7Bo_ET4iND85EoBXfA":{"text":"This community hub is always pleasant, and the staff are always kind and helpful. The rang","useful":0,"cool":1},"79Uvk1U0kmftccBoRKsdFg":{"text":"I eat here often since its quick , clean and affordable. Its the place I take my tourist s","useful":0,"cool":0},"KBb_ulnrxDwZqivALuhMBA":{"text":"I feel like this is not what New Orleans is about. The market is lovely and has some great","useful":1,"cool":0},"pbcVaT9dkSSlsH0YH4Pz6g":{"text":"Wish  I had more time to spend at this market but unfortunately this was an in between spo","useful":0,"cool":0},"sb8TnLTMPGUqVAnw-rF7lA":{"text":"We made a trek out here based on some of my obsessive pre-trip research -- my husband make","useful":0,"cool":0},"1SXZl9251GXw2_2upWzOCQ":{"text":"First tip: avoid Elysian seafood! The extremely rude staff and food were both horrible. We","useful":1,"cool":0},"XCILuyZqN8_k1pbNvzCoag":{"text":"Great atmosphere and wide selection of foods from various vendors...The back of the market","useful":0,"cool":0},"jBoulebWnGBEHt7T6jDELQ":{"text":"This place has gone so far down hill I want to cry! I used to come here all the time and t","useful":0,"cool":0},"BaUc86lJI0iO_5VfgmGggA":{"text":"This place rules. It feels like a good truck festival with all the variety it offers. Get ","useful":0,"cool":0},"apWzNyz67F_34ioiY21RwQ":{"text":"I love places like this and this was my first time visiting.  My sushi was amazing and the","useful":2,"cool":1},"9wn9o_q0teovDE9uHM-mzA":{"text":"Finally got the opportunity to visit New Orleans and the St Roch Market really helped make","useful":4,"cool":3},"Kjml9yIr9V7yeDaxM0w_Pw":{"text":"a truly beautiful space! st roch is one of the first food halls i ever went to a few years","useful":0,"cool":0},"Cuc0qdgQDRF8Ih2ml1l6qA":{"text":"I was very surprised to find a number of different food halls scattered throughout New Orl","useful":1,"cool":4},"a4aivOr4Tp2d2nL3BVv7OA":{"text":"Bustling indoor food court with very attentive staff cleaning the tables between customers","useful":2,"cool":1},"_oUBXN_eyh2wPxithiavWw":{"text":"i guess it could overwhelm some, but I thought this place was fantastic. its a cafeteria s","useful":1,"cool":0},"ZHcRzqkHCb9m9Cd574QfNw":{"text":"St Roch Market staff gets five stars. I have to start out with that because the customer s","useful":18,"cool":11},"LkZGP0IwuThG_FQlLhoyRw":{"text":"The best crab cakes you'll ever taste! Fresh and well seasoned. The warm buns, mmh. Who do","useful":0,"cool":0},"UUCONFMHCaX13FeduDni1A":{"text":"So much great food. Highly recommend T2 street food for vegan bao, the beet cafe for break","useful":2,"cool":0},"Q06bHABU-U1o39XfWodV8A":{"text":"St Roch Market is one of NOLA's many gems that's off the beaten path. There are a wide var","useful":1,"cool":0},"L-ehXFJwkksDkopfNyEf3g":{"text":"This review is specifically for the terrible and snobby staff of the MAYHEW/ MAYHAW bar.\n\n","useful":17,"cool":0},"aSbkeEIibJo5DqCeRLAwLQ":{"text":"Closed indoor food market with great food varieties. There were so many fusion of differen","useful":6,"cool":6},"fcuVQP3LbjcCzBzCWjlNSQ":{"text":"When I heard that the folks who own the Launchpad in CBD bought this place I had some hope","useful":25,"cool":4},"Pw0uozcyJqLBVo6ByfYA6g":{"text":"Absolutly AMAZING!!! The service here was absolutly outstanding! First stop and my first t","useful":1,"cool":1},"Hd-WNW2uHrqo2KeINHnS0g":{"text":"What a great place to bring a few folks and try several cuisines in one place! \n Flavors f","useful":3,"cool":0},"MutaaVvqXaUY8Srkf9aoWw":{"text":"I found LA in the middle of New Orleans!! I loved St. Roch Market...it's similar to Grand ","useful":4,"cool":5},"O9WrkUnsYhi0a7BQdyTmGA":{"text":"We stopped to get oysters here after a quick tattoo  at Treasure Tattoo across the street!","useful":0,"cool":0},"CXTfBCOGiG3voSGhkKMlAQ":{"text":"This is a cool food court with awesome restaurants. They have a bar with decent prices ($6","useful":10,"cool":8},"Y6GJQUUVbqRzMrCIbni0Mw":{"text":"Walked into this cute market just 20 min before closing. There is an arry of cuisines- Med","useful":1,"cool":0},"62s0rn0AE2hIBKMMPtsVpg":{"text":"Atmosphere was cool. But different vendors run behind at different times. My wife got her ","useful":1,"cool":1},"cLZ-LCbAsY1fUt3pYhyNog":{"text":"Bright, clean and a variety of different stalls. What more could you need? Chairs are cons","useful":0,"cool":0},"VlIuXAftn-edviXIzUlJdA":{"text":"Best oysters I had was at Elysian! Don't waste your time and just get the full dozen. Don'","useful":1,"cool":1},"j50WCHMfhtyM2VILTlg0Lg":{"text":"St. Roch Market is not actually a market in the traditional sense, but a hall of food stal","useful":2,"cool":0},"7fAv8NZZN8daI0Lf_Qe15g":{"text":"I love St. Roch market and eat here all the time, which is why it gets 4 stars. However, t","useful":0,"cool":0},"7wU-r6aJp3Y69VBq5I6RVg":{"text":"I am never disappointed here. There is always great variety and something for everyone. Mo","useful":3,"cool":2},"UkbrTJEOm4MwLc41sooTnQ":{"text":"Lots of different places to eat \nSeveral options of styles of food  \n\nSeating can be chall","useful":0,"cool":0},"xQmE_wclgTP5xHHX1KQGCQ":{"text":"My friend and I came to grab some coffee and although we were so disappointed the coffee p","useful":1,"cool":2},"spc5oYhandI4N6MMCD0-dA":{"text":"The best little market that I've visited so far down here and I totally enjoyed the atmosp","useful":0,"cool":0},"W1ldN8E_19em4v0cqtQCEg":{"text":"Great, fresh food with healthy and vegetarian options. Definitely a please-all with creole","useful":2,"cool":1},"aPFyDnQG3FXkLKFRMvf0MQ":{"text":"Nice atmosphere + lots of dining choices = fun new place to meet friends\n\nWish I could rev","useful":4,"cool":0},"6GGCYoBlAFEehr1S7nJGGA":{"text":"I loved it here at St. Roch Market. They have a variety of foods from southern style, Phö,","useful":1,"cool":1},"YvavpVju-zv-GvcRsD0w0w":{"text":"I go here every time I'm in the vicinity. The coffee vender is pure joi. Not mellow joy, t","useful":0,"cool":0},"uSOAET00qwyVJ-eYUUHApQ":{"text":"I am obsessed with every vendor at St. Roch-- the food is always incredible and the array ","useful":0,"cool":0},"t5uZDfzOeyR7ReGycaXsOA":{"text":"Loved the atmosphere of open market dining. The food was delicious and vendors were very f","useful":0,"cool":0},"76dDdA1uZ6OR8_lZ9wEaOA":{"text":"I have been to the St. Roch Market twice, once new years week 2018, and just last week. Th","useful":1,"cool":1},"gwR_XWwA0DDBsGMRLrkNrw":{"text":"This place is cool and the food is good, but the service isn't always great. The woman who","useful":0,"cool":0},"ZampVH-glMscUFfcIsI2UQ":{"text":"A gem on St Roch Street. They should do more advertising.  I have been here several times ","useful":0,"cool":0},"L1Tn27RjNrM-2WHLDEiCMg":{"text":"Absolutely one of our favorite places to spend an eeNturebday. Many options  in both food ","useful":0,"cool":0},"3odZSTpbdCmfoiYcIulIZA":{"text":"Such an interesting place-very different than any other \"food stand market\" that I've been","useful":4,"cool":2},"BgshGq0dRsIqUmoTssEpyg":{"text":"This place is gentrification incarnate. But hey, it's also really pretty and there's a goo","useful":0,"cool":0},"x0JsY9iphqHrLTQLANFD7g":{"text":"What a treat coming here.  There are so many options to choose from in this upscale good c","useful":0,"cool":3},"8FTGIUEH1cfHnKeh_St2Dw":{"text":"Give me all of the variety !!!! I've come here a few times for breakfast and lunch and rea","useful":21,"cool":13},"LeWLq0FCYriwj72rjP_hvQ":{"text":"I like this market, while it didn't meet my expectations I was still pleased with what it ","useful":1,"cool":1},"oWLrHX2bpVxrw1V0LA-8dA":{"text":"We are from Philadelphia and stayed in an Airbnb 2 blocks from this gem! Honestly this pla","useful":0,"cool":0},"bKgTNKASOPqw19uHx79cFQ":{"text":"Taco salad bowl - was delicious! Needed to warm the shell, but overall healthy and tasty!","useful":0,"cool":0},"nsYixyZ_1r5zrKpBf5RhrQ":{"text":"Pleasantly surprised and impressed by Saint Roch market. Walked up to a building that had ","useful":1,"cool":1},"EsJLfSKPg4FM_vb8so3r3A":{"text":"This bright, airy, clean space provides a variety of food and drink options with enough ch","useful":0,"cool":0},"iUOy7g2IFV8BFZiul_Dy2A":{"text":"Pretty much what Robert B said.  Not a market which is what some native or native-esques w","useful":3,"cool":2},"ZIRDBLGyLIg_cJqnsBDFtA":{"text":"St. Roch Market is where you go when you have no idea what you want or when you're with a ","useful":0,"cool":0},"6Qg_FQhwgg0RCY1fLLEh1Q":{"text":"I came for the Daily Beet, which was closed up due to COVID-19.. boy was I hurt. I was in ","useful":0,"cool":0},"0D9gT5BMgaKBm6SDDCb4FQ":{"text":"Love this place. There's a little something for everyone. \n\nI really enjoyed the oyster ba","useful":0,"cool":0},"PLsjb3wwJ1BtL5-E3BQ1iw":{"text":"We visited the market while in New Orleans for vacation and loved it. Everyone in the fami","useful":0,"cool":0},"pGTS3ALIoosW5mY2r8jJNA":{"text":"Such a gorgeous space with amazing small kitchens lined up along the walls. We loved our H","useful":0,"cool":0},"oOSwOoN-vSX6hzxP3HVLcA":{"text":"Because it took me SO LONG to check this place out, and because I am now well on my way to","useful":10,"cool":10},"D2e_V2IoD22DDK9NvQI6bw":{"text":"Definitely a great variety of food and drinks. Even though I live down the street I would ","useful":0,"cool":0},"ChoL375NMoVV-C7JjPTpFg":{"text":"The market overall is a vibe. There is indoor seating and outdoor seating. It's pretty sma","useful":2,"cool":0},"LE2KFov98bpYgRFxAI-ldw":{"text":"Great Old Fashioned at Mayhew's bar in the back but only if you don't mind fruit flies goi","useful":0,"cool":0},"mcwi3lpwIYVax1l1kPODmA":{"text":"Great selection from several different areas. There's pecan praline bacon to try which is ","useful":2,"cool":1},"wGpmzg8to57HdEmaH2ekNg":{"text":"It said Sunday close ar 10pm our uber arrived at 758pm and its pitch dark, disapointing","useful":0,"cool":0},"r_N53wFxkrIzd5GTdfVPng":{"text":"The anchor tenant of the renewal scene on st Claude. Originally part of SRM was to have a ","useful":0,"cool":0},"j_4XxglH_zERLqVyOWHXlg":{"text":"My favorite place in this cool market is Dolma Egyptian food.  The vendor is friendly and ","useful":0,"cool":0},"5eE_uieJssJRq9JK28AhEw":{"text":"OMGGGG This was my first meal after touching down and I was soooo happy. I got a crabcake ","useful":0,"cool":0},"Mf1DxK90r2ZEyuCn6_BfCg":{"text":"Even though it was grand opening, I was highly impressed! Different vendors all in one swa","useful":4,"cool":2},"jGQEGhm7v_F8qzIHpMZ9_Q":{"text":"MANY PRICES ARE 50% - 100% OVER MARKET\nI had sticker shock when I first checked in (Yelp 4","useful":46,"cool":14},"6k65lCVlkCaXuF6Rn6WLzg":{"text":"I love St Roch Market for its variety and location! Great place to go with a small group, ","useful":3,"cool":3},"UVClzx-39L_dw_Ba4ggo5Q":{"text":"One of my favorite places when I visited New Orleans. It used to be a fish market and they","useful":4,"cool":6},"yk4dACHehGUK6O8UnX4iZw":{"text":"My absolute favorite place in all of the New Orleans area!!!!!! \nGreat selection of restau","useful":0,"cool":1},"Tvjqylq38inZsJHCowNJQw":{"text":"I give this place only 3 stars with a saddened face. This place misses the mark, just slig","useful":11,"cool":4},"WzayFX_Dnb9JHN5L5qzAYw":{"text":"Loved this place - it's millennial heaven or just lovely for the clean-eating, açaí-cravin","useful":3,"cool":1},"OEIvk9lTahGi1iNbm8Do5g":{"text":"Spoiler alert: St Roch is even less a \"market\" than Central Grocery is.  If you're looking","useful":4,"cool":1},"pvzoTfdBYOEdybKXEjur8Q":{"text":"LOVE this place -- highly recommend!\n\nIt's a food hall with 13 vendors (so it's a great pl","useful":2,"cool":2},"hd-DGSDIaxBAD8QndpTPJg":{"text":"We visited Nola for 6 days and we came to this place four times. We loved trying food from","useful":1,"cool":1},"ShL8ROD3b-IUn_Znzx6FjA":{"text":"This upscale food hall is the place to be. Whether you're in the mood for vegetarian dishe","useful":1,"cool":0},"dq3i7CrX7bEW2uanEd8HvA":{"text":"The selection of stalls is impressive for a not-huge space. I had a cauliflower rice salad","useful":1,"cool":0},"6w-PTGiL13Q8i6LI7ONFFQ":{"text":"We had a few hours to kill before flying out and decided to venture out our usual New Orle","useful":1,"cool":0},"hSqznzUFLfdTI1hgdYwhaA":{"text":"This was the perfect place for a Sunday afternoon. This is a great place hidden on Elysian","useful":5,"cool":4},"XteO-N1rbs4Rc55LDDNTBQ":{"text":"St. Roch Market was underwhelming to me.  Not because of the prices or because the types o","useful":5,"cool":0},"xiOawRUuI-yVHFWVeykkrQ":{"text":"Womp. I've visited Oxbow market, union market, and just knew St. Roch market would be grea","useful":1,"cool":1},"Q8fM0Lj4179XGOgSY4bJQw":{"text":"Very impressed with this development!!  A must visit when in New Orleans.  Beautiful inter","useful":3,"cool":2},"hvf8Sbqd8DHHI5UZNz3j7g":{"text":"We stopped here for a small lunch and it was perfect. Prices were very fair and the portio","useful":0,"cool":0},"HmI_uSqiYpVGDohD5Z7c4w":{"text":"We came here after visiting the French Market and really enjoyed it. The location is a lit","useful":2,"cool":0},"WDcsn47DVJKD3_CxQWkB_g":{"text":"Absolutely loved this place. We stayed at an Airbnb which was down the street, which was c","useful":1,"cool":1},"hfHDsaGAd5j7vW4eg6sSKw":{"text":"Definitely like St. Roch Market. It is conveniently located off of St. Claude with parking","useful":1,"cool":0}}