{"yPdKyvSxlGR9sj_ubtPycA":{"text":"We loved the Saturday Grand Tasting...great food, wine and layout well designed to make it","useful":2,"cool":1},"2wvKoLXaFR-cqi6mhPOWMg":{"text":"Overall, not bad. For those who have yet to experience true wine tasting in Napa or France","useful":4,"cool":1},"EyWmGZgdQxyzQDMisYbG7A":{"text":"Review of 2017 Grand Tasting.  I feel honored to be the first one leaving a scathing revie","useful":2,"cool":1},"RVNrOy_Y_dL-GaY3A_-hUQ":{"text":"The NOWFE starts with the Wine Dinners at selected restaurants in New Orleans.  WE attende","useful":0,"cool":0},"s-YrItZblLVDPuKGlU96Ug":{"text":"Grand Tasting was poorly planned. Utter incompetence.  I needn't repeat what the other neg","useful":1,"cool":1},"vF0f4m5Sa5qZr6cFouPwKg":{"text":"The 2017 event was held at Mardi Gras World. This is a warehouse and hard to keep cool. It","useful":2,"cool":1},"ApSNK6aAmc4t3XwXifdGAw":{"text":"The New Orleans Wine & Food Experience benefits local Louisiana non-profit organizations. ","useful":6,"cool":2},"CscUZHxLzpB-od-HIsFjOg":{"text":"ZERO chance that we would ever go back for this... paid $179 for the \"VIP\" Royal Street St","useful":0,"cool":0},"XFSS2affD0FGCyKtrJe5Ow":{"text":"My daughter and I attended the NOWFE brunch and it was fantastic. There was live music, kn","useful":3,"cool":2},"EvGZJ8HRk-Np48RSKCwzqA":{"text":"This is for Friday's grand tasting. Good was cold, taste were ok. Wine was pretty good. I ","useful":1,"cool":0},"COJhX5NboA7DT_Sg03aWRA":{"text":"Used to love this event. So I scheduled around their dates to go again in 2020. Sadly due ","useful":0,"cool":0},"EgC53jvZYGq9pPwh09F-kw":{"text":"This is in my Top 5 events all year long.  Wednesdays are the wine dinners where one winer","useful":5,"cool":0},"kT6wg7TJISc5M58-9J9FWA":{"text":"I am so glad I went to the NOWFE. So many types of wine and fabulous foods and desserts to","useful":5,"cool":3},"XHN9oCo2oCp3AXeqH7Efvg":{"text":"This was the most incredible event I ever attended in New Orleans. The food was top notch ","useful":0,"cool":0}}