{"gCfKNvyabItjaDW3B3aDAQ":{"text":"Seed is the Mecca for Vegans in New Orleans. Everything is farm fresh and vegan. They take","useful":0,"cool":1},"epOpT7APK8wDOdLrDiwrAw":{"text":"A+ for service and food. This place is super healthy and delicious. I started a raw food c","useful":0,"cool":0},"wPmcRYzD3LXG6SHVoFSg0A":{"text":"Awsome place , amazing service and the food ... OMG , delicious the chili fries were delis","useful":1,"cool":0},"mBEa1NCeE08TAYTnGVsRMw":{"text":"Great service. I recommend the Tofu Nuggets with the queso sauce. Also, the Seed Club was ","useful":0,"cool":0},"UAZT1ComyzJ6U3n2n1-jnA":{"text":"Revisited Seed and had another amazing experience. The bartender, Chris, was fabulous and ","useful":0,"cool":0},"TzFrXhAp1KxpdCujSs3JTw":{"text":"I'd been meaning to check this place out for awhile. It's a little smaller than I expected","useful":4,"cool":3},"tBgw3WrZjSfs_8VS0G8tuA":{"text":"Every time I visit NOLA, I make sure to stop by Seed, even if it is only for takeout. I've","useful":3,"cool":2},"Eif4HSc3jDYndsb_oQnYTQ":{"text":"not a vegan, not even vegetarian, but i crave eating something i know to be both tasty and","useful":0,"cool":0},"LR5AG3DPmytfoxacLG5rIQ":{"text":"Okayyyyyy. First of all the Poboy is SO GOOD. Also the chocolate avocado milkshake. I plan","useful":0,"cool":0},"oTMyG0Ju__l4vXI3uWc5xg":{"text":"I can't express how thankful I am that this restaurant exists. Bourbon Street is fun & all","useful":0,"cool":0},"uIV7ppDgoSmhI6f9-wEsww":{"text":"It's nice as a person who is lactose intolerant not to have to worry about food with dairy","useful":0,"cool":0},"NNYrXEywQNfdq_BvyZVz2g":{"text":"Service was awesome! Food was delicious! Loved nuggets! Bbq sauce amazing! Nachos were del","useful":0,"cool":0},"W1xF1TPcbFUj4ydFm02G3A":{"text":"The po boy and Mac and cheese were awesome!! Thought it was going to be a challenge findin","useful":0,"cool":0},"njZU-Af7WVqaGtiHqpOfbQ":{"text":"Holy crap this place is amazing!!! I went with 1 friend, we spent under $50 including tax ","useful":6,"cool":3},"7ERyqjEB-EmdBA2p-OCvBg":{"text":"I had the Southern Poboy with tofu. I had to take another look at the tofu in this awesome","useful":0,"cool":0},"ucz56FACjGkfujk8pUKcFQ":{"text":"So nice to come back to NOLA after a 2 year break and to find so many more places to eat! ","useful":1,"cool":0},"kI_RcYqCiA-Vgk0RcEAWew":{"text":"My friend and I got here around 7 on a Tuesday and it wasn't busy at all. We got seated ri","useful":1,"cool":1},"hwr71D17_wFyKD2cxcMzBQ":{"text":"Really great healthier food when I needed a break from the heavy new Orleans eating. Great","useful":0,"cool":0},"79qRUI9_lV9EJTGTscsfHw":{"text":"OK. I have been to \"seed\" (all lowercase) TWICE. The first time I was on a raw diet. That ","useful":4,"cool":1},"CMUpmk1sQraF_ahciNPQqA":{"text":"The concept of Seed was exactly what we were looking for in NOLA. We wanted to try vegetar","useful":1,"cool":0},"fh3kpgb3imYngGeSCbygbw":{"text":"I love Seed! Very delicious vegan options. The drinks are good too. Friendly service. It's","useful":0,"cool":0},"hIUZtuN7bC1JKSbizBXNqw":{"text":"The food is great but they keep skimping us, i keep ordering the eggplant Poboy and it's t","useful":1,"cool":1},"c_7v03IuvCYj5ydt8ioqRg":{"text":"Liked the place for choices of the Menu and also the Local Louisiana Delicacies. I am a ve","useful":0,"cool":0},"w2LFp3Xnq7XNwO-jo3oANg":{"text":"Great tasting vegan food! This coming from a hardcore non vegetarian person is a true comp","useful":0,"cool":0},"cL_T6K1FgiH5i-r8i0rtHw":{"text":"Great service.  I had the nachos and they were awesome.  Great drink menu as well. I had t","useful":0,"cool":0},"hxCk-T4EJcW2Wq19P8C21w":{"text":"I'm pretty new to vegan food, but I had such incredible food here. Tofu Po-boy is awesome ","useful":2,"cool":0},"qOzBRHzqRKCoFXcBObdiMw":{"text":"Finally a vegetarian restaurant where the food taste good and they don't solely rely on mu","useful":0,"cool":0},"uR4OjMKR9FG2nA7RCA1D8Q":{"text":"Best real coffee house in Boca.  The place I go when I want to sip my excellent coffee, re","useful":0,"cool":0},"pYvmRZfMUCTI8vl-c8VoAA":{"text":"Excellent low-key dining. Food tasted wonderful--had the polenta and beignets for dessert,","useful":0,"cool":0},"WbW6xyb94X_1N8ynO3YSVg":{"text":"Amazing vegan restaurant if you find yourself in New Orleans this is a must to try!!!","useful":0,"cool":0},"WsYwdlYmaAax_4XvT6w5LQ":{"text":"Awesome vegan spot. I love the nuggets, nachos and all the sandwiches,but my favorite is t","useful":0,"cool":0},"LXSHQ1PP0q3TRe29sns-vg":{"text":"Delicious vegan food. Lovely,  lovely staff. Beautiful minimalist decor with warm messages","useful":0,"cool":0},"S656SUbtnpkWVQwdDTtBbQ":{"text":"Excellent qualty , top qualty ingredients but very expensive--grilled cheese, salad and te","useful":1,"cool":0},"BbdmyCTEVjF9XcRjG2uUIw":{"text":"Such a great place for vegan comfort food! I'm not vegan by any means but have been trying","useful":3,"cool":2},"1QuJ8nhZnvwhg-ALBtYmnw":{"text":"Disappointed almost entirely with Seed, especially after going to so many great places in ","useful":5,"cool":0},"JiSXGvXu3MlRPTv3PZTZ0g":{"text":"I'd give this place 1.5 stars but I'm choosing not to round up. So 1 star and its for the ","useful":0,"cool":0},"dCKpWzaTHuRYF3FtfFZroQ":{"text":"Vegetarian gumbo was great so was the Egg plant Poboy once you take out some of the bread.","useful":0,"cool":0},"8_Tggo8BwAJRltBTps-GEQ":{"text":"Food was delicious! Ordered the BBQ sandwich and the Seed Club. The staff was very friendl","useful":0,"cool":0},"tHxi9GNzYn2SzeYY95wGPA":{"text":"While I definitely can appreciate vegan, this is more of my wife's kinda food.\n\nThat being","useful":0,"cool":0},"f1xJdDG-XUlLf6jJWBtOMw":{"text":"If you are in New Orleans do yourself a favor and check out Seed. It was so good we had to","useful":1,"cool":0},"BfZ2Q1JfLxl90iIgrUZYyQ":{"text":"My vegetarian (no seafood either) brother and sister-in-law came to visit this weekend and","useful":2,"cool":1},"Eew8MAXzy4SeqAQpitdeDQ":{"text":"Me and my boyfriend stopped here for a quick lunch and we were pleasantly surprised. I'm v","useful":0,"cool":0},"fuaGUvQh65eH42tA0RNMKg":{"text":"Pleasantly surprised to find this restaurant while visiting New Orleans. Bright, clean sea","useful":0,"cool":1},"khd1HDnsmwChWkyYNgRMpQ":{"text":"On a recent visit to NOLA, I quickly got tired of the touristy areas (and minimal vegetari","useful":0,"cool":0},"73O5HcenhRgR8AWiWSPknQ":{"text":"What a wonderful place.  I am not a vegan, not even a vegetarian, but I LOVED this place. ","useful":0,"cool":0},"SPop9GjIMkrayEHWDdPbpQ":{"text":"Holy moly!  This food was so good!  I'm pretty sure we ordered the entire menu post Ironma","useful":0,"cool":0},"6vi5yIoRd6YO7sDPb_mLSw":{"text":"It is hard to find good vegetarian/vegan food in the area, but this is the best of the bes","useful":0,"cool":0},"4pgJRbVcKZ78soyRn2SH6g":{"text":"Wow, top 5 best Vegan food I've eaten. Highly recommend if you're in the NOLA area. The Na","useful":0,"cool":0},"6elUbnVd7fs5X_Tu-lZI9g":{"text":"I have been a meat eater since birth. I have tried vegan and vegetarian food, all of which","useful":0,"cool":0},"obsXVCSlZo8eTYpJU0oBBQ":{"text":"For New Orleans, this is as good as it gets for healthy food.... thus 5 stars.  But if you","useful":5,"cool":2},"F7b05UaHaRWFTM-_CfSpKA":{"text":"Awesome food totally exceeded my expectations, nice ambience and organic condiments :) Def","useful":0,"cool":0},"bKA0j6rFCA7VEUAmKqb7MQ":{"text":"Great little find during our short trip to New Orleans. This place was right across from o","useful":0,"cool":0},"LccWKcMAk2S0SuEFziwLoA":{"text":"Was living in New Orleans for a bit over a year and Seed was definitely one of my favorite","useful":0,"cool":0},"78qR2r8fQkN3t6E5WGONMw":{"text":"I'm only giving this one star because you can't give zero. We walked in and sat down and t","useful":0,"cool":0},"KDSpYwhT6-Yo_Bi_sp7y_A":{"text":"Liking vegan food, for me this was a could not miss in NOLA. It was just as incredible as ","useful":0,"cool":0},"jH_TVuOXjQyjdZ8BYh3Syw":{"text":"We ordered the artichoke cakes, Parthia raw and burger and we liked all\nOf them. I can't s","useful":0,"cool":0},"UeJ2u9hxKiRsx464tAsVcQ":{"text":"How is it possible that a 2-week running vegan restaurant can compete with the best of Phi","useful":1,"cool":0},"qnv3Rtc9ZhlsnWoNcwHMjw":{"text":"As a lifelong vegetarian, I was in New Orleans wanting to try classic southern food but wi","useful":0,"cool":0},"QcKqBawSAjKKrzLa4pu2JA":{"text":"They get two stars for the stingy portions.  And for using frozen crinkle cut french fries","useful":1,"cool":0},"H_MzN9-C6XGkqD4sm1p3xA":{"text":"This place is amazing! Great food, awesome service and amazing prices. For dinner, I split","useful":0,"cool":0},"GYGkGx7rhUdTJ1C063uOIQ":{"text":"Their BBQ sandwich is THE TITS (incredible). Never have I wanted a recipe so badly in my l","useful":0,"cool":0},"pKjF81oYjVqXVhlZ_mTDfQ":{"text":"Seed is a great stop for vegans in New Orleans. The food has a higher-end feel but the spa","useful":0,"cool":0},"i1_--ftJVionDNbOjliG3w":{"text":"Best health food in the city. Everything on the menu is vegan, even the nuggets! The  bart","useful":0,"cool":0},"1Jp4MvYnrXrxIUEWbLCVzw":{"text":"This place is kind of hit or miss. The po boys they have are amazing. The artichoke cakes ","useful":0,"cool":0},"xeYy6akw16a26kAAYA2URQ":{"text":"Surprisingly good! I'm not vegan or vegetarian, so I was a little apprehensive, but my wai","useful":0,"cool":0},"vbjh8szFcUrp5BiVnSk82g":{"text":"Great Southern/creole style vegan food. I went here four times during my stay. I loved bei","useful":0,"cool":0},"chC01xpsV0Xnj9z5EH_zzg":{"text":"Seed is a vegan restaurant. The menu is exciting and the food was delicious . We will cert","useful":0,"cool":0},"75XXIbIkMIqYGnXiUniHNg":{"text":"This place is SO good! Lots of fresh raw options, along with veganized NOLA staples like g","useful":0,"cool":0},"hk7QYD2YHW9ESuikfnBZYg":{"text":"I was visiting for a conference and there are not many plant based options in this town.  ","useful":0,"cool":0},"p4i6wBLTc2FxLOSKU3pFSQ":{"text":"Went to Seed for the first time tonight and I was actually impressed. Ordered the nuggets ","useful":0,"cool":0},"HTxZ4fYoFFSbW98ERZ-pSg":{"text":"They do vegan and they do it well. Pro-tip: Order the tofu nuggets, you'll thank me later.","useful":0,"cool":0},"JT2wvo1tFRch2CIb7vwefg":{"text":"Very good food, especially the artichoke cake and gumbo. Vegan food prepared in New Orlean","useful":1,"cool":0},"yGVFjm-rxzsJlRYp5Q_aNA":{"text":"went for brunch there for the first time and couldn't have been happier. the place was ver","useful":1,"cool":0},"ygAcd8NnRfnp5HbwuvFRlA":{"text":"I'm a vegan of 12+ years with tons of allergies (dairy, tree nuts, etc.), and an out-of-to","useful":3,"cool":3},"jbZU8C5uOSMO4TcTBlp9NQ":{"text":"Good place to have some fresh and healthy dinner. The bartender was super nice, waitresses","useful":0,"cool":0},"aYYqJ3lFEFJUTd5P2TrHWw":{"text":"As I find more and more vegan options coming up in the city I notice their service and at ","useful":0,"cool":0},"pcxVQkun7eMcxBvxRGOI5Q":{"text":"It was a sunny Sunday, and a perfect day to walk over and check out my new neighbor. I was","useful":10,"cool":3},"3p94UDgQkJDTg7kuk9_rTA":{"text":"I was very happy to find a vegan restaurant within walking distance of a conference I was ","useful":0,"cool":0},"9uwvtjQDN11ICGJhUVS1Tg":{"text":"This place is amazing and I want to eat/live here every day. I can't wrap my mind around h","useful":6,"cool":3},"2ksXvbbZaELk1JpsiqOdjw":{"text":"Great vegan spot outside of the French quarters. We went for breakfast and it did not disa","useful":0,"cool":0},"PSV7jCwUf1hJxiY-HLlIwg":{"text":"We arrived as a family of 4 with a baby. We were greeted immediately and seated appropriat","useful":0,"cool":0},"4AM6J3fyfEHKEP-PFRGoOQ":{"text":"Fabulous all-vegan menu, marked for soy-free, gluten-free, and raw foods, all New Orleans ","useful":2,"cool":0},"mZR8KuUZE8q3ezcL5KkRqA":{"text":"I got a Southern Fried Poboy and Standard Juice to go and ate both outside in a park, alth","useful":1,"cool":0},"hGu-4Fryl2Th86E58y8q_w":{"text":"Super delicious, amazing food!! My family not loved it but cheeriest every bite. Excellent","useful":0,"cool":0},"hm1cOLKZ1LGysqKv5flhsg":{"text":"Delightful meal. Great to have everything on the menu Vegan. Fun kind and inclusive. I lov","useful":0,"cool":0},"V5HMBnnqU_uurKj0UK6_yw":{"text":"OMG. Delicious vegan food! One of the best vegan restaurants I've been to.\n\nMy fav - phad ","useful":0,"cool":0},"yxoCFllrCjbMTnX0TzKCOw":{"text":"I've been yelp stalking this place for a long time and decided to come here for my birthda","useful":2,"cool":1},"BSiEX1xqBa3-6KFtaG8DPA":{"text":"This is THE BEST vegan restaurant in all of New Orleans. Great ambiance, service and incre","useful":0,"cool":0},"U58SJmTHGDyU9bmJoP-kAQ":{"text":"There are a lot of good things to say about Seed. First of all the food quality itself is ","useful":0,"cool":0},"jKnbeKQ6OJ7YEs9wUHSkSQ":{"text":"Seed was excellent. I was already planning to return and try out more items on the menu be","useful":1,"cool":0},"iZ0_Xdy526NryX6kMkIKSQ":{"text":"Love this place. Everything looked delicious; hard to decide what to get. I went with the ","useful":0,"cool":0},"RRsMxFr_7uGS7QTB2Q4-cQ":{"text":"Delicious tofu scramble with Seitan! I couldn't resist ordering the artichoke cakes, which","useful":0,"cool":0},"EKCUOME7DXjjTJQ_j4uTyg":{"text":"This is one of the best (and one of the only) vegan restaurants in a city known for rich, ","useful":0,"cool":0},"yvO3mc2QneANeBziF2IjfQ":{"text":"Best vegan options ever.   I never had a po boy until I ate here and I grew up in New Orle","useful":1,"cool":0},"K5CYtBUMP2LzDtQL4yafFw":{"text":"Meh. Maybe one shouldn't come to the Deep South expecting bomb healthy food. I ordered the","useful":0,"cool":0},"6_fD-_YVBMNsON5Yv722Rg":{"text":"My partner and I love Seed. Their menu has things labeled gluten free/soy free for you so ","useful":0,"cool":0},"MKd8abeSxhH2rKepTmK2uQ":{"text":"There are times I come to Seed at least 3 times in one week. I have been numerous times an","useful":1,"cool":1},"-II4GRb2ctsV3iZPQtdpBg":{"text":"Amazing food I really recommend this place all we ate was amazing, plus next to the restau","useful":0,"cool":0},"BoqDgECDMEIDLNAhS8c58Q":{"text":"Cant speak for the food (other than the small portions) but do NOT order the drinks! This ","useful":0,"cool":0},"CZso9Yt5rFoJtyEgi74mWw":{"text":"I had the artichoke cakes & the super charge coffee smoothie, both were exactly what I wan","useful":0,"cool":0},"lyn18VJOlTpTeOriX-jFYg":{"text":"I was very impressed with this vegan establishment. My mother ordered the nachos that had ","useful":0,"cool":0},"oablcgwZXLAhepV2VSQtOw":{"text":"Overall, for plant based eaters - this is a great place! The gumbo was tasty.  The creole ","useful":0,"cool":0},"AecptZk7REh3WbfYxVLflg":{"text":"I must preface this by saying that I am not a fan of vegan food.  I went b/c my friend is ","useful":0,"cool":0},"-kO3cWzD9AhL-q4xcti9dQ":{"text":"Very small but quick service.  Food was very good and if you are looking for a Gluten free","useful":1,"cool":0},"lhyR3wakLT2y1ouSGZLyvg":{"text":"I couldn't say enough great things about SEED. We spoiled ourselves to try a few different","useful":0,"cool":0},"nukBGhxAe5Q6imnIXg6H1Q":{"text":"The only reason I'm giving it four stars rather than five is the price. For the amount of ","useful":2,"cool":0},"72pdszibZpZd5ZF1i6lMHA":{"text":"I expected more based on Yelp reviews. Perhaps it was just an off evening, but I walked aw","useful":1,"cool":0},"JcUIGC1s_E3D6d5QLocyhw":{"text":"Any place that dedicates their restaurant to vegan food is great, but Seed isn't perfect. ","useful":0,"cool":0},"WUqSSh_pT-bDA279tZ_NJg":{"text":"We'd been meaning to try Seed since we first heard about it, and had high expectations--it","useful":2,"cool":1},"aCbEDtdbgxruDtrVz8kwww":{"text":"This spot is DELICIOUS! the Gumbo is the best! Their drinks are really good; specially the","useful":1,"cool":1},"Me-PdwRELUNzvWLzlYCJCw":{"text":"I'm not particularly needy in the vegetarian/vegan/raw food area but give me good ingredie","useful":11,"cool":4},"ES6LGphRk9MKGkxgdoOOiQ":{"text":"I had the tacos, they were delicious. Definitely planning on going again. The place was al","useful":1,"cool":1},"REouiSf9WqXeZFVgXjqEnQ":{"text":"The food and cocktails are great. I recommend the tofu scramble plate, southern poboy, and","useful":1,"cool":0},"rkJ5QqehO8UkCCioep_ykA":{"text":"This is exactly what I was looking for coming from out of town! Great friendly staff with ","useful":0,"cool":0},"mIBxdWg6bvaXH0r3nTAf3w":{"text":"I'm vegan so I was excited to come to one of the very few vegan restaurants my city has to","useful":0,"cool":0},"TI4TglPixXHdGs4t6gyi_A":{"text":"Oh.My.GOD!\n\nIf plant based eating was like this every day in my life, I would never consid","useful":6,"cool":6},"rCMyUzxVvrIp2zZX2NtIgA":{"text":"One of the best vegan places I have ever been! Great food at reasonable price. We ordered ","useful":0,"cool":1},"cQMmk2JCMBdlzBtPiUcBzg":{"text":"We had New Year's Eve dinner here. Loved every single dish. Service great. Delish, can't w","useful":0,"cool":0},"xknJYSvbtVHta1Ma7Bl-Kg":{"text":"Vegan nachos!!! So filling that I couldn't finish (and that's saying something). I did ask","useful":0,"cool":0},"sOfxkyTHn2z6CUpUE8LjvA":{"text":"The food receives 5 stars. It was unbelievable.  I had the southern fried poboy and my com","useful":0,"cool":0},"khklRRZOPSo39-5nhE96sw":{"text":"Everything I have had here has been above average in terms of taste, presentation and vari","useful":0,"cool":0},"tJaZfqgCmR57I6xjadWPgA":{"text":"1st time in the city and so excited to find Seed. Did a take out. Staff very friendly. Lov","useful":0,"cool":0},"g3Gh6yMtDj9SyOU4s3GKjQ":{"text":"I LOVED this place. My sister and I ended up eating here twice on our trip. The first time","useful":1,"cool":0},"8KnYAwv8PC_Zd273tvKP2Q":{"text":"It was good, but not as special as everyone has talked it up to be. It's a vegan restauran","useful":0,"cool":0},"XDgQ_VrNbO4F0B0TwGX90w":{"text":"Ate here 3 times in the course of our 4-day trip. Was very impressed! I was SO excited to ","useful":1,"cool":0},"vr0uxVxRivU2XPR8nNgp2Q":{"text":"Absolutely delightful! It's a small place and the service is great. I had the eggplant po-","useful":0,"cool":0},"eLSiB6sy-tn540g-4VTxVQ":{"text":"Have been traveling a bit lately and trying out some vegan options.  Seed did not disappoi","useful":0,"cool":0},"VwjQTAbvvHc5MolEMFgT-g":{"text":"This place is ok as far as vegan / vegetarian food goes. There are other veg po boys w/ mo","useful":0,"cool":0},"O0vBLqyB8z5QhwGueS0I4w":{"text":"My friend and I really enjoyed the food here. We got the southern fried nuggets, chili che","useful":1,"cool":1},"kOMsMUwICQRm1pTpkAwadA":{"text":"Wait staff wasn't very attentive. I'm posting this a little late because it was in my draf","useful":0,"cool":0},"24RcYGEUzK1xHt29J695bQ":{"text":"Food is pretty good, minus the bread that the po boy sandwich is on. \n\nService is slow and","useful":2,"cool":0},"eXkok7es0h53mkVTRKWASQ":{"text":"Service could be a little faster, but not too bad. The sweet corn polenta was pretty good.","useful":0,"cool":0},"M0VAHl9Yxq2mXEZB-Dvhyw":{"text":"Amazing. Not just soy processed crap, but great, fresh ingredients! I really wish I would ","useful":0,"cool":0},"_5iL5KgGjPqORbT3TmtdRQ":{"text":"I've been to Seed a few times and I love it all. Really yummy and filling vegan food. We j","useful":0,"cool":0},"WkSvZfN-pTckZHBxQ7MyXw":{"text":"I usually stick to the concentrated area that is the Quarter, but I made an extra effort t","useful":9,"cool":3},"fadSH9BYDRzZsBC3i2b8oA":{"text":"A very pleasant and quaint local shop. All the food here is organic and what I had was fai","useful":0,"cool":0},"LO_Omdu1fBYM1S2MvzLflA":{"text":"Great food and nice selection for vegan southern food! Nice vibe inside and there are a fe","useful":0,"cool":0},"qcdFzjBMG85xnTQIGp5ELQ":{"text":"Possibly the best thing that happened to New Orleans! Outstanding food, service and ambian","useful":1,"cool":0},"eMnPcDSLYBoXh1m40W6l-g":{"text":"SKIP IT. SO VERY BORING. \nThis was like going back in time to the first few years when I b","useful":4,"cool":1},"AN9BNnNoHr_d1qVREy0L-g":{"text":"We were very excited to check out a veg restaurant!  However, we were completely let down.","useful":0,"cool":0},"flEMyVKYKxSpU5ZK3PzenQ":{"text":"Good Lord the service here was terrible. We went to this restaurant twice during the stay ","useful":7,"cool":3},"xXHN2tzc2f_CQO2j77T7Og":{"text":"We came in 15 min before they closed and received friendly service.  They suggested the ar","useful":0,"cool":0},"xNnAjzuhcJ61rjEE0guAVQ":{"text":"I am a vegan living in the midwest. Not a lot of vegan restaurants in my town.  Correction","useful":0,"cool":0},"bMMYfSCZvN6WdHdBOeTaFA":{"text":"Just moved here from Seattle. I'm so happy I found this place! I'm absolutely obsessed wit","useful":0,"cool":0},"KM3ajxvHNbXhe3nnvgAG6A":{"text":"We will definitely visit again. There are so many incredible options on their lengthy menu","useful":0,"cool":0},"16IUSgNSYecceWE9Qxu4Pg":{"text":"The food here is excellent. I feel there is something for everyone, even if your not vegan","useful":0,"cool":0},"D5u17AcJztSoVQPCtnnZ8Q":{"text":"This place is AMAZING. I will bring even my non vegan friends here because the food is so ","useful":0,"cool":0},"mN3MSIuPKrFPMCP7kvzI5g":{"text":"I'm visiting New Orleans, a city known for its food, as a vegan-- and not finding a ton of","useful":0,"cool":0},"JW0nSEZ8XYdbpDTKer8cWQ":{"text":"My wife eats Raw food and I eat vegan/vegetarian, so this place hits the mark perfectly! W","useful":0,"cool":0},"S5CUlLWUk8rh2UPxsm70gQ":{"text":"All my food was delicious . Customer service was great . I loved everything about this pla","useful":0,"cool":0},"Ay_Xo-2wZzs52HSfF0VwGQ":{"text":"Wow! I'm so glad I got to try Seed. My group shared the beet carpaccio, nachos with nut me","useful":0,"cool":0},"b2G3LeiB3wSThHozn9Xsrg":{"text":"So the food at Seed is super super yummy and I would have eaten there everyday if I could.","useful":0,"cool":0},"OOIz9wmipZlgNSt6LBCzpA":{"text":"Excellent brunch after several days of gluttonous eating and drinking (as one does when vi","useful":0,"cool":0},"xD_DVzPqcYOWQ9umgzFqnw":{"text":"This is a cool vegan spot. I liked the lighting and art. Overall, the decor is hip and inv","useful":0,"cool":0},"2f52bny7dZUrKJubLSbM7g":{"text":"Loved Seed so much we came back a second time during a four day trip.  The nachos, beignet","useful":0,"cool":0},"D1yFt485xlTEjTONXvWX6w":{"text":"I am not a vegan or a vegetarian or a tree hugger. But, I'm not a carnivore, I do like veg","useful":2,"cool":2},"Xh34DE18PF9ZMcZ_N5iDRQ":{"text":"First time home back to NOLA in two years and happy to report the establishment that took ","useful":0,"cool":0},"Im7uKuKR9TubZEgOSuouSg":{"text":"Food was amazing !!! My sister and I had the tofu chicken nuggets and chili cheese fries. ","useful":0,"cool":0},"Ijb-bGSiKB5XjjAeVHmuqQ":{"text":"Something is different...since moving out of NOLA 4 years ago we have made it a point to g","useful":0,"cool":0},"9mtnx6wXD09aiEmMix56Cw":{"text":"So so good! Nice space, attentive service, and AMAZING FOOD. The fried tofu was by far som","useful":0,"cool":0},"MY4O9gGIrLrgdBNqGKTy8A":{"text":"This place was AMAZING!!!!!!!!! I am visiting from Miami with my husnband and we couldnt h","useful":0,"cool":0},"uofbpq9v4sJqGDL2WPkoCg":{"text":"I love hunting out vegan spots when I travel... I ended up here twice in 24 hours. All the","useful":0,"cool":0},"aoUmnXRLnBR1gD3czfZsSg":{"text":"OVERPRICED!! This is an awesome place to go, especially if you're vegan, but the prices ar","useful":0,"cool":0},"-OE3cm7trtDIXRnxec71YA":{"text":"Really enjoyed the gumbo, and palm artichoke cakes.  The egg nog cheesecake was frozen whe","useful":0,"cool":0},"mW8vtOXiv9lFwsFPKO9T1Q":{"text":"I'm not a vegan, but was trying something new and different to eat.  I ordered the fried t","useful":0,"cool":0},"zdYUb84gr9C1JKKsAfq8TA":{"text":"Amazing vegetarian/vegan spot.  The place is clean and cool.  They've got juices, smoothie","useful":0,"cool":0},"lkkg1FUDIeKUUu32CtZFvg":{"text":"We arrived to New Orleans last night and this city is something special! \nThis has gone mu","useful":1,"cool":2},"KTY5ld0arQAeEU1clHyDIQ":{"text":"Sooper food. Always..\nEnded up being here after 3 yrs and this place still upholds it's ta","useful":0,"cool":0},"Hnk1BltOpsMNaS_HfMAnqw":{"text":"What a treat to find this delicious, Vegan restaurant in the middle of New Orleans! The fo","useful":0,"cool":0},"ohVdHaT8Q7Lg-gDUEhZPmw":{"text":"As soon as you walk in, you just know the food is going to be good! I ordered the Gumbo, a","useful":0,"cool":0},"xYEgbd5RrUFl4gfMqVOb7w":{"text":"I ordered their nachos to go and OMG they were amazing! They were $10 which is high for na","useful":0,"cool":0},"v8oUII4dyRqJccLQQ6zqKQ":{"text":"As a New Yorker who came down for my bachelor party, I was worried about finding vegan foo","useful":0,"cool":0},"LfNSRS1J9Ge7QwkbOq97Ig":{"text":"Gourmet. Amazing. Best seitan my husband has ever had. Best raw pad thai... ever? If you'r","useful":0,"cool":0},"0zICRtraELwD2bXsMwgL4w":{"text":"This is a spot you must try whether you're a vegan, vegetarian, or vegan wanna-be like mys","useful":0,"cool":0},"jlbi2n-3ddUrZ4b8OU-M-w":{"text":"Cozy, warm atmosphere and good brunch options. Service was fast and friendly. The eggplant","useful":0,"cool":0},"Vnb0c3-y3dHDcEYhUMr2kw":{"text":"It was about a year ago I had the pleasure of spending time in NOLA and traveling around t","useful":1,"cool":0},"YlRSw9iWgUkvSTC6HrfFUw":{"text":"I really liked this place and, as a visitor, I enjoyed vegan versions of New Orleans stapl","useful":0,"cool":0},"uRU4kljpqwIlX10cET9ltQ":{"text":"Great gluten free, vegan and raw options.  I've had the nachos, salads, pad thai, veg past","useful":0,"cool":0},"uB09NnGKd_u6Whjq38ddUg":{"text":"Great food and friendly staff. I go here regularly and have tried quite a few dishes. So f","useful":0,"cool":0},"2zOx3ecVHW2k7NEiKN9WyA":{"text":"This place does a great job of providing flavorful, healthy vegan fare. I was impressed wi","useful":0,"cool":0},"Ll4rSUgzLUuT9XXiM9B35A":{"text":"Great Decision to try this restaurant with friends! I had the Mac N Cheese, and tofu nugge","useful":0,"cool":0},"NT5UynL-wNBoCOA_vFMedw":{"text":"I wanted to try this place for a while and finally got the chance to check it out. When yo","useful":1,"cool":0},"-ND0bp5L1vmNaiYpNHch6Q":{"text":"Bartender was really rude. We stumbled upon this place while walking. We decided to get to","useful":0,"cool":0},"BMNW5bOy3s1yIaOHot1y7w":{"text":"came in with a group of friends (7), food was eh. Food wasnt good enough for me to return.","useful":0,"cool":0},"j5ZChBEpJfSZUKaju-w_Cw":{"text":"It's so hard to find healthy restaurants in New Orleans since moving here, but this is by ","useful":0,"cool":0},"QkK34aJCO3d81gq8SUuLbA":{"text":"I am totally surprised! This little gem is nestled in a small nook and is full of all natu","useful":0,"cool":0},"FHRW9eWa6t9XMiNZcmGBsA":{"text":"I tried the pad thai. It tasted good but was very small and not very filling considering t","useful":0,"cool":0},"lU8E08Ets96FbRDATvidfw":{"text":"Before heading to New Orleans for a conference last June, I began researching vegan restau","useful":0,"cool":0},"zlZZweCOO7pe_4LFT2KVNg":{"text":"Vegetarian restaurants have never been able to have staying power in New Orleans- too grun","useful":5,"cool":4},"vYRni-qKs7B8NGH_DR2YfQ":{"text":"The food was incredible but the staff was less good... \nThe food had loads of amazing flav","useful":0,"cool":0},"fsrabvWFhM4TQTMWFrTmvA":{"text":"My wife and myself went to New Orleans for a trip  and happen to find this restaurant thro","useful":0,"cool":0},"eyu4JBcIUpT0h4DJqFYH6g":{"text":"Let me start by saying I am not a vegan. To start we had the tofu nuggets which were incre","useful":0,"cool":0},"PpdcF8oKlye8aAuzpe33gQ":{"text":"My first visit was AMAZING. I ordered the vegan nachos to go. I had a hearty amount of cas","useful":2,"cool":1},"yn2OeTsNH05vT2CZIEFxwg":{"text":"So awesome! The beignets were perfect! The first I've had in years. Tastes just like I rem","useful":2,"cool":2},"5HtAkGPFONeW4F3VgvVPWQ":{"text":"vegan haven. so so so good and fresh and not heavy. got the seed club (a1 if you love aoli","useful":1,"cool":1},"fZy9zBAjggkPe56hp_tBJA":{"text":"So good we went back the next day! So excited to find quality plant based restaurant in NO","useful":0,"cool":0},"Ucoj3E6TGyjekLRbevWaNw":{"text":"Nothing short of AMAZING! The food and cocktails were so DELECTABLE! We recently converted","useful":1,"cool":0},"2OVlXHT1N1Waoa0gZiJtUQ":{"text":"How happy was I to know that there was a 100% vegan restaurant not far from my air bnb! I ","useful":0,"cool":0},"UwnYinnMV0BWmw5xKTgM6g":{"text":"Like all my reviews, I base them off of what they are trying to be, not based on what my e","useful":1,"cool":0},"HEs65mrrfibjX107WB88zQ":{"text":"The food is whatever. I had the nacho which had very little toppings. Did I just pay $14 f","useful":2,"cool":2},"IXm4LWTjmZ6Du4QVPE1QwA":{"text":"Very vegan, like 100%.  So, if you're looking for vegan, you'll be here if you're in NoLa.","useful":5,"cool":4},"gMKS1Ldyf2WbeyPguLITmg":{"text":"Food was really good, but unfortunately was spoiled by the rude service that made us feel ","useful":0,"cool":0},"SSl9iLjmP2O3wN4AQLi3iA":{"text":"Great food. Nice atmosphere.  Neighborhood a little sketchy. Right near a street car stop.","useful":0,"cool":0},"orBpHNe_9BAjsaUXaXWj2Q":{"text":"Wow! I was so impressed at lunch today! I walked in for lunch and grabbed a cozy table in ","useful":3,"cool":3},"9u-fCh8FlT4W_3SKUlsMmg":{"text":"Delicious! \n\nI found this place accidentally while scrolling through Instagram.  Such a gr","useful":0,"cool":0},"J6Rrob7pQbeANhH-CkC0CA":{"text":"Having a vegan girlfriend come to visit me in the city of meat and fried food was going to","useful":0,"cool":0},"tCtOXqh64x80pZwxJ3JYyQ":{"text":"We came back home to visit family and found this awesome vegan spot. The food and smoothie","useful":2,"cool":0},"ZuFJDexxLv0Ui9ul8dobfA":{"text":"5 stars for atmosphere, food and amazing service! We had artichoke cakes, gumbo, raw pad t","useful":0,"cool":0},"k57bB6PcJw2m_-B-hiD-FQ":{"text":"UPDATE: went back to this place recently and it is even better!! The beignets were hot and","useful":1,"cool":1},"bfT2PJZPQGQVBAUhpIS6GQ":{"text":"Perfect spot for lunch with friends. Most of my friends are vegan or vegetarians, so we ca","useful":0,"cool":0},"9M3U82UNGAeD_X1qOcKdZA":{"text":"Very rude to me and my girlfriend! Food super disappointing and might even be frozen?","useful":0,"cool":0},"jcbOivTmHUi_QNKasNghsw":{"text":"I live in Brooklyn and delicious vegan food is readily available pretty much everywhere. L","useful":2,"cool":0},"8YTuL21SlD24qpCQ2HK2xQ":{"text":"My girlfriend and I decided to stop by Saturday for lunch. We started with some of the Ear","useful":1,"cool":0},"mPyvlRBRhN3hSHo0DMDWrQ":{"text":"I'm no vegetarian or vegan but I really enjoyed the grilled cheese and the drinks were gre","useful":0,"cool":0},"C-If8VXVL3NNPjaZa2PkVA":{"text":"I'm not a vegan or a vegetarian and you don't have to be to love this place.  The food is ","useful":0,"cool":0},"wA7OzGPstE0gGhwAVhHMhQ":{"text":"I had been looking at this place for a while, and was really hoping it would be great. But","useful":0,"cool":0},"jlP-Lex-NzQ_7_izvYHkNA":{"text":"This was my first vegan experience. The waiter was friendly and my \"chicken and waffles\" w","useful":3,"cool":3},"cgc7m_Tv9wErgah7gktHUg":{"text":"Five stars for the eggplant poboy, with salad on the side! So yummy and a great value at $","useful":0,"cool":0},"az2bGyqoPEvOiSWOghOHNg":{"text":"Went for dinner last week and it was a disappointment. Every thing seemed to be a small pl","useful":0,"cool":0},"L5vFT5CPw4PeNmwXEAqIKA":{"text":"I am disappointed in this restaurant. My husband and I have been coming there at least onc","useful":2,"cool":0},"YKrvAfGS0l7TfWzpiJn31A":{"text":"We had lunch  on Saturday while we were in NOLA. A friend from LA recommended, because he ","useful":0,"cool":0},"uUnDOqdTP0oC6yk8Ifw1jQ":{"text":"Great all vegan menu. Service is super fast and attentive. Nice atmosphere. New Orleans ha","useful":0,"cool":0},"-kzaZ-m45ktycQ93b3UQkQ":{"text":"Finding SEED in the vegan/gluten free food desert that is New Orleans was the highlight of","useful":4,"cool":2},"AYyzaZcNtiqs9AYE_2kP-A":{"text":"I enjoyed a delicious taco salad with walnut meat. My husband had the blueberry pancakes a","useful":0,"cool":0},"5BCrgVCqEFcm1Hrk7zuHKA":{"text":"First of all this place is adorable inside. Lots of fun and sweet quotes and it has great ","useful":3,"cool":3},"LAibDYqhdHDEvwcU7nVaoA":{"text":"I am with Joi B. (review below) on this. I really wanted to like the place, it's very prog","useful":3,"cool":0},"_rVR1RFybyl_Y_kNchFaMg":{"text":"This place was great! Passing thru and was excited to try. It gets busy here so be prepare","useful":0,"cool":0},"J-TuBy5OmcLOZtXcCK5spQ":{"text":"I really wanted to like this place. It smelled strangely and there were flies and gnats. D","useful":0,"cool":0},"9e5bEGnXjHyOzQ1gbznSuQ":{"text":"What an amazing vegan place in New Orleans. I can say that Seed is one of my favorite Vega","useful":0,"cool":0},"rRBHj4pelkOckpZlQdASag":{"text":"This place is insane. If you are in NoLa, I don't care how far you have to travel, you MUS","useful":2,"cool":0},"eTYetkEY3_cTZPcbSdaFVA":{"text":"I ordered Eggplant pomodoro, and it tasted very bad. That taste was like made with a half-","useful":0,"cool":0},"rD2xgwWTgY7h_ZdftqehxQ":{"text":"So delicious!! Service was amazing! Cucumber monitor was so good!! Perfect Vegan! (Ps. I'm","useful":1,"cool":1},"xenRM-kRbG4Hc_L0yeSXJA":{"text":"I'll eat pretty much any kind of food.  We were down here last week and on our last night ","useful":1,"cool":1},"6sdAZ3wO1NFCEO9yusclVw":{"text":"This place was so overrated and overpriced. I've never had such bad vegan Mac and cheese! ","useful":0,"cool":0},"ZWFTJaPwbInkk_ASVMCQGg":{"text":"I am thoroughly disappointed in Seed. I rarely write a review if my experience was negativ","useful":42,"cool":21},"t1NDIsMlZaKd0wE3pXDOYg":{"text":"Update: went back to Seed today because my vegetarian girlfriend wanted to. I'm not vegeta","useful":1,"cool":1},"d7BthS8zQ6g6erenLxZYpg":{"text":"Excellent (vegan) food with New Orleans flare! We enjoyed the artichoke cakes (crab cakes ","useful":0,"cool":0},"GzlroXsuFyMDv8qS2VM3kw":{"text":"I was in the neighborhood and hungry, the place looked nice so I walked in and sat down. I","useful":1,"cool":1},"3re7mTQErwhdBIxctWwWWA":{"text":"I love Seed! My favorite vegan restaurant in the city. The food is consistently fresh and ","useful":1,"cool":2},"OowWblfcU540Aac7E1ihQA":{"text":"Let me begin I am a vegetarian from Houston and there's a lot of great places to choose fr","useful":0,"cool":0},"HUGo6qJpEVJiD8VZZPQSrQ":{"text":"I wanted to give vegan a try. I can't make it at home; so why not a nice restaurant that s","useful":2,"cool":0},"IgrKiW1A9u-fWbiWmeOgPA":{"text":"Wife and I went in for brunch.  She had the avocado tacos with a chocolate milk and I had ","useful":1,"cool":0},"JGSLeaUQnk54SPLUJSjIUg":{"text":"I've been looking for a restaurant with food that's not over-sauced, and over oiled in thi","useful":0,"cool":0},"JnCekJwqouDWWBYRk-umDg":{"text":"I took my best friend here for his birthday. These reviews are misleading, maybe since the","useful":0,"cool":0},"jSyLpJcz3CYbU0ZnrLNSQA":{"text":"Summary: Overpriced \"meh\".\n\nIf you are not actually a vegan, I seriously recommend avoidin","useful":2,"cool":1},"oO78CcLQTmtgsSn50IVt5w":{"text":"This place is a vegans dream.    The food is well made and thought out.   Presentation is ","useful":0,"cool":0},"OMx8flSvNyPAQOffJPDkpQ":{"text":"As vegetarians on vacation in New Orleans the options are somewhat limited.  After several","useful":2,"cool":0},"7iParwM0Fbec1GIRrfd3gw":{"text":"Fantabulous BEyond Comprehension!!! Thanks to ALL at Seed for ALL you do!!! Everything jus","useful":0,"cool":0},"Vf7RyeSjAo3BCR_KGgUukw":{"text":"Perfect spot for plant lovers. The tofu scramble and nuevos rancheros were delicious. I wa","useful":1,"cool":1},"3JYL6j7CWBWr6M6dDnw8SA":{"text":"Vegan beingets, nuevos rancheros, coffee-based smoothies: enough said.","useful":0,"cool":0},"YthPgA4dRBlD-s4hRPg7OA":{"text":"Review: Seed -- Garden Based NOLA (New Orleans, LA) Taste \n\nFirst Impressions: We're happy","useful":4,"cool":1},"fXI_Zef21i1FtRsUSLoPIQ":{"text":"This place is an absolute gem amazing staff super friendly very laid back atmosphere. The ","useful":0,"cool":0},"iXAVaiiatvMo8NvyV7Wh7Q":{"text":"I came across this vegan place on Yelp and thought it would be worth a try. I had the nach","useful":0,"cool":0},"S2QPzUyhXhCzixpFE3UpEg":{"text":"Amazing, amazing, amazing! I came here three times in five days because I just couldn't st","useful":0,"cool":0},"nCU8JgneTrJGNcYLyNkc1Q":{"text":"The space is lovely- modern, bright, and clean. But the service... UGH.  Our waiter was re","useful":0,"cool":0},"XH1cbxhfid5ePn3WQnabLA":{"text":"Delicious! I ordered way too much food, but it was all so good. And they have vegan beinge","useful":0,"cool":0},"SZw928XHjJJCyyx3-cJ7gw":{"text":"As I've been visiting vegan restaurants around town, i couldn't bypass this one, yelp revi","useful":0,"cool":0},"ByF67qTKw_jmHbr7FOtNEQ":{"text":"Another Yelp gem. The Southern Fried Nuggets with dipping sauce were amazing! The Chili Ch","useful":0,"cool":0},"HX98WyDFbd_dGf5MwoCqsQ":{"text":"Only for the crabcakes. Everything else pretty much sucked. Went there after seeing the re","useful":0,"cool":0},"ADb-pfeuBWaZKaw0KYBg0A":{"text":"Good vegan food is such a treat. Coming to a place like New Orleans can be frustrating in ","useful":1,"cool":1},"JLvIpBuY6Egxa7Zox3y5Xg":{"text":"Polenta was ok. Artichoke cakes were great. First time eating here. There was a \"catastrop","useful":0,"cool":0},"bABaEoS0lTAza__zCnFbXw":{"text":"My new favorite restaurant in the entire world. I'm allergic to gluten, and my friend is v","useful":0,"cool":0},"n_s3BP4XVLMWczibTdhwwg":{"text":"We loved this place! The eggplant poboy and the fried tofu poboy were super yummy, and WAY","useful":2,"cool":1},"VcEpHTbmhUyjQ3vi1PSIZA":{"text":"Amazingly unique concept, but definitely not for everyone. Our bread on our po-boy could h","useful":0,"cool":0},"Xwdo__izsacbUkuC6280Yg":{"text":"I'm not particularly vegan, but I do give myself an annual break from all the toxins I typ","useful":0,"cool":0},"eBa_pRE2GV9785dgPp5ZDQ":{"text":"Food was very good. Definitely more expensive than I expected. Over 50 dollars for a two p","useful":0,"cool":0},"zCQlfaI6o_Y0Xaw7KdyXDA":{"text":"Recommend: nachos and gumbo\nGreat escape from the heavier meals/fried food. Not to be mist","useful":0,"cool":0},"Rd867jr59p9r3qQonxRtfA":{"text":"I had the southern fried poboy.  The only other poboy I've ever had in my life was the swe","useful":1,"cool":1},"yE556LXh_ICmvhwhbU-3Kw":{"text":"On the hunt for vegan food, this is not a bad option! However, overpriced and small portio","useful":0,"cool":0},"sPQq7G4vW82EGSLMcDVrnw":{"text":"Love this place! The food is very high quality, and delivers superbly scrumptious healthy ","useful":0,"cool":0},"01FpnYH3fyuPM58vHETp7Q":{"text":"This is the best vegan restaurant I've eaten at. We ordered a couple of appetizers, a few ","useful":0,"cool":0},"Q8IRWgvn3IIExbQTM4KsrQ":{"text":"Ordered and received a margarita, a beer, a (very)small salad, artichoke cakes and a tofu ","useful":0,"cool":0},"d6ysrEF_z62otq_sS7IIBA":{"text":"The staff is always welcoming. I've been a few times and I always love everything I order.","useful":0,"cool":0},"0BLxhLMXhGlzjg3vq4m7YQ":{"text":"The service was terrible and the food was nearly as bad. \n\nMy friend and I have been vegan","useful":1,"cool":0},"nRMASzcpqHLJyvPEHrN2ig":{"text":"The ambience is very nice. Modern, hip look on the inside and a vegan/vegetarian friendly ","useful":0,"cool":0},"zne4L8so2xh8XqOfbBd1OA":{"text":"I don't get the 4 star rating. This a 5! Beignets, po boys and artichoke cakes. So very de","useful":1,"cool":2},"8yki93e_aLOR8k3rhsvfqA":{"text":"The food was amazing! I'm still thinking about the nuggets!! Mmmmmm! And the staff is wond","useful":0,"cool":0},"AW3ED3B1go9mO0RbUnIHBw":{"text":"Seed offers fresh, delicious plant-based food in a spacious, airy environment. And it is w","useful":0,"cool":0},"TIEk4hw_ePbrmWf_MHdR6g":{"text":"Went on a Tuesday around noon. Being a pretty small restaurant, and our party being seven-","useful":2,"cool":2},"MNGAQvRoDf0YYuQttV_U5g":{"text":"I could have cried I was so happy to eat here. Being veg in New Orleans makes for limited ","useful":0,"cool":0},"8XnQ_CtHw-FL__5RjPq6oQ":{"text":"It's my first time in Nola & I researched vegan restaurants. This One got great reviews. T","useful":0,"cool":0},"04qvR7BzzZSEO83Wmm6b1A":{"text":"What a great local find.  Thank you for the wonderful vegan food. They go the extra mile. ","useful":0,"cool":0},"0zgRhqvTD1-nGEWkviiVXA":{"text":"Seed was great. Diverse menu with lots of different flavors. The staff was excellent. High","useful":0,"cool":0},"4HSwrlKj86iXsYEoyZ4stQ":{"text":"After a rich Creole brunch, we're expecting something light and fresh and seed is definite","useful":0,"cool":0},"Ii6ceMcJmYt3KHo8PM_hBg":{"text":"Good menu.  Lots of variety for vegans.  Food fresh and tasty.  Only complaint (minor) is ","useful":0,"cool":0},"XjKjho0hpEluPc6WGM-VlQ":{"text":"You know when you go to a restaurant and it's hard to choose what you want to the point th","useful":2,"cool":2},"eQVT41e_Z8XeyGloQZTRJQ":{"text":"It's amazing how delicious food and drinks can transform a person from being stuck in a fu","useful":0,"cool":0},"m5h7h3AFl2TZG5g1Mi3fFw":{"text":"Fantastic all around! The service is great and the restaurant has a light airy feel to it.","useful":1,"cool":0},"WboVORmQTy-UyyqQCqoerA":{"text":"Food was fantastic!!!!  The flavors were so spot on.  Will go here again. I had the Artich","useful":1,"cool":0},"q7aeJ6vdgHd7d9lIIBsaUA":{"text":"This was my first time here. Everything at the restaurant was awesome. They food was great","useful":0,"cool":0},"RI18fRfSerk5iKfP4tNTzA":{"text":"5 Stars to the Cauliflower steak and to the cashew queso appetizer.  Overall experience wa","useful":0,"cool":1},"kGqqIMdFxsT2UjtRW6LU6Q":{"text":"So the concept is great and has tons of potential and some of the food is really good, how","useful":0,"cool":0},"Q_bKPy1YO2DIEzt4lRK23g":{"text":"We had the nachos, BBQ sandwich, and beignets. We thought food was okay. The BBQ had a tan","useful":0,"cool":0},"uJQEsgmbgTknaYsgTjpnRQ":{"text":"Visited this location on Saturday to taste the local NOLA vegan options. I ordered the art","useful":0,"cool":0},"GpfWFaZ71HQoyRz729_m2Q":{"text":"We were so glad to find vegan food in New Orleans and the interior space was lovely, but w","useful":1,"cool":0},"X0gVGst4YCi6labs3kIldQ":{"text":"Seed was one of the nicest coolest vegan option restaurants in New Orleans very near the F","useful":0,"cool":0},"4PI35VENK6XZRngBIxE5tw":{"text":"I came here for brunch on a Saturday and we were the first people to arrive. Four stars be","useful":0,"cool":0},"xoYnIsFm7Pjwd_3LzRgOJg":{"text":"I went with a friend to try this place. The atmosphere is very nice and the water is filte","useful":0,"cool":0},"vlCOHl4NeRGBMkFyxE3e_A":{"text":"Fantastic option for delicious vegan food! Great variety in all categories ( raw, gf, sf, ","useful":0,"cool":0},"ots7XQZ8-oqehm1nPY-eiw":{"text":"I recently went here for lunch on my friend's recommendation.  I must admit I was skeptica","useful":0,"cool":0},"O4-aQA2tIA81fiEPEo41Tg":{"text":"The \"nugget po boy\" with mac and cheese came out and I thought, \"No way I can eat all that","useful":0,"cool":0},"juF0lanWAO6Prg44U-MQuQ":{"text":"Tried the carrot and avocado tacos and the mexican seasoned waffle fries with cheese today","useful":3,"cool":1},"V1yHMyqaP_exbxXIRQlrmg":{"text":"I was really excited to try this place but was nothing to write home about. I had a fresh ","useful":0,"cool":0},"J5hshGWOyZ2YyBzDckH87Q":{"text":"We ordered the southern fried poboy and artichoke cakes and they were both so delicious. I","useful":1,"cool":1},"V6IRu1eQoIBrm1S_Rs2Ejg":{"text":"The food was delicious.   I enjoyed my lunch and it was a real treat on a rainy day in New","useful":0,"cool":0},"-CodsDjrZ6lnH4n-w5FX8A":{"text":"What started off as a great experience ended up being a poor one. We had a party of 5, Cor","useful":0,"cool":0},"5Dm6eWQ4_VcNB0pBcOnc0g":{"text":"This is an entirely plant-based restaurant, one of few in New Orleans and perhaps in the e","useful":3,"cool":5},"c-6YdLAORw-Dn-jCz_b1lA":{"text":"Amazing food! I wish that I wasn't here for only one night while on an overnight stay foll","useful":0,"cool":0},"75lXsuI06F2CP2saiVcVdg":{"text":"If you're vegan, this is your place. The food is good, however, it is on the pricey side. ","useful":0,"cool":0},"RuGkrvbs3jrYdS41zb0iHA":{"text":"Excellent service, friendly and food is delicious!!\nI enjoyed the portobello mushroom burg","useful":0,"cool":0},"EpS71dlDSHXL8095rJWhTg":{"text":"So great to have an awesome veg restaurant in NO (we miss Jack Sprats!). Artichoke cakes w","useful":0,"cool":0},"g4AVqUO2mQ4BvQ42p5N6mg":{"text":"Two people.  Two simple orders.  Both orders were incorrect.  I was so disappointed.  I re","useful":1,"cool":0},"4cklXXpUDRMcAzAq3O_w6g":{"text":"Hail all plant eaters:  this is the place to eat in NOLA. Fresh ingredients, robust flavor","useful":0,"cool":0},"IqVNzY6wuk5akV9BXGOQsA":{"text":"Deborah and I stopped in for lunch and I was excited because I pass this place all the tim","useful":8,"cool":7},"0nshtOfw9Cxm1ct7IH0nSA":{"text":"Food was great and worth the wait but service was really slow and seemingly disorganised. ","useful":1,"cool":0},"8rb2q7Abz2uX1K6CjWscVg":{"text":"Got here just before closing and they still took my full order and treated me with kindnes","useful":1,"cool":0},"pbt8-GW9hVGqxN8DX_0ZtQ":{"text":"Yes yes yes. Vegan restaurant win!! We were walking from the French quarter down to the ga","useful":0,"cool":0},"k6rjxYVM0C7JQ9L57DDSjA":{"text":"Outstanding plant-based spot close to downtown NOLA.   Comprehensive menu, good service an","useful":0,"cool":0},"du-_mQUwFuBT8fwhcwhB7g":{"text":"Was excited to check this place out. I ordered the pad Thai to go. It was a cold dish,  a ","useful":0,"cool":0},"JPlrEZvZnr9cRdeiCrOTWA":{"text":"Delicious vegan good with a local spin.  I had a fried tofu poboy sandwich, which was so c","useful":0,"cool":0},"3XIvi3co5BI4rOTkhjDAcw":{"text":"Wonderful vegan/vegetarian food. The inside of the restaurant is beautifully decorated and","useful":1,"cool":0},"x0e3LVlczPAtoVBOTIpQrg":{"text":"Ate here for lunch today and I loved it so much I wrote a song about my experience:\n\n\nAte ","useful":0,"cool":0},"ZimokJxXGGk946gFXpusUg":{"text":"It is really hard to find good chili cheese fries as a vegan, and Seed's was killer. Also ","useful":0,"cool":0},"iyyI_T7nlAxhHUufbzQH_w":{"text":"I walked from French quarter wasteland in search of veg food. Seed was awesome. Quick serv","useful":0,"cool":0},"MKccwFHNwWa3I-FicVboKw":{"text":"The restaurant has bad acoustics. The waitress could not hear my order and my friends coul","useful":0,"cool":0},"hv_4Sqrnx6A39QWY-Aq53w":{"text":"I'm a meat eater, but this place is amazing. Every cent was well spent. Go get the chickpe","useful":1,"cool":0},"LJ7d7tmNP0_md0BFVUKf6A":{"text":"This place is amazing! As someone with a gluten intolerance, this was the first time I hav","useful":1,"cool":0},"iKNTaAxXLGJze43ALAlDRw":{"text":"This place was delicious!  I highly recommend the eggplant schwarma, the tacos and the car","useful":0,"cool":0},"4CEiFKSx6PsVknha0zqmIg":{"text":"My sister decided to go vegetarian and wanted to go out to eat, so I headed to Seed. The p","useful":0,"cool":0},"1HKUcul2mpjZyHUjp9I5uA":{"text":"The space was really cute.  I was entertaining friends who were vegan so really wanted to ","useful":1,"cool":0},"7emafYU_GI2GTNf5b7mtZQ":{"text":"Food was amazing! Even the non-vegans enjoyed their food! They had a good selection of loc","useful":0,"cool":0},"tmoemfdLgrS0UBU6iLjiHw":{"text":"The absolute BEST vegan in all of New Orleans!! Don't miss this gem. We had the artichoke ","useful":0,"cool":0},"YOtgGuVn8MYdnmQI8D0f7g":{"text":"This place nailed it with the flavor, crisp, and creativity.  Waitress was awesome.  Will ","useful":0,"cool":0},"UhQ7Tvl2WX5spGhsSEfs1A":{"text":"I went to seed looking for some comfort food. After seeing the menu online and some review","useful":0,"cool":0},"QwFLd2vpiQ5S6MPsLlPYJw":{"text":"So far so good! This place is earth friendly all the way down to their compostable straws.","useful":0,"cool":0},"GxfEn7AoNWsSRZR0mlIcww":{"text":"This is a very delish, cute vegan restaurant. There were 4 of us for dinner, we had a vari","useful":0,"cool":0},"yMA1w3MiLxnHF3p1Xp8pCQ":{"text":"Whenever I go out with my carnivore friends, I can always find something to eat on the men","useful":0,"cool":0},"WyFIBvFNNYXiSe_4TdPtng":{"text":"I'VE GONE TO SEED... hardy-har-har, but seriously what an awkward name.\n\nCOACHING POINTS: ","useful":7,"cool":3},"uuZ-mLkr1bRFCVl6VUvrAA":{"text":"Awsome creative healthy tasty vegan food\nQuiet friendly peaceful ambience and decor\nVery f","useful":0,"cool":0},"aIsylQI0Tt6xvWuXDLo1Bg":{"text":"Very good tasting vegan food! Downsides are the lack of a gluten free bread option the pas","useful":0,"cool":0},"yZmdEyKdzpFOvdxUj8zdSg":{"text":"Awesome high quality food for a decent price. The staff was great and they had a fantastic","useful":0,"cool":0},"l-dMK0-0kWyQz_oyviJqkA":{"text":"really good food. altho a tad too pricey\n\nmy favs were the raw pad thai and the southern f","useful":0,"cool":0},"dVSB3iKb3WLyRLzSHOwaFw":{"text":"Honestly, one of the worst experiences I've ever had at a restaurant. It doesn't make me h","useful":2,"cool":0},"jIIZPEk5Z1P8Vy-Ptxd8nQ":{"text":"I came here due to a recommendation from Courtyard Brewery down the street. Being entirely","useful":0,"cool":0},"u71mzSGitsnzRT6z55An1Q":{"text":"We wanted to try seed because finding a Vegan restaurant in New Orleans is not easy.  We d","useful":0,"cool":0},"Gnm253aeauzpoXni--LdcQ":{"text":"Read the reviews on this place so decided to check it out. We were NOT disappointed!  The ","useful":0,"cool":0},"ZAsvOJ9fAJQ2Qbj5DkrUHQ":{"text":"I travel all over the world trying vegan spots that are highly rated and this just slipped","useful":0,"cool":0},"-EhUXhGwDNjIQfq-6D2FCg":{"text":"Service was so so, starters were excellent especially  the fried tofu, we loved it, & the ","useful":0,"cool":0},"HH-o_kk3mAbcYU_BFdII8w":{"text":"Seed has been at the top of my to try list since my very first time in New Orleans and I h","useful":0,"cool":0},"ZwtNnE-rozPJQlWb2qFIeA":{"text":"When visiting New Orleans, people typically think of crawfish, po-boys, daiquiris and othe","useful":1,"cool":0},"SZ43J4C_OTsdhUrBVZXhcQ":{"text":"Amazing vegan restaurant - I wish I lived inside of it.\n\nVegan food for the non-vegan. But","useful":0,"cool":0},"8dU-qidCi5UlC0lfPYhkew":{"text":"Tofu Po Boy is delicious and very satisfying. Pomodoro was fantastic. Highly recommended f","useful":0,"cool":0},"_i3zHKoQty4_ATeN0soXSA":{"text":"Seed changed their menu since the last time I was in NOLA, so I was a little sad... but as","useful":1,"cool":2},"8H70RYP155D25VYRwzhUjQ":{"text":"I wish i could go everyday. thank you seed for feeding me when i visit nola.","useful":0,"cool":0},"gj3S3ktcy_CE7CJdTC_Lwg":{"text":"Now this was a vegan experience honey. We started with the artichoke cakes which mirrored ","useful":0,"cool":0},"lP9WGnt-fJNRhEtrCyvJHQ":{"text":"A great place for vegetarians (vegans) to dine in NOLA. The artichoke cakes are out of thi","useful":0,"cool":0},"F3UbzX9Xe_nv7TePadSShw":{"text":"I've never had vegan Louisiana style food before and Omg- I'm not even vegetarian/vegan an","useful":0,"cool":0},"CMIyxonb8H3qO-oW0VZuqQ":{"text":"Most everything was amazing.  Some of us also eat meat, but we were all very pleased with ","useful":0,"cool":0},"7UKA5NeUSZurK3qMOmiz_g":{"text":"I had tried Seed in the past and was a little underwhelmed, but I recently heard they had ","useful":0,"cool":0},"R4PHgOFDyW6IFVQTfQmeHg":{"text":"Came here hungry after a long flight, to treat our vegan daughter.  We all enjoyed the art","useful":0,"cool":0},"aqcwxtTkg7FK3iN1yDCt1Q":{"text":"What a quaint little place. Nice ambiance and excellent food. I had the eggplant po boy an","useful":0,"cool":0},"3GRSy9UAuPSfyfQLyuFs0g":{"text":"I saw Seed's ad in the Gambit and decided to try it out because I'm all about healthy and ","useful":0,"cool":0},"dNdpeuAJYbNM7WVwe2Zdog":{"text":"This may be my favorite restaurant in the city. The food is so unbelievably good in every ","useful":1,"cool":2},"3fdglada-5WjkvOR8Tk1RA":{"text":"So impressed by this place!! I would kill to have one of these on Dallas. It was wonderful","useful":1,"cool":0},"B7JTMH9JStT7_2GUEF9oiw":{"text":"Second visit to Seed. I brought 4 Meatheads promising them a meal that would surprise and ","useful":2,"cool":1},"F1C4l8_3N7Z3HLN2O9OQmw":{"text":"OK guys . . . this place is a gem.  The energy is high and the people are the best.  Great","useful":0,"cool":0},"mc0T5r_0hQoxDl5zbZSz5Q":{"text":"Had the pineapple, almond butter, ginger smoothie; a carrot cake\"cupcake\"; and the BBQ san","useful":0,"cool":0},"WWzapEyIrMBWxLcrCnUfEA":{"text":"Wish we had found this sooner!!!  We found this spot the last night we were in New Orleans","useful":0,"cool":0},"ILhJninIpxjt1qR-ugRv8A":{"text":"Clean, cozy, conscious eating! I'm so happy to have found this spot! New on the journey to","useful":1,"cool":1},"V6Ui5CeZOqvQKNfVP3qFHA":{"text":"Fantastic food. Jasmine was our waitress and was extremely personable which made the exper","useful":0,"cool":0},"XKyQVx8ux-2mtLou-h4wZA":{"text":"Not a great place to eat rats and roaches everywhere inside of restaurant owner is sexist ","useful":0,"cool":0},"rJxQlxKrnlS1m4U7bM3lyg":{"text":"High quality food but definitely more of a \"fast food\" vibe rather than \"healthy vegan\" vi","useful":0,"cool":0},"c6mpCxpLXP5OSrKDJBtAuQ":{"text":"Hard to eat in NOLA as a traveling vegan... but this place was a legit clean vegan find! W","useful":1,"cool":1},"9e2Ud7gSwo0Cfdjgm_aydg":{"text":"Went on a Sunday super packed of course. Waiter was on it though, friendly, and got us eve","useful":2,"cool":1},"5GzjhChY6Jje2n8okDOLTQ":{"text":"I've dined at Seed once and gotten take-out once. The first time I was at Seed, about half","useful":0,"cool":0},"bEFx5bjjiVSIXbFOo9X1NQ":{"text":"Put Seed on your list for New Orleans. Great food that will be sure to please veg and non-","useful":0,"cool":0},"GQWl6hNUsrzJG3TCghqMog":{"text":"Food and service is outstanding. They do a great job of offering plant based versions of s","useful":0,"cool":0},"GuJl16F8tSLyih1lwvV1kQ":{"text":"Normally a vegetarian, I ate everything New Orleans had to offer on a recent stay. This pl","useful":0,"cool":0},"nY7T61djoF0ZJTkaj1ngoQ":{"text":"We thought this place was decent - definitely not amazing, but a good vegan option. Prices","useful":0,"cool":0},"fMiM4M4ZMm30p1TXg61wrA":{"text":"Just left New Orleans and saw the owner and chef of this place, \"SEED\" on the morning news","useful":0,"cool":0},"Jjux5gSxv3TWIJF2r2eC8w":{"text":"The food here is really good and all vegan! I have gotten various items from their menu an","useful":0,"cool":0},"FrHLJsFpRIjQc9rxZi2V4w":{"text":"Only go here if you are legit vegan or like vegan food. Obviously I was roped into goin he","useful":0,"cool":0},"ERUZMthp9sC1B7Vffrl7Ig":{"text":"I am a recent vegetarian and really headed to being a vegan.  Thought cheese was a friend ","useful":0,"cool":0},"D7wpBCiWVlY--CLpCqqjGg":{"text":"I'll be perfectly honest and admit upfront that I've had a really long day I was looking f","useful":2,"cool":0},"heNBdJIv7udzHi40BW4nBA":{"text":"Excellent creative vegan friendly fare. Tremendous asset to the neighborhood. What a refre","useful":0,"cool":0},"g0bG_XpLaqZ4eVvSJ9KBOw":{"text":"Breastfeeding mommas that can't tolerate dairy or soy looking for a filling meal please co","useful":0,"cool":0},"XSYZT0XDUnUKvsDrb__azA":{"text":"Healthy stuff but really nothing exciting in flavor to me. The gumbo was decent but really","useful":1,"cool":0},"_s3TMJZErswSQMRgHJPmRg":{"text":"Honestly disappointing. I'd been holding out to try this place. Almost every other vegan I","useful":0,"cool":0},"9WyTyuRGWLhPyqSEENaAOw":{"text":"I had 2 friends visiting in town from back home. One of them is Vegan, so it was a must th","useful":3,"cool":2},"kzjUgWQeQ-DoUpeA9gO6jw":{"text":"I would love to give Seed more than 2 stars, but the service was some of the worst I've ev","useful":0,"cool":0},"_dLd_4h5lgzB-hDHmldhTg":{"text":"Cool place with friendly service. They have excellent vegan deserts... including vegan bei","useful":0,"cool":0},"Gr8y9xcujaIUDgJMF4xhTw":{"text":"This place is amazing. Definitely try the artichoke cakes, southern fried tofu nuggets (we","useful":0,"cool":0},"CBOkvACj_21LM8OTnBciKw":{"text":"A lovely little vegan restaurant in New Orleans. We went twice for dinner. We enjoyed thei","useful":1,"cool":0},"28FN4iPH6DtDmUooCWBgYg":{"text":"An exclusively vegan restaurant with a wide selection of creative and tasty selections.  T","useful":0,"cool":0},"_omv3l_W9WhxnUb6YrwsaA":{"text":"Worth the trip for the (vegan) beignets alone. \n\nOr the artichoke cakes. \n\nOr the waffles.","useful":1,"cool":0},"zDANOT11DgQX2k-3QQW8_w":{"text":"Hands down one of the BEST plant-based restaurants I have visited. Everything in this plac","useful":0,"cool":0},"US3Y-ziicFG3zJP4xite1A":{"text":"It's wonderful to see so many veggie options sprouting up in New Orleans!--a far cry from ","useful":6,"cool":5},"P0IAZaAlrXBjDU-ZqTLU3A":{"text":"This is like a restaurant from my dreamiest imagination. The food was great. The ambiance ","useful":0,"cool":0},"OQ9etoFL1SN123o7dd3gNg":{"text":"Definitely my favorite vegan spot in NOLA! The nachos are the #1 choice for me. They have ","useful":0,"cool":1},"e0JDh085m-DeHBkP4_pFeg":{"text":"Great environment, friendly staff and oh so delicious. We went here twice on our four-day ","useful":0,"cool":0},"0cwSUOKSCgNovuQkPtSVzQ":{"text":"Lemme tell you what I thought of Seed- fuggin' great. I am an avid meat eater, love the st","useful":1,"cool":0},"Tx8Sjtg6mf9beQAub5Whyg":{"text":"My vegan spot in nola. My goal is try to everything in the restaurant lol!! I absolutely l","useful":2,"cool":2},"pmnd-XK0lw6YHY6RcmVIHg":{"text":"My SO and I visited SEED on a recent trip to New Orleans.  We are both vegans so we were r","useful":1,"cool":1},"kO0bVPcHUGujIUpzukQa9Q":{"text":"Being a vegetarian while visiting New Orleans, I still wanted to experience Louisiana Creo","useful":0,"cool":0},"NUpRw2Ig5C22j11lQmtdAw":{"text":"We were visiting NOLA for the weekend and found this place online. It had good reviews so ","useful":1,"cool":0},"5_gcQ14o48RUTWwyUJ25_Q":{"text":"Great food, great atmosphere. It's always nice to find good food when traveling. Hope to v","useful":0,"cool":0},"7p0ADQlGwRe_ZWHrVY0AZA":{"text":"This was our first time eating at a Vegan Restaurant. We took our 15 year old daughter her","useful":1,"cool":1},"VLHK8nFLFeB05lsWFbo5iQ":{"text":"This place was amazing. While on vacation visiting a church nearby we walked to Seed after","useful":1,"cool":1},"hqedrCpihnRHj6gC-piFhw":{"text":"I really, really, REALLY wanted to love Seed. I've been a vegetarian-vegan-pescatarian for","useful":18,"cool":10},"i-uugXaB83B7m1RbIkPr-A":{"text":"We are Vegetarians from Oregon.  We traveled to New Orleans for a less than ideal situatio","useful":1,"cool":0},"whIibJle8J71dZAn7D_N_g":{"text":"From appetizer (seaweed cavier!) to desert (beignets), this was one of the best meals I've","useful":0,"cool":0},"wC9uGB6bVwZqYfl5CIN8wA":{"text":"Literally just had the most unpleasant dining experience of my life. My party and I waited","useful":2,"cool":0},"PdD5oNuxvVlvcCW8ObR4fw":{"text":"The atmosphere, service, and food were amazing. Great choices on the menu and a helpful st","useful":0,"cool":0},"tCL2L-sO_q9RBMYiNdzqAA":{"text":"Bland food, worse service, but the amabience and the nachos salvage a star. Our waitress a","useful":0,"cool":0},"RNtPrvL6winQgHN0gtJbsQ":{"text":"I loved the atmosphere of this place!  I had the eggplant po-boy and really enjoyed the th","useful":0,"cool":0},"8ljXyUqJxx7N2qB4YrP-Qg":{"text":"As a vegan I will admit I was very excited to try this place. The first time I ate here wa","useful":7,"cool":4},"xosVuEKTWY6SQS6n_3-HAA":{"text":"This place did not impress me in the least. I came here with a friend and arrived around n","useful":0,"cool":0},"g7fLXzxrrekHA2pYuZhQlA":{"text":"Me and my hubby went to this location when we got in town from Houston. We absolutely love","useful":0,"cool":0},"-vQ1EyRmKM2IUZchiMqbCw":{"text":"Really cute spot, really great food. The service was prompt and friendly. We ate indoors, ","useful":0,"cool":0},"JgX1lBFEpbP0eWSWSWPYww":{"text":"This is good vegan, and I suppose if you're in the South any vegetarian/vegan cuisine is s","useful":4,"cool":0},"Iw5M_Hlry02HMOSLFuukQA":{"text":"This place was so good. The po boys were great. We had to sit outside across the street be","useful":1,"cool":0},"U8H6ROH9RZbNQr_4MjmEmg":{"text":"Abosulelty perfect! Will always tell my friends to come here even if they aren't vegan. Se","useful":0,"cool":0},"PQ-Vx9ClNh80SCIP4FcTsg":{"text":"I love Seed! Highly recommend! Quality ingredients that do not lack flavor! It's so great ","useful":0,"cool":0},"T0kTJr1KcLGl7Cwo6IpMQg":{"text":"Love this place e. Awesome food, great service. Nice craft brew selection. Plant based cui","useful":0,"cool":1},"LbNMrYz7pyLnBLdweIUSxw":{"text":"Hands down, this is by far the best place to eat in \nNOLA!!!!! The 2 non vegan man in my l","useful":0,"cool":0},"uqdYL6rCLkwCynd0vnwGXw":{"text":"SEED is back and better than ever! The interior is GORGEOUS and the waitstaff is super fri","useful":0,"cool":0},"8senDQX8TwxYKHiSX9QLVw":{"text":"I stumbled upon this place during a trip to New Orleans because a needed to find a place t","useful":2,"cool":1},"e2RArqzzl3CpjciqQ2NnhA":{"text":"Absolutely phenomenal flavor. Phenomenal food. The nachos were my favorite and I LOVED the","useful":1,"cool":0},"AhlQpsddsRyPBlqGO6Z-qQ":{"text":"Great food, get the Korean cauliflower and Bao buns! Drinks were weak but delicious and th","useful":1,"cool":0},"2czbmwqnBNuENJmB8HHkbg":{"text":"This restaurant goes in the top ten worst dining experiences I've ever had. I'm not at all","useful":1,"cool":0},"CIQ7QkhkuFXE9_aYdcrmDQ":{"text":"The food was great; however, it was accompanied by the slowest and most inattentive servic","useful":0,"cool":0},"k6lBj-mDciENKYekGVqYIw":{"text":"Went here today. My wife is vegan I am not, but I have to say food was delicious. Here for","useful":0,"cool":0},"KPodj4wcjmw29bk-C8RuQw":{"text":"I had one of my favorite lunches at Seed. We started with a delicious nacho plate, and the","useful":0,"cool":0},"8MWU3b8j4vEg44xXDfINsA":{"text":"I stopped here for dinner and loved it. I had the vegan taco salad and artichoke cakes, wh","useful":0,"cool":0},"SImCBTCsQeaTY_sYukP2xw":{"text":"Seed is always on the \"must eat\" list when we visit New Orleans. They are one of my favori","useful":3,"cool":2},"cvXUtYsinMJm6SnoZxQJ8g":{"text":"Seed is AMAZING. Gosh that cauliflower Katsu sandwich is what dreams are made of. I love t","useful":4,"cool":4},"8EUePIHI8J-jn4rHBtgoGg":{"text":"This is a real treasure for vegans in the New Orleans area! They have a diverse menu of ve","useful":0,"cool":1},"S1qpNTeceLPUXUiUqvFuhw":{"text":"I love when a place gets so much hype and then lives up to it! We got the Artichoke Cakes,","useful":1,"cool":1},"IvvUuSgSV4-J77OP5_jEQg":{"text":"Traveling in NOLA with a vegan isn't the easiest, and although there were things here and ","useful":2,"cool":1},"o2OrWCV4FgM9D3znI9GJjg":{"text":"it was really great to be able to get creole food that i could eat as a vegetarian. it was","useful":0,"cool":0},"LxXZ7IRLkVYwMCuo5WJ1rQ":{"text":"Delicious food, my first vegan beignet :-)! Quick service. And a storage place for suitcas","useful":0,"cool":0},"aU6I-gBL2qUk5vLiWkIzlQ":{"text":"I really wanted to like this restaurant.  The menu looked good and we were excited to try ","useful":0,"cool":0},"zDDZvO5CF2wU4WzxJwXR1g":{"text":"Good vegan food.  Service is good as well.  Overall pleasant experience!  The appetizers w","useful":0,"cool":0},"LSWoHhddley-Yyz8Qh0zEg":{"text":"Seed was one of the must-go places on my list for NOLA, and after having a disappointing v","useful":0,"cool":0},"SfbEx8jd5_BM6-SJTrLJVQ":{"text":"Everything was delicious! This was my first time exploring vegan-American staples...hooked","useful":0,"cool":0},"QXzCFdSck8yqvMvN8S6aLQ":{"text":"My daughter took me here to celebrate Mother's Day. I recently transitioned to a fully pla","useful":0,"cool":0},"LWjxJHr5IRMYTxrd9WsYMQ":{"text":"Greeted by super friendly staff. Didn't need to wait long for a seat. Food was great and w","useful":0,"cool":0},"h7sEbkxDhCwC1RZ6W0dJMw":{"text":"The worst service that one can expect.  Hard to imagine that this place can stay in busine","useful":0,"cool":0},"bD2JtOJr1rjrXQPUNavbIg":{"text":"best vegan/vegetarian restaurant I've been to. I was in town for a conference and, being a","useful":1,"cool":0},"VqVZiIT6qFShAsc3PVqGbA":{"text":"Was there for Mardi Grass and discovered it by chance in search of food along the parade r","useful":0,"cool":0},"FasigtqHq0k9QWRtq8xYPQ":{"text":"What should I say about a Vegan restaurant in a city known for restaurants?  Seed rivals a","useful":0,"cool":0},"LhYivU6iecsPW0vdBQ02ig":{"text":"This restaurant was amazing! The whole menu is vegan and everything we had was delicious. ","useful":1,"cool":1},"YjD531i4jotzmV9uI9YzDA":{"text":"This place was so good that I downloaded yelp and made an account just to give it five sta","useful":1,"cool":0},"XLs83F7IXrhl7FtKFJwbaw":{"text":"One of the absolute best vegan restaurants I have been to. The interior is white and clean","useful":0,"cool":0},"6gJY3CWcE3sJdnC3_fp0Tw":{"text":"I was in the area for something else, and happened to look up and see the sign. I just so ","useful":0,"cool":0},"OtvQ7EoMXIRiBCnOZ8HQ1A":{"text":"Well worth the detour from our visit to the French Quarter. We came for THE VEGAN BEIGNET ","useful":2,"cool":1},"-zSGTN4pQDm1B1ED4Z2J3g":{"text":"Fantastic vegan option in New Orleans!  A little off the beaten track, but a nicely decora","useful":0,"cool":0},"AiCj_mlFECyOWkerGeqvlw":{"text":"Excellent service. Super pleasant staff. Now to the food -- I loved the chili dogs. Beigne","useful":0,"cool":1},"LTzHcM1B7636uh49F2Bc6w":{"text":"Coming from Buffalo, NY were excited to dine at a restaurant that serves everything vegan.","useful":0,"cool":0},"iq7w-7xFgNDiJONKtT1Vyw":{"text":"great.food,  nice peeps. give it a try... found it on a rainy night, needing some vegan fo","useful":0,"cool":0},"t3eMaZAY9nAocu0Lm_y4PA":{"text":"Everything was scrumptious, service was quick. and the servers are extremely helpful and d","useful":0,"cool":0},"pVyglRR6Af_stdMY3RLYxw":{"text":"holy crap holy crap this place has some of the most authentic vegan food ever they're tofu","useful":1,"cool":0},"vSzDPELsTsqGU4yfU_ARnA":{"text":"My boyfriend and I came here for the first time on a Saturday around 1pm and there were pl","useful":1,"cool":0},"WGEapBxvh33IZeQSoultDA":{"text":"This place is on my top 10 list.  The artichoke cakes are out of this world.  The service ","useful":0,"cool":0},"sLu-7t-itVavBMi45m8Glg":{"text":"I love the bbq sandwich.  The place itself is beautiful and service is always excellent.  ","useful":0,"cool":0},"p5iqCHkuHDGrwaX-_pBmvA":{"text":"The food is absolutely delicious! I had a Mexican style tortilla soup that was out of this","useful":0,"cool":0},"rp58VdBqvJ7mg3UVVmOGfQ":{"text":"I just found this gem today in NOLA traveling from FL. Their entire menu is plant based fo","useful":1,"cool":0},"7br9k2U6jmoa3j0mKtv6RA":{"text":"Seed is another healthy food haven for plant based diet folks like me in a city better kno","useful":0,"cool":0},"SRVZIusod365Iq28YiC01g":{"text":"As someone who isn't vegan, I was a bit apprehensive. Everything we had was absolutely del","useful":0,"cool":0},"gU7P7aRKFTUuveZDTrwKEg":{"text":"Highly recommend for some good juices. We only got some juices to go but really enjoyed th","useful":0,"cool":1},"n96CuX9S212mSP_N7qgmmg":{"text":"In NOLA for a few days and searched for veggie/vegan places: this was a very satisfying, e","useful":1,"cool":0},"p6DM7OaYyLlfJauePX-wtw":{"text":"After a long day of non stop walking and only having eaten 2 beignets for breakfast, I was","useful":3,"cool":3},"yKspq4hX6iAfg3Kvg7kyNQ":{"text":"Good place.  I like the decor.  Very simple and neat.. Amazing drinks..  My only grumble w","useful":0,"cool":0},"mm3Gfgbs29Thd3mcbsVcXg":{"text":"[this review was written 20-30minutes after getting our food] My boyfriend and I are Bushw","useful":3,"cool":1},"K9gLWnHu0XiD0thacoOgjQ":{"text":"Beautiful, friendly restaurant with amazing vegan food and drinks. Has bar/lounge area as ","useful":0,"cool":0},"kJUCEMK3E1ANDvXbczV6zw":{"text":"The service was really good and the food was awesome. I recommend trying the beignets. The","useful":0,"cool":0},"0tn2LfkX-kpe1PK3xR7FHQ":{"text":"Absolutely thrilling...my wife and i had a great time here, excellent and prompt service, ","useful":0,"cool":0},"AMES30m9hG_Twrh461bDzQ":{"text":"I am a Vegan and went to Seed while on vacation and all I have to say is this place is awe","useful":0,"cool":0},"YoGSHcy-23jhc_dhecdnfA":{"text":"Heaven exist!! It's called Seed, and it's located on Prytania St in New Orleans. \n\nLet me ","useful":2,"cool":1},"qfjnnkYJt7qy-AljGKqj1Q":{"text":"The food is delicious and the service was quick. Very nice variety of offerings. Definitel","useful":1,"cool":1},"kaanpIc2ZM7NBHZkiUbu8g":{"text":"just got into Nola and immediately looked for a vegan spot. everyone swung through a weird","useful":0,"cool":0},"Oc5SaNoOOlbt0GtYbT4WjQ":{"text":"this place is amazing. it's vegan. amazing. taylor and i got the eggplant pomodoro and the","useful":1,"cool":1},"nVBMQ4-aDjmX3IVlNNuGOA":{"text":"My husband and I visited this restaurant yesterday. But let me tell you a quick story abou","useful":11,"cool":4},"4_oxu9bTGZOe15bkOLoWgg":{"text":"In my pre-travel search for vegan options in New Orleans - I was pretty excited to see See","useful":2,"cool":2},"kGt1vdIsEw9m0-pgL3Q5pw":{"text":"Absolutely pay attention to all the great reviews. They are very true. I brought a colleag","useful":0,"cool":0},"bptz8vzYb2LjMP1hRgvodw":{"text":"I loved seed. there are so many good options, it's hard to pick. I decided to get the frie","useful":0,"cool":0},"O5Cgba_Y_2zVdk8_4gpCyQ":{"text":"The food here is soooo good. Very cute and laid back environment. I wanted to order everyt","useful":2,"cool":1},"QEr9SH3VE6h_oSA-1McF7Q":{"text":"I visited this cafe recently with my family while on vacation. The food was good. It was v","useful":0,"cool":0},"Bcuy3GM4XTVxIP7X9GgrWg":{"text":"Wow what an amazing place. Seed presents NoLa food in a clean way. I went with my friend a","useful":2,"cool":1},"_w_EG5cSYTqKv3mk4NExwA":{"text":"I normally do not give a single star to anyone, however, due to the fact that I was never ","useful":1,"cool":0},"cEvm7E4jCXQKCGdQgToSPQ":{"text":"We had the Cauliflower Katsu, artichoke cakes & the mushroom poboy. The artichoke cakes ar","useful":3,"cool":0},"KzHbrOKi_GZjB0U8Tr8Csw":{"text":"This was touted as one of the best vegan/vegetarian restaurants in town, and I was a littl","useful":0,"cool":0},"iScxMu2OKpM0o5wrusZvug":{"text":"I'm not a vegan, but I eat more often vegetarian than not.  Seed was GREAT!  Service was f","useful":1,"cool":0},"DvBV5YhhyC-I0_u4k9yb1Q":{"text":"Friendly staff, nice environment, and amazing vegan food! We ordered the tostadas and arti","useful":0,"cool":0},"5Nv4-ikqcPdyDSuM0SBdHw":{"text":"I came in for lunch with four other people and we were seated right away. Our waitress was","useful":0,"cool":1},"Uapf_9speEF0bHvQ5HSp0g":{"text":"If I knew how to cook this way I'd be vegan. The waffles where delicious. Excellent servic","useful":3,"cool":3},"d5Z1u68n2feiiPbSPl7SmA":{"text":"Omg this was a last minute find for me, so happy I found it though. The tofu bao was amazi","useful":1,"cool":1},"a2rkxmwWMIaH8OXT7MBQcA":{"text":"The food was fairly mediocre compared to the other vegan options in town but still very en","useful":0,"cool":0},"6Sk_GGoBLTV3e1SXVZ1xrg":{"text":"https://facebook.com/story.php?story_fbid=10213036056549856&id=1045905872\nin summary, the ","useful":0,"cool":0},"Mt9QH6l9gmSDWN6_ueLVog":{"text":"I'm on day two of no sugar and no yeast....basically nothing but PURE food. My daughter to","useful":0,"cool":0},"kZNLCT5cFQv-Phcwh0gi9A":{"text":"I first have to ask before starting this review, Do you have any management at your restau","useful":0,"cool":0},"7ovClxOYrNboilJTAGauqA":{"text":"I'm quite thrilled that New Orleans is on board with this recent vegan/healthy-eating band","useful":8,"cool":7},"r-7uvwAm2jcyuJPrp2YtKg":{"text":"One of the best meals I've had, vegan or not. The Brussels sprouts were the best I've ever","useful":0,"cool":0},"zhe5yAuJpMC8lao0TVIbRg":{"text":"Vegan lifestyle is hard! But places like this one makes it so much easier. I savored every","useful":5,"cool":3},"SMX-X2XhsUlHX8DBbEL8Og":{"text":"I came to NOLA for a girls trip and was excited to find some local vegan spots. Seed was a","useful":1,"cool":1},"l0jUiK_iR_2Kq1w-x-wW6g":{"text":"We had a nice Vegan meal at Seed. I got:\n- nachos; this was a generous serving, which i sh","useful":0,"cool":0},"K__O5SldmOInF-QUUif1Bg":{"text":"First time trying this restaurant and it was amazing. My mom (vegan newbie), and VERY pick","useful":0,"cool":0},"TJC_RXOYuQt_62-96gzrew":{"text":"Food was awesome. As a vegeterian, sometimes it is really hard to find food in New Orleans","useful":0,"cool":1},"nbd711ymal5roQYEAChDsw":{"text":"Wow... Seed was amazing, fully Vegan and all the flavor of New Orleans. \n\nThe Gumbo was am","useful":1,"cool":0},"ol567ZQ0_HpWTbWLbOobMQ":{"text":"First, I am not a vegetarian or vegan, but I came here with a vegan friend and 2 vegetaria","useful":4,"cool":0},"IifKP6A4BP586lBMue9jEw":{"text":"not a good value and presentation is lacking.  nice cocktail list though. sides are tiny a","useful":0,"cool":0},"J8450l3U4iqFBb1SdgDsZA":{"text":"Ordered to go when i walked in. Took like 5 minutes to get my food! It was super quick, th","useful":0,"cool":0},"Zv89ktJIe4_zlSqxrA-EWQ":{"text":"We were visiting New Orleans and decided to check out some vegetarian restaurants. Being v","useful":0,"cool":0},"lD7CdlpD6JdPV4J0e8Fkzw":{"text":"This place is incredible. I am not a vegetarian but I needed to eat some vegetables while ","useful":0,"cool":0},"pMW3KYs_a5Bgq8wcPoqUVA":{"text":"Vegan/Vegetarian Heaven! I was with a group of people that enjoy this type of restaurant. ","useful":8,"cool":5},"6YySbC8XVhoWPYxesBMpgA":{"text":"Seed is a wonderful vegan restaurant (or should I say plant-based), but you wouldn't know ","useful":1,"cool":1},"8lmROcRZIbLtqCAHDUvdbQ":{"text":"I checked in today for lunch.  My husband had eaten here before but have been wanting to t","useful":0,"cool":0},"V4wZfZUi88z6Lj__obrqZw":{"text":"Hip atmosphere and good service. Hubby and I tried the nachos to start. Light and fresh. D","useful":0,"cool":0},"uOZL3Zr4g-d_JYAwAjLDWg":{"text":"Everything was absolutely delicious, and prepared with excellence. The dishes we had (Eggp","useful":0,"cool":0},"zvzPpS67ynyGZQ-r66IxNw":{"text":"The food was fantastic everything we ordered was soooo goood and great portions good value","useful":2,"cool":0},"ZmiTaws6JyFqBcCXunZfsA":{"text":"What a wonderful eating experience. I had brunch with a friend who is strictly Vegan and I","useful":0,"cool":0},"1ywDa38hXmZcr2Rb-b4UgQ":{"text":"The food was AMAZING! I am still craving the artichoke cakes!! While visiting New Orleans ","useful":0,"cool":0},"DtLTU_EF5nd-0MKzL4irFQ":{"text":"My family and I were seated but got no help for 20 minutes (no menus, no water, no we will","useful":0,"cool":0},"Y-st9NHvEo0S8DQrsq4g4g":{"text":"Best food I had during my short stay in New Orleans! We got the Thai Noodle Salad, the waf","useful":0,"cool":0},"Jd_hXNvL6WarKWBCgjhrxQ":{"text":"Amazing food and the only great service in the entire city for the week we were there. Tam","useful":1,"cool":1},"0FKpqJOSPiTheWxLKXTW-w":{"text":"So nice, we ate there twice :)\n\nMy partner and I took a long weekend trip to New Orleans a","useful":1,"cool":1},"9RUsl2tyxiXAsMukO1VySQ":{"text":"Best fresh local orange juice I ever had. That I can say for starters. I was disproved tha","useful":0,"cool":0},"srTI0ughkr-7wPYvxNXnQQ":{"text":"Wow...what a great place! Walked over from the Amtrak station (about 8 blocks) on a Sunday","useful":0,"cool":0},"HXdrsJqxWJVWyELW7d50Vg":{"text":"Love coming here whenever I get a chance to visit Nola. Love the eggplant poboy. Can never","useful":0,"cool":0},"0V6OKmhwosq19rXu3SaNLw":{"text":"This spot is so contemporary, so chic, so...Instagram-worthy! And their food is beyond del","useful":12,"cool":10},"hCWZk47NxtzbxYotzo873A":{"text":"We were in New Orleans for a conference and we were very happy to find Seed. The staff are","useful":0,"cool":0},"SEgNLbAmc_NGt4rDT5NrqA":{"text":"I was so pleasantly surprised with my dining experience at Seed! I happily cleared my plat","useful":0,"cool":0},"u0b4gb_ooDUmpIXAt62uZg":{"text":"Really good Vegan food! There's not a huge amount of vegetarian or vegan options in NOLA s","useful":0,"cool":0},"31MVBGSfyTtb0iYjdS1mOw":{"text":"Absolutely loved this place! My favorite food in New Orleans. I had a BBQ sandwich and it ","useful":0,"cool":0},"niKTXVxdfzV_IZMXFxy2pw":{"text":"This place is a hidden gem that is a must for any vegan . The tofu app with buffalo sauce ","useful":0,"cool":0},"NWqlUlzh0hvemkHeXbdMqA":{"text":"Omg The crab Cake are to die for! Amazing restaurant with so many vegan options it's reall","useful":1,"cool":1},"bo01Gjf4Drqf13Wt17OvGA":{"text":"This was my first stop in NOLA after a six hour drive and it definitely hit the spot. Ther","useful":1,"cool":1},"tI-1L8B9d_E3piXRaQmCAQ":{"text":"Overall, not impressed with the experience at Seeds. The mac and cheese was pretty underwh","useful":1,"cool":0},"DzHd526bvwgLodBwHIc2LA":{"text":"Food was good. Lots of healthy and vegan options. Location is a bit odd not necessarily ea","useful":0,"cool":0},"5awhKm7GoixHtJ4KRVOBYQ":{"text":"This made my whole New Orleans trip worth the while! I was so happy to be away from that a","useful":0,"cool":0},"z3JTBpeVS6O2a6Ux3wSrhg":{"text":"Food and ambience both are really good! We loved fried Korean cauliflower, pork belly bao ","useful":1,"cool":0},"pk0VuFtjkjgBd5r-4CCEHQ":{"text":"Starting my vegan journey & the food looked amazing on yelp! I ordered the seed burger & i","useful":0,"cool":0},"4rDRqrQaJRYFIJePBnLsDg":{"text":"I honestly was not a fan of this place and it's one of the first vegan places I visited wh","useful":1,"cool":0},"ErGABxT1DVXM_1_sOqLo2g":{"text":"Seed was wonderful. We decided to do delivery (so full transparency, I don't know what it'","useful":2,"cool":1},"R_u-2axwYQD9yAzDFrSnMA":{"text":"Loves this place! Amazing vegan spot in NOLA with all your comfort food favorites: nachos,","useful":1,"cool":1},"KiHRFRDcMXL7KaMe6GdF-g":{"text":"The food is good but my god the service is awful. My first (and last) trip here saw me wai","useful":0,"cool":0},"k9JWvEbFqM94ZVb_ZtUjdg":{"text":"Our waiter (older man) was all over the place. He was awkward and left us feeling uneasy t","useful":1,"cool":0},"V6cN_5TaxLIpAAaiqUvFFw":{"text":"The food was good but the waiter was rude. He got the order wrong and took my food from me","useful":1,"cool":0},"ju0v_QvrI6lebjkn31sJfw":{"text":"This place was refreshing after not finding good food anywhere. We had the southern fried ","useful":0,"cool":0},"J7NJFAP-2ck65sjhmwc64g":{"text":"You know that feeling you get when you're going to a new restaurant, you're hungry, and th","useful":0,"cool":0},"ITsW_kf6fmXioxt6pAbjew":{"text":"So... this was my go-to for vegan food in Louisiana... The gumbo definitely needed more se","useful":0,"cool":1},"IlhyFGV911pG1Srm6xgc2g":{"text":"Seed is a wonderful plant based (Vegan and gluten free) restaurant. We've visited three ti","useful":0,"cool":1},"-mEYeVbqws-wWUqYaWCeoQ":{"text":"This place was great! I went at about 430PM on a Monday and it wasn't busy. I was served v","useful":1,"cool":0},"BV3IY3n-RzCNI-KuSGckmA":{"text":"I had the coconut burger with avocado yesterday and I'm back again today. I wasn't feeling","useful":0,"cool":0},"KDNQLY5F89pJGC_0tc7pcQ":{"text":"Ok food, terrible service. Won't go back because of the bad service. Great concept but the","useful":1,"cool":0},"-U8iPap4ZhXqIehbSbACog":{"text":"Great option if you are looking for a healthy vegan place in New Orleans. Best thing - it ","useful":1,"cool":0},"0Rhy3Y1A1Hk4GOHuD1ypWA":{"text":"Went here for my birthday and had my first vegan birthday I was plant based all day that d","useful":2,"cool":0},"Ur0XxuxVpn35kwTG7fw5BQ":{"text":"Everything that we ordered was amazing. everything was seasoned well and everything was fa","useful":1,"cool":1},"X0W4lcjiQs__WKNkpvvshg":{"text":"Great area great little nook and good look no environment and energy wish they had more sm","useful":0,"cool":0},"rf-wOxFL6K80nV2Lg0-94Q":{"text":"SEed is a great new restaurant. It is renovated in an upcoming area of New Orleans they ha","useful":0,"cool":0},"jaLOH_ZhoHNbY9uvG4oudQ":{"text":"The bereber spiced lentil bowl at Seed was fantastic along with the chia seed pudding I or","useful":0,"cool":0},"TdeHAUDEYiEYkBDM8KvIzA":{"text":"I'm a vegan at a bachelor party in New Orleans listening to my friends talk about po'boys ","useful":6,"cool":2},"cNfF26Lqhaw41-4K8-sRtw":{"text":"The ambience was nice and I must admit the prices were high and the portions were very ver","useful":0,"cool":0},"kWPFGY2-P4RStOVInCnrhQ":{"text":"I ordered online and it didn't make it clear the food would be coming cold. I tried the ch","useful":0,"cool":0},"CwppVWlcY-GuxceByaDGZw":{"text":"I hate writing reviews when ive only been somewhere once but I was on vacation so no choic","useful":2,"cool":3},"QPXnTsOtShtGwOQ4Z8HbYw":{"text":"If you're looking for some good vegan/vegetarian food this is an excellent spot to hit up.","useful":22,"cool":22},"rjAah2ox2SJMca0KWoqF7A":{"text":"Seed is fantastic! I had the southern fried poboy and the beignets and they were delicious","useful":1,"cool":2},"_x3_UdpBm5TDWP3II_v5_A":{"text":"Their salt looks like molly\n\nIt's so quiet in there; everyone heard the argument I was hav","useful":0,"cool":0},"RwAdCwOsJNTgP3m3JpUsmQ":{"text":"Very nice atmosphere inside. However, I'll never understand it being windows and an entire","useful":0,"cool":0},"aENkBGYMa0SHj3HKThjCkg":{"text":"So good! CAULIFLOWER KATSU crispy cauliflower steak, cabbage, katsu sauce, purple yam milk","useful":0,"cool":0},"KKm2ZELuwbfAUcF60jEWUQ":{"text":"Seed is PARADISE! Everything there is completely vegan and OH SO GOOD! The artichoke cakes","useful":5,"cool":4},"coUXDIQaCYKQn5jCqMWItQ":{"text":"We visited Seed several times during our recent visit to New Orleans and were thrilled to ","useful":0,"cool":0},"-8Aa1_UMfc5CNaUxIKHZQw":{"text":"The food used to be very flavorful but it's been a while since I've visited. I used to lov","useful":1,"cool":1},"lTPpySsPXwTVvNXPHUm_sA":{"text":"Not so good found a long black hair in my Salad. Not very appetizing. We quietly brought i","useful":0,"cool":0},"q-Mi3OkGfEIDIUGg67mcGw":{"text":"The fried eggplant sandwich is literally the best thing I've ever had. I love that it is N","useful":1,"cool":0},"oNTCvlqUoAa8fZ_16RY_Xw":{"text":"It's tough eating in NOLA if you are vegetarian or want healthier non-fried food. Seed was","useful":0,"cool":0},"RSGZHd9hI-OgzL6qwl_I9Q":{"text":"Amazing place. From the decor to the staff and the entire menu! As a vegan it's amazing to","useful":0,"cool":0},"lckPpqvwmEGA90q53oEtaA":{"text":"Let's just say, this is why I don't go out to eat.  Overpriced, small servings, terrible s","useful":0,"cool":0},"ZeEZEmzWIcgERcUC-M7qlg":{"text":"What a gem to find on our first brief trip to New Orleans. A combination of vegetarians an","useful":3,"cool":1},"QTNHzdUHAUAsZUQ03paa1w":{"text":"What an unexpected find. You have to have the southern tofu nuggets. Just amazing. \nPo'boy","useful":0,"cool":0},"ibkW7DI5s9S5dGlzkEzWHg":{"text":"I thought the drinks were awesome I tried the watermelon soda and it was refreshing and sw","useful":0,"cool":0},"arjFZLa5U-4OuqhKm_a8DA":{"text":"Recommend? Yes. Cute spot for brunch.\n\nThere were two of us and we were starving so we got","useful":1,"cool":1},"bIylHO93RIkte372wB2Yow":{"text":"Incredible! Only complaint would be the small portions but the food is fantastic. I had th","useful":0,"cool":0},"UHmKQetsor49uc2sm-jhsQ":{"text":"I used to come to this establishment all the time when it was Blue Plate so I was happy wh","useful":4,"cool":3},"LSF-LLMNYnV9MmN_FGZ83g":{"text":"Great veg restaurant, but stick with veg creations. Usually veg versions of traditionally ","useful":0,"cool":0},"hgM6yHvxXouucUQ-N8wPhQ":{"text":"I was blown away with what these people do with an entirely vegan menu.  Everything I have","useful":0,"cool":0},"2UKvAUAa9y0MlOwWeoFPzw":{"text":"WOW - and - THANK U! U gals/guys know what ur doing and are officially my #1 go-to spot in","useful":0,"cool":0},"ccvFVi27Z-EXNbDaGoxiCA":{"text":"I saw this place driving by one day and couldn't wait to try it. I'd been looking for a re","useful":0,"cool":0},"wzGPV-jdGFKmstqKh1cCiw":{"text":"AMAZING, WONDERFUL.\nI don't even know where to begin. I've been living on the Mississippi ","useful":1,"cool":0},"wkZtvV7-qWY6Gg-YSFDSjw":{"text":"Happy to fInd a good vegan dinner option while visiting New Orleans. Calm, cute ambiance, ","useful":0,"cool":0},"KohCwnZb5SdeQIo04NJZVw":{"text":"I went out of my way (opposite direction of my hotel) to try this place out and I am glad ","useful":1,"cool":1},"kVeqC9OwAZ488oZucpeVnA":{"text":"This is the stuff vegan dreams are made of! Such vibrant flavor and each of the dishes we ","useful":0,"cool":0},"UqtGnqMtlt8MwxyuvnWuXA":{"text":"Absolutely delicious! Was looking for some good vegetarian food in the mass of seafood and","useful":1,"cool":0},"mr49hcKRuyBrlxUFsYtpsQ":{"text":"I give this place 4 stars. I enjoyed my first visit but a few things could be improved. \n\n","useful":1,"cool":0},"K5smmwu5D68V3z5GIccLlg":{"text":"Wow! Fourth time I've been here, mainly for the to-die-for vegetable spaghetti. But this t","useful":5,"cool":0},"uKoN3SuRSDlp-q6K_hbE6A":{"text":"The only word that comes to mind when describing our meal at Seed is mediocre. It blows my","useful":0,"cool":0},"ealMbEfYk9rPr8KJD7WlBQ":{"text":"VEGAN REVIEW:\n\nWhile in NOLA, my brother, who is not vegan, went to Cafe Du Monde for thei","useful":6,"cool":6},"FR-q8hT6M1dygzr1Zn_JJw":{"text":"I went there twice... so yummy the tofu nuggets were excellent and the carrots in the sala","useful":0,"cool":0},"b9nwUUcyrSA4JByAhlbhng":{"text":"We loved the food. It was delicious. We are vegetarian and this place rocked. We ordered w","useful":0,"cool":0},"6_jGnYDnoegNDKYyPduoEA":{"text":"Expensive compared to small portion. Still, I was hungry so wanted to order more, but the ","useful":0,"cool":0},"NPeF928qhM1JY9hpzdDxzQ":{"text":"I came here when I decided to be vegan for 4 hours and loved my experience. The service wa","useful":1,"cool":1},"poHPWPrld6cx7U7U6Z6IVA":{"text":"Lackluster \"health\" food. I love that the place is 100% plant based, but it's very basic v","useful":0,"cool":0},"OB8Mo8sTaKRkBkhukC_t5A":{"text":"Tagged along with my significant other here to try some NOLA vegan/vegetarian options. \n\nW","useful":1,"cool":0},"cIONjwKTYV-Vq1kOMAEKWw":{"text":"We had the artichoke cakes. We also had the gumbo and the coconut burger. For dessert we h","useful":0,"cool":0},"Ec1Ka2-EfQ9iYO5-6XeT_A":{"text":"After a few days of partaking in traditional unhealthy New Orleans fare this was a fresh c","useful":1,"cool":1},"DdbINdrXn3V4A8mxfYjxxg":{"text":"I went here with one of my friends from out of town. I am not vegan, but don't mind vegan ","useful":0,"cool":0},"7WqX5JTHFtPTnuGUwGWxQw":{"text":"I had heard great things about Seed, but wasn't too impressed when we went. Maybe it is ov","useful":1,"cool":0},"7DRGIrLO6tKo_4pAXjKQTA":{"text":"This place was awesome and they had Vegan gumbo. I went to New Orleans wanting gumbo so ba","useful":0,"cool":0},"Jr2-AkRHFa0c8xP9TiblhQ":{"text":"I've been wanting beignets for so long ... but I could never find any vegan ones in Baton ","useful":0,"cool":0},"6tjaYwxrJmCusoNSlY0qWw":{"text":"Probably some if the best vegan food ever, BUT they need to take the raisins out of the ca","useful":0,"cool":0},"fLxAC8bE-IPjoD841OXPEQ":{"text":"2nd time around. Again enjoyed the food. Definitely worth the drive from the northshore.","useful":0,"cool":0},"x2sEeq2QzK3dEZI8OYY3Yg":{"text":"Seed, I love seed. They're open everyday for long hours, the food is great. They have vega","useful":0,"cool":0},"UohceG91iS8OKUna1jI8Vg":{"text":"Less than a year ago when I was in town, there were very very few choices for a vegetarian","useful":0,"cool":0},"WsfhP-v33zl4WsnwRYwCag":{"text":"Last minute decision to come here after the initial place for a brunch with friends was to","useful":0,"cool":0},"l7HnddicAO-h3-YtyZkqvw":{"text":"Giving this place 5 stars because it's the place I most wish was in our hometown, as it is","useful":0,"cool":0},"7rLiokd9ImuCel7viD6NdA":{"text":"WOW is the only way to sum up my experience here!  I was astonished at how amazing the foo","useful":1,"cool":1},"hGrk9J4iZUrZ8I66_ozGXg":{"text":"We ordered the Mexican seasoned waffle fries without cheese, Tofu nuggets, Mushroom gumbo ","useful":3,"cool":2},"ZhfiD1YPnx8tFut54PwsaA":{"text":"Delicious vegan food. Priced high but worth it. Fair portions. Their juices and smoothies ","useful":0,"cool":0},"yq-ytYqShunavPIvofN65A":{"text":"I've been wanting to try this place out for a while. I came here for dinner with my friend","useful":1,"cool":0},"gcCBXjS7XB98B2Hki9N9yQ":{"text":"We started with cocktails, the Chameleon and Is That All You've Got? Both were beautiful (","useful":0,"cool":0},"462Sqp8wNAHUqAafTe-B3Q":{"text":"Their Mac N Cheese is the most amazing thing in the world. If you don't come for anything ","useful":0,"cool":0},"UOCaoDfuWyWi0KVjxvbcVQ":{"text":"I'm one of those people who trust very few gumbos, my mom's, and a small selection from ar","useful":3,"cool":2},"c0KQZMeq6k0RlL7m4UpzJw":{"text":"This place was easy to find, and so was parking (which was free on the street). The interi","useful":0,"cool":0},"Ts6EXHqtCS6OFqoiE4A2Nw":{"text":"This is vegetarian/vegan paradise. The restaurant is charming, casual, and airy. The staff","useful":1,"cool":0},"-kWMuLlMeno69m-25Rn3CA":{"text":"The food at this place was pretty good but service was lackluster. The guy was polite but ","useful":0,"cool":0},"CnB_mj-TDoMMZY_LfJg44A":{"text":"The food is incredible! Everything is good. I love that you can get NOLA classics with a v","useful":0,"cool":0},"5bnfEIJ_lKUFrw13SuAvOA":{"text":"Incredible food. I'm not vegan and it was just a Flavor gasm. Will eat here as much as I c","useful":0,"cool":0},"-U7inzPZQIQ_ko2VzshxXQ":{"text":"An amazing spot in NOLA! Artichoke cakes are divine. Highly recommend for plant-based food","useful":0,"cool":0},"aQ0JGLOIz3EEWFZdV6UAZA":{"text":"Was in New Orleans for the first time and everyone told me it was going to find hard vegan","useful":0,"cool":0},"8i-yp6nmiTyhtGLzZrvZfw":{"text":"Bruuuuhhh, this place slaps i had the cauliflower steak sandwich, the tacos and the boa an","useful":0,"cool":0},"jt28P09LfinoJfSPnIBOPg":{"text":"Seed has its ups and downs. The food and cocktails can be delicious and unique but other t","useful":0,"cool":0},"zgx4zg0CdNT2Ww_1pSD0qA":{"text":"F yeah. All your southern favorites in fancy vegan form. BBQ seitan sandwich? DO IT. They ","useful":0,"cool":1},"VLrtf8BjlmsIBPXxHlWdIg":{"text":"Everything was ok. Service and food. They were quick to sit us and take our orders but foo","useful":1,"cool":2},"H2tXpnQGr6yvBsinmmKIBQ":{"text":"Great vegan food in the heart of New Orleans!!! You won't be disappointed! We loved the be","useful":1,"cool":1},"lXTWGQBTD20YFQryON6ivQ":{"text":"My son has food allergies and we were so excited to find a place that we didn't have to fi","useful":0,"cool":0},"wKxXcZk-xJmRKEWsl3ZxyA":{"text":"Space: bright, clean, plenty of seating.  There is a semi-open kitchen   The vibe is earth","useful":1,"cool":0},"HjHuGKtKkub_fyLiHh1vww":{"text":"It's not easy finding a vegan restaurant in a city like New Orleans, but I liked the revie","useful":0,"cool":0},"4V0HJEeY7m5E-aNSL2hqGg":{"text":"Same story--boyfriend is vegetarian and I'm not. Here we are visiting New Orleans where th","useful":0,"cool":0},"kjVnRqhM2iwHlBJ65Io4Gg":{"text":"I've eaten here on multiple occasions. Their nachos, chili cheese fries & spicy artichoke ","useful":0,"cool":0},"_bWFIUi-wWA1QcH3Rj_OLg":{"text":"The food is delicious and in one of my favorite parts of New Orleans. The staff were very ","useful":1,"cool":0},"6QLu8rgM2Ck9thHebz8tCQ":{"text":"The best vegan gumbo, I had it during rainy & stormy weather. It was perfect. I got it to ","useful":0,"cool":0},"6slguh28yaamEtZRSIKccg":{"text":"Decor, environment, and service exceeded my expectations. My non-vegan boyfriend approves ","useful":1,"cool":1},"0mbM7Ie2vh82bldJIRhorQ":{"text":"Food was pretty good. Just my main gripe is that the food is really pricy. I feel like I c","useful":0,"cool":0},"6UUmC0Ey9i61H81RzzkCCw":{"text":"The food here is good. I've tried the eggplant and southern fried tofu poboys. I'll reluct","useful":2,"cool":1},"okWnm58t8xiLDlKFd5aVsg":{"text":"Vegan like it should be, and not just one or two things, the entire menu. There needs to b","useful":0,"cool":0},"68SL5_hMKaAgctGqOQM3eg":{"text":"Who knew Vegan in NOLA is an option? Now you do! Go here my Veggie loving friend, you'll b","useful":3,"cool":2},"SQT0bMB5DlsN_FMYT7ADsw":{"text":"This is a wonderful spot for vegan dishes! I tried the pad Thai and the club sandwich. Nei","useful":0,"cool":0},"dQo8K8nBD4ZpBv8dinnpeg":{"text":"The nachos are delicious !! Absolutely love their house-made sour cream & the cashew \"chee","useful":0,"cool":0},"Ctt71Fih1ozcY4Ap9w8Tow":{"text":"Clean, tasty and quick. The Mac and cheese hit the spot and the barbecue sandwich had a ve","useful":0,"cool":0},"P60WRYgsoazhIlLgVeUuBA":{"text":"Thank goodness I found this place with the help of yelp and it offered a welcome departure","useful":1,"cool":1},"y7k_QO3x2MX1PeBK3ZQErg":{"text":"I was really looking forward to Seed tonight but was thoroughly unimpressed. We sat for al","useful":0,"cool":0},"yQwyaDPjaogWmhu69S9eiA":{"text":"The concept is good.\nThe quality of the food is good.\nThe service is GREAT. I had a very f","useful":2,"cool":0},"mfYADNPZOf-Enymi_3K2fg":{"text":"Great selections, bright location, cool atmosphere, and super yummy! So happy to get south","useful":0,"cool":1},"aUPfsvSDKXv1qBAHEEKGfw":{"text":"Great vegan and vegetarian restaurant in New Orleans. It is a modern style full service re","useful":2,"cool":0},"v7Hisv5-NaSk_Hm6A2_o6Q":{"text":"good vegan food. pretty pricey though.\nI had the artichoke cakes and fried tofu poboy. the","useful":2,"cool":1},"6RPUiQFlqFVlnnOTFafABg":{"text":"As I was planning my visit to New Orleans my biggest concern was \"what the hell am I gonna","useful":5,"cool":3},"X16HFI9lnwB4ySkkSePNgA":{"text":"Easy 5 stars. The food is flavourful, thoughtful, and delicious. There are plenty of corne","useful":0,"cool":0},"RP21sV8FikeKALhnjNJtFA":{"text":"I ordered takeout today and was very pleased.  My hubby had his favorite, the BBQ sandwich","useful":2,"cool":2},"ifPrXrltY467ChVJF4LXBQ":{"text":"The bar here is really underrated. They use all fresh-squeezed juices from their juice bar","useful":0,"cool":1},"AvgciXGTL6AnIrntwdRY1A":{"text":"We just got home from NOLA.  Over our 4 day trip we went here twice and everything was so ","useful":0,"cool":0},"uIw0z0nYB0hK89rgp4NX-g":{"text":"Of course I write this review when I am once again (read: always) hungry. Went here becaus","useful":15,"cool":9},"7cSeYcHKHDwelPnhn5Y9Jg":{"text":"So perfect in every way.\n\nBeautiful atmosphere. \n\nFriendly, cool staff. \n\nDelicious eggpla","useful":0,"cool":1},"YupqQYz_1vy7K1u3mAmNnw":{"text":"Friendly staff, amazing food, relaxing and welcoming atmosphere, this place is phenomenal.","useful":0,"cool":0},"lFPyvN_59T7XAPhaU4v2sg":{"text":"Why am I always hungry 2 hours after I leave a vegan restaurant? Service was spotty on a m","useful":0,"cool":0},"JpSE5alX8xfVgXtZS3RIFA":{"text":"Really enjoyed the grilled cauliflower steak.  Very good service.  Casual atmosphere.","useful":0,"cool":0},"fq59R0M7XNw99zu1KOHe4g":{"text":"I loveeeeeeeeeeeeeeeee EVERY bit of this place!!! \n\nFrom the ambiance, love the minimalist","useful":18,"cool":19},"7T-bjFtOEDdm-SI-DUVp8w":{"text":"I'm soooo disappointed that I food this restaurant towards the end of my trip. I'm no wher","useful":1,"cool":0},"xDuZu_LsWcvngnrKNq8mkQ":{"text":"This was our favorite dinner in New Orleans. The artichoke cakes were delicious. We had th","useful":0,"cool":0},"8bO58rv8uOb9hefbly--9A":{"text":"So amazing. The waitresses are nice and welcoming and the environment is peaceful. The foo","useful":0,"cool":0},"2lP7byH-by_Sc9BqgJ38ow":{"text":"The wife and I stopped by New Orleans and heard about this joint and man oh man did it liv","useful":0,"cool":0},"JHevC328BSWvOMHmQf2SjA":{"text":"Expensive but absolutely delicious.  My husband has never been a huge fan of veggie let al","useful":0,"cool":0},"CvzGsgJg2NjgtzZ-aRdOJw":{"text":"Good vegan food despite the sticker on a pepper in my wife's pad thai.  The service was a ","useful":1,"cool":0},"XX-yrrq6TvijTnNeDehOWA":{"text":"Delicious and so worth the walk over here from the French Quarter! Yes, I dragged my BF he","useful":1,"cool":1},"ecaITbjNlPFPxlItlqsEow":{"text":"My wife and I were looking for something healthy for lunch and came across Seed. Glad we t","useful":1,"cool":0},"eEra20C83CDnPaJIo0tfqg":{"text":"Unfortunately, this place missed the Vegan mark for me. We tried:\nGrilled cheese - the bre","useful":1,"cool":0},"w_ja-BdDn0baG8hTx6hi4A":{"text":"Worse service experience in my life. I asked for the bill in Swedish translated into Engli","useful":0,"cool":0},"4QWDxhMtrfWpvLNLqYrmCg":{"text":"So, I had to drag my boyfriend here because he's a meat eater, and a hunter that couldn't ","useful":5,"cool":5},"CdXFoM3HydZzuHELX8rUBQ":{"text":"So good. \n\nEverything I've had here is yummy. Servers are friendly and didn't even give us","useful":0,"cool":0},"p-Vfgl0nvc5f074n-10Tmg":{"text":"My entire experience at this place was two steps forward, one step back. \n\nThe menu at fir","useful":3,"cool":1},"Rj32DCCI-Gn3cIuDtcIPQg":{"text":"I had the Coconut Burger and it was very good and filling. It came with a side of quinoa. ","useful":1,"cool":0},"2zietdkUtj8zpAYW9U7SwQ":{"text":"I'm absolutely obsessed with the Southern Fried Nuggets and the Artichoke Cakes. So good! ","useful":0,"cool":0},"VNiGG59inKaeb3MRqn7AKw":{"text":"Yummy but I wish they would be more creative with the \"chicken wings\" they are just batter","useful":0,"cool":0},"KVxypMsGoNDsPEitcJTEow":{"text":"I have dined at Seed twice now and both times has been exceptional. I have eaten at plant ","useful":0,"cool":0},"sP7zCHV3E5i60NzRs3-oKg":{"text":"Amazing amazing amazing!!! The very best place we have eaten in New Orleans. This place ha","useful":2,"cool":1},"BfegPsBJar00ptPze9_Bxg":{"text":"Service terrible. Busy day, Voodoo fest, Saints game, I get that, but way too slow. Was wi","useful":0,"cool":0},"nWqVx5HjVcrq8jljj7uRQw":{"text":"This is probably my favorite plant based spot in New Orleans!  I'm never disappointed here","useful":0,"cool":0},"zwGBrzOKdSM45Zkm2YnhTg":{"text":"So happy to have found this place on yelp during a récent trip to New Orleans. As a vegan ","useful":1,"cool":1},"J1-VTRzVXOad0Rmfg-xEHg":{"text":"This is the second time I've been to Seed. It appears that the management/ownership has ch","useful":0,"cool":0},"HuKPNIe1giDf0v8XEFsTNw":{"text":"This was the first restaurant we ate at during our first visit to New Orleans back in Nove","useful":0,"cool":0},"MMF5B0CoO16ZH-RyePjUEQ":{"text":"Seed is a great place for vegans who enjoy a drink. They have a full bar and their vegetar","useful":0,"cool":0},"v1UzG7cVawBjwrTg74r-9A":{"text":"It's a little far from the French Quarter but the menu looked so appetizing that we just h","useful":1,"cool":0},"782zV2cNY1sQ_R-RO--25g":{"text":"If I could eat here everyday, I WOULD. It's a great atmosphere day or night. In a city whe","useful":1,"cool":0},"1bSR5TDXn1b7pHtVpFLdNg":{"text":"I was excited to eat at Seed after it was recommended a few times over the course of the s","useful":0,"cool":0},"eYCk6rS_5WWVQa3x5osi4A":{"text":"I dined here three times during a recent trip so was able to try several things on the men","useful":1,"cool":1},"tcC9gVmC-J0WdPcMwhuJkg":{"text":"Wow. What an amazing restaurant. I can't say enough about it. If you are in New Orleans yo","useful":1,"cool":0},"zuK2-it9tn0gz8K2f-a9Xg":{"text":"Seed is really good. I want to preface this by saying I love meat as much as the next but ","useful":1,"cool":1},"yQ5IoX5VpWL9IEmlOV28GQ":{"text":"Super hip and conscious! Exceptional food and great ambience. The staff was incredible- su","useful":0,"cool":0},"dLFBpu8ZLPumP5cPBS6BNQ":{"text":"Amazing place. Super creative vegan food with lots of gluten-free options. Even the non-ve","useful":0,"cool":0},"hgFcDY2KcwQyGMtrt1bIOQ":{"text":"Food was great. Service was amazing. Place was hella clean and they were busy. So glad we ","useful":0,"cool":0},"HRIl-OjfUTzfDmeJzdid2Q":{"text":"Amazing!! In a city made for eating seafood and drinking thus place is just refreshing. Fl","useful":0,"cool":0},"DKdRTX1CWE0FPY3SznHgVw":{"text":"While visiting NOLA I did not expect to find one of my favorite vegan spots ever, but I fo","useful":0,"cool":0},"L4Cd5b_okkjygZz7VHInYQ":{"text":"Awesome choices and great service. If you're a veg and visiting NOLA then this is the best","useful":0,"cool":0},"JhYyY-Aj_U3mnG6kcEgx5g":{"text":"I went with Dad to visit the WWII Memorial / Museum a year ago - August, 2017, and we had ","useful":0,"cool":0},"oPrqmQz_1CiGuQtSh0vseA":{"text":"Plant based. Savory. Excellent service..... and drinks!! What more could you ask for? #Fav","useful":0,"cool":0},"9PSeJJVsCShNn29kxJ8cPw":{"text":"I first ate from Seed's restaurant not at the Restaurant but at an event venue. I fell in ","useful":0,"cool":0},"kQ7rvVPhMeuq3o8_OQnQ4Q":{"text":"I first gave Seed on prytania 1 Star after I heard their now former-general manager mistre","useful":3,"cool":2},"2WTS19RuA9zjF62D4GnzzA":{"text":"Nice restaurant with a diverse menu of fresh juice-based drinks and vegan food. The pad th","useful":0,"cool":0},"pf2FROjIT0zEm51mgv00gA":{"text":"A breath of fresh air in the city's food options... its quite a challenge to find healthy ","useful":0,"cool":0},"llq1Ba-Vuq4Ed0ggQ2gBLw":{"text":"Phenomenal eggplant po boy.\n\nVery tasty raw enchiladas.\n\nHaven't written a review in proba","useful":4,"cool":2},"BhW5ADpdYEqs9P-jD0Jd8w":{"text":"What a treat for a vegan visiting New Orleans!  My Mango Lassi was delicious!  And my husb","useful":0,"cool":0},"tdeZc4Tk4UkLndXxADmlHg":{"text":"Such a cute restaurant!  Perfect for lunch!  Everything is vegan, and the menu offers a qu","useful":0,"cool":0},"6h7hAEqRq3CXiTrW8CLwsA":{"text":"Three of us were seated, we ordered and then waited an hour and thirty five minutes for ou","useful":1,"cool":0},"6tgTvyTQIYvXrJPHdotNog":{"text":"I'll try an keep it short here. The staff was friendly and helpful with questions. The amb","useful":0,"cool":0},"wBDZCfG30m4cuTD8L9jdVQ":{"text":"Great food! You have to try this place at least once. Pad Thai noodles was not exactly lik","useful":0,"cool":0},"EvezuA-FDYOI5C5MeCxfBA":{"text":"Food is good for first time vegan visitors of NOLA to get that New Orleans cuisine. But li","useful":0,"cool":0},"cS5lUaGqpPxpR2EU4SeFDg":{"text":"Maybe we're spoiled but this was subpar in service, taste, portion, and atmosphere. Not wo","useful":0,"cool":0},"dhb09QVyL-wCeGq1SodQ7Q":{"text":"I was excited to find a vegan restaurant not too far from our hotel. My biggest issue here","useful":0,"cool":0},"rUA1UvJVZx4c1WiHVMaU0Q":{"text":"Disappointing experience.  Food was okay at best.  The service was ridiculously slow.  It ","useful":0,"cool":0},"LRUDuzdWJQc4eSAvRfWyNA":{"text":"Amazing place. Being a vegetarian and finding a place where I need not to say no meat whil","useful":0,"cool":0},"Ew1O-3oA-1wwHuldBpS5gQ":{"text":"Stopped in overnight in New Orleans and found this vegan gem on Yelp! Delicious, accessibl","useful":1,"cool":0},"v2vob9P66ZzgOKgAGMSgYw":{"text":"There are two basic things make me to come back to the same place.\n* Friendly and attentiv","useful":1,"cool":0},"oIW4LisgRWJJI6FN0Wd4Ag":{"text":"Delicious! I had the fried tofu poboy with a side of mac n' cheese. I was worried it would","useful":0,"cool":0},"IwIlWL7nPh5tJ7zWjmNj_A":{"text":"Tried this place on a whim. Ambiance was very nice, clean, and pleasant. I was skeptical t","useful":1,"cool":1},"2SCaU7GKDADwk87BlwAxRw":{"text":"Hands down the best vegan menu/ food I've had, eggplant poboy, crispy, thin eggplant yum! ","useful":0,"cool":0},"9UK13V6yE-H4giZicTzdDw":{"text":"Some of the best vegan food in New Orleans!  Awesome little restaurant with delicious food","useful":0,"cool":0},"t8nyD549KZlpuvxtwGsm4w":{"text":"I took my lovely Nasha here while we were in New Orleans for Vacation/ Nasha's birthday. O","useful":5,"cool":5},"c9Ls0JWmAfaxN3T69e8xyQ":{"text":"Oh my GOODNESSSS from the friendly welcome to the gorgeous presentation to the mind-blowin","useful":1,"cool":1},"s5Dkt9hRqlb_HDTGm0uLZA":{"text":"The worst thing about Seed is not being able to eat everything! I made a fair attempt thou","useful":0,"cool":0},"NlhXkDOeOP5yzfo9RzzmMw":{"text":"So you couldn't tell me that I was eating 'vegan' food. Sorry, I've tried many times, but ","useful":0,"cool":0},"fZsCTROQ0RqogT6H7eOe6g":{"text":"So so delicious. Fast service, full glass and awesome menu. I had the chips and dip and a ","useful":0,"cool":0},"NUnYBaWRk54w6yrAlz-KYQ":{"text":"Lovely vegan restaurant. Great offerings. Fresh and delicious! Such a nice break from othe","useful":0,"cool":1},"uhfTkDuIQ8JH0-uVKuaecw":{"text":"It was different. I had decided to treat my grandmother(who's a pescatarian) to dinner. Le","useful":0,"cool":0},"DmhT-Pay1kQz3CTbpvzzmg":{"text":"Food was good, but I wasnt wowed...gumbo couldve been more spicy and more flavor and it wa","useful":0,"cool":0},"-UDS6yIWja_9ooTPESLdZQ":{"text":"I think there's a lot of hype around vegan restaurants these days and few stay up to the n","useful":0,"cool":0},"2galIatT_boTsr_lCv_w9A":{"text":"So amazing to find veg options in NOLA! I had a wonderful dinner here - loved the menu and","useful":0,"cool":0},"lwThTtf-Bix_DA-wQeoADA":{"text":"Disappointing. I went out of my way to come here. I probably should have gone for brunch i","useful":0,"cool":0},"Op7326_c0d9JEfsu8-CIlQ":{"text":"Awesome place for vegans AND non-vegans. Even though the whole menu is vegan, this restaur","useful":0,"cool":0},"gGn8JLu06nsK--EV5bYmXA":{"text":"Ive been here twice in the past year. Whenever i visit NOLA Seed is a favorite. Lovely pla","useful":1,"cool":1},"qTbZQUqfjHyU1FOu81_QXA":{"text":"Expertly prepared vegan fare. Great atmosphere beautiful setting, great service. Hopefully","useful":0,"cool":0},"et9167UG7RlVKykuk15EGw":{"text":"Good location, nice decorations and good foods , everything is tiny but it's worth\nThis sm","useful":0,"cool":0},"x5Te-DanuCoVQpePyx0VTQ":{"text":"This was my first time coming to NOLA as a vegetarian and I was bummed I couldn't get a po","useful":0,"cool":0},"FGItmJ2O-nTxBZ5NnWLIOw":{"text":"Was looking for a healthy dinner with my pregnant wife. Took a chance and a guy immediate ","useful":1,"cool":1},"ZWtwMMWyYNNWuYHIx0BqLQ":{"text":"This is for you vegans out there. During my visit to New Orleans, I discovered this place ","useful":0,"cool":0},"Vbop8uf5Ukg9uBi3Cjf3ww":{"text":"When you are a vegetarian on vacation, the choices are not always the best and it can be d","useful":0,"cool":0},"DpLf8bssWTznbA21JIJkig":{"text":"The five stars is for the southern fried tofu (the actual tofu). The bread on the poboy wa","useful":0,"cool":0},"rl2OZ6Zy_Vn2TJd_KcejPg":{"text":"During our week vacation in New Orleans, we ate at Seed twice. When traveling, especially ","useful":0,"cool":0},"aOTHHRQSnWphTQ8W4mlRrw":{"text":"The food is absolutely flavorless and overpriced. They seriously need to consider adding m","useful":0,"cool":0},"e8tzUrpjac5Uqg6OytCwEQ":{"text":"I've been vegan/vegetarian for 21 yrs and was excited to check this place out while visiti","useful":1,"cool":0},"TNl-hSsItEPN22cbE-Eeew":{"text":"Omgeee! I love Seed! The selection of food and quality of food is great! The food can be a","useful":0,"cool":0},"NUNiJUnOVNRMyyak9vNfoQ":{"text":"This place is the best!! It sits outside the Quarter. Easy to get to by Uber or if you hav","useful":0,"cool":0},"SrNCLxtALwY3B6vkzMgzvA":{"text":"I grew up in and around New Orleans, but this was my first time being back in the city as ","useful":2,"cool":0},"-m2yCS70J2h6CK9SimYo5w":{"text":"So amazing to find this oasis of all vegan food. We wanted to order everything on the menu","useful":0,"cool":0},"U6iaMbwgney3cFUNZ6dg7A":{"text":"I grew up savoring various kinds of New Orleans cuisine and tend to love plant based and v","useful":0,"cool":0},"Qos7toU-J3scnzU3BTcqIA":{"text":"The best vegan food I've ever had! This place has everything; lovely service, a beautiful ","useful":0,"cool":0},"tqFqRfSEo-PKiPzliBdpsA":{"text":"Disclaimer is that I'm not vegan, but one of my best friends is and I've eaten my fair sha","useful":0,"cool":0},"ByAhGKOdzb3BxkDjicefDg":{"text":"The food was super fried and oily and had very little flavor beyond that. The tofu was ext","useful":0,"cool":0},"6xWm7iQQ6DoRStZzsmDTeA":{"text":"Always a fan of a place that makes it easy on the vegetarians in my life. Seed is all vegg","useful":1,"cool":0},"09x9BVZRs3vo1CET1aS_gw":{"text":"The décor was earthy, plenty of indoor tables for dining, bar seating & outdoor bench for ","useful":35,"cool":25},"5LbO702_sordCxyTjQtlGw":{"text":"LOVVVVVVEEEDDD this restaurant! I came here when I was visiting for the essence festival a","useful":0,"cool":0},"5N7E96aT4crcZ1F9IqmMlg":{"text":"We were really hoping this restaurant would be great. The menu looked amazing and for the ","useful":0,"cool":0},"DchKwZT93WuK_dzpGmtGlw":{"text":"The eggplant po-boy was the bomb, I will dream about that eggplant po-boy for a long time.","useful":0,"cool":0},"KRvfavVn1Z9sKOmKXCt9Jw":{"text":"This was a very disappointing experience; I have never interacted with more condescending,","useful":0,"cool":0},"sFTdXZ6_3yJgU7CeOAS5FA":{"text":"This is the most incredible vegan restaurant. For the appetizer we had the southern nugget","useful":0,"cool":0},"JnW8LJW_lzcgUoMTGkfpeQ":{"text":"Mannnnnnnn this place is the bee's knees. The energy is so pure and there is so much love ","useful":0,"cool":0},"n0tUPKDVWNapdKlEw7ju8Q":{"text":"The service and employees are super nice, but the food wasn't my cup of tea. I was so look","useful":0,"cool":0},"3bQArY1XpxpuGtlLj8Aeug":{"text":"Excellent! I came here for dinner recently and The entire experience was top-notch. I was ","useful":0,"cool":0},"dIHxEq9kwUk8HJP0Y21q5A":{"text":"ok food - pretty poor service + prices = its an ok place to grab a bite but don't be in a ","useful":4,"cool":0},"AGALE8xR51Ex9Il1juOC2A":{"text":"IF YOU HAVE FOOD ALLERGIES DON'T EAT HERE! On our recent trip to New Orleans, I was very e","useful":1,"cool":0},"KWJdTLjx2BreICwSkDnWXw":{"text":"Visiting from Atlanta, I wasn't looking forward to the limited vegan options in New Orlean","useful":1,"cool":1},"ohQ2TA5ZrgzMg6kuk4CK1w":{"text":"There's two things that I always get: either the coconut patty burger sub garlic aioli ins","useful":0,"cool":0},"aEFQV1mjApOVhqWdIg1HRg":{"text":"First time at the newly renovated Seed. Beautiful inside, plenty of seating. We sat at the","useful":0,"cool":0},"xUUB95ef2gZBk7XJImFg9w":{"text":"We went back to Seed today and I had the nachos again, this time with the crumbles. It was","useful":0,"cool":0},"QeMOYIZmdT9QpmL7SxMG-A":{"text":"We got the southern poboy, artichoke cakes, fries and quesadilla. Everything was amazing!","useful":0,"cool":0},"htbsdO7VFw1jH3GQcOm_Iw":{"text":"I would definitely recommend checking this place out. The nachos and dips were great (best","useful":0,"cool":0},"rxzM5iXuiiYy21j6fUUVLg":{"text":"I'm not vegan or even vegetarian, but I appreciate a good plant based meal sometimes. Went","useful":0,"cool":0},"HlYgNTSNMXF1ySDQPK5dcQ":{"text":"Super excited to find a plant based restaurant.  It's an Uber ride or a good walk from the","useful":1,"cool":0},"vc7JUw8jsk5Ye9K1Ex-C0Q":{"text":"Its a very cute restaurant, we had a hard time choosing from the menu, because it all look","useful":0,"cool":0},"1606kMQu5WrTKbeP338Pzw":{"text":"This was a very cute spot. The atmosphere was very airy yet grounding. They had so many yu","useful":0,"cool":0},"5D7Ok0us_pHuq_2gEhYBow":{"text":"My wife had the pad Thai and loved the way it was prepared except for the lack of flavor. ","useful":0,"cool":0},"3X1logRmImuAYgVSSgdd-g":{"text":"The beignets were not baked fully and we tasted the yeast. The ginger smoothie took so lon","useful":0,"cool":0},"SJ3bw072F_HV2RZts7HfiQ":{"text":"This was such a wonderful place to start our NOLA trip! It's a lovely, open and airy space","useful":0,"cool":0},"k_z2DXMGoufqDDtDEtRDXA":{"text":"I visited New Orleans for a few days and I came across this gem. It's tough traveling as a","useful":2,"cool":1},"0oqppSN_PjD4Z6BSl6y7NQ":{"text":"I really wanted to like this place more and was SO excited when I saw the menu.  Few issue","useful":1,"cool":1},"uoj4iqFbgWDfdGpK-X_FXg":{"text":"Si hospitalier to have found this place on yelp during a récent trip to New Orleans. As a ","useful":1,"cool":1},"lfRXH1S3jBHrP16bQXiNEg":{"text":"Amazing food, poor service.\n\nI brought a group of 5 here for dinner as I am vegan and ever","useful":1,"cool":0},"YSJ-AGRHJymfmBDun_BTtQ":{"text":"My second visit was a big success (the first, a disappointment, having come shortly after ","useful":0,"cool":1},"2GiKnVYACBpG5AOGHh9U5Q":{"text":"Came here for dinner one night during my stay in New Orleans. I'm not vegan but I do enjoy","useful":0,"cool":0},"NYPJAQzDqO1N82xs27HmyA":{"text":"As far as vegan food goes, New Orleans still has a ways to go but Seed holds it own. \n\nDel","useful":4,"cool":1},"qVi-P_vVY88KpffeaFadIw":{"text":"Holy Batman - bad service!  We went here with high expectations and while some of the food","useful":0,"cool":0},"-TpCJgX7E0Dyjs9jIYDxsw":{"text":"The food is delicious!! I went several times while I was staying in New Orleans and I trie","useful":0,"cool":0},"8P8JBNcElBDt7tSGsZ8aow":{"text":"I was really looking forward to go for lunch at Seed. I have to say I was disapointed. The","useful":0,"cool":0},"8AJLqtZmb0vURqkgEYv_0Q":{"text":"Just an update: Seed has not yet reopened at this location. Ran past here this morning and","useful":0,"cool":0},"6GmXnpPeFTZ3tsSUT0jxFA":{"text":"Everyone should come get some gumbo and the eggplant po boy. \n\nTry a little something else","useful":1,"cool":1},"JJh-xZTLp2SisgGBReL_Jw":{"text":"Best vegan food ever!!! A wide range of food. Comfort food, healthy options, desserts, New","useful":0,"cool":0},"R-3HXBzDJbNhvMBK6cTStA":{"text":"Absolutely delicious!\n\nThe tofu po'boy was phenomenal.  The tofu was so thick, \"meaty\", sa","useful":0,"cool":0},"zgmzj9a7UacuSCMELG7yow":{"text":"A year since my last trip to Louisiana , and couldn't wait to get back to SEED! \nThey did ","useful":0,"cool":0},"GBCNIXupRK-x6NTmnhZs8w":{"text":"Upon my arrival to New Orleans I made my way to The Seed as I saw their menu carries vegan","useful":0,"cool":0},"aQceJLXTLuKo_txrHeCjnA":{"text":"The food at Seed is amazing.  My partner and I came to New Orleans for a small trip, and t","useful":0,"cool":0},"W0nJd6B69OV8ozNBqgg-nQ":{"text":"The quesadillas were AMAZING! I'm not just some 1st time vegan who doesn't know better...t","useful":0,"cool":0},"YuA2D63P2XvpQIcGvKIX2A":{"text":"Holy ball of yummy goodness!! It will fill you up without feeling guilty!!  So you must in","useful":1,"cool":1},"VQPc83UXrcMG4sDODZ2QQQ":{"text":"Did not know what to expect with gluten allergy at a vegan place, but it was delicious! My","useful":0,"cool":0},"daJA_IwTCE5kyusq2E884A":{"text":"Seed was such a great all vegan place to eat. I found it through a YouTuber Lauren Toyota.","useful":0,"cool":0},"DHykU1XdwjUqYC0vxmvScA":{"text":"Beignets were delightful!! The tofu nuggets are calling me back. The ceviche was perfect o","useful":0,"cool":0},"vfVTdw8J5LtM3Ruwpu0y6A":{"text":"Service was great, location and atmosphere is also nice, but either the food or the prices","useful":0,"cool":0},"hDWxAlo4_H1_DPTRdYYCLw":{"text":"I came after driving through a neighborhood and doing a yelp search. I really wanted to ea","useful":1,"cool":1},"WwpIprBr1PLA5FB3Ei9lDQ":{"text":"This restaurant is great! Friendly service and delicious food. Just as good as vegan food ","useful":0,"cool":0},"p1eyyJKsbE1FNcWo2PYnXg":{"text":"This spot is SO delicious. Ambiance is adorable and the overall feel of the space is open,","useful":0,"cool":0},"rD78YmjOzfSLF12tsl6YHg":{"text":"As a vegan visiting New Orleans, I assumed I'd wind up eating here multiple times- that wa","useful":1,"cool":0},"5JFvjX1ssQVYc4mB3B_pDQ":{"text":"Great place. Nice people go here and always pleasant to be a patron at a clean, friendly a","useful":0,"cool":0},"NpOcxclWPca23f5IuQ4kjg":{"text":"I was here visiting from Vegas and found you when i was desperately looking for a restaura","useful":0,"cool":0},"qhUddyAv3lCNDcYVBLASSg":{"text":"Ok, I am here visiting from Northern VA for a 3 day Conference and today marks my 3rd time","useful":0,"cool":0},"sOnSg6H7F_CWq-BpYrcgYg":{"text":"Food and service were amazing \nWe had the artichoke cakes, raw pad Thai and eggplant poboy","useful":1,"cool":0},"axwVkcswTxjA-yNGQsjqPA":{"text":"The tofu nuggets are so yummy with the homemade honey mustard sauce, my date could not get","useful":3,"cool":2},"eL9s49itPrCggjRsMyzfwQ":{"text":"Great vegan food in NOLA! Nuggets with sauces are delicious and the artichoke cakes were a","useful":0,"cool":0},"KD6aI58DUMogwgRdnogNtg":{"text":"Just ate here w/ friends on our spring break trip. Food was amazing!!! Shawn, our server, ","useful":0,"cool":0},"POtKJbh7yQi6wFN3aU64CQ":{"text":"This place is way too overpriced for what they're serving. My vegan poboy had a thin layer","useful":0,"cool":0},"K4_aW3w84u4vt1FY2CTm7w":{"text":"Delicious!! I wanted everything on the menu. The Super Seed juice is great. Ignore the fac","useful":1,"cool":1},"CdCo-MSrwwMNq3R1wV47hQ":{"text":"Had several apps that were good, and eggplant sandwich with aoili was fantastic, as was th","useful":0,"cool":0},"kWBds541BR304LJCsqqCeg":{"text":"this place was great. me (vegan) and some other non-vegan friends and family went there wh","useful":0,"cool":0},"VpkQkRr-m7yOArwjb-Wk_A":{"text":"Hugely overpriced. The chili cheese fries were good, but not super impressed with the chee","useful":0,"cool":0},"LR1Ik_rFH4muZ-cHeogcGg":{"text":"I've been to a few restaurants around town but this was my first all vegan , plant-based e","useful":0,"cool":0},"YDb8z6lOvxm7RGLeHz26hw":{"text":"I was so excited to try this place after searching for a local vegan option. New Orleans i","useful":4,"cool":4},"lyHl0V2Qb5ZjrmaVIfHVBQ":{"text":"All three of us (vegetarians) loved our dinner at Seed. The service was fine but the food ","useful":0,"cool":0},"InXmJeriHLu3r5eeRt9PaQ":{"text":"It's a solid vegan spot. We stopped here on our way back to the French Quarter and it didn","useful":0,"cool":0},"Q9wLOGjkSX9ss58cg1cIxA":{"text":"The food is fantastic!  I was a little worried visiting New Orleans if we could find any v","useful":0,"cool":0},"uaDFAfLVALX1RZPdAeHvZg":{"text":"Good food but took 45+ min to get our food and the waitress did nothing during that time t","useful":0,"cool":0},"wLwh1Rvq3UQEDjl-oqEMZg":{"text":"I just had one of the best sandwiches of my life here!!! The seed club sandwich was incred","useful":0,"cool":0},"R0NzziGLKMgjbL0i3q6jxw":{"text":"This os probably one of the best vegan restaurants I have ever been! The \"fried chicken\" w","useful":2,"cool":1},"RV9nFhP7VNXAbKzFDibC1Q":{"text":"After eating the southern fried nuggets and the chia chai fresh juice I couldn't even touc","useful":0,"cool":0},"yOdIwJ6gwghNMvXsMzL7eQ":{"text":"For our one night in New Orleans, we truly had intentions of hitting the town and sitting ","useful":2,"cool":2},"0Jzi9GzJVGJW_FYkXwtXPg":{"text":"Amazing vegan / raw fare!! Light and fresh options as well as fried comfy foods. Worth the","useful":0,"cool":0},"V-3xsBBK1dkNw8cJcfwERw":{"text":"Local sourcing is a priority and the menu is 100% plant-based. We ordered the Tortilla Chi","useful":0,"cool":0},"gZrmdut0_Yu8w0v67B-Pog":{"text":"Vegan beignets. Enough said? Well there is so much more to offer at Seed. I came in a trio","useful":1,"cool":0},"Q_4YNCuU0c2Vs8-OMYCkEA":{"text":"YUM! This place is a MUST GO! I had an excellent experience here! I was driving through Ne","useful":0,"cool":0},"j6nd_DH7RqBO-K-zhBfYfQ":{"text":"I think that I just walked into the best restaurant in New Orleans!  Wow!  Great flavours!","useful":0,"cool":0},"GUzdyBSUYFgnXjcDfgkgYQ":{"text":"Such good food! My sister is vegan and out me on this place. I am not vegan but I love lov","useful":1,"cool":0},"BxKcwD47y6idGsXBgK9y4Q":{"text":"Here's a place I wouldn't try if it wasn't for my Vegan friends .. we came in & sat at the","useful":5,"cool":2},"qxGjuCn6IhmIRm_2dK_g3A":{"text":"Came here for dinner the other night and I got the pad Thai and my friend got the Bbq sand","useful":1,"cool":0},"XLpKnOzC-cqeHOrUDq2A8Q":{"text":"Must try place in New Orleans. Simply loved the food. Had been there thrice already in a w","useful":0,"cool":0},"x6F2oty1_KsCcDeFMWYC6g":{"text":"I was really looking forward to dining here, and was so disappointed at both the food and ","useful":0,"cool":0},"KN8zKZX7GILqcadviGFsWQ":{"text":"This place is off the hook good!! This was our first time ever visiting New Orleans, it wa","useful":0,"cool":0},"E_WdK5ZgmGhlPx_zzr02KQ":{"text":"At my first visit to Seed today I had the special: Ginger glazed lentil rice bowl w/ cauli","useful":2,"cool":0},"tkYPWlFa_gQUfsshHiCtMQ":{"text":"So happy to have a great Vegan option in New Orleans. I highly recommend!","useful":0,"cool":0},"G-AbDmZdq5pWzbcX06ZT4w":{"text":"I tried vegan food across US . But this one of different and interesting. Nice place for h","useful":0,"cool":0},"KRi7xqTD3SkTFoZVJdUK8Q":{"text":"This is a MUST for any vegans visiting New Orleans.  In fact, I would be surprised if you ","useful":0,"cool":0},"u17chA4hJv7XSXNjkDR-4w":{"text":"The Korean fried cauliflower is absolutely delicious! I also enjoyed the cheese fries and ","useful":0,"cool":0},"httN8u_XCmJdUe2p6X-61w":{"text":"Easily one of the best restaurants in New Orleans. The atmosphere is friendly and welcomin","useful":0,"cool":0},"chTX5XomRRqr95QGN4YgFg":{"text":"I'm pescatarian, but my friend is vegan. We found this spot on Happy Cow. I had the Eggpla","useful":1,"cool":1},"QxmiYvPgVs9FKXcz9PNdVw":{"text":"Ordered chili cheese fries as an appetizer- perfect way to start lunch!!!!\n\nGreens Juice w","useful":0,"cool":0},"uI1NIeLjg9AgAmvRzfJBxg":{"text":"It's so exciting to see New Orleans opening up more vegan-friendly options and Seed is one","useful":0,"cool":0},"DsDVDi9Zgi5URNwwV-zGrA":{"text":"Love this place for the aesthetics and how 'vegan' it is with the plants surrounding you!!","useful":1,"cool":1},"dx8RcMojcUNjhua3oh6syg":{"text":"We had the Southern Fried Po'boy with fries, Nachos, and a Mixed green salad. The po'boy w","useful":0,"cool":0},"4Ex28RzzddH2EGQmSN1ZZQ":{"text":"Artichoke cakes are divine.  Even if you don't like artichokes much you may find you likes","useful":0,"cool":0},"vB6ceQAZbPjq40Jk442_tg":{"text":"The food is mediocre and overpriced. The people who work there are rude and elitist. There","useful":0,"cool":0},"KKIwIhax25Zvt8vfxY7nBg":{"text":"Sit down, breathe they do not have meat. I repeat they do not have meat! I went here with ","useful":2,"cool":0},"_nBfk4pA_gllVfG5bMIoPA":{"text":"One of the best places in New Orleans, we discovered this place over a year ago and make i","useful":0,"cool":0},"w4RGxu6rvHRwDA3_IV5e0w":{"text":"Vegan food is my mission when traveling- this place is plant based with tons of options. T","useful":0,"cool":0},"t3Bc396kyOqCxN_zXwvnoA":{"text":"This Place has AMAZING FOOD!!!! My friend and I placed an order online to pick up on our d","useful":2,"cool":0},"rQe0H8kPY7EXCCAKljfWDw":{"text":"Artichoke Cakes win hands down as best  tasting dish.  Artichoke hearts and heart of palm ","useful":1,"cool":1},"hqr8DIWMxLw1hgu7piMamA":{"text":"Great food, nice staff. The restaurant was full of people and we were sat quickly. Definit","useful":0,"cool":0},"1DrFINsh10K4GgZvGLpDew":{"text":"Went by my favorite vegan restaurant yesterday and my hubby tried the tofu \"southern fried","useful":0,"cool":0},"1Y1lvXgqD_Zo-YNyDqbLHQ":{"text":"This was our very last stop on our last day in New Orleans. Boy, am I glad we braved the p","useful":1,"cool":0},"A7CgBiAcyh49Z-CWaeBkHw":{"text":"We tried $70 worth of items. It seems like the warm selection is better than the cold. \nBB","useful":0,"cool":0},"IcDbwWO-zHhkpgNNGw8I6A":{"text":"Things I loved about Seed: \nThe decor. \nParking was easy. \nThe menu. \nThe food (AMAZING) e","useful":1,"cool":3},"sSuYufBURh1ZWtl9BLW38A":{"text":"For two gluten and dairy free travelers, this place is as good as it gets.  We had the tof","useful":0,"cool":0},"ZvvN9xA8e9AxJfNaSKhCNw":{"text":"My sister and I tried Seed for lunch and were very impressed!  They had so many options th","useful":0,"cool":0},"r7S6mUssuz6D7m_vAHyCbQ":{"text":"Do not be afraid to over order food here since there are so many amazing options that aren","useful":4,"cool":2},"PsjS4rIrIkkyU81ToAx52g":{"text":"This place was amazing! I've spent a lot of time in New Orleans and I have almost eaten ev","useful":0,"cool":0},"5RM1WS8ny2b7UJgZBfAuCg":{"text":"One word : Delicious\n\nI loved it here it was awesome. We were in town for mardi gras and t","useful":0,"cool":0},"iv-34E-4dHeed2y-wEWCzw":{"text":"Service was fine, food was a bit disappointing. The BBQ sandwich didn't have a good balanc","useful":0,"cool":0},"NMjOMNSgizGcPwsFSDx-ig":{"text":"This place is amazing. Sometimes being a vegetarian is difficult in cities like New Orlean","useful":1,"cool":1},"V0XR6n60wmCCYLUm6AXmGg":{"text":"I eat primarily vegetarian/vegan during week and I am always on the hunt for tasty lunch s","useful":7,"cool":4},"mF61_6ww6CcLbQwIuai33A":{"text":"Great and healthy food \nPortions pretty small \nRather pricey\nGood atmosphere\nGreat people ","useful":0,"cool":0},"6o40UjrVNlOPuKs2rWh-lQ":{"text":"Top ten vegan restaurants anywhere!!  Here in the big easy catch the amazing Artichoke Cak","useful":0,"cool":0},"4P9N9qirhimPcM1_Wgvwbg":{"text":"Good  menu. Tried the gumbo, great.  Artichoke appetizer, really good. Salad delicious. I ","useful":0,"cool":0},"hkMrEqoF2s6OMJTDef5cMQ":{"text":"OMG southern tofu is the best dish I ever had! Sean was so friendly server GREAT JOB Seed!","useful":0,"cool":0},"tmVjWoNOWZTpljp1OzAvnA":{"text":"Stumbled across this place when looking for some vegan options in the nola area and it did","useful":0,"cool":0},"RFzF1fWuVwNUXC_wI9pNOw":{"text":"Oh. My. Jeppers Creepers. This is a Vegan MUST. The cause has little known such a resoundi","useful":0,"cool":0},"iwzissHjvuNil8D1_mvp4w":{"text":"Disappointed with this place. It sounds great -in theory- but I paid 12 dls for a salad th","useful":1,"cool":0},"_AvkNPgdge5WkCXk0MhM-A":{"text":"went to new orleans for 5 days and ended up here 3 times !! the best place for sure, espec","useful":0,"cool":0},"kx4bR-EseiFs8-OJT5KC3Q":{"text":"I've been to plenty of Vegan restaurants and this is hand down the BEST that I've been to!","useful":0,"cool":0},"TYhn_EMeKd-ngQJPne_o8A":{"text":"One of the better Vegan places I've had. \n\nThe Bloody Mary($10) was good but a little over","useful":1,"cool":1},"Y5A8pyrUAhOXIXx6mwEyPg":{"text":"Was more impressed than my first visit just after opening. BBQ sandwich then was a bit too","useful":0,"cool":0},"J5Lk8wyPHGObcoYqv0v1_Q":{"text":"I enjoy Seed. Latest trip, today, I had the nachos add taco crumbs with a mimosa and beign","useful":1,"cool":1},"eKRCaGs88ZzEFn-04CbY4w":{"text":"I'll admit I liked SEED more than I expected to. Here's why:\n\n1) The drinks are good. One ","useful":4,"cool":2},"3eH2gdKXpUUEGGdCjLW8wg":{"text":"I came here for dinner with my husband and a friend that lives in town, per her suggestion","useful":1,"cool":0},"5R4Bo58TSYFPAzXmJyj8rA":{"text":"The food is delicious but the portions are small. It perpetuates the myth that vegan food ","useful":0,"cool":0},"5cPPGbKMcrJJJL7ST3uX2g":{"text":"What??? Vegan restaurant in New Orleans? \nAre you sure this is vegan? A question I asked t","useful":1,"cool":0},"pU8tNhzpXhqtW8cAZ2sMGA":{"text":"Yummy NOLA-style vegan food! \n\nI had the eggplant poboy and beignets, both of which were t","useful":2,"cool":1},"YmfPliXlekrDa0qMgM8Wnw":{"text":"Delicious food, delicious drinks. The southern fried nuggets taste like chicken and the ga","useful":0,"cool":0},"twvDYiTidJNmtovGvi7vHA":{"text":"We came to seed not too long ago for a bite to eat, although I am not vegan but not a stra","useful":0,"cool":0},"7BmwFOiycckN3AWRJcn9pQ":{"text":"If you're in New Orleans looking for vegetarian or vegan food, look no further...!! This i","useful":0,"cool":0},"tM3VDWLkt71DPkOCtgYmLg":{"text":"I absolutely love the brunch menu! & the poboys are amazing as well as the juices & smooth","useful":0,"cool":0},"dOxVm9YjPcBaxxWG3wih0A":{"text":"Excellent service, ambience, and food! Wonderful menu options that span a variety of flavo","useful":2,"cool":1},"uRyLaJqP2iL9VC6OPJDusA":{"text":"Obviously I ate every last bite so the food was good, just small.....very, very small port","useful":3,"cool":0},"jOnigDB-pBxWqkPD4u7IgA":{"text":"Good food, sustainable cutlery and take-out boxes, and vegan options, but I don't think it","useful":5,"cool":4},"UFRy2Vzt7EmgxjsHYqH-PA":{"text":"I really liked this place. The ambience is cool and hip. We know how hard it is to find ve","useful":1,"cool":1},"mNJF9ON0rnrMUgcTgWSLFA":{"text":"Visited this location on Saturday to taste the local NOLA vegan options. I ordered the art","useful":3,"cool":0},"EJINUzMACdEp3diOpGV09w":{"text":"My boyfriend and I came here on an impromptu trip to New Orleans and we loved every minute","useful":0,"cool":0},"W9Vy_giwwZFAlPjR2t7mXg":{"text":"Seed is great. In a city where classics are a dead animal party, Seed veganizes traditiona","useful":1,"cool":1},"EujnUuBCdBmiZzKgbayntw":{"text":"My vegan wife and I (vegetarian) visited from Portland, Oregon. We went to Seed for lunch ","useful":2,"cool":1},"rFZg8fSe1sMcwwy2q_bWaQ":{"text":"I found seed online and came here because it sounded good. And it is. But I wish they stil","useful":10,"cool":9},"fNFED6W4PMrq0qEjlMhZ1A":{"text":"Change in ownership, layout, menu etc...\n\n(yeah I know its over a year ago...)\n\nI came her","useful":3,"cool":2},"j6_qxGdpdxYq33qns0HS6A":{"text":"As much as I hate hippies, crusties, and other assorted dorks, their food ain't bad.  As w","useful":1,"cool":1},"He2RcVond5pzCiZKUvv5Ag":{"text":"Good not great. Friendly staff- new spot and working out the kinks. Seaweed salad and gumb","useful":3,"cool":0},"QRfcNX9Fygbrq8KJfsAZdQ":{"text":"Visited Seed three times on a recent visit to New Orleans. I'm vegan and my friend is omni","useful":0,"cool":0},"H-P-CotH0iYsqeWoxyCCVA":{"text":"Way to represent Veganism Seed!  Variety of protein options on the menu, including the art","useful":3,"cool":0},"FGcvlWIqAVqt4Gr_qFw2dA":{"text":"I am a vegan who is not normally impressed by vegan restaurants; too many try too hard and","useful":0,"cool":0},"eXF-Al7q3uwjuebjkYay6g":{"text":"This place was so good that I'm still daydreaming about it over a month after eating here.","useful":1,"cool":1},"0TWhh8SsVgguHM926yQkQw":{"text":"The service and employees are super nice, but the food wasn't my cup of tea. I was so look","useful":0,"cool":0},"4AhTqI6_NMRTz-D8x51_eQ":{"text":"4.5. Outstanding food just a little pricey. It was good to get to try Gumbo especially wit","useful":1,"cool":1},"JmJcmUqwZbaQvgJwtvW43Q":{"text":"While visiting NOLA, I was looking for vegan places to eat and after days of watching my m","useful":0,"cool":0},"Ef25rfsnogg8Rf6CBp0m9Q":{"text":"I was taking new strange medications, and while waiting to hear from my family, I stopped ","useful":1,"cool":1},"tjBpxkxF0CuIPzdQD8Y7_Q":{"text":"Great food. Loved it, the best food I've had in new Orleans so far. Super cute inside too.","useful":0,"cool":0},"YXMrAz4h9CeM_Z25UytZyg":{"text":"As a vegan, this is about as good as it gets. The decor is really nice, good natural light","useful":2,"cool":2},"clWxe-htKyVxY8Gwi3ECNw":{"text":"Awesome awesome awesome. We shared the tofu chunks and the cauliflower appetizer. Both wer","useful":0,"cool":0},"zSHsPJQQrH0geSCi5b34kQ":{"text":"Seed served delicious, plant based foods in a modern atmosphere! My server was very nice ,","useful":1,"cool":1},"I6IDd2XkGeG40tjdCksaFg":{"text":"I enjoyed this plant-based restaurant while visiting NOLA during NYE weekend. I ordered th","useful":0,"cool":0},"_tu1ah7mWwVVKky5QVxdiA":{"text":"This place has great options for vegan food. Non-vegans might not enjoy it for what it is,","useful":0,"cool":0},"P3U0dsJ9kbyIifyBnu8DVw":{"text":"Food was great, However, the service was not welcoming. \n\nMy partner and I were visiting f","useful":1,"cool":0},"5o59FeO1ndpVNjqyXipnpw":{"text":"The service was easily the worst I've ever had. They were obviously understaffed, but fran","useful":0,"cool":0},"W0zhnMW8xQTMSyb1loBS7A":{"text":"I loved this place.  I went for dinner here and it was everything I wanted it to be.  Ther","useful":0,"cool":0},"7aiYwavMBW8n_UP1pqa5lQ":{"text":"I can't speak to anyone else's experience but for our first visit to NOLA, this was a refr","useful":0,"cool":0},"EnR7mTbZ9Lqh_Ick4-VSCQ":{"text":"Words can hardly express how much we loved this place. Vegan gumbo, Po Boy and Beignets se","useful":2,"cool":1},"DCDl5XS2zswy0egD_1V9Ag":{"text":"This place is 100% plant based. We came in hungover and ready to eat. We left super satisf","useful":2,"cool":2},"H9qkkmxMLJlwrwL5zzLvSw":{"text":"Being from LA(the land of vegans) this place holds up to the same greatness offered in LA.","useful":0,"cool":0},"83osopxSG96bqoEvCZ-9Ag":{"text":"Seed is the premier vegan go to place. I love going there because it's an adventurous food","useful":3,"cool":1},"PZNwwvDTzDAYy1rEO_iJWA":{"text":"Tried seed with my hubby yesterday. Although I'm Vegan and he's not, we both thought every","useful":0,"cool":0},"fkfXIqyTkYzhow49v0Yjvw":{"text":"Ohhhhh myyyyy gosh!!!\n\nThe motherfluffing food is awesome! I questioned whether I was real","useful":3,"cool":3},"FII_2_rgthK1_Kh1LO12Bg":{"text":"I was so excited to try out the new and improved Seed!  We arrived about 10 minutes before","useful":0,"cool":0},"wwnoCc67rRFqMrehEMK-oA":{"text":"I came here twice with vegetarian/vegan friends for dinner during my stay at the Garden Di","useful":0,"cool":0},"SyVWRGZmG6ykmslw4KINuw":{"text":"Best vegan food I've had in a while. We got the tostadas, cauliflower steak, and the falaf","useful":0,"cool":0},"VsIf9qvmyXHYSNVJgF0G5Q":{"text":"Cozy restaurant with outstanding food!  The artichoke cakes were amazing and the gumbo wit","useful":0,"cool":0},"mzuvtFU24GfYdpfLvgd65Q":{"text":"Service was great and food was awesome!! So good love having a vegan place to get good qui","useful":0,"cool":0},"L0hbyLOoTd3vvgRPNSye9g":{"text":"I hate having to leave this kind of review on a vegan place but I just wouldn't come back ","useful":2,"cool":2},"q1iI_2u1LyLTdGWHRAFC6w":{"text":"Good but not stellar. Seems a little bit hyped. Good ambiance and good food. Would definit","useful":0,"cool":0},"MBvLyE6mWJ6E2OyeXdCePg":{"text":"Disclaimer: I do not practice the vegan or vegetarian lifestyle. One of my friends is a ve","useful":3,"cool":0},"p1nMYZIgN9eG207pRds8pA":{"text":"Super cute restaurant with amazing drinks!\nWhen had the pork belly boa and cheese fries wh","useful":0,"cool":0},"g3VzDCKXFPwtEqpWLUltgg":{"text":"One of the finest vegan restaurants I've ever visited anywhere! The \"crab\" cake style arti","useful":0,"cool":0},"HVwqRmQyvdxeAd64yymQcA":{"text":"Original and tasty vegan food. Coconut burger was delicious even for a non-vegetarian.","useful":0,"cool":0},"NFOXggZ76pkXxnaD0V6ihw":{"text":"My Vegan Review: All Vegan Restaurant in NOLA!!!! Such a breathe of fresh air. So glad  I ","useful":0,"cool":0},"mvngkIiLuZnPL4faHVh98Q":{"text":"Loved it! I got the BBQ sandwich and devoured it instantly. The portion size is a bit on t","useful":0,"cool":0},"7EY9e_BGsqXO-u7FQuaiyA":{"text":"I made a reservation for Friday night and just got a text this morning (Wednesday) saying:","useful":0,"cool":0},"4-joqU4jJcXDMdMQdz4Ybg":{"text":"While we were in NOLA my daughter googled every vegan restaurant available. Seed was on th","useful":0,"cool":0},"p9DRNS7E9si3JZGOnG-M0A":{"text":"This spot is perfect with bar libations healthy vegan meals desserts and everything to del","useful":1,"cool":2},"Pr7d9PiojzXNh08a9NtoXA":{"text":"I didn't believe in love at first sight, until I happened upon Seed during a recent trip t","useful":3,"cool":3},"RIvpHLQ2jWZR2Cbs2EgyvQ":{"text":"As someone who eats plant-based in New Orleans, the food is good, but it's definitely not ","useful":0,"cool":0},"PtPWkGExCFxWmRKCpWhkxw":{"text":"We got the mushroom gumbo and chips w cashew queso. Also got the vegan beignets w espresso","useful":0,"cool":0},"MYVXjyUm34PBsq7mUgBK2g":{"text":"Yum!  This is an excellent vegan place and it was hard to decide what to order. I ended up","useful":0,"cool":0},"b9wIlHCXQ8301yHzU5v_8w":{"text":"Am awesome place for vegetarians -I was able to get both Gumbo and a PoBoy so I could feel","useful":0,"cool":0},"U9DLkjDhku-3ZgrHgZbs3Q":{"text":"Colleen my severer recommended the eggplant pomordoro  which was delicious. I'm on a big e","useful":1,"cool":0},"7nzEJe4GDch0bgB8ZDZQRg":{"text":"Everything about this place is AMAZING. The ambiance, music, food....hell even the seats a","useful":0,"cool":0},"5IXLZStAnA35wC7ly14aYg":{"text":"One of the best Vegan inspired restaurants I've ever been to if not thee best. Very nice q","useful":2,"cool":3},"zSCIgpT-AjEUxaYnic9LWg":{"text":"The food was amazing. I can't wait to come back! I've never had a \"real\" poboy but the sou","useful":1,"cool":2},"S7-h6EAe9NEVuCIl1mLv-Q":{"text":"Fan. Fricking. Tastic.  I am an omnivore, and I still loved this place.  Amanda gave us gr","useful":0,"cool":0},"b49kvjYBpfL-DLPjoVrGQw":{"text":"If I had rated this place after my first trip, it would have been 4 stars because I loved ","useful":10,"cool":3},"dyHaf8sqYqOMdgT7DUjUtQ":{"text":"We ate here twice in our 6 day visit to NOLA.  Everything we had was delicious.  Nachos, f","useful":0,"cool":0},"jhBL4eMortemupY99MQNTw":{"text":"Excellent quality, great flavors!! A gem in NOLA for Vegan/Vegetarians folks. The food is ","useful":0,"cool":0},"fTP6syZZnOb-5vvPxWYwNQ":{"text":"I came here 4 times, and each time the food was good, the service was good, and I felt the","useful":0,"cool":0},"lYtqIizDnowNMBP3iQyxWg":{"text":"Confession: I'm not vegan. But I was lured to this place after reading about their vegan s","useful":2,"cool":2},"HogjxtNKwKV_gHje5-j4RQ":{"text":"Walked here from the French Quarter in 25 minutes, and it was worth it.  Cute place, prett","useful":4,"cool":1},"8t9dt_SLB3UsseSQIvRyMQ":{"text":"Amazing! I'm in New Orleans for a conference and was excited to be able to eat at a restau","useful":1,"cool":0},"uTYbB_s7bXwcMZ9l5E-2Hg":{"text":"They took some of my favorite items off the menu, which I'm really sad about! I wish they ","useful":0,"cool":0},"Kvgv-rIlCJd3MGf6Y3Z_Eg":{"text":"We were really looking forward to this restaurant, but had such a disappointing experience","useful":1,"cool":0},"szPzpnYQ_JQ-5T0zZ9pVJw":{"text":"Just moved back to New Orleans a few weeks ago and was excited to find a good vegetarian p","useful":1,"cool":1},"kIrdp9Vm0K7oIRGyTaOLFg":{"text":"I visited New Orleans for a conference, and almost didn't try any other restaurants becaus","useful":0,"cool":0},"kwn0I-qp68O0KIqYEq_4wA":{"text":"We really loved this cute little place when we went for lunch on Friday. We ordered the na","useful":0,"cool":0},"BdhTDIeWh2mg7kPmvPjdbg":{"text":"I had a great meal at Seed a few days ago! I picked up takeout but when I got there I wish","useful":2,"cool":1},"FTpAU3gggY3etf7kDnw_hg":{"text":"My vegan friends took me to this wonderful place for brunch and OMG was it fabulous. Their","useful":2,"cool":2},"joXazYMct8AogkE6KU325w":{"text":"This was our first meal in NOLA, and I'm really glad we chose Seed. Obviously a vegan rest","useful":1,"cool":1},"UB5US_1CxJr_V4ji58_RBQ":{"text":"Seed is different now that how It was in the past. New Owners, new menu. The food is more ","useful":2,"cool":0},"-oL3owtA3t28Pt_FT-p_8g":{"text":"I had the nachos and immediately regretted it. They lacked toppings and ended up being chi","useful":0,"cool":0},"5k9iJLwf1-xqltqKvmURAg":{"text":"What a lovely place!  I had a Full Charge and some beignets that were out of this world.  ","useful":2,"cool":1},"HLP9JlodCaRPqbtY-O8c3w":{"text":"I LOOOOOOVE Seed & am shocked to discover that I haven't already reviewed it.  As a carniv","useful":4,"cool":2},"Hd_w2vv-BAxXYY31sPwQNw":{"text":"Great atmosphere, friendly service and a nice selection of healthy options...can feel the ","useful":2,"cool":2},"yXTZsgL6533ALVnlApIl2w":{"text":"Delicious vegan food in hip location. Had the Bao, sooo good! Staff was super friendly. Lo","useful":1,"cool":1},"gXoMxLdWaZzwT4PL2ZbqYA":{"text":"My yelp search for 'salad' and 'healthy food' led me to Seed and I was not disappointed! A","useful":1,"cool":1},"yH34MIa_eAdxaxLonI4BYA":{"text":"Can't go wrong with a vegan joint in NOLA. My server, Brandi, was one of the best I've had","useful":0,"cool":1},"oFDw6gDnk909uDAnZadCXg":{"text":"This is one of those places where the food and atmosphere is so good you don't want to cre","useful":2,"cool":1},"r0_3L2nxRN1hD4RyGuA6tg":{"text":"I got home from New Orleans two days ago and I'm still thinking about this place.  I've be","useful":0,"cool":0},"rp8MW9yk-SlKMvleRV9TqQ":{"text":"Let me think about where or how to start.... This place is so adorable. It's very easy to ","useful":2,"cool":1},"A9i3dLtMzAGsX7-Zhj1RsA":{"text":"There isn't much space to park in front of this restaurant, so you might have to walk a li","useful":1,"cool":0},"eCukpjjFmrBExpHqKIpiOw":{"text":"The food is great here. Good costumer service too. I would recommend the Mac and cheese an","useful":0,"cool":0}}