{"u5Zt6RxQ3WBr0xPnIwDP1Q":{"text":"5 STAR SERVICE Y'ALL. \nMy bicycle is my only mode of transportation so keeping it safe, fu","useful":0,"cool":0},"MiJ6w0Qpo2lG_e5NJNut_w":{"text":"Andy is super nice and sold me a great bike for a deal. Also has locks, helmets, and other","useful":1,"cool":0},"H9ldcMVy-nDLIbLAApLCvQ":{"text":"Rented two incredible bikes from Andy for 4 days. They were perfect for getting around New","useful":0,"cool":0},"aJFG0GJ-taGezyXKMppbNw":{"text":"If you want to find the vintage bike of your dreams and have a lovely experience the whole","useful":0,"cool":0},"RyjnydPFzSjIITGsnUZSuQ":{"text":"Great experience! I saw a bike I loved listed on Facebook so I messages Andres about it. H","useful":0,"cool":0},"gTXGlXMDgmruCqcWBS7k_Q":{"text":"New bike shop in the neighborhood- had an issue with my bike that I commute everyday with ","useful":1,"cool":0},"oteLcpjnNqqtQNWbU7oRXQ":{"text":"Great shop!  Fixed my wife's flat tire on the spot while on a Saturday afternoon ride.  Th","useful":4,"cool":6},"sVgkljaFMJXjNDJw3JwEdQ":{"text":"I have purchased two vintage (but totally rebuilt) bikes from Bokah in the last year. Both","useful":0,"cool":0},"19ZDCT3aCYRjXEAtNcE-5A":{"text":"EXCELLENT service, great owner and better prices than anyone else around. I have been a gh","useful":0,"cool":0},"uqQ2BJ7yKtp7WIbanrGbRA":{"text":"Andy and Micah are the greatest. Fixed up my two old bikes for Jazz Fest and had them ridi","useful":0,"cool":0},"W4rzDnMhgUwgEiAZMBNirg":{"text":"This owner operated neighborhood bike shop is a gem. Andy helped me out of a jam when I ha","useful":0,"cool":0},"Jv3akuvbXFnWXtTDlQmqLA":{"text":"Great advice, excellent service, and helpful insights about selecting an appropriate set o","useful":1,"cool":2},"BUtDBjVa0zMC0sad8nTDdQ":{"text":"Helpful and came in to fix my flat when he was off \nNice and new knowledge about bicycles ","useful":0,"cool":0},"kiEvZ756AzeUSGEtNlM64g":{"text":"About a week turnaround for tune up of two bikes, one of which was my vintage 10spd that n","useful":0,"cool":0},"usQAnkRsBbzp5HjYDbcG7A":{"text":"Andy is the biggest dawg in the city of New Orleans. My boyfriend and I are from out of to","useful":2,"cool":0},"srSAKhc_TA42pdAlKiQBQg":{"text":"Bokah Bikes is an amazing community bike store where you can find vintage bikes for afford","useful":0,"cool":1},"UJSEBIgMtgPlzG6IREWa_w":{"text":"Micah and the team saved us and repaired our bike quickly and with exceptional service and","useful":0,"cool":0}}