{"QCNFbr3yqmhuSStfSZAdaw":{"text":"If I didn't have so much I wanted to do and see, I could have spent so much more time in J","useful":6,"cool":9},"_G0DDxxQN8AAphu9bYQ8_Q":{"text":"This is a cool little square.  There seems to always be something going on here, no matter","useful":0,"cool":0},"mp7MmJ0u60fjlQXxypmWhg":{"text":"Jackson Square is a beautiful little park that everyone should check out. I recommend book","useful":1,"cool":1},"NVkDTK1XKfHVz-Y2rXgChw":{"text":"Beautiful place! I love this area. Always active, it is one of the focal points in the cit","useful":0,"cool":1},"DCpAjQMaVoxmoJheuBMz_w":{"text":"The history of Punishment Square was reflected in my star rating here - Im sorry its beaut","useful":0,"cool":0},"VpxOGs7vWh8ciISJA8DQ6Q":{"text":"Def a touristy place in the french quarter because there is a lot to do in this little are","useful":0,"cool":0},"Qqidwm79uVqFgdQaO5lV5g":{"text":"What a neat little square. Yes, there are alot of homeless individuals, like much of New O","useful":0,"cool":0},"aDwnqVSrOCK2W-IEKkhQxA":{"text":"Very clean. Great view of the church. Great place for photos.\n\nWedding Photographers: this","useful":1,"cool":1},"ibwK7ieEC9-DtpbyXcsF6A":{"text":"full of art, music, psychics, and psychos, and food. It is very beautiful with tons of his","useful":0,"cool":0},"EOp47mk8h59iMX5KAkW7vw":{"text":"Tarot cards.  Palm readers. Artists. Live performances.  Cute shops. Necessary NO, LA stop","useful":0,"cool":0},"Y-lFQ6egcCtXLCddMgJq5A":{"text":"Park is really fun. Lots of tourists, but beautiful churches and architecture. Great spot ","useful":0,"cool":0},"TOCKzBPPLJB1LctC-QPYcg":{"text":"Jackson Square is an obvious must for any visitor to the French Quarter. On a beautiful Sa","useful":2,"cool":1},"eflL3wmd7b6bAEL9WKf5IA":{"text":"Last Saturday nite, I visited Jackson Square at night. Beautiful! I saw the tarot card rea","useful":0,"cool":0},"HvkbNkfD37fEPJg6GqgJMg":{"text":"So great.  All the local artists, the awesome cathedral and museums, restaurants, food.. a","useful":0,"cool":0},"iB5lusTctxOwEhZ9pd6MKg":{"text":"Long ago this was the place for public hangings and it is said to be haunted. Now it is a ","useful":0,"cool":0},"w-pnUoMO7LR2eSP6HSoYmQ":{"text":"Rows of artwork hanging on the fence surrounding the square, bustling and lively with musi","useful":1,"cool":0},"5UjKtVyitAKxPCz7enje_g":{"text":"The sights and sounds are wonderful all around the French Quarter. Artists and musicians a","useful":0,"cool":0},"CoYf7MVfqDxXBO2auLt5Lg":{"text":"Not sure what all I can say that previous yelpers haven't already said. This place is awes","useful":2,"cool":1},"zRLFN5hCWJCesK0_b0Ihlw":{"text":"History and beauty in a peaceful setting. It's called jackson Square, but it could well be","useful":10,"cool":16},"GykjACB9u6KjK7YlDMHkrQ":{"text":"Very cool place to see a lot of local art and the line of tarot card readers! Have fun!","useful":0,"cool":0},"ej-t5Bm_QI05IggQYH698A":{"text":"We were here during Essence Fest and it was poppin!!  The 2nd line band was playing as we ","useful":0,"cool":0},"26gB0lb8OTGcm-DRJB6l8A":{"text":"Very historic site. It's a must see. Close-by, a steamboat on the Mississippi played jazz ","useful":0,"cool":0},"M0P9vbldOsj35jKZwxU6ww":{"text":"One of the highlights of our walks through the French quarter; the park borders several to","useful":1,"cool":0},"gGOaQaaozBQXChp8DHkQyw":{"text":"We went on a beautiful sunny day. There was a wedding party with a traditional jazz band m","useful":0,"cool":0},"smIrQkvjAg-II6R9b0GvaQ":{"text":"Quite simply, one of the coolest corners of the earth I've ever been to. Many layers here,","useful":0,"cool":3},"-xMNzR24tadkXJQarW8wnA":{"text":"Jackson Square for me is more of a focal point of a coming and going spot when I'm walking","useful":1,"cool":3},"r5bZ9io-X-5jkBCS79ilXQ":{"text":"Okay, this place is a must-see on your trip to New Orleans!! So much character and excitem","useful":0,"cool":0},"ceeIaND2Dsfpc_iXFP7r-A":{"text":"This park is one of a kind. Filled with culture, art lined up all around the edge of the p","useful":1,"cool":1},"-HKX1if4fvY48Twq78bHrQ":{"text":"Great spot to cool your heels in New Orleans. Park has a large circular park bench providi","useful":1,"cool":0},"UCl1ttIBlCCNMrphwDyQ7w":{"text":"Not as big as I thought it was and a few homeless people in the park that was abit off-put","useful":0,"cool":0},"HuhZmZyFoHJUHaoZTvACOg":{"text":"Very beautiful place! Enjoyed our day here. On the outside Artists were set up and perform","useful":0,"cool":0},"fJx2B2hM7-r0XBPl4m4OCA":{"text":"Jackson Square is right in the heart of the French Quarter and offers easy access to a lot","useful":1,"cool":0},"Yp_08Sce0_YUA5sPSEiyfg":{"text":"Just a little removed from the Quarter and a great place to spend a day.  Cafe du Monde, S","useful":0,"cool":0},"30gBFpMTlTrVesak00iigw":{"text":"This is always a must for every time we visit the city. I'm not much for the touristy rest","useful":0,"cool":0},"eg1oy_BcWiwcuuQjANF50g":{"text":"There are artists all over New Orleans.\nJackson square is where you can sit and enjoy thes","useful":0,"cool":0},"S0aeVWohKcHu_E-Ys4YPEw":{"text":"This is a nice park. Before Katrina I remembered a lot more seedier looking elements. Now ","useful":3,"cool":3},"iQaPVCC5FB9TzirEyFR9Ow":{"text":"Just your typical shopping/food/tourist area in the middle of the French Quarter.  One of ","useful":1,"cool":0},"wLLDWE8z8SIsJmivvo5c1Q":{"text":"''After our disembarkation off our cruise which also began in New Orleans! Myself and acco","useful":0,"cool":0},"1i0fzD-XB0_e9KIG1Y3sSA":{"text":"Jackson Square is so pretty.  I know it has a rather morbid history (public beheading/flog","useful":1,"cool":0},"Dj3Heq3olj5Swv-9KA_ZxQ":{"text":"What's not to like about Jackson Square?  It sits in the center of some of New Orleans mos","useful":5,"cool":4},"tRNXDzATkT8vZIpcjfkMYQ":{"text":"Beautiful Jackson Square.  Well manicured, clean, and a sight to behold, I hope you never ","useful":2,"cool":2},"FObTEo95eOlrCV88TRxiRw":{"text":"I would almost say that Jackson Square has more life than Bourbon street.  At least I woul","useful":2,"cool":2},"4CnGmFDwYCBYro4_fNWnXg":{"text":"Beautiful cathedral and pretty square.  Who would think of being assaulted at 2 in the aft","useful":0,"cool":0},"NED0-8OdL87HxDPIyOPDdQ":{"text":"Jackson Square  was declared a National Historic Landmark in 1960. In 2012 the American Pl","useful":5,"cool":5},"grnIMYRwIwi8K01Pcpy-Vw":{"text":"Hey you're so lame, you're a square! You're not hip!\n\nHey call me a square all the time if","useful":1,"cool":3},"DzfJrd_eVaeDNPi_GqmhTg":{"text":"Cool square to chill and take some pictures. It's not cleanest but there are plants of tre","useful":0,"cool":0},"zrvBKRdHNVsW8qPV406LhQ":{"text":"While traveling through New Orleans we decided to stop at Jackson Square to see the amazin","useful":1,"cool":1},"7_IlHzW79hVQ8JUc-YsSgA":{"text":"There was a lot to do and a lot to see around this area. You definitely want to watch all ","useful":0,"cool":0},"Yk0AutxccF6lvmNkX5yMxA":{"text":"Great place to listen to live music and people watch. You can grab a coffee and beignet fr","useful":0,"cool":0},"i_EWAgXCSkMyLqp_KWnEaw":{"text":"A visit to New Orleans is not complete without visiting Jackson Square. It's like visiting","useful":0,"cool":0},"z9frSAljWThlqVT4hbl-FQ":{"text":"Artsy area. Local artists selling their stuff. Lots of street performers. Lots of fortune ","useful":0,"cool":0},"waPNkyzVB-kH387FA_D1YA":{"text":"If you're visiting NOLA for the first time, you'll end up walking through Jackson Square a","useful":4,"cool":6},"k6xj5qELq3E65XPCAskkIQ":{"text":"Love passing through here when I visit New Orleans. There are many artists painting and ha","useful":0,"cool":0},"ehUraLFvUEhjI2BVrj0Stw":{"text":"A tourist must, I'm sure this place is just as popular with the locals.  There is more to ","useful":2,"cool":2},"HInMQsy1wqkrTnrdM8HrbA":{"text":"Must see with the local shops and art. Beautiful buildings in the area as well.","useful":0,"cool":0},"K_tN_D5STiiKPJr14c9mXQ":{"text":"Absolutely awesome place for an afternoon stroll.  Love all the artists and street perform","useful":0,"cool":0},"zrvCwBb37hYO4JxjRSrmng":{"text":"I am filled with pride every time I am in, or see, or even think about Jackson Square. The","useful":18,"cool":16},"NUvL-xgBHcgqWzhDQmQZtg":{"text":"No trip to the french quarter is complete without a stop at Jackson Square. Great place to","useful":0,"cool":0},"4_noXUvp_EQQc0CoaA8OMg":{"text":"We spent a lot of time here on our recent vacation. After visiting the Cathedral, we explo","useful":1,"cool":0},"k2avvL7S3-2fA6bzvrt25Q":{"text":"Came here during my NOLA spring break last March and happened to come across this beautifu","useful":0,"cool":0},"TiTw5Hf0-vk0x7Wrxh1ohA":{"text":"Whether you're there to people watch, buy some unique art or tour the beautiful church, th","useful":0,"cool":0},"no53kJy3jIDslTq07EYH6g":{"text":"C'est l'une des places centrales de La Nouvelle-Orléans, en allant dans ce Square qui est ","useful":0,"cool":0},"H8MwOtQk_V48SFbjbArWKQ":{"text":"Jackson Square is gorgeous and so lively.  I was able to sit and people watch.  The good t","useful":0,"cool":0},"p-ni0Ti9eHD9km8NIeIRvA":{"text":"If you need a break and want a quiet spot. I come here on to sit, read and people watch. S","useful":1,"cool":0},"e-ii_P8A_o2J_dy2kKB7lQ":{"text":"This is where you come when you visit New Orleans. There is plenty for everyone no matter ","useful":1,"cool":1},"TtIcG5NFiseuJqUdmvp79w":{"text":"Day 1 in NOLA: Hit the Cafe Du Monde take out window, proceed to Jackson Square and picnic","useful":0,"cool":0},"QxVN1xVK8fzjNuJ3G1o0yA":{"text":"I love frequenting New Orleans and Jackson Square since I've been going for the past decad","useful":0,"cool":0},"oTZoAOJcUWUYHoi09SHQvw":{"text":"Really pretty place to visit --- at night it can be very pretty! A lot of street performer","useful":0,"cool":0},"jfELVBkDa4i0QfePkb-ydg":{"text":"I LOVE this place. A lot of fun unique stores with a lot of unique items. Store owners are","useful":0,"cool":0},"vlmkTvZRFlx9q2sNavkDgw":{"text":"This square is a beautiful park with a picturesque fountain in the middle with the awesome","useful":6,"cool":6},"JR-d1XqFa4yLupfayi8IsA":{"text":"Love NOLA.Just make sure you have enough cash to tip the performers.","useful":0,"cool":1},"iCyPmLgTGijQyf2o3Rq2-g":{"text":"Jackson Square was one of my favorite places to visit on the entire trip.  Not only is it ","useful":0,"cool":0},"AMIEy1WVRM_JqxJgrRsLaw":{"text":"Grab some beignets and cafe au lait at Cafe du Monde and sit in Jackson Square while peopl","useful":0,"cool":0},"323Pdlj0MN9GuMo-__ghZQ":{"text":"From street performers, art exhibits to mule rides, Jackson square has it all! Great place","useful":0,"cool":0},"WKD_r0WUqYPX7uQ_fRNf6A":{"text":"Loved beautiful Jackson Square! It was such a close walk from our hotel. Inside the square","useful":0,"cool":0},"j9AJGY_fzXNaq3BvBIL-UQ":{"text":"Come to Jackson Square to get your tarot read by Jennifer (Jessica?).  I believe she sits ","useful":0,"cool":0},"flG4SOhE3Sqgp6OM9Xy09w":{"text":"Located right in the middle of French Quarter which is perfect for tourists. Be sure to go","useful":0,"cool":0},"Rp6qsacrM3SLjutbomIpEQ":{"text":"From the musicians to the artists and all the fortune tellers Jackson square is a great sp","useful":0,"cool":0},"_pCb3I4Z28CJv14VGe3jqA":{"text":"Jackson square is really nice. Come during the afternoon to enjoy the gras and to have a r","useful":2,"cool":1},"SdnN-p8IuLLD1zrnWbFCNA":{"text":"Nice place to explore and have a picnic. \n\nWhen the weather is nice the park gets crowded ","useful":1,"cool":0},"GoqOeop1JDRZjEsFIRawog":{"text":"The square itself wasn't super huge. It was definitely peaceful to be there. My friend sai","useful":3,"cool":0},"tY7wwZWyKegEyQnqYyrpAg":{"text":"Lots of shops and great for walking around viewing local entertainment.  Loved all the pra","useful":0,"cool":0},"ZImi6tga7EpaRuC9qhWp5w":{"text":"Nestled in the middle of the French Quarters is Jackson Square.  Sure, you seen Bourbon St","useful":0,"cool":0},"a8JG2sE7GKAm3k4IeupHhA":{"text":"Simply put, one should go to Jackson Square to experience:\n\n-Tarot card readers\n-People wa","useful":12,"cool":12},"C6_e1iMVzMIIIfQFlAOrXA":{"text":"October 2015\n\nJackson Square is not a large park by any means.  It holds a statue of Andre","useful":0,"cool":0},"9ZGJA0AZ-z4zKlIEWz5nOg":{"text":"Beautiful! It doesn't take too long to stroll through this area in the French Quarter. St.","useful":0,"cool":0},"At6FD5Dxa1ceDS-tj9YPFg":{"text":"This is probably the only pretty free thing you get to do in New Orleans as a tourist. It ","useful":4,"cool":4},"bcdtl9eWFw4xgrVp6tUMXA":{"text":"This is an urban park in a busy area of New Orleans. When I think of a park I expect a qui","useful":0,"cool":1},"2-ZV0PmhHuCUv5U2j3LYlw":{"text":"Beautiful and rich in history. Jackson Square in NOLA's French Quarter is where the iconic","useful":1,"cool":0},"5q5Dc0koua3vjU3spt3Udg":{"text":"Superbe place centrale riche en histoire, en couleur, en musique, en joie et en bonne hume","useful":9,"cool":2},"6X1e3RVddOKfqpAed7bItw":{"text":"Do much going on. The church is beautiful, the horse and buggies are lined up waiting for ","useful":4,"cool":2},"IsOmIZAbBCBegTLvObFL_A":{"text":"completely and totally obsessed with jackson square. every time we come to NOLA (once a ye","useful":0,"cool":1},"kr_xEme4dqiOF76ghfWYvg":{"text":"Jackson Square is the perfect place to get a little taste of the city. You can experience ","useful":2,"cool":2},"TEJvABcQ-6_Iu9zmW_B_TQ":{"text":"When you think New Orleans, you are probably envisioning either Jackson Square or the buil","useful":1,"cool":1},"xSGeo-hLYEQZXSkTGO8N5Q":{"text":"Beautiful park. The cathedral is so white and the sky is so blue and the grass is so green","useful":2,"cool":1},"pF30FFFdqTDnLEa_LVXs5w":{"text":"Excellent place to people watch, do a little shopping and take in the more family-friendly","useful":1,"cool":1},"bxknH7XbFJ6Orn5mNMblcg":{"text":"Jackson Square is many things, but it can best be described as a hub of activity.  It acts","useful":0,"cool":0},"WWKo1NXIpXpIS5O_JDNTNA":{"text":"En el corazón de New Olreans, ubicada frente al Barrio Francés y la catedral de St.Louis s","useful":1,"cool":1},"ugDyRYiMYSkJ-1zrltTOVQ":{"text":"Beautiful! A must see location in New Orleans. A fun mix of music, artists, and other loca","useful":0,"cool":0},"N6jA_ZiBEep-uuB3IJY6CQ":{"text":"Just a really awesome place. The highlight of New Orleans. Take the time to look at all th","useful":0,"cool":0},"cz3Wd3CMLXD26VBw9DueRQ":{"text":"Stop by Jackson Square for pictures and checking out local artist and painters work (many ","useful":0,"cool":0},"m79X8X4BoSa5JoLJVEAHGg":{"text":"As a NOLA visitor, you can expect to wander through Jackson Square several times during yo","useful":4,"cool":4},"FKZD342jMZLdfyK_AOM-8A":{"text":"Sat in the park near the Jackson Statue to get some reading in the warm sun.  Peaceful yet","useful":0,"cool":1},"NTX7T8QWH-mKXznGzuv1sg":{"text":"A Beautiful focal point for the city with the Cathedral in the background. Makes a great p","useful":1,"cool":1},"rtpmPakAmmpunNVQfAmbSA":{"text":"Such a beautiful park. In the center of the French Quarter. Plenty of places to sit in the","useful":0,"cool":0},"qZBMTI_ZFWGriqmrJhUd_A":{"text":"Beautiful place where you can see the famous President Andrew Jackson's statue riding away","useful":1,"cool":2},"Amlg_CF6OcU03LtbluYgBw":{"text":"Very pretty park in the heart of all the things to do in New Orleans. Statue of Andrew Jac","useful":0,"cool":0},"OprvMjFGrib2fHvh0NQpDg":{"text":"This is one of the best city squares in the country! The statue of Andrew Jackson in front","useful":2,"cool":1},"0js7dlSlYXFu3Cd1VNuakQ":{"text":"Center focal point and landmark of the French Quarter experience.  Horse carriage rides, s","useful":0,"cool":0},"4cqxgBreAcyGVxfz6TAs-Q":{"text":"Nice park on the riverfront of the French Quarter.  Surrounded by some old and wonderful b","useful":0,"cool":0},"iOQdBlk0RGdfFQdIfSN4rw":{"text":"Love Jackson Square. It's basically like the center and gathering area for Nola. Andrew Ja","useful":8,"cool":8},"3w39PegKzrEj5zGemfrwSw":{"text":"I visited Jackson Square this April. Jackson Square serves as a nice little park area with","useful":0,"cool":0},"KXVwk9rWcCAfX2Cf2fqL-g":{"text":"A historical landmark everyone that visits New Orleans should see. This is centrally locat","useful":0,"cool":0},"9XPhaB8ilhRx7MwzAlrm9w":{"text":"Beautiful place to stroll and explore. What a great historical area in Nola!!! A must see!","useful":0,"cool":0},"Yx8wvzsOpy0LCc2-3q70Rw":{"text":"My favorite place in NOLA! Beautiful and historic. The best view of Jackson Square is from","useful":0,"cool":0},"TTJ5ngI4-KSGUyNL93YgAg":{"text":"It is a historic park in the French Quarter, and on the north side of the square, as the h","useful":11,"cool":11},"XgStYysR-W7O6Qlddqiu1g":{"text":"Other than Cafe Du Monde, Jackson Square is my favorite place in NOLA. There's so much lif","useful":0,"cool":0},"QVaCVQjrk2rjzQJjg9Dq9g":{"text":"We ended up here many times. Good meeting point with street performers and other surprise ","useful":0,"cool":0},"s6L04yD0DQ2_69Od8j3eSw":{"text":"Touristy and crowded but centrally located for people watching and break taking. The Cabil","useful":1,"cool":0},"wfq_ZL6_WTOFx2V4UlTHgQ":{"text":"Took an obligatory photo in front of the Square and walked around taking in the sights. Ve","useful":0,"cool":0},"0wfoklY_01b-MH_IeX-Dsg":{"text":"Beautiful! \nDefinitely a place to see around the French quarter. go for sunset or during t","useful":0,"cool":0},"1cuQaF2Fr7co8_ho338YHg":{"text":"Jackson square is a great park. Lots of talented artists and musicians displaying there ar","useful":1,"cool":1},"dBMm9yb5UjVqFg088EPiOw":{"text":"Let's face it: people are happy in the French Quarter, and Jackson Square is the heart of ","useful":2,"cool":3},"-2lNR8KrgpmerdKgF9gpkQ":{"text":"Loved all of the local artists and music.  Amazing dueling violins.","useful":0,"cool":0},"gdbCl9RXF76qqGz0USPI0A":{"text":"Great park with tons of good photo opportunities. There are  street performers and artists","useful":0,"cool":0},"vzjk2lzmw6PnTXSjXTFO6w":{"text":"I just recently had a reading with a gal named Willow Le Mechant. I went looking for a rea","useful":2,"cool":1},"1fEiCDf4kc7o-dMs_Z3THQ":{"text":"By day, Jackson Square is a rather charming destination to repose, study, read, capture aw","useful":11,"cool":9},"05aGCdQ7M5xIOKqt6pvK0g":{"text":"Jackson Square is easy to find and a great place to start your day. Cafe du Monde is a blo","useful":0,"cool":0},"_8Lg_4BiA91E5ZWrX8JeLQ":{"text":"This is one of the most gorgeous places in the French Quarter! Definitely stop by and take","useful":1,"cool":1},"3_1YzSsJ2E5S9LM4HgU2Xw":{"text":"Great public space. Beautiful garden and street performers. Museums, Cathedrals, stores an","useful":1,"cool":0},"AGgUwe0iXOPGuJNw9sgY3w":{"text":"Sit, stroll, elope, get married, eat lunch, meet friends in the best spot in the Quarter.\n","useful":1,"cool":0},"KhcJiEU7mKPEyYBVGsI0Ig":{"text":"I feel like I'm right by Princess Toadstool's castle when I'm in Jackson Square.\n\nSome of ","useful":2,"cool":3},"EkmoInE6v-9uNLEX3W_Zuw":{"text":"Would be beautiful if it wasn't like a circus for adults. During the day, this place gives","useful":0,"cool":0},"7sDBoezJUnVYP0bM7KaKGg":{"text":"A must stop while in New Orleans Jackson Square provides a multitude of options for visito","useful":1,"cool":1},"1RyYcihEighEL3zt4VFDGw":{"text":"A New Orleans tour is not complete if you do not visit Jackson Square. It is so beautiful ","useful":0,"cool":0},"sg-zOEFYpfJ03wVVkYapKg":{"text":"Interesting place to visit, a lot of history in one spot. We booked a \"haunted\" carriage r","useful":0,"cool":0},"9J0H1-bnMzufAtu2QrKF-w":{"text":"Definitely a historic slice of New Orleans where you can sit, people watch, eat a beignet,","useful":0,"cool":0},"Z09nSXvxp0rLr2U_B4hxeQ":{"text":"Probably one of my favorite places in the world. The street artists, horse drawn carriages","useful":1,"cool":0},"RIl2zJn4WSbqvB4GaQ5lDw":{"text":"One of the best places to visit in the morning, afternoon or evenings to get a good feel f","useful":2,"cool":2},"FKRgZdzRxPymLmfF7L2VEQ":{"text":"A very lively place during the day. Quite beautiful at night. It's well known views are le","useful":0,"cool":0},"hut55lWj8k6nDZtQvCPf1g":{"text":"I love Jackson Square. It is the heart of New Orleans... the place you think of when you t","useful":0,"cool":0},"yx99XC3kS5CznD7walfjrQ":{"text":"At Jackson Square you can always find some interesting activity taking place. The street m","useful":0,"cool":0},"JpAeQQVh0mFH__Gm-UEjEg":{"text":"Like a little slice of Europe on the Mississippi. Makes sense, since, you know, it was Fre","useful":0,"cool":0},"ilX9TaxnARzR1d7Wp6A6MA":{"text":"In the hustle and bustle of the French Quarter, Jackson Square offers a bit of break from ","useful":0,"cool":0},"iXsjDonmxPg7HjIDUGHNQg":{"text":"Nice buildings. Horse tour people bug u","useful":0,"cool":1},"fMFTAEQd3gLmgiV_poRRpQ":{"text":"Great place to stroll through if you are one of those people wandering NOLA. There are ben","useful":0,"cool":0},"vQVlsV8-KEmRtDc8W5djFw":{"text":"If there's one area that defines New Orleans it's Jackson Square. It has the food served a","useful":0,"cool":0},"PGnXjBCC9BXfSF7KO2EKJQ":{"text":"Jackson Square. Artist! Artist! Artist!  There are many artists show case their creation a","useful":3,"cool":2},"t6oXkNr2iqBH-50Fk_n_GQ":{"text":"Pro: Quite a delight in the early morning without the drunks and heat. Marvelous layout an","useful":0,"cool":0},"uljmJqNbrm8YdQ2F_yH0gg":{"text":"Surely one of the most emblematic locations in the city. There's plenty of weird stuff goi","useful":0,"cool":0},"TtpjtZpEtHyCkk9HbnT42Q":{"text":"Pretty and clean and jazz music playing around the area. With horse carriages waiting arou","useful":0,"cool":1},"gnCpEKczfrprU7a_GwKYrA":{"text":"The sites.  The sounds.  There is so much to see and feel in New Orleans.  This is one of ","useful":1,"cool":0},"epmxZftTGJunZlULz6NNqg":{"text":"This square is absolutely beautiful.  It's perfectly landscaped, there are local artists s","useful":4,"cool":3},"UP12tpL_6W858mdgEIwpBw":{"text":"This park is pretty nice. There is the Jackson monument in the center. There are plenty of","useful":2,"cool":3},"eIWANQOUv0vMR66sKN1deQ":{"text":"The square was simply picturesque. The statue is the highlight, with beautiful buildings, ","useful":0,"cool":0},"mmSAzbbaZ4nzpl3X15GkQQ":{"text":"Very nice park. Worth a quick visit for a couple of nice shots of the statue and cathedral","useful":0,"cool":0},"UB2uG0lYiXHdTJOpQ4AAbA":{"text":"An ugly statue for the most racist president in US history. Definitely worse than trump. \"","useful":0,"cool":0},"hjoISHXB7os7QrgZ9ojZjg":{"text":"A must stop on your New Orleans trip!  Yes, it's touristy.  Yes, it will probably be crowd","useful":0,"cool":1},"Rfkjnt4fJI_PbEPiQXXJxg":{"text":"Famous tourist spot, so it was a must to stop by and take some pictures. The location is b","useful":0,"cool":0},"HYXQhJ1O-1MtnqYNhlPRlA":{"text":"A very nice to stop by to take lots of pictures, also to hear music from local musicians. ","useful":0,"cool":0},"-lNjz1GPWh5U4gffWky75w":{"text":"it is a good place, a lot of musicians, events... i like when there are some musicians blo","useful":0,"cool":0},"cjZFHQpLB1ezYgMlpuzXvQ":{"text":"INCLUDING THE AREA AROUND THE SQUARE= Jackson Square itself is a nice calm amidst the chao","useful":1,"cool":1},"Rs1pzCi8jjrJO1fMBVkTPQ":{"text":"If you want to escape the frenzy of New Orleans for a moment, take a break in Jackson Squa","useful":2,"cool":0},"Q2lnv7kIh3rn4PhVBnA3bA":{"text":"Jackson Square is the heart of the French Quarter.  It's a beautiful park surrounded by an","useful":7,"cool":8},"RFK1mHAzD72SnvI4OyUJ1w":{"text":"Tarot/Astrology Reading with Sareena- Jackson Square was beautiful last night! This is the","useful":0,"cool":0},"4dZSjly60wR3jtJPVfHqKw":{"text":"Please do not remove statue in the square. I have so many pictures of it, it's a land mark","useful":0,"cool":0},"M7l4R9RAKntRCQY9Rsji4Q":{"text":"Absolutely BEAUTIFUL! A must visit when in New Orleans. It's full of tourists but it has g","useful":2,"cool":0},"rnCWINsIQpwvpxWV_yvF6A":{"text":"I used to live in New Orleans and loved Jackson Square and the French Quarter.   This song","useful":0,"cool":0},"mD5btOsY4yOWfnzhyQhTEA":{"text":"\"I bet you a dollar I can tell you where you got your shoes!\"\n\n\"On my feet.\"\n\n\"Damn, man, ","useful":0,"cool":0},"4P54JpJmZctU4EeRJmsrkQ":{"text":"Jackson Square is a great place to sit and watch people go by. Tons of shopping. Street ar","useful":0,"cool":0},"ELgXQGO5yeEHjsojqtw59g":{"text":"Nice place to hang around and to listen to music although since it's new orleans probably ","useful":0,"cool":0},"M-gBgz54_TY8nldQSvfLtA":{"text":"It is a really fun place. During the day there are a lot of artists selling their art work","useful":0,"cool":0},"SpXyX6sl30c8XLiIOCqb_Q":{"text":"The Jackson square is the true heart of the French Quarter. Surrounded by shops, restauran","useful":0,"cool":0},"XMFX60NoR03IhHEkyE0SDA":{"text":"This is a happening place for sure.\n\nMusic, art, food, and TONS of people.\n\nGreat place to","useful":0,"cool":0},"glUeuwo3FMlBGpTnfPfOQw":{"text":"Beautiful place!!..so much see, do, eat and buy!! :)\nWill be back to visit Again! :)\nWent ","useful":0,"cool":0},"qsEgMl31fN5kLrc7XmMvkA":{"text":"Just a lovely little place to relax and take in the sights, sounds and abundant street per","useful":0,"cool":0},"4NAh7bXJUGuXWolXQmCfmw":{"text":"Beautiful park, especially during early morning or twilight. The garden is well-manicured.","useful":0,"cool":0},"hg4rJclqw3dRQjbdFRzUbQ":{"text":"There are many great places to eat, drink and just hangout.  It was nice to sit around in ","useful":1,"cool":0},"JAocDYTNuJf_HjyWMdLpxA":{"text":"this is a very cute area...its free and there are paintings, small one-two man shows. ther","useful":2,"cool":1},"xm7z7kShtdO5SzUCm8WbRg":{"text":"My Ratings:\nQuality - 3 Stars\nLocation - 4 Stars \nEntertainment - 4 Stars\n\nMy Opinion/Stor","useful":1,"cool":0},"tGt9yIpS5ZWI8WOuTzCYoQ":{"text":"When most people think of the French Quarter their first thoughts are about partying on Bo","useful":5,"cool":4},"7tBfGhwAUcmVP3xxTKliyQ":{"text":"Cool to go and stroll around during a lazy Sunday. Lots of artists trying to sell their ar","useful":0,"cool":0},"HtfXmEXbS-7hkell96dptA":{"text":"Jackson Square is a gorgeous park/square in the heart of the French Quarter. You can get y","useful":3,"cool":3},"QCvhmg3Rs41UYjNLun2WXA":{"text":"Very cool place with a TON of history, although I am sure that the Native Americans aren't","useful":1,"cool":1},"lEc9kj2dqwfNZoI9HQrqgQ":{"text":"A beautiful square with historic buildings, beautiful landscaping and surrounded by artist","useful":1,"cool":0},"YdUu3lsf5LLGxxLMVS5S6Q":{"text":"Nice garden square to walk around. Great atmosphere. There was a live jazz band playing wh","useful":0,"cool":0},"pbbTm7CVRynXwq7B5VOKTw":{"text":"It's a beautiful area. I've past by here several times whenever I was in the French Quarte","useful":0,"cool":0},"n7SZIP8KkTWNZbo5qPQOww":{"text":"Great photo op here, but look closer and you will see mostly homeless around the perimeter","useful":0,"cool":0},"jBhZ1U6-qrUhFNG-gCx7YQ":{"text":"All kinds of artists and vendors plus, the carriage rides start here.  There are restauran","useful":0,"cool":0},"kx5sendSK0st3XvFV5BhEw":{"text":"Jackson Square is like Union Square but instead of retail shopping surrounding the park, i","useful":0,"cool":0},"7tzvQNz4sz9_Mu3wCo1eXw":{"text":"This is a lovely place to walk around with a beer. We went there around dusk and it was re","useful":1,"cool":0},"nTqhlhi8KGpLKfwY_aGG-w":{"text":"Beautiful historic park. Stay awhile on one of the benches and sip some coffee from Cafe D","useful":0,"cool":0},"40hjySuOuhCVQy1x9kOeoA":{"text":"Technically it is just a tiny, immaculate, public park in the center of French Quarter. If","useful":0,"cool":0},"g0gidy5_Ph3dcyDmeSoWmg":{"text":"This is a beautiful and classically New Orleans site.  We took a number of good pictures w","useful":0,"cool":0},"md673NVVJzvgzY4t6vmcfQ":{"text":"Jackson Square is one of those areas in New Orleans which holds so many memories for me.\n\n","useful":7,"cool":8},"h4XSmTZq6aLby2ixzKa6HQ":{"text":"I've never been to France, but I can somehow imagine that it would have a similar feel. Ar","useful":0,"cool":0},"MkebpgM4Iij-hR_Lz-P0Ew":{"text":"The exquisite architecture, history, and the jazz music are what lured me to New Orleans t","useful":5,"cool":3},"hnoCcqU3VIkuM6k7CPt6TA":{"text":"There's some cool stuff here. It's definitely worth taking some time to explore. The park ","useful":0,"cool":0},"e-shRrydBMd3w0zxAPmtaQ":{"text":"We really enjoyed Jackson Square! Lots of excitement. There are a ton of shops all around ","useful":0,"cool":0},"PT7vyUEwV8g-mKJ3NF-Ufw":{"text":"The park was locked throughout my Mardi Gras visit - that is unfortunate.  That aside, thi","useful":3,"cool":2},"qHm1g5ZiTnDrYlb3RNcoCA":{"text":"Dee place 2 be in the deep South. Nawlins,  street performers,  you can people watch too. ","useful":0,"cool":0},"0T-HEL58RY6scGn-6AmLIQ":{"text":"This was my favorite sightseeing experience while in New Orleans! Jackson square is such a","useful":0,"cool":1},"IBTTcVbgk7OrotgKKgTBCg":{"text":"This place is not what it use to be. I remember you could walk around Jackson Square and i","useful":0,"cool":0},"xylzR2MrY0gI7vWXZcIRbA":{"text":"A must-see and easily the heart of the French Quarter. You can walk through the park to ge","useful":0,"cool":0},"cEkXQo8JF_vfDFskdTVjsQ":{"text":"If you have an afternoon in NOLA and you're looking for a picturesque, quaint and overall ","useful":0,"cool":0},"98cIbZvftyUguFiOGEeY-w":{"text":"Very cool square right near the riverfront and the French market. During the day, artists ","useful":1,"cool":1},"qr7yq9q2BX5bUd7ZbkZj4w":{"text":"This is a neat place to check out in NOLA.  Statue, old buildings, green space, artists, s","useful":0,"cool":0},"HdR0aFwe7flpmT-BtVlG9A":{"text":"Worth a stroll. Lots of art vendors, tarot card readers, etc.  be sure to go to the levee ","useful":0,"cool":0},"IW6Mw3EBqRvC8B2mI5aDzg":{"text":"A must see if you are in New Orleans!\n\nEspecially if you are here over the weekend. The Sq","useful":1,"cool":0},"aqa1EJvnoYdrNZfrDqYQUg":{"text":"I often write about how major cities should have a convention center that supports hosting","useful":0,"cool":0},"boE4OrEdGfE2HEJOUOC3uA":{"text":"NOLA has been devastated by Katrina over a decade ago and scars still deface this ever so ","useful":0,"cool":0},"VMfGwpfnk-Ds89Z57natdA":{"text":"Beautiful park located in the heart of the French Quarter. Jackson Square is easily access","useful":45,"cool":46},"SM1auSAeKS42ZZneuAc2ZQ":{"text":"Beautiful church views and park area with the Mississippi River pretty much right across t","useful":0,"cool":0},"2vwef1kGVYQLWQhf0dxbcQ":{"text":"Jackson Square is a place ever anything goes!!! The place where artist, performers, reader","useful":0,"cool":0},"vZq5osMaqh2fjHnZ8IuE_g":{"text":"Jackson square is so beautiful! It's right across the street from cafe du monde and just s","useful":0,"cool":0},"ZeflAfDIoBqKGRdsuBlpgA":{"text":"If I could give zero stars, I would. Was there last summer. Hot, humid, crowded, dirty, gr","useful":0,"cool":0},"DhTSKQ5FLbDBD3OnzWfgCw":{"text":"The best part of the French Quarter. Lovely Cathedral ,.. lots of artist and art. Street p","useful":0,"cool":0},"Q1ta0dKvuS8fVGRa9fK4Pw":{"text":"Jackson Square is iconic, legendary, and a must-see for anyone and everyone. It's historic","useful":0,"cool":1},"lWp_IWH4qRNuRy3zkvdiSg":{"text":"With the help of the St. Louis Cathedral in the backdrop, Jackson Square is the most pictu","useful":0,"cool":0},"46V882_YQW5Pc-jOvIkXow":{"text":"Buskers are all over Jackson Square. Children who cut soda cans and put them on their feet","useful":0,"cool":1},"A8Aj8J8Zqa7Is8qYyZwY_A":{"text":"A visit to New Orleans would not be complete without a stop in Jackson Square. Visit the C","useful":0,"cool":0},"y2dNWwHsEJIBP8W3UQnFfA":{"text":"Why check into Jackson Square and do a review, I mean who reads a review about Jackson Squ","useful":3,"cool":3},"AF3T4boH4Pha34wVO7cCVg":{"text":"On a beautiful day, this place is a get area to kick back and relax. It is a break from th","useful":0,"cool":0},"nrcu1cH9Iq_88z6-h-nXog":{"text":"It's just a square in New Orleans that is near a beautiful cathedral. While some of the in","useful":1,"cool":0},"btQH7Kb2OXkjN1vX6SwkoQ":{"text":"This is one of the coolest spot in NOLA. There is so much to see/do here. We came here on ","useful":0,"cool":0},"ftuQwCwDh7Z4WBhqK3kteQ":{"text":"My kind of park. Morning, noon and night there's great art, music, food and sights. Go to ","useful":0,"cool":0},"PmR5vcNlCHrV41TGTpKmQA":{"text":"What a site!! It has art, live music, jazz, lots of vendors, and charm. From young to old ","useful":1,"cool":1},"SBEq3h4WKqPec0oadJEecQ":{"text":"Jackson Square dominates the tourist area and is a must see.  The statue of General Jackso","useful":0,"cool":0},"O3OnDQvYAJvWCPDyPD0JbA":{"text":"This square at nighttime is magical. New Orleans is magical, but this square is something ","useful":0,"cool":1},"p8K5krvHS6d9jB4g7zh8eg":{"text":"This is the heart of the French Quarter, filled with places you've seen in photos. Artists","useful":2,"cool":3},"-MWoi8Wun_k91FYrDSGIeg":{"text":"I love the vibe at Jackson Square. There are tours that you can go on, café du mond, and a","useful":0,"cool":0},"2Lu6-0kkgl4_NIIgNcKvXA":{"text":"This park is so beautiful and well manicured. My boyfriend brought me here last week and I","useful":0,"cool":0},"p9ebTT1aGlTvsaHCzfcwSg":{"text":"Really beautiful, clean, and well manicured park right in the heart of the French Quarter.","useful":0,"cool":0},"w7F6G7903ID4-5yjTUKqhQ":{"text":"It's a must-see in New Orleans.  The square looks out to the cathedral, with an Andrew Jac","useful":0,"cool":0},"ip9GQAO-mYmyvFpe6ta_cw":{"text":"This is a beautiful location. The area is very clean and well kept. Perfect photo opportun","useful":0,"cool":0},"EyDIDOUFAltGmVfrU6ugGg":{"text":"A place for pictures, people watching, finding our your fortune, and viewing the street pe","useful":2,"cool":0},"mNv-ivk2GErvvLmpnw3sAg":{"text":"I love Jackson Square. It is an absolutely gorgeous park. It has beautiful wrought iron be","useful":1,"cool":1},"bG-1QOOr4IBAvdBJBUM9hg":{"text":"Where else can you find street performers, artists, and fortune tellers all in one spot?? ","useful":0,"cool":1},"41SunK_CheSaGSeEP5-wQA":{"text":"The heart of the Quarter! So much art and a plethora of performers there to make a buck an","useful":0,"cool":0},"PvCBLeBNcPNZljl_hzOirQ":{"text":"Picturesque park in the heart of the French Quarter.\n\nDAYTIME: Enjoy the vendors selling t","useful":0,"cool":0},"jAe3-zvfUWZ6JF7-XvMa0Q":{"text":"There is always something going on in Jackson Square.  Whether you are people watching, ha","useful":6,"cool":7},"zSaeuIoTyXgVuKH14l-49A":{"text":"Beautiful park near the river, with the oldest catherdral in the US right behind it.  A gr","useful":1,"cool":1},"PiqqxNoY4femNpsTbgqNVQ":{"text":"Beautiful place to frolic around in nice warm & sunny weather! \n\nLegitly almost everything","useful":0,"cool":0},"ZZvjKusPYrG6KRBAt_i9ew":{"text":"Jackson Square is the heart of the French Quarter. It is a beautiful shady parklet with be","useful":0,"cool":0},"Fz0CLdpMkK5dJuvEV1d32A":{"text":"Beautiful at night, fun during the day. There are street vendors that hangout along the fr","useful":0,"cool":0},"JQWFLG3Rh5psRR_Pg2OAEA":{"text":"Jackson Square is one of the nicest segments in the French Quarter. Lined with stores, res","useful":1,"cool":1},"JJ_WGPIEXYpnHXdtuIq5ug":{"text":"Shops and restaurants surround Jackson Square. \nThe park is nice and clean. Good for pictu","useful":3,"cool":1},"_z2mAV73jlPVcp_bVMXB_Q":{"text":"Jackson Square aka Place d'Armes occupies 2.5 acres and built in 1721 designed by architec","useful":0,"cool":0},"o3hoROCMxWWIOP_jUi5lOA":{"text":"This is one of the absolute best places in the world to relax, read, people watch, or enjo","useful":1,"cool":2},"0ju-yuCJ5qqrW6gtrR03fQ":{"text":"This place is a very happenin' area to be and it's a wonderful tribute to one of the worst","useful":0,"cool":0},"7RnxdJUxBcyOjLbU2ZM33A":{"text":"Beautifully landscaped square in the French Quarter-- a hop, skip and jump from the Cathol","useful":0,"cool":0},"nqAlsHJotYQzZwH9oPuysQ":{"text":"I love the square in the early fall, when the weather is temperate and it's quiet.","useful":0,"cool":0},"S6poYYMKOxnknOPq4MNAHQ":{"text":"We stayed nearby here. A lot of artwork and live performances, a lot of tourists like me a","useful":0,"cool":0},"i5dNSt4gmFreeCDU7I8fdw":{"text":"Jackson square is my fav spot in New Orleans so far!!! If you love art this would be your ","useful":0,"cool":0},"J4cgZGoikCbLk13O7hHkNw":{"text":"This is a beautiful area for a leisurely walk on a lovely NOLA morning where you may or ma","useful":3,"cool":3},"Z_i8N5lQRkTszbe3vd0qlg":{"text":"A very clean and beautiful park. There was a nice breeze and places to sit and enjoy the s","useful":0,"cool":0},"L4Y6xECD6crgfCk0qLspcg":{"text":"Jackson Square is beautiful to walk around.  The buildings have great details.","useful":0,"cool":0},"psr1qJG0w2vTSM7BE1jk_g":{"text":"Who would have guessed that a city square would be such a hot spot!!! Located right in fro","useful":0,"cool":0},"I0-HSHPf5COO61P1UBOC8g":{"text":"Because I don't care for the long, haphazard lines, the gobs of tourists or the camp of pi","useful":12,"cool":15},"UmKBTnwdg8z-qMD_XVkQXg":{"text":"While this may be in the French Quarter - it is nothing like France! Filled with tacky bad","useful":0,"cool":0},"W56pwihDJ-iGa4oAI95U5A":{"text":"Jackson Square, such an antebellum jem. Once a public area for execution, now a picturesqu","useful":1,"cool":0},"5OY5cIl1Dc7PBO9nYFYudA":{"text":"Small, beautiful square surrounds statute surrounded by lovely wrought iron fence.  Oct-20","useful":0,"cool":0},"iQ8CzhzDqVWNyxQkHwOPsw":{"text":"Except for the fact that Andrew Jackson drove peaceful Native Americans from their homes a","useful":0,"cool":1},"45LorufvTwQUpyribvvNQQ":{"text":"One of the most popular attractions in New Orleans. This covers a lot of best tourist spot","useful":2,"cool":1},"uuup7lUL5H3QuunmhR-sFw":{"text":"Lovely square. Dotted with loads of tarot card readers at night. We sat with two different","useful":0,"cool":0},"b1PEbn2tmz_8cuic3qH2fQ":{"text":"Lots of interesting things to see here. Taro card reading, random acts and dancing--overal","useful":2,"cool":1},"mIXsqZbZAgEmlsKEgggzsg":{"text":"This is the heart of the New Orleans art scene and the center of all that is touristy in t","useful":1,"cool":3},"Qf9VwEpxVGq-r4RK_eqxyw":{"text":"A beautiful square and it is decorated with st Luis cathedral. It is full of street talent","useful":0,"cool":0},"rXJJ5rJIiOvENqgpJDOTEw":{"text":"I've visited New Orleans a couple of times, but usually it's for an event and I don't get ","useful":7,"cool":4},"Hcnyt7aFljdBH2OSaLsjHg":{"text":"Such a colorful place! Buildings, people, sounds of jazz music and soulful everything and ","useful":0,"cool":0},"WZpGTIC-H_Fugf3aUrKI9Q":{"text":"This is like the garden of the French Quarter! Ironically named after the US President who","useful":0,"cool":1},"lGknRRP6j65SZRWZ5zqPpw":{"text":"As I walked up to the Square, I was hit by the amazing jazz music being played bu a group ","useful":0,"cool":0},"PvAymKqIPN5MQMlPWA_Umg":{"text":"This was a really fun area! Full of street performers and vendors, this is indeed a must-s","useful":0,"cool":0},"KIjHjpvegPyOScHENaZuHQ":{"text":"Beautiful here! Lots of shady spots, grassy areas and benches to relax, eat a picnic lunch","useful":1,"cool":1},"xGFjpykRBRnC2Fz5jGbuCw":{"text":"TIP: if you need a strong data signal, face the church and go to the corner on your left h","useful":3,"cool":1},"aF2B79tNKxy1X9T3SI6MTA":{"text":"Hey, pretty little thing. Look at you, all lined up around the outside with local art. You","useful":0,"cool":1},"R6IcGU9K2ndaYowiN4YG9w":{"text":"I spent a lot of time here when I lived in NOLA and I make sure to visit when I come back ","useful":0,"cool":1},"mDgNIof0CGXBad7QPpGc8g":{"text":"Great park with an awesome statue of Andrew Jackson and the St. Louis Cathedral in the bac","useful":0,"cool":0},"nxUrvzGwU6vb889ew8S6Bw":{"text":"One of my favorite spots in New Orleans!  I love all of the street artists that display th","useful":1,"cool":1},"aU88HcrdMG04HnqQg9ettw":{"text":"This park is clean and beautifully kept. We sat here and observed people for about a hour.","useful":0,"cool":0},"HQH5TY_JYo6dhViOWU9PiQ":{"text":"Very pretty park. Wish I had had more time to sit and enjoy it. I love that it was once th","useful":0,"cool":1},"sI3HCEMrqm24KaFJ0gHQ9A":{"text":"Well Kept...Live Music..plenty of places to eat...art, clothing, and food shopping also.  ","useful":1,"cool":2},"sATxeNX4oxJ-pg9QS9p6QQ":{"text":"Nicely maintained and surrounded by so many touristy places. Definitely a place to relax b","useful":0,"cool":1},"vsaqGJUfmEJxB37UDkL9tg":{"text":"Cool area with lots of touristy stuff to do.  Is touristy even a word?  Doubt it!  I digre","useful":0,"cool":0},"wyn-XatqAh79Ou6vICPPBQ":{"text":"Jackson Square is a historic park in the French Quarter of New Orleans, Louisiana.  From t","useful":2,"cool":3},"r4ybSl8hi1tSErLkMC9SKQ":{"text":"Jackson Square is a gem I can never forget. It's the first thing I think of when it comes ","useful":1,"cool":2},"wlqd9TbmJLnMmK4sxCbThA":{"text":"Jackson square is so beautiful! We are from california and it reminded us alot of venice b","useful":0,"cool":0},"yusPvV7Y8ApnkvAmUrThDA":{"text":"When traveling to NOLA you should so go here.  Its pretty with tons of shops and historica","useful":0,"cool":0},"chezXvaPa5zi_YkUOQcwiQ":{"text":"This is an area that my wife and I have enjoyed so many times. There are many art gallerie","useful":0,"cool":0},"SOTmVAuFQU8L3_4bM_3iXg":{"text":"The place is beautifully surrounded by historic architecture (one allegedly the 1st apt. c","useful":1,"cool":0},"BmwOmqazgiQ6g_BBXik23A":{"text":"For me, Jackson Square really was the essence of NOLA, and the highlight of my trip.  Alth","useful":0,"cool":0},"Vmcl_zWiYIBi2jJJIuoW4w":{"text":"Lots of entertainment, but it's hectic. The park actually closes early. Probably afraid pe","useful":1,"cool":1},"YCylE3Y_H6B9bFp3dYOhBQ":{"text":"This place has a lot going on! People selling some amazing artwork, music, dogs pretending","useful":1,"cool":1},"Dn9EE46X2Ae1et80r1vusw":{"text":"The atmosphere was amazing. From music to street vendors we had a great time! Thank you he","useful":0,"cool":0},"9i2wIq2YecYJVLIiyfbywg":{"text":"Beautiful! I really enjoyed this area. It was clean and I felt safe there. Plenty of artis","useful":0,"cool":0},"zlnvwzKdsGMkdRb_combhg":{"text":"Stop and take a breath.\n\nAdmire the historically inaccurate statue of Andrew Jackson (rear","useful":7,"cool":5},"oIoZcO4iHuRn6piKIIfR8A":{"text":"This is a beautiful spot in New Orleans. There is always street vendors and performers. Th","useful":0,"cool":0},"1VZmlsK1OOu9ZXCJ0rgYXg":{"text":"It's a small park but a convenient location. Nice and thick grass.","useful":0,"cool":0},"XajP6GPex03GaxO8aFQssw":{"text":"This special place provides a much needed opportunity for weary travelers to slow it down ","useful":0,"cool":0},"af-hIiT1AFiXbYnd1jgEcg":{"text":"Jackson Square isn't really your typical park like I originally thought. While there is a ","useful":3,"cool":1},"yRNGf2Tw4cGhEV3zyEgx4g":{"text":"Street performers, musicians, guys drumming on buckets. Take a walk around the square. A s","useful":2,"cool":0},"G5TyHbHIlEW6F89BMfYVrw":{"text":"Stunning area of New Orleans. This was 100% the vibe I was hoping for when we booked our t","useful":0,"cool":0},"_InLa-4k2QCH9X8qb6BDQg":{"text":"great environment a must see and bring your selfie stick","useful":0,"cool":0},"rnlRksLK9dWSsCg3XJCwOw":{"text":"Jackson Square is an open square which stands before the St. Louis Cathedral.  With some g","useful":1,"cool":0},"5-atzyiXvmH_KNGUgqh19g":{"text":"Great place to just hang, listen to street vendors play some great blues or jazz, entertai","useful":0,"cool":0},"ldGRPvV4ftBenpSC9I8CkA":{"text":"This was my favorite place that we went to in New Orleans! It's a beautiful square with lo","useful":0,"cool":0},"5Lbkiq6Y7BMqrkGK0m9U5g":{"text":"Jackson Square is one of America's gems. It began as the Place d'Armes -- Weapons Square -","useful":3,"cool":2},"0zPNu7OP774PzSt7xQMV-Q":{"text":"Checked this area out on my last day in NOLA. Lots of shops, good food and music. Would de","useful":0,"cool":0},"CTOduJ3U0uVL76UpO0_V-w":{"text":"Located about 3 blocks away from the drunk, wild party block....this is a great place to g","useful":4,"cool":3},"gxc99YHi8bwWYoYMBBFxdQ":{"text":"So many cultures in one place. So many different types of artists in one place. It's a glo","useful":0,"cool":0},"G3_OZAbN-1r-UiZX3oBy1Q":{"text":"The park in Jackson Square has benches under trees. Very nice way to relax out of the sun ","useful":3,"cool":4},"jkM2R0PdrFTXGWMDTw-MHQ":{"text":"Beautiful and a wealth of talent to be seen. Def grab a beer from one of the shops and enj","useful":0,"cool":0},"GjXfe84X1I-whtx_lnctwQ":{"text":"Thank God for Yelp! Otherwise I never would've found this lovely gem on my trip to New Orl","useful":6,"cool":3},"h4voHhfNc0g_-OPtTACI2w":{"text":"If you're in New Orleans, you must walk around Jackson Square. This historic park is a Nat","useful":2,"cool":2},"KPyLLu8_Zk_uvg98ppJirg":{"text":"You'll always find some fun sightseeing and people. The square is also the perfect photo o","useful":1,"cool":1},"eXjFFL0s4uq0ojRB-FsmjQ":{"text":"Love this space! Such a great vibe. Love the view of St Louis Cathedral, Andrew Jackson, a","useful":0,"cool":0},"KZ3yky6ETtAeA387X-MZyw":{"text":"Great environment in this entire area. There was a live national daytime show filming when","useful":3,"cool":1},"ERwnB0r8ngEw5w5Zmj-gSA":{"text":"The group I was with stayed in the French Quarter and we spent all our free time in the sq","useful":0,"cool":0},"oAHLvCN47kpanWDAqWyCNg":{"text":"Jackson Square is hands down my favorite place in the French Quarter. I often start my day","useful":0,"cool":0},"s-E_aGX4r29GdLHYRhVMVw":{"text":"Great place to visit when you're in town. Tons of history and people watching. Excellent p","useful":0,"cool":0},"o5Wighnlr_z3j-jlLpNsGA":{"text":"This is an awesome historical space and landmark for NOLA. It was built in the 1700s which","useful":3,"cool":1},"9tdMk0c-aJgoxIxc4Exy7A":{"text":"New Orleans is filled with so much history. This square is home to the beautiful catholic ","useful":0,"cool":0},"hoJUKi1tq_aZwpQjDApKAg":{"text":"The history and rich culture of the square is a nice place to sit and reflect.  We missed ","useful":0,"cool":0},"q_-98mBTmbzT_lVb_0gi9A":{"text":"This was a pretty little park with art on display/ for sale by local artists right on the ","useful":0,"cool":0},"-6ltodIUULkLigEyze-jpw":{"text":"It seems silly to write a review, but much like everything else in New Orleans, it is uniq","useful":0,"cool":0},"N4jjIIgTYqZCvvAvt0NahQ":{"text":"Jackson square is where it's at. Where what is you ask? The local artists, art vendors, ca","useful":8,"cool":8},"-aI4GGpokkH1Mlg9_cPVvw":{"text":"Small little park, worth the visit if you are in the area, but don't make an extra trip. T","useful":0,"cool":0},"fADVdUl2J2N3sl1QLgGGQQ":{"text":"Awesome place, fantastic history and great pictures can be had from nearly all vantage poi","useful":6,"cool":6},"c7xBAKewIuKSZShjuiveLA":{"text":"A Night in Jackson Square\n\nNew Orleans is a siren of a city, a city of fables and illusion","useful":8,"cool":8},"6AXfbBxOPAHgQOHj2kr1hw":{"text":"In addition to being iconic, it's also just plain nice. You really appreciate what good at","useful":0,"cool":0},"ULHgMg8Zzbx3yU01mxIkbw":{"text":"Next time I visit New Orleans I will try to get a hotel near this square. If you are trave","useful":4,"cool":4},"ckmIexWGiHf2uttz1d6HSA":{"text":"Wonderful history and scenery but watch out for the scam artists who will Harass you. Wish","useful":1,"cool":1},"sciViyKLBXjgWq--YwroRQ":{"text":"Jackson Square is a beautiful little downtown area to go and sit after you've dropped by t","useful":3,"cool":4},"fhrYo7SeKyBPDHJmkGBdcQ":{"text":"Jackson Square is beautiful, in every way. The cathedral is almost always used as the obli","useful":12,"cool":10},"muAD34kwHLf4oG6WVe8XjQ":{"text":"We had 1 day to sightsee in NOLA, sans vehicle. Jackson Square was around a 30-minute walk","useful":1,"cool":1},"PN-VELoAhl5ra7GFGFjKQg":{"text":"What a beautiful part of New Orleans. Walked over after breakfast and had a wonderful time","useful":17,"cool":15},"wqYmSu8Ldvv9Z2R9hwKA_g":{"text":"Very picturesque location near the Mississippi River and French Quarter. The St. Louis Cat","useful":1,"cool":2},"1Cuc1M1T2sRhEPwrsqCpdg":{"text":"Iconic, symbolic, classic, it easily transports anyone back to an historic plaza in Europe","useful":8,"cool":8},"tlPZ5CEBAvX8orqosAg_Ug":{"text":"In the middle of the craziness of the French quarter is a green oasis where you can relax,","useful":6,"cool":8},"zwf3YHmN02384nthlQHiBQ":{"text":"Iconic. Street artists. Horse drawn carriages. Chill atmosphere. Music. Restaurants.","useful":1,"cool":0},"wML5bI400IBPPKS9zWeYlw":{"text":"Jackson Square is a historic park in the French Quarter. It is also where the St. Louis Ca","useful":11,"cool":11},"hwlFwydiX2hDv5EupJ2TJQ":{"text":"The grounds are pretty and clean. No matter where you sit you'll hear music. Plenty of sha","useful":1,"cool":1},"dLR3ZBjNDkI7IB3liWMISA":{"text":"One of the great public spaces in all of America!  Couple that with the incredible history","useful":14,"cool":12},"o6m8uMurEoTew2yUb4Tn_g":{"text":"It's so peaceful inside the walls of Jackson Square, even though I can see tons of people ","useful":3,"cool":2},"Kud44L4Wh_sQSXY1eT0o8A":{"text":"This place was really fun a lot of history , culture and music is all around this place I ","useful":2,"cool":1},"HlDYfqFi6iYBkMy6FT4qCA":{"text":"Jackson Square is a lovely park across the street from the Mississippi River. It is only a","useful":14,"cool":16},"sjBs65PNEgT7l7sHjiMCYQ":{"text":"A must see when visiting the city ! Hit this place mid morning before the crowds hit and e","useful":2,"cool":2},"EyU5_8cI6vQCItrKfruupQ":{"text":"I sometimes wonder if locals resent us tourists for turning their beautiful, historic Plac","useful":1,"cool":1},"q2pK-5tOIbfj6sdsd0noug":{"text":"If you're wondering where to start have your Uber, Lyft or taxi drop you at Jackson Square","useful":7,"cool":5},"AqW4dik0oGrup9U-KezY6Q":{"text":"Loved this location, people and happy crowd. Great place for pictures and relaxing. Lots o","useful":0,"cool":0},"Eq4dgs--dUDoRKj-Y5YG0Q":{"text":"I will round up a little since i visited during a pandemic.  It was completely dead when i","useful":0,"cool":0},"H5Xw62PkHhE0B285IWKR2A":{"text":"All I can say is ditto to all other Yelpers with a five star rating. Live shows, restauran","useful":1,"cool":2},"YyKgDHmDTbgBM6SCf37D5w":{"text":"Yeah it's touristy but it's a place you need to check out when you're in New Orleans. I wa","useful":2,"cool":0},"6yyxoD-zMEALTGeaoAfnYQ":{"text":"This is the iconic New Orleans park with the statue of Andrew Jackson on his horse honorin","useful":3,"cool":3},"eJ8a9zNAqs8s3LAGX5krsA":{"text":"Such a beautiful place! Very clean location and cute little shops. The Cathedral and the L","useful":1,"cool":1},"9OqQJCg1jUVdaoyJNsrnnQ":{"text":"This is an awesome park. Very clean, the trash was being picked up by the street workers d","useful":1,"cool":1},"0ZCB3p6-OmigkDd5_SlmZg":{"text":"The historical essence of this place makes it a worthwhile stop while in New Orleans -- if","useful":3,"cool":1},"-oPSXLcCuxuHiRSzNGhGJA":{"text":"Nice place to walk to while visiting Nola. There are benches to sit on and pretty flowers ","useful":4,"cool":0},"Ew3IMdhbz-z4yO-Cw1YDmQ":{"text":"Smack dab in the middle of the French Quarter is a beautiful park with a lot of history an","useful":5,"cool":4},"Ez1fV9yxTDnd_j0RAI9ozg":{"text":"Pretty small park and centrally located in the French Quarter to many different restaurant","useful":0,"cool":1},"mJGvELdcfur6r--zJFMy6Q":{"text":"This is hub of the french district. Plenty of performers everywhere, lot of restaurants an","useful":7,"cool":7},"T_-PjIGSvmx0BSJFHho6RQ":{"text":"Date/Time: 12/14/2019\n\nJackson Square and the surrounding area really attracts a lot of pe","useful":1,"cool":0},"xLat7ZfFZ5r_AAoU8mQxcQ":{"text":"One of my favorite spots in all the French Quarter.  It sits in a very busy part of the Fr","useful":4,"cool":3},"uXLViXZdhoxciZGEuf_GGQ":{"text":"Great area to chill out, have a latte & some beignets while listening to some awesome live","useful":0,"cool":0},"BOf_kTtmjt9VHvdyRNwHbA":{"text":"Jackson Square is arguably the heart of the French Quarter. We passed through the area for","useful":2,"cool":0},"VIVXoveUu71xw91hjG9uzQ":{"text":"The place to go in New Orleans to see a bit of everything. Each day that we partied and wa","useful":21,"cool":21},"2FnNTM0ePdHSDWgxDD_LXQ":{"text":"Beautiful with interesting people. Great for people watching. This is a must for tourists ","useful":0,"cool":0},"PuJz3ZQyQ7o4oqKTS77kng":{"text":"Just got back from a mid week trip to NOLA. It's the perfect time to go. I wanted to write","useful":1,"cool":1},"9CkcK-9PMhHnRd6WXUndOg":{"text":"To ring in 2011 the right way, the girlfriend & I spent the week around New Year's Eve in ","useful":1,"cool":3},"3LwQxKDTobNmJRYkKAlcKw":{"text":"*If someone says \"For a dollar I can tell you where you got your shoes...the city and stat","useful":3,"cool":4},"1Dbwfg-u6y7vMC2wkMsfyw":{"text":"Definitely worth checking out when you're in NOLA. You'll see so many things going on. Per","useful":0,"cool":0},"VgH8UlnvoCEeufHGsuBvbw":{"text":"If you a history buff this area will likely appeal to you.  It feels like an oasis within ","useful":0,"cool":0},"0LfkOVIWESXCEZ9SG0Ghow":{"text":"While this is an absolute must see on any traveler's list, do be careful!\nLike any big cit","useful":4,"cool":2},"0_R5Qg-J_3NVDbXEAiEvAg":{"text":"Jackson Square is bomb. Just sitting on the benches, eating some beignets from Cafe Du Mon","useful":1,"cool":0},"-CKWbB_VhfwB4AB5MRcc-A":{"text":"You can't come to New Orleans without passing this park because of the iconic St. Louis Ca","useful":1,"cool":1},"aeIeLwfyb2mARxOqFEux-g":{"text":"Absolutely beautiful, today!   Jackson Square is where lovers quarrel, lovers become fianc","useful":1,"cool":0},"wGHIHDhDpMqQJ5rwStwQWg":{"text":"The heart of the French Quarter.  Great place to people watch, eat a muffuletta from nearb","useful":0,"cool":0},"hIW_evqkgBQWAj2AWrsuOw":{"text":"Beautifully landscaped and plenty of places to sit and relax.  Lots of shopping options an","useful":0,"cool":0},"49QhUWMHWE1Bb17jLqzMaw":{"text":"Jackson Square was one of my favorite places we visited. It is so full of life and culture","useful":1,"cool":1},"vrhNQHPMppduOjo_me4zbg":{"text":"Beautiful park with well manicured lawn for a great  photo shoot in the park. It's very we","useful":2,"cool":0},"WkQmmVxEtdVksce_2mB6aA":{"text":"Jackson Square is names after Andrew Jackson (okay this is a duh!) This is where you get a","useful":8,"cool":7},"M_ffpkEWUXovuQW2xXcrXQ":{"text":"Jackson Square is truly one of the iconic attractions in New Orleans. You've most likely s","useful":2,"cool":0},"QzCSDzDRp7uVJ4mX6QWGKA":{"text":"The rumor mill was in full swing that Friday morning in New Orleans on how the protestors ","useful":2,"cool":2},"vyTMgWlGYXH0gFpn2G5zRA":{"text":"I really enjoyed Jackson Square and spent a lot of time here on my visit to NOLA. Now, I a","useful":8,"cool":7},"D3DRa98-D81kjFCMXzEfsw":{"text":"Such a nice place to visit. Very clean and wide open. When we went it was during covid so ","useful":8,"cool":6},"H6UrD3macRHC37KY2TRM8w":{"text":"Must see if you are in town. This is a historic landmark in the French Quarter.\n\nWe got to","useful":62,"cool":55},"KTgt4Usag9qfkSw5LQAHeg":{"text":"A New Orleans icon. Very nice pretty park. It's famous for the Jackson statue in the middl","useful":6,"cool":6},"lwA8ozJE0xNYTYXdnYqdKQ":{"text":"Jackson Square is a beautiful park in the center of French quarter. I saw a famous $20 bil","useful":0,"cool":0},"WWPP-jwG9dVS0KQcQfje9w":{"text":"Absolutely breathtakingly beautiful! \n\nI was just blown away. \n\nI'm speechless right now..","useful":1,"cool":2},"_DgVPhgu6krIauRX4bqwJA":{"text":"I really enjoyed this square. It's so lively on the weekends with musicians singing their ","useful":2,"cool":1},"7hUtDTEtHujC2bDHa1d3NA":{"text":"Not only is it historic and beautiful it's just a spot that will pull you back in time a b","useful":19,"cool":15},"KUZxIPnPw7Y659-elTixQw":{"text":"Jackson Square was originally known in the 18th century as \"Place d'Armes,\" and later rena","useful":3,"cool":3},"0fad41K8Emm2KQwTs5s9nQ":{"text":"The better the weather the better your visit will be.\nThis area is busy, with loads of foo","useful":2,"cool":3},"nqkAnnOttk1AEPl9hctMYg":{"text":"It is written in the guidelines of tourism that to understand NOLA,  all those who visit  ","useful":8,"cool":4},"twPjJcoOtxRdg-CcxZbu5A":{"text":"Iconic landmark in New Orleans. I'd say make this one of your first stops if you're visiti","useful":19,"cool":13},"sCyP-iBB0rl271pzNV022w":{"text":"If you come to visit New Orleans your visit should almost always start here. Why? Because ","useful":6,"cool":4},"U0yvxy1kQibJnH3RiYWwew":{"text":"No visit to New Orleans is complete without a visit to Jackson Square. There are countless","useful":4,"cool":3},"9viSlgbqNX78p5FHDMiWBA":{"text":"Lovely little reprieve from the entertainment all around the outside of the small park. It","useful":1,"cool":0},"uVrbrIg7fJ_HQ1k8o5SdxA":{"text":"This famous U.S. National Historic Landmark/ Register of Historic Places faces the Mississ","useful":1,"cool":0},"oSruH6OUMVCTHdLaL5ofaA":{"text":"During my visit to Jackson Square,\nLove was certainly in the air!\n\nMy sister held an impro","useful":3,"cool":7},"BkhO9J4e3JaYIClPDJpcpw":{"text":"If you are already walking around in the French Quarter - add a little more history to you","useful":0,"cool":0},"LRYWYckUPHs5FsZRi_8iZw":{"text":"Not finding it extremely as exciting or as \"must see\" as other reviews seem to suggest. \n\n","useful":2,"cool":1},"j8b-UTa5BxYXCX6PE2YElA":{"text":"Artists making master pieces, jazz players in the st, beignets across the st, all mixed wi","useful":6,"cool":4},"Ts19AOIHKhACGzALlMBUOg":{"text":"A must visit when in NOLA.  Just a couple of blocks away from Bourbon street, and it will ","useful":8,"cool":8},"lmu9_acjtoF4yHKzn2cgZw":{"text":"One of the most iconic areas of the French Quarter and a must do attraction. There are art","useful":1,"cool":0},"r71M64PJOtUTDxqrVLKkJw":{"text":"I would for sure stop by here if you're going to the French Quarter area. They have so man","useful":1,"cool":1},"Wf9ORj7BUDAkDg81BwNDcQ":{"text":"When you get tired from visiting such iconic attractions as Cafe Du Monde, St Louis Cathed","useful":2,"cool":1},"xPaHdNb55a3ZfQc1tIZMJg":{"text":"Really, how can you give Jackson Square anything less than 5 stars?\n\nWhen you talk Jackson","useful":8,"cool":4},"OrOxtfP4mbFf6Zxf4LV5jg":{"text":"Cool square,in front of the cathedral.A lot of things going on all around.Across Decatur S","useful":0,"cool":0},"KEurrWLt0DrNGtAjln8AmA":{"text":"Cool square,in front of the cathedral.A lot of things going on all around.Across Decatur S","useful":0,"cool":0},"L7jmZTWmwwuDjKSEeZhmxw":{"text":"Beautiful park full of street performers and talented artists. We saw a funny magic act. W","useful":8,"cool":10},"bOvmmxPtB2pZJRTHNtTKCQ":{"text":"Jackson Square is a must when visiting New Orleans, especially if it's your first time! I'","useful":3,"cool":2},"0XeRKWqICj8jdQxojWkyiA":{"text":"Best park in the country, so much history, so much to see and I love all the galleries and","useful":0,"cool":0},"ExjkPvdCC2xlqZBq6k5qOw":{"text":"Hitler square. But political issues aside, a nice clean square in the heart of the French ","useful":1,"cool":1},"SX-CYqfsM2Cbsieh2nhThg":{"text":"Beautiful little park in front of oldest Catholic Cathedral in North America-really intere","useful":3,"cool":3},"ZGM6VNTx8VZkov1BQcFP1Q":{"text":"Beautiful square to take in the NOLA scene:\n\n* YES - Ample bench seating \n* YES - Live str","useful":3,"cool":3},"u4OkFcFGggJoMHxBt8Q38Q":{"text":"Soooo, you want to know about Jackson Square, huh? It's pretty awesome, and very easy to h","useful":5,"cool":1},"8QQbuxkZMoEfGn5NyW3VCQ":{"text":"Well it's  a square. A big square park. It is nicely kept and clean.  There are many big b","useful":31,"cool":30},"Oun4KznyhWrkX3Up9mFKWg":{"text":"If you are indiscreetly meeting your lover in Jackson Square, then you're a moron because ","useful":7,"cool":6},"WseEFw9yVSWZNJCJNx3c_A":{"text":"Center square more like it!\n\nNice scene and on the way to Beignets and French Quarter! \n\nI","useful":10,"cool":13},"vKd5fjPhu__5vsAV8SkRzw":{"text":"Such a beautiful and historic place to come and take a break from the food scene and enjoy","useful":0,"cool":1},"YtKCQlO-RWNGDnQZwIFiIQ":{"text":"Really cool park with a lot going on. On a warm, sunny day, I suggest having a seat on a b","useful":7,"cool":6},"nnDy-cbwjoC-3Kuf0javFg":{"text":"I am sure if you walk around New Orleans at some point you will stumble across Jackson Squ","useful":1,"cool":1},"IP8b4UOXi1Ydq2-e-5Ho2w":{"text":"This square is so beautiful! It's right next to the Mississippi. My guess is it's named af","useful":1,"cool":1},"VxGUalClRxRAjKVW07sPbQ":{"text":"1. Unique 2. Historical 3. Romantic = JACKPOT!\n\nNew Orleans is divided into 72 different n","useful":17,"cool":19},"0KhrjYcHeQGF_jnEvmzMgg":{"text":"This place is beautiful with shops street performers bars restraints and museums. A must s","useful":0,"cool":0},"VniMymLjszuMk9v3-XJjJQ":{"text":"There are many memories in old Jackson Square. I've been coming to jackson Square ever sin","useful":1,"cool":0},"GAj8bRf5_3MLX9Yl_BbZow":{"text":"Jackson Square has a vibe you won't want to miss. Whether it is musicians, magicians or ta","useful":1,"cool":0},"gPEO0E6H0x9cVh7OpBDKxw":{"text":"Love it here.  Perfect place for a picture.  The church is beautiful.  Great location, cen","useful":2,"cool":2},"XHS72rEyvDLoU3icqWLxrA":{"text":"Jackson Square is a park in the heart of \nthe French Quarter of New Orleans. \nIt is full o","useful":6,"cool":5},"LFwl_mgUvk8Gm9gi7edc7g":{"text":"It's always nice to have an urban oasis to escape to when in a city.  Jackson Square is on","useful":11,"cool":11},"BpOI5pmtjCWCjqN9XgYdRg":{"text":"Jackson Square is pretty Iconic to Nola and is just as touristy to other staples like the ","useful":0,"cool":0},"Yf90f3qHpnvuTUy8P9Tgww":{"text":"What is not to love? What is more iconic than your photo taken with the the statue and St ","useful":8,"cool":8},"ct-SGutjnOls8ci5c82yiA":{"text":"Jackson Square is such an iconic image of New Orleans.  From the street you can see Andrew","useful":13,"cool":13},"oraIXPq2SXk-2q5Rj6yBKA":{"text":"Such a beautiful place and right across the way from Cafe du Monde. I loved all the artist","useful":1,"cool":1},"iPXhWB2Zu57y_a9KEwmNdA":{"text":"This is a must visit tourist spot. The Cathedral is here, lots of street vendors, shops, r","useful":2,"cool":4},"tGzv4d1nEbfWzYm4rxgfEw":{"text":"Truly an iconic place, must see if you come to New Orleans.  It looks just as pretty as in","useful":1,"cool":0},"eB7GK2UHIlel1-cekGupuQ":{"text":"It is the convenient culmination of New Orleans and the French Quarter.\n\n  This is THE pla","useful":0,"cool":1},"1lFyoIriwfVdqQ3Xb88jZw":{"text":"I had a blast visiting the renowned Jackson Square during my first trip to Nola! This ador","useful":16,"cool":17},"UtouRGmarfi6B0MLIdEqjg":{"text":"People watching. Live Music. Artists. Acro. Performance artists. Museums. Seers and henna.","useful":2,"cool":1},"mkc4EWy_R_yfXKVgoROAoA":{"text":"This place is one of the best photo opportunities in all of New Orleans.\nBe sure and climb","useful":3,"cool":4},"8CSaKQk-jWwInTMdwUP9vw":{"text":"We visited New Orleans for New Year's Eve 2016 and the first few days of Jan 2017.  We vis","useful":2,"cool":3},"ssk-6mEjfMdz-fcjLpTM3Q":{"text":"Good central space pretty much in the middle of everything. The park itself is kind of coo","useful":1,"cool":2},"85m9An2dDvf3qJFu_9cfYg":{"text":"One of the most recognizable parks in the world, Jackson Square is a historic landmark cen","useful":5,"cool":5},"W4Vr3rGm4ZrapuE7CTnilg":{"text":"If you've been to New Orleans, you've most likely been to Jackson Square.  It's the heart ","useful":21,"cool":23},"MPin6VY1EB0t-Xz5Ysb2mw":{"text":"A definite must see for anyone visiting the area. The square has a garden with statues in ","useful":18,"cool":22},"snDI8WO5MuEQCr5yquYmBg":{"text":"Great atmosphere and people. There is a lot going on in the square. If you enjoy music, ar","useful":1,"cool":1},"TahDULDEgmAmAdKhEu6AIw":{"text":"A visit to New Orleans isn't complete without a trip to Jackson Square.  I love Jackson Sq","useful":8,"cool":8},"BzGVR0G_yCnpxJtutHkB2A":{"text":"You have not lived until you have been chased by police through Jackson Square. \n\nA one-st","useful":5,"cool":5},"y2zTh1-TDrwCtcIpHztS7w":{"text":"Very chill and laid back, but fun, park in the French Quarter. First visited Jackson Squar","useful":20,"cool":17},"xLK3Nh6d0HCNPrYnb7I_sg":{"text":"Absolutely love Jackson square and seeing all the artist come out with their work. We boug","useful":1,"cool":1},"Yh3vnvq2BQZH0J7xMoxtCw":{"text":"I was highly disappointed when I got here and did not find Michael, Tito, or Germaine.  Ju","useful":1,"cool":1},"lV5QxcVvxZIJz49vCx-b1w":{"text":"Not to be confused with the neighborhood in San Francisco (#1), this landmark is one of th","useful":8,"cool":6},"uUZWZkgIXLicVuLxhcZLGw":{"text":"Very lively square in NOLA.  Kids all got really nice Henna designs, listened to live musi","useful":2,"cool":3},"TRFjrX4tElDCMecOvRemLg":{"text":"First time in New Orleans.  After walking along the riverfront, you wind up in the heart o","useful":1,"cool":1},"dn7ZfOs4YY3JqOlV0KM9IQ":{"text":"We did a tour and they walked us around Jackson Square and taught us all about the history","useful":1,"cool":1},"27pXu0HuLX3q3vlHAyHwCQ":{"text":"Lively town center where there is always a lot of action. NOT a park, it is a center of to","useful":2,"cool":1}}