{"VO8DpmYxzroMa5jeIhhMjQ":{"text":"We took the criminal sinister intent tour with David tonight and he did an awesome job! He","useful":1,"cool":0},"mgD5FkgkSwPxhJSFnXxKbQ":{"text":"I had a great time walking around New Orleans learning about the history and mystique of t","useful":1,"cool":0},"h86TmX0N4VZuK3uxU9PmJQ":{"text":"Took the Sinister Criminal Intentions tour with Terese! One of my favorite tours in this c","useful":0,"cool":0},"epJg0DihsaqkWR-gwjDtaA":{"text":"Sinister tour... Davis was our guide. He was awesome! He didn't have a costume but he has ","useful":0,"cool":0},"blmwEyxSg50tBDlqdFCRiA":{"text":"My husband and I booked the lewd spirits tour and we were not disappointed! As a disclaime","useful":1,"cool":0},"3FPxj0fk7fdZhNAM91WuGQ":{"text":"We took the Family Ghost tour and had a fantastic time with Monique.  She knows her stuff ","useful":2,"cool":0},"cd7KE_QwF5Cio-9OfbxhvQ":{"text":"I booked a private tour for the Sinister Crime tour for my 40th birthday with my family.  ","useful":0,"cool":0},"j7qD6WiVqiAkVweYtbWe_w":{"text":"This was a very fun way to explore the city! The tours are definitely on the cheesy side, ","useful":1,"cool":0},"MEjJJw6j5jkJtM0-bvD8lg":{"text":"My boyfriend and I signed up for a Murder Tour with Unique NOLA and we loved it! Our tour ","useful":0,"cool":0},"0gddwaTt8kwUAgM9l682qw":{"text":"Randy was so great on the True Crimes Tour! Very informative and really captivating. I per","useful":0,"cool":0},"7btrHuGzLlZHrd_AB4vzIQ":{"text":"My wife and five year old daughter thoroughly enjoyed this wonderful tour with Monique! Sh","useful":2,"cool":1},"u_NDvn8AyyK2_1UCJnDjWg":{"text":"The best thing I've done since being in New Orleans! Barbara was an AMAZING tour guide. Ve","useful":1,"cool":0},"H59JWhUGuA52ODcJVIMXaA":{"text":"David was an amazing tour guide for our sinister criminal intentions tour. We have partici","useful":0,"cool":0},"iSmVP1dkRZZsxwo1QzFXIg":{"text":"Wandered up to St. Louis Cemetery #1 unaware that visitors must be accompanied by guides, ","useful":2,"cool":0},"gXxTieZTTHiGlQHVoIVK_g":{"text":"Randy Randy is the BEST tour guide and we had such a great experience! We learned so much ","useful":0,"cool":0},"pNMiwcctnyFCCEuKL1IT7w":{"text":"I just love this tour. My friends were in town with their children and we're looking for s","useful":2,"cool":1},"Kyc2xOJp4gXXgD5_WdmJfg":{"text":"We did the Sinister Criminal Intentions tour. Our guide Randy was the best!!!! He was so f","useful":1,"cool":0},"tIBDeLAzpmo9kuvCwWkWHw":{"text":"We toured with David. He was extremely entertaining and kept great conversation in between","useful":0,"cool":0},"s56PQleGVsxAwlyrMNVxRA":{"text":"Today I was able to do the \"Adult Only Sinister Tour\" with Randy. The tour was absolutely ","useful":0,"cool":0},"wKjL6aaeod72OptXq4ytdg":{"text":"We did the kid friendly ghost tour with randy and he was amazing!! Extremely knowledgeable","useful":1,"cool":0},"eEjqYRibxNsOfJUpi3d5cw":{"text":"We booked this tour day-of, and we were so happy with the booking process - very accommoda","useful":0,"cool":0},"K11Hq4yYwjFl0zK4Yind2w":{"text":"Murder tour. Monique is friendly and wanted to be sure everyone enjoyed the tour. She adde","useful":0,"cool":0},"sbgS_ramXVkiBRFvvyGyOA":{"text":"Aurora was an amazing guide and story teller! What a great way to spend our first night in","useful":0,"cool":0},"5W81ey7cG-8QfYXZt1T40Q":{"text":"We did the Criminal intentions tour with David. He was awesome! Very funny, but knowledgea","useful":1,"cool":0},"xUVYuOhhYYrzS2Wm2zNlIA":{"text":"We opted for a last minute, unplanned tour of St. Louis Cemetery No. 1, and in spite of a ","useful":3,"cool":1},"fy9lOCk6rKNmIbjCYf0pGg":{"text":"Randy was a very knowledgeable and entertaining guide on the Sinister Criminal tour. We co","useful":1,"cool":0},"QZP1xEpGWClx8CuEVNNoqQ":{"text":"We booked the Sinister Criminal Intentions tour and David was absolutely fantastic! We had","useful":0,"cool":0},"S6UNZ7xc9b3eq0mLJZvpBQ":{"text":"I took a tour with Mike and absolutely loved it. I learned so much about the culture and h","useful":0,"cool":0},"CO6zUQY3tTLiOiI3nFn09g":{"text":"Aurora did amazing! We had a blast and she was very personable. The tour was super spooky.","useful":2,"cool":1},"7mmebl_FmyeLj5Zdwl05fg":{"text":"We did the \"Sinister Criminal Intentions Murder Tour\" with Randy.  He was super funny and ","useful":1,"cool":0},"TK3t9mDIYzdUGq5dIhn9rw":{"text":"We took the Criminal Sinister Intent tour today with Ren from Unique NOLA Tours.  He's pro","useful":2,"cool":0},"7wRgMIYfiY56iR-ZZXj1Ag":{"text":"Took several tours while in NOLA this weekend, by far the best and my personal favorite wa","useful":0,"cool":0},"HDKK4zXbSk3fbbmv_B9ghw":{"text":"Lesley was our tour guide for the Garden District walking tour and it was fantastic! She w","useful":0,"cool":0},"rUxMlILRbpKrytbObSuZug":{"text":"Great experience! We did the family friendly ghost tour with a party of 8, and it was supe","useful":0,"cool":0}}