{"VNdTliF-qL2vUqo6txxsAQ":{"text":"Very good food and service. A small place but the food was as good as you get. Off the bea","useful":0,"cool":0},"EmUqGSe10EZFYztCg9_RsA":{"text":"Awesome brunch spot! There is usually a wait, but just put your name on the list, venture ","useful":2,"cool":0},"E3OAaC5Uf72ZvPU1Z6ruOA":{"text":"Nice appearance. The place looks good maybe a little bit hip. Friendly service. Food: noth","useful":1,"cool":0},"n8uuUY3GC5jNhv_L-3hRig":{"text":"Incredible place! Yes, BYOB from the corner market one block away. We showed up right as t","useful":3,"cool":1},"11morLb5bd2bmB95bf4LbQ":{"text":"We came here for lunch, showed up a little before noon and were the first ones to be serve","useful":2,"cool":0},"UcorbLheK58J8U-rAAdnhQ":{"text":"From the moment we walked into Eat, I knew it was going to be a great experience. This lit","useful":3,"cool":1},"zqjENBUsW78MwNIgMah-wA":{"text":"This was our last day in Nola, and we both decided that this probably was the best place w","useful":0,"cool":0},"HNAGbev56Tl6od_8IFarYQ":{"text":"Enjoyed everything we ordered. Chicken and dumplings were great, albeit a bit light on the","useful":1,"cool":0},"6WYPqtn8CG9ItE6gGvbdvw":{"text":"Que Manifique! This place was out of this world! My sister and I strolled in before closin","useful":2,"cool":1},"GfEiJ_EfuczNSKDybxolng":{"text":"Eric did an amazing job.  It was a very nice change from the loudness of the rest of the F","useful":0,"cool":0},"s8Nkk9xk_0Tq5RvQP-rNGg":{"text":"Fantastic!!! The menu was so interesting that we couldn't decide on an entree, so we order","useful":3,"cool":0},"GZK8MdS0Hdg1PB9L3_v4QA":{"text":"The eggs dauphine and fried green tomatoes with remoulade were amazing! Plus, they were wi","useful":0,"cool":0},"mRs7yUPIFj3npIkkfCj2Hw":{"text":"It took over 10 minutes just to get water for the table. They had fruit flies around us be","useful":0,"cool":0},"gvk7q9jNOEgGlcz3oeaxKg":{"text":"This place is just yummy.  For any foodie it's a dream.  The perfect twist on homestyle co","useful":1,"cool":0},"P9JnkoXso-_P-mI1h3EdNg":{"text":"Cochon dinner ($19) was amazing!Chicken & Dumplings were good. Deviled eggs were decent. G","useful":1,"cool":0},"nQI7AQE-aqWfHRLpM7NOwA":{"text":"Breakfast/Bruch was amazing. The Eggs Dumaine are very rich but so good! The wife had the ","useful":2,"cool":0},"Xe9BoixAdCrpvYpKLiKa_Q":{"text":"Food was excellent. Not \"real\" southern cooking BUT the stuffed peppers and Mac and cheese","useful":1,"cool":0},"RPg7uuoTPslIB6DfjWe6BA":{"text":"Looking to get an authentic Cajun meal before a night out in the French Quarter, my friend","useful":3,"cool":1},"YLRReoNVYMLnYGTCK8tcdg":{"text":"I actually found Eat on Yelp, and the restaurant did not disappoint!  After taking my boss","useful":0,"cool":0},"tISc-piqG1ExNRNBozWhdA":{"text":"Perfectly prepared food in generous quantities. BYOB. Sweetly caramelized onions on braise","useful":1,"cool":0},"wfyuiQYRyny1svAFEXx-pQ":{"text":"We surprised a friend for her birthday on our trip to the Big Easy, and found Eat on (wher","useful":4,"cool":4},"Z_iqla1ybgL53Y7MnzkPlA":{"text":"Good food great service.  A little over priced on the entrees.  Though the portions are la","useful":0,"cool":0},"ajp980tgHblUgkah1wK2JA":{"text":"I consider a meal amazing only if I want to keep stuffing myself until the danger zone. Th","useful":2,"cool":2},"bMaTfnrDnHsqw8H45Q3_-g":{"text":"What a great spot! Far enough away from Bourbon Street that it doesn't feel touristy, but ","useful":1,"cool":1},"qjLL2NICDYx4U3FRvgE9rg":{"text":"Chose to go here after reading all the positive Yelp reviews, even though they do not have","useful":0,"cool":0},"QqPb5c3FUaPpDAgR0df8og":{"text":"lovely place for brunch, can bring your own champagne! great food but not a lot of vegan a","useful":0,"cool":0},"PZyC3Ij4FKDuJNMSzL3Wtg":{"text":"I had the most AMAZING brunch ever last weekend at EAT!  I am a brunch connoisseur, and th","useful":1,"cool":0},"xMpP2WkPnmj9BxH82aoQzA":{"text":"Definitely a must visit on a trip to NOLA. BYOB encouraged, no corkage fee. You just have ","useful":1,"cool":0},"ogFzH1heMQPa3CvWc4Cx0A":{"text":"We were looking for something to eat in the French quarter and came across Eat.  Literally","useful":0,"cool":0},"BcVZchcVlrktc47F3pWsuw":{"text":"Delicious.  Had a fantastic meal here this past weekend.  Was in town for a friends bachel","useful":4,"cool":2},"P5VhJznEpoiViIkRy_D03g":{"text":"Eat was a great, unexpected surprise. The breakfast was amazing. The \"Eggs Cochon\" was pro","useful":1,"cool":0},"szto3WIqmg71Zhb8rXh4AQ":{"text":"I LOVED it.  It's a great place to start your trip off in the French Quarter.  Eat looks l","useful":0,"cool":0},"rDgjWMiwm1xC-24sGLfK_w":{"text":"Beautiful restaurant set just one block off Burbon Street.. I went in , looking for New Or","useful":2,"cool":0},"qLdHlW6FPAVBi41BLtDnrQ":{"text":"Hip, friendly, attentive service. Great food starting with the appetizers. We enjoyed our ","useful":0,"cool":0},"GIz6II5OHdpG1cKOBPPEEw":{"text":"I'm giving them 5 stars because I can't think of anything to fault.\n\nI went at \"brunch tim","useful":1,"cool":0},"MV4HA6b0B7OAK6rMmwBvXA":{"text":"Fantastic!  Cochon was delicious. \n\nGreat atmosphere. Attentive staff. \n\nVery reasonable f","useful":1,"cool":0},"Xv6f1ojQNb3IgYKEHw_zyA":{"text":"The food was ok but the waiter was terribly rude to me. While I was ordering, he had the n","useful":0,"cool":0},"WUU0m-YQPRFKeRmuDHFPPA":{"text":"Food was mediocre as well as the service. Both of us ordered the three course dinner and t","useful":1,"cool":1},"BH1wfPBuR1u2cvLKFLhz7g":{"text":"By far the best food we had in NO on our trip. Affordable, tasty and inviting! We loved th","useful":0,"cool":0},"mKh_Ulicb5wdEopzar3umQ":{"text":"Randomly stumbled on this establishment, Had dinner, not a lot of options on the menu but ","useful":0,"cool":0},"FgPvDZ4QcQtwmveSWbGzJw":{"text":"Had Saturday morning breakfast.  Unique menu that was enticing.  I had the chicken fired s","useful":1,"cool":0},"Neqk55IS_tWBcuYsY1alNQ":{"text":"Excellent neighborhood eatery..service is top notch. Love the Caeser's dressing, Catfish a","useful":1,"cool":0},"T0fxwiZGalnDUo--S-AvPA":{"text":"Very cozy little spot.  BYOB, unfortunately we didn't make it to a store to bring somethin","useful":0,"cool":0},"ZLoq9kiOEt9n5UxneQ79HQ":{"text":"Food:\nMediocre.  Had the trio.  Gumbo was watery.  Stuffed pepper was very bland.  The red","useful":4,"cool":0},"sHJZ6SpPtAHtbDeS0WdIZw":{"text":"Yum, this place is really awesome. We ate here twice during our trip and both times were e","useful":7,"cool":4},"KkGd90o6Aph6plj3bdyX5g":{"text":"Outstanding breakfast.  7 people, 7 different entries.  Each one fantastic.  You can't go ","useful":0,"cool":0},"Jjwuo6uefORBZwHB4Bfvig":{"text":"We ate brunch and lunch here during our New Orleans stay. Both meals very good, the fried ","useful":1,"cool":0},"qPX629cyf2XFw3WmOdiWiw":{"text":"Fantastic place for brunch!! We had a group of 7 and were able to be seated right away (ev","useful":1,"cool":0},"-jg6G3cRJDyzCdldE7_C0w":{"text":"A phenomenal experience! We arrived starving and in grungy travel clothes, but the waitsta","useful":0,"cool":0},"2U30vq8l-VcIu5NkLdd1mQ":{"text":"Overpriced, run-of-the-mill food spot. Terrible music playing. I had the breakfast sandwic","useful":0,"cool":0},"CwdvuBwdg0aRSRiiqyiHsg":{"text":"My husband and I came upon this place as we were walking through the Quarter.  He ordered ","useful":0,"cool":0},"C49NR27ovAmHVOcy3ZOpXg":{"text":"Amazing food. Great service. \nCrawfish étouffée was amazing and the staff was quite helpfu","useful":1,"cool":0},"4hPZxkNI4ecHW_9Y9oclog":{"text":"Dinner, small plates, amazing value! Really blown away by the fact that my gf & I got so m","useful":1,"cool":0},"f9naKEgRcgjjzslKxLRBfg":{"text":"A great corner place. I had a trio. It was very delicious. The stuffed pepper is over the ","useful":1,"cool":0},"K8lu_fA7dWZCG3yDJIf0Sw":{"text":"Great food, nice casual atmosphere, very friendly staff. Will be back!  Short ribs were de","useful":1,"cool":0},"QhgkXGuZyH0kaR_k4kLOaA":{"text":"ummm...seriously patrick m, are you sure you actually ate at this restaurant???? i find al","useful":3,"cool":2},"Xg8lu1c76zBN3Is7wOzwlw":{"text":"This restaurant was very highly rated so my wife and I had to give it a try. No alcohol se","useful":0,"cool":0},"kHVhMEf0P-VCxskaat2lZg":{"text":"Cozy restaurant on the corner that feels a little like a converted ground-floor apartment ","useful":1,"cool":0},"b5S3aB4A2PFtdvgQRWhgXQ":{"text":"It's BYOB. Food blew us away. Best gumbo I've ever had. Tender pork loin and server was ba","useful":1,"cool":0},"3NKoBlMD6J-kcifExuACsQ":{"text":"\"A\" for effort - i like the concept and idea of using local ingredients and local flavors ","useful":1,"cool":0},"JAh4X5Fwy2N_tx8-0yVxRg":{"text":"This place was delicious. The guy at the Voodoo Historical Museum down the street recommen","useful":2,"cool":1},"RmJVpPieXs_qGLkUpBYRlQ":{"text":"The Cochon with mustard greens was wonderful! Everything else is \"meh\". The decor is awful","useful":0,"cool":0},"omlCnXmfSADPuIbWv1FPOQ":{"text":"Cute little cafe, reminds me of similar places back in California. It was recommended to m","useful":0,"cool":0},"G5b3CfeTHfepsMcMLFjacQ":{"text":"Brunch was amazing. Hidden gem. We each had something with pork in in. Delicious. Definite","useful":0,"cool":0},"GMQhAJgnbJnjjboY6H17Dg":{"text":"Yummy!  This place was a great find!!  We asked the waiter what to order and went with it.","useful":2,"cool":0},"JwKmGEu1q3g6PhjlSjRxAg":{"text":"They are keepin it simple at Eat, so I'll do the same:\n\nBYOB, Yay!\nCrawfish boulettes, Yum","useful":0,"cool":0},"CaV-QyEHXIqml5UJtfMf9g":{"text":"Came because of proximity to my hotel but was pleasantly surprised. Had their tomato bisqu","useful":0,"cool":0},"nXGwWFRxqtQ2dV2487hXzQ":{"text":"EAT takes Southern/Cajun food and makes it a bit upscale.  Everything was tasty, especiall","useful":0,"cool":0},"103Gh20zyWbmPtEhbulQ7g":{"text":"Great service from the time we walked in! Food was good ! BYOB if you like which we loved!","useful":1,"cool":0},"VTOCPzrNGKtA6sliQpLiEA":{"text":"Great little restaurant with well-executed, delicious food.  We had lots to sample -- frie","useful":1,"cool":1},"8m0Ibzn9Safi-xxLgHNolw":{"text":"Well lit, beautiful big window, casual dining with charming servers who were are well vers","useful":1,"cool":1},"rBVi5oyrhgxo4ffnPxf9yA":{"text":"I walked to the quarter on father's day with a couple of friends. We decided to stop for b","useful":0,"cool":0},"3m1UelHlmGcUJ39tK9E0fw":{"text":"Well....yes you can eat at EAT but you might wish you hadn't. The food is awful and the se","useful":0,"cool":0},"8UaMrX5PEFLUfaXysSEV6A":{"text":"This is probably the first restaurant I've eaten at in New Orleans where I've left satisfi","useful":4,"cool":1},"2OxUn_p012k0H4fjJxTjUw":{"text":"Had breakfast here.  It was excellent.  Started with the fried green tomato remoulade serv","useful":0,"cool":0},"Jaiaaag6keuy2zNYNl17-g":{"text":"super cute place on the corner.  Great service and amazing breakfast!  I loved the biscuit","useful":1,"cool":0},"9jukf8J0U0WDE642arj3cA":{"text":"Had the chicken and dumplings. Wife had the fried catfish. They were fantastic. If your lo","useful":0,"cool":0},"piHrRQnVxXytS2A6PecwPA":{"text":"Disappointing food and service; I had the trio- deviled eggs, ribs, macaroni and cheese, a","useful":0,"cool":0},"DjljYzwdQd8dbURv5yct6Q":{"text":"Forgot to BYOB, but the food ....what they had ...was def fanom. \nNot a whole lot of veget","useful":2,"cool":0},"eqvd1CgmIc5dwjHSs3VWTA":{"text":"Awesome!!! Everything we had to eat left nothing to be desired. Our server, Doug was funny","useful":3,"cool":0},"LRUE4NG1RvMQbwk6Ab53Kg":{"text":"Hands down, the best brunch we have had. Flavorful Chicory coffee along with Shrimp & Grit","useful":0,"cool":0},"7mmow_-OkPDtN_8F-gIyOw":{"text":"I've been here twice- once for brunch and once for dinner.  The first time, the brunch was","useful":0,"cool":0},"JZ78U_whODz_dCfKoRKvyA":{"text":"Great place. A street car named desire was written here.","useful":0,"cool":0},"EzqUPOfs2nFQymiDhaqjlA":{"text":"It was at EAT that we were introduced to the famous cochon. What is this beautiful piece o","useful":5,"cool":2},"8IEYo0JfVnSZmZvSKP7lOA":{"text":"Eat was really good went there after reading really positive reviews on yelp. The food was","useful":1,"cool":0},"DBYC-pMMfYtWqgXD1p4wlQ":{"text":"Thoroughly enjoyed breakfast of Eggs Provence. OMGosh it was delish. The eggs in the skill","useful":1,"cool":0},"3HPS1o53_g4W5ikcSMoprA":{"text":"Old review - from a visit in July 2011.\n\n3 stars based in food, service, and atmosphere.  ","useful":1,"cool":0},"GTXAoULkTiHl6pvItSzh1Q":{"text":"Delicious food in the heart of the French Quarter.  Cool, cozy vibe.  They don't serve boo","useful":1,"cool":0},"CElGksSoths55b97SXviyA":{"text":"Try the crawfish etouffee and bread pudding,  excellent!!! I was surprised that a New Orle","useful":1,"cool":0},"5RLbV2xQpM9izA-bkEEOjg":{"text":"Honestly, one of the best meals I've ever had. I destroyed the fried green tomatoes tomato","useful":2,"cool":0},"-HpZCcgAU4uRmqwYyy6Gdg":{"text":"We didn't get acknowledged at all. Walked out after finding our seats and waiting fifteen ","useful":0,"cool":0},"b-ZfEVixvlQDUs-qWZN4xw":{"text":"Great local food. We had brunch on Sunday and each had one of the specials. Service was in","useful":1,"cool":0},"jg2l1bH2dhkXRb5d8C72uw":{"text":"Wow... After reading some of the positive reviews along with some not so positive I destin","useful":2,"cool":6},"ONdfahAqD6elPNWEc3E1PA":{"text":"We stopped here for Saturday brunch and had a lovely meal. My husband's huevos rancheros w","useful":3,"cool":1},"5zDwAswOh7phl-qte_nfcg":{"text":"This is the first restaurant I ate at when I arrived in New Orleans and it was absolutely ","useful":1,"cool":0},"TYtQzluMMJP0ugn8oIHzJg":{"text":"Easily the best meal I had in New Orleans during my visit.  The side caesar was amazing an","useful":1,"cool":0},"3kHSehxlbZJE98MmlcA7Sw":{"text":"My oh my, what a find in the French Quarter! A couple of friends had previously stopped in","useful":0,"cool":0},"Meoht6A98CkrX4JPsf0PiQ":{"text":"Amazing food. Fried green tomatoes with remoulade sauce was perfect and flatiron steak coo","useful":0,"cool":0},"cIfZyKXM11nRm33JrGsPkA":{"text":"This is my first Yelp review, and I want to be enthusiastic and positive.  \n\nI'll start by","useful":2,"cool":0},"wJZ3vJAlJgwd7GOxmQyZXQ":{"text":"Love this spot and bring in out of town guests for a great brunch. They don't take reserva","useful":1,"cool":0},"eg7goaHGclyttGKMvpj-AQ":{"text":"Girl I want some creole!  Go to Eat!! This is a very VERY strong 4 star restaurant.  Def a","useful":0,"cool":0},"ainA2q6TKSz77yD4_-HP-A":{"text":"I really want to give this place five stars, but that would mean that I'm completely overl","useful":2,"cool":0},"0jqMe4DLGLkq5OAbCd2vTQ":{"text":"Eat is in a beautiful part of the French Quarter, tucked away from heavily touristy areas ","useful":1,"cool":0},"gpzG1ueIHidJdY5P6LLicA":{"text":"Had a great eggs dauphine here, with a tasty homemade biscuit. A little pricey for brunch.","useful":1,"cool":0},"zxIWl5KVExkyXxb6ukDWnw":{"text":"Chose this place because it was close to our hotel. Seated quickly. Nice atmosphere. The f","useful":1,"cool":0},"Oajf19YbxOw967m6TzHFCw":{"text":"This was a lucky gem of a gastronomic kind. The atmosphere and quality reminded me of a lo","useful":1,"cool":0},"u4JpxymSoJsa-DEnWXWG8Q":{"text":"I've been dying to try some creole/cajun food ever since I came in to the city.  This plac","useful":0,"cool":0},"2momJTRaPw4RfwBrZE3Fvg":{"text":"The meals are innovative and trendy.  I eat at this establishment 2-3 times every time I v","useful":1,"cool":0},"mipHQ6WzSQOqblDHt9foMQ":{"text":"Our first meal in New Orleans. It's BYOB with a corkage fee of course.  Intimate place tha","useful":0,"cool":0},"lgXd9FmPRi_pM78BB-BFyw":{"text":"Breakfast was fantastic! The biscuits definitely taste homemade. I had crab cakes topped w","useful":0,"cool":0},"-YE4L3C0-8GydROqvPNCNw":{"text":"One of the best places we ate at in NOLA. Went there for breakfast. Service was very frien","useful":0,"cool":0},"IfDe1KDRlSS5CR9Idfeb3Q":{"text":"This was our best meal in the US - and definitely the best value. We had the amazing half ","useful":1,"cool":0},"3kDBgPBe37TtTKQsQ7gYEg":{"text":"EAT's gumbo and jambalya are so very, very delicious!  EAT's service is so very, very frie","useful":1,"cool":0},"GseOGdtFLTxiPo4f8QvVzg":{"text":"Very nice place to have breakfast with others are alone. Atmosphere is good. Good recorded","useful":1,"cool":0},"Cg-bjk4Za_tcFuB-IUtwdw":{"text":"We went here for dinner on our last night in New Orleans and were excited by the good revi","useful":0,"cool":0},"7NpTIkN1LqqqBwvh61Tqkw":{"text":"This place is a hidden gem. My friends and I were in the area and looking to get a taste o","useful":0,"cool":0},"O5FoVIb-VMTXj4CmxJ_1KQ":{"text":"Our late lunch at Eat was great. The service was friendly, and we all really enjoyed the f","useful":1,"cool":0},"VoFwVOgVpKifBJ37LWBN4A":{"text":"We presented with a group of 7. We were seated much later than quoted. One of our two appe","useful":1,"cool":0},"KVA9527wXcJa53yimmt3kg":{"text":"The server was a nice guy, but the food wasn't very good. Overpriced (but not very expensi","useful":0,"cool":0},"kgL5Beo7a9e7jstQgo3ljw":{"text":"Awesome breakfast/brunch had the chicken fried chicken with eggs. Biscuits and jams are gr","useful":0,"cool":0},"_Jt2338y89duTpSp4guJCg":{"text":"This nice little restaurant needs to examine the quality of food served and revise the men","useful":0,"cool":0},"si9vBNnk8DmrJ9xNWXJo7w":{"text":"Delicious find in the French Quarter.  Great, simple fare, New Orleans style.  Much better","useful":1,"cool":0},"SJRVqAtWRwKocjKgjhKB-g":{"text":"This was one of the best restaurants I've been to during my trip to New Orleans. We had to","useful":2,"cool":1},"XPglhc9KQu4sxpAhqCy_tA":{"text":"Mimosas, crab cake dauphine and great service","useful":0,"cool":0},"-xm9K-5oONDd8zd4xcNA7Q":{"text":"This place is amazing!! I found it on Yelp and had a layover so crashed with family who wa","useful":0,"cool":0},"vUjtTFfHmszv8kZ8frl48Q":{"text":"Phenomenal comfort food- perfect if you're looking for a sample of Cajun/ Creole food.  Fr","useful":1,"cool":0},"ftHroYh34fkQZIGjQr_uAw":{"text":"Great place to go for brunch. Large portions and tasty specials! Wonderful service. Thanks","useful":0,"cool":0},"fs7MnlBKfheTuevIy0Mnbw":{"text":"This deli/small grocery does an amazing sandwich. The guy behind the deli was very helpful","useful":1,"cool":0},"qI18Me6nylR4zAyoFUzURw":{"text":"This is definitely a hidden gem. I found this place the night before returning home which ","useful":0,"cool":0},"yhG-iCsJX5vzM71DPdj36g":{"text":"If you're ever in the French Quarter Eat New Orleans is a treat. Using local produce they ","useful":0,"cool":0},"2zbPZxZPzG8c6_hD9pQ_JQ":{"text":"Made a reservation here and was excited to try it based on previous yelp reviews. I'm not ","useful":2,"cool":0},"oeU_Fw7K2higv08dD_D-qg":{"text":"Came here late after our flight came in and it was delicious! It wasn't too crowded so we ","useful":1,"cool":0},"-oYHtOBpDob8RhHKFgxo5A":{"text":"We had lunch here on a weekday afternoon.  The server might have been new; he seemed very ","useful":0,"cool":0},"dciufpRVFk5KB365DV1Jyw":{"text":"Eat is a very good brunch spot in the Quarter.  Expect a wait for weekend brunch and bring","useful":1,"cool":0},"7Zj9sBNSyxUFOCnm0tUrAw":{"text":"One of our favorite New Orleans restaurants. Many things on the menu to choose from and ab","useful":0,"cool":0},"fjj38LSBhyg5UAGFOtMx6w":{"text":"So we found this place on Yelp and saw it was literally a block from our hotel St Pierre. ","useful":3,"cool":4},"z_bid4KZALdT0LfcDBI_AQ":{"text":"Found this place while wandering through the Quarter last week. The menu has quite the var","useful":1,"cool":0},"Dvm7W7fiN1H1Pi6ciKpX0Q":{"text":"Absolutely delicious Shrimp & Grits w/added poached egg. Also recommend the chicken fried ","useful":0,"cool":0},"SdiBGlHAGKPuc_3WqcdAqg":{"text":"Came here for brunch a few Sundays ago.  Had the Otis special omelet with Cajun shrimp and","useful":3,"cool":1},"PUWoiy0Mhc5sqpJTqQZMuw":{"text":"Was not disappointed! So good, great service, and I had the best BLT I have had in a long ","useful":1,"cool":0},"4OfhAsDG8WlMTsuBq8ckWg":{"text":"Unique flavors that combine to an excellent idea. A BYOB Restaurant in the French Quarter.","useful":0,"cool":0},"MiT70H0iZIV21YOjQVszXQ":{"text":"\"Sorry we're open\" \n\nThis is long overdue as we dined here in December...but this was our ","useful":2,"cool":0},"ebxTPALD9GFj705wUmY3mw":{"text":"This place is a bargain and a half with some pretty good food to boot.\n\nFirst of all, they","useful":4,"cool":2},"eYg9zx4JWAJi32WPvVDYgw":{"text":"Food selection was good. Fried Chicken like no other. Catfish can't go wrong. And the Mac ","useful":1,"cool":0},"C8PKw0t-Sa_oybzylqB-NA":{"text":"So not happy with this place. I can't fault the food because it was fine (but just fine, n","useful":0,"cool":0},"Wn6AYWH5L2TBP41Aq0MFpg":{"text":"Don't \"think\" about going to eat at Eat. Just do it. You will not regret.\n\nSome buddies an","useful":4,"cool":0},"-F3R881c7qCH-tQmbMFa0g":{"text":"We checked this place out for brunch while vacationing.  This was my second time visiting,","useful":2,"cool":1},"tVhdVx8Li7nqk701VdK9uw":{"text":"Great food. Totally tasty! Good service and neat environment. Ideal place for brunch. Orde","useful":0,"cool":0},"LzO5e_5e_qkE0K0DnLiFWg":{"text":"This place was the best first stop for our first trip to N'awlens. We Yelped it for dinner","useful":3,"cool":0},"0KxazBiOT6nNZ3S-7LdYBg":{"text":"This was our first meal in NOLA and it did not disappoint. We had to wait a bit as reserva","useful":0,"cool":0},"Yh0ZTjidFz4Bi4VjLRRnZA":{"text":"came with my bachelorette party over the weekend. table of 12 but they split us up into 2 ","useful":0,"cool":0},"ORc0lJ6hvc1xZZEPAe3H7g":{"text":"Kenny, our server/tour guide/go-to answer man, was great. The space was adorable and fresh","useful":1,"cool":0},"uJdmqAJa_gq2A1fQsJgplg":{"text":"I wish I could say I enjoyed the good food I'd heard so much about, but we were never serv","useful":0,"cool":0},"XHExwgP9iC1wOjXttfiUmA":{"text":"Well the food was good, service couldn't be bothered. Miss Thing pursed her lips and her m","useful":0,"cool":0},"T4-_wYML82R5byWz4hqMIQ":{"text":"There was confusion on my wife's lunch order and the waiter brought 2 orders of the softsh","useful":0,"cool":0},"1Gxmd_wkAH0Om92vScnfZA":{"text":"The chicken and dumplings was savory and very filling! The chicken was moist and the dumpl","useful":1,"cool":0},"G1bXlyA5WSlonBRcUushuQ":{"text":"Good, solid, and unpretentious, my dinner at Eat was delicious.\n\nThey encourage BYOB, I op","useful":0,"cool":0},"1aZ_TrvrqsrzaplWJ9n9kQ":{"text":"Our new favorite place to eat in the Quarter.  Great food at a good price.  Great service ","useful":1,"cool":0},"kg1gjttHlK-IIiEXXp7aXg":{"text":"Ate here 1st night in Nola & it was outstanding. Great food, service & ambiance. They do n","useful":1,"cool":0},"FsZWwtHMOHCRP7qmwAiM4Q":{"text":"Went to this place after a long night.  I ordered the fried green tomatoes with ham and po","useful":0,"cool":0},"UPML7dnXcnT9okBkrN2tJQ":{"text":"This is the first spot I stopped for brunch since I got to New Orleans, and needless to sa","useful":1,"cool":0},"xwx1CWcZV7WkRc8wpxYf7g":{"text":"This place was almost like an oasis. It's a very modern, southern style café. I would call","useful":3,"cool":1},"IT7D8smz80Q7jd-e-9Xo2A":{"text":"I was disappointed with my dinner tonight! I was recommended by a resident from New Orlean","useful":0,"cool":0},"O_QF2Cv2UP3dUwc_5rliBg":{"text":"Ate here over Christmas weekend and was not disappointed.  Crawfish pie was excellent.  On","useful":1,"cool":3},"ddkIZUU7DqJvDvH4-81oxQ":{"text":"I was in New Orleans for two nights only in July of 2015. My boyfriend and I stumbled acro","useful":1,"cool":0},"CPdCIbIUrRz4BGEn9b-l5Q":{"text":"Really good. I had the ribs, they were moist and the sauce had a little kick. Husband had ","useful":0,"cool":0},"H7sItZe_SmvjWY7CceVmKA":{"text":"We had an amazing dinner here on our first night at New Orleans.  No other place beat the ","useful":1,"cool":0},"rWX1vBynCYUtzRSI3Kzqbg":{"text":"We never miss this restaurant during our vacation in New Orleans.  During our Halloween we","useful":0,"cool":0},"JB1XeKje73rLSerbuAxdAw":{"text":"Average food, lousy service, and overpriced (for what it is).  Don't understand how it's r","useful":0,"cool":0},"nVwrVIsYei-ZinQvR61QOw":{"text":"I wouldn't talk anyone out of going here.  I wouldn't recommend it though.  I didn't find ","useful":1,"cool":0},"wawxuTrFdqchoG7e38SXOw":{"text":"I really love this place.  Last time I was in town it was really busy and never got to go,","useful":0,"cool":0},"o1U6A7qaz_CmJ9lHvIGYKQ":{"text":"Great local place for breakfast. Fresh ingredients, reasonable prices. Great service. Try ","useful":0,"cool":0},"F7nB7yPLbM5d-TddwZhyVQ":{"text":"Love, love the la beans with shrimp!!  The stuffed bell pepper was so meaty and delicious.","useful":0,"cool":0},"TLLi9ynmC6iF41_s0Ds-ng":{"text":"Great brunch!  The staff is so friendly and made great recommendations.  Crawfish boulllet","useful":0,"cool":0},"i324pCr55LecGNIhuMKAuQ":{"text":"We woke up on day 2 of the Staycation forcing Powerade and 5 hour energy down our throats.","useful":2,"cool":1},"P30vDY-UomGeFrfyn2-qCg":{"text":"Eat was amazing.  It had a nice homey atmosphere and the people who worked there were very","useful":0,"cool":0},"V6jAwUTWPNrmzFOMsQkPIw":{"text":"You're not on Bourbon St. anymore. Relax, enjoy the atmosphere and food, and BYOB if you w","useful":1,"cool":0},"BsdBA5rafQuaQr-slIzQUg":{"text":"Based on yelp we walked forever to get to this place.  Food was good, but they were out of","useful":0,"cool":0},"PBMzZeEvrt7Sp0xBtjlnkg":{"text":"Food is important. So is service. Horrible service and overpriced food served with pretens","useful":1,"cool":0},"ktYwFoyFDnrdxglY99q4Tg":{"text":"This place screams brunch!  From the hardwood floors, the green and pale blue color scheme","useful":3,"cool":2},"J3LLkaoHvV2dCdGK-OP4fQ":{"text":"Ate brunch today at Eat. Wow! Pulled pork bread pudding was delicious. My sister has the M","useful":2,"cool":1},"FSB6Z86UY_IOaF64JlCDsQ":{"text":"This BYOB treasure is a must!  The wait staff was friendly and helpful.  We started with t","useful":0,"cool":0},"l9yFQuVDwSea08JTNKWkrA":{"text":"No words can describe the amazing flavors!! \nMust have the Watermelon gazpacho!! It's to d","useful":0,"cool":0},"hZ8i1ZRO5Efh8ra8tVwBqw":{"text":"Tasty,, Tasty... My second time back and not to disappoint. Always fresh, innovative dishe","useful":1,"cool":0},"ezJMt7X1wT9Mi79rmBVlUA":{"text":"Okay as a restaurant general manager I do not usually leave reviews unless they are good. ","useful":1,"cool":0},"3vTG8zAiImZSB0OQCdo0qA":{"text":"This place is so delcious and enjoyable that I have to leave no serious details.  Great fo","useful":1,"cool":0},"slhtI8emHSBE528gOob8Ig":{"text":"I am a \"brunch lover\". After days researching brunches on Yelp- I found EAT. This is what ","useful":1,"cool":1},"j3ST7cOaR4iCBjeS89ZnHw":{"text":"I decided to go here for a late dinner, trying to avoid all the fuss of Bourbon St and was","useful":4,"cool":0},"8Ov6HTQ7YTGIGWlPDi9oAw":{"text":"The brunch is great.  Original and fun dishes. Eggs Delphine were special treat. Only drag","useful":0,"cool":0},"sfktYeLNnbrDd8MD-06ziA":{"text":"The place was hopping at brunch time, but after a short wait, we got a table for two.  Thi","useful":1,"cool":0},"P0l9cpgWafrFhNLromChCg":{"text":"My wife and I took a trip down to New Orleans for a bowl game and we decided to try and av","useful":1,"cool":0},"wEy1QeVVj42im3AzzX33Xg":{"text":"You can't really go wrong at EAT.  It has a nice, casual atmosphere.  We tried the crawfis","useful":1,"cool":0},"lXYF7qz58uz3GdlZjPrO6A":{"text":"We had a wonderful meal at EAT! All the courses were prepared perfectly and the staff were","useful":1,"cool":0},"u3E3zc53wjONc5mC5H5bYA":{"text":"This place had great traditional food and was located in a cute and calm area of town. How","useful":0,"cool":0},"zqnxZ8Tu-isjy0E6LM4IFg":{"text":"Really awesome food and service. We had the cochon with mustard greens with a side of mac ","useful":1,"cool":0},"zYqSmaudrRrwa61AIyR1hw":{"text":"Food was just alright, not something I would go out of my way for and there are more flavo","useful":1,"cool":0},"i4lOkNdfmDdj9PQBFaPPAQ":{"text":"22 Jul 2014, 11:45a\n\nHubby and I were staying on St. Ann and didn't want to walk far for l","useful":0,"cool":0},"ozuWI8Z11KclLkdPh9OhSA":{"text":"Food: 2 stars\nService: 3 stars\nAmbiance: 4 stars (romantic, practically all yuppy couples)","useful":1,"cool":0},"Lspvgj79ny-zlpfpUr5LKQ":{"text":"Amazing food.  The lemon curd pancakes are the bom.   The service was great.  The banana f","useful":1,"cool":0},"KDZvUH6ivXW0aRHNnRQtBw":{"text":"Really good breakfast. The regular menu is inventive and quite delicious. Specials are equ","useful":1,"cool":0},"_d29Bf9h6BtMibfWYuKvGg":{"text":"After much deliberating and researching on Yelp and Trip Advisor, I finally decided EAT wo","useful":2,"cool":2},"xAIXal-8KGNeyTNvRhQYKw":{"text":"The best! My favorite place to eat.\n\nIn this city of culinary delights, it's hard to find ","useful":3,"cool":1},"eB1gy95glQdvga4UR8ZF5g":{"text":"*** EAT has definitely gotta Southern charm going on. ***\n\nIts menu items are cleverly con","useful":9,"cool":9},"40GozaSh7sdLoEZn9gUKsg":{"text":"The food was very tasty but we were sitting below a pipe that was leaking on us. I mention","useful":1,"cool":0},"C3ezOERi0cgr4Nv_JmnlBg":{"text":"This place loses a star for making me pretty damn sick the rest of the day. However, the c","useful":1,"cool":0},"rOhFKyy8V1hH478daJbjpg":{"text":"Best fried green tomato remoulade and red beans and rice ever!!","useful":0,"cool":1},"AxrsZ3PkV240RvgmFCprLA":{"text":"My bf and I stumbled on this place while taking the ghost tour. Discovering this place was","useful":2,"cool":1},"t4aRVt7M8sLU6iPUMySyqQ":{"text":"surprisingly good little place in the french quarter.\nwe made our way here after failing t","useful":0,"cool":0},"VOcLGFTEOXUk_JfzGh11aw":{"text":"Wish I could love this place, cute, convenient and smells amazing.  It's byob which is ok ","useful":0,"cool":0},"8GszQaX2wS8rCg8ltkns9A":{"text":"So, in most of the world, a small group can get away without a reservation, but not here, ","useful":0,"cool":0},"crkFn7rr5WRZT_qbsApTnw":{"text":"Really excellent, down-home menu options! I couldn't decide between the stuffed pepper wit","useful":2,"cool":0},"fLCD4xiRoDET_AJ6pYHyNg":{"text":"Eat. So simple. That is just what we did. \n\nIn town for a conference, we were given this s","useful":4,"cool":0},"jXhjIWGno6kE13SNuX7iJw":{"text":"Enjoyed the combination of casual and classy. The fried catfish was perfectly prepared and","useful":1,"cool":0},"QXufW6tVhh0AqJc6kE-4-w":{"text":"Incredible southern cooking! Mama's Meat Loaf is my new favorite (don't tell my mom) ... A","useful":0,"cool":0},"D-TlAj7j-9B0r7Cssjao4A":{"text":"We had a great seat next to one of the big windows along the street, so we could look at t","useful":1,"cool":0},"y2gJlnDlgio8DFW_3Ck0iQ":{"text":"The fried catfish is the best I've ever had. Great service, a total joy of a restaurant","useful":0,"cool":0},"t5da4M3QQCjskCYn6JT8Cw":{"text":"I think this restaurant should actually be 3.5 stars but I rounded up because the staff wa","useful":1,"cool":1},"gZnFs_GkTG658jX-6A9krg":{"text":"I probably would have given 3 or 4 stars, but our waiter was a little off-putting. This is","useful":4,"cool":2},"1901Wgy4BvDT36P3OYFnFA":{"text":"Off the beaten path in the Quarter, but easy to walk to. This is a true gem. Small, intima","useful":2,"cool":0},"XXgcBKeqZLiOskXvKoFfSw":{"text":"Went here Sunday - unfortunately didn't get a chance to go back!\n\nWoohoo as good as last t","useful":1,"cool":0},"6yInLs0YumXsPFTQCc-P7g":{"text":"Let me start by saying, it may be worth your while to make reservations. The way they mana","useful":1,"cool":0},"yPKTAT6I1aQjLETuh5KFhg":{"text":"The hospitality here is remarkable. Such sweet guys serving up really amazing food! Brent ","useful":2,"cool":0},"n-6G6bioCF0nWev75TJ8_g":{"text":"Stopped in for lunch had the gumbo and shrimp po' boy, it was great! They don't serve alco","useful":0,"cool":0},"I_eqAALN_u-jEe0YwWYJkw":{"text":"Had fried shrimp omelet from their Sunday brunch menu and it was delicious. No kids menu a","useful":0,"cool":0},"Ur4iaWixC4HSi21OAkiyTQ":{"text":"Came in this cute little restaurant on a Thursday night and were seated right away.  \nAs I","useful":1,"cool":0},"EmiwwxDQluKELByYNsvkEQ":{"text":"Ate dinner here recently based on the good reviews. We didn't have a reservation and waite","useful":1,"cool":0},"-c7B5P-fvenNTEtUh5nfIg":{"text":"Very mediocre - not impressed. Even easy dishes like fried catfish were way off the mark. ","useful":0,"cool":0},"fMOfwQV-w6QkJ0rxV3EMSg":{"text":"This French Quarter restaurant is great for breakfast.  This tiny place has a charming sim","useful":0,"cool":0},"27WG2xjjfOJBnY_RDoplGg":{"text":"We stumbled upon this place and are very glad we did.  They had the best shrimp and crab a","useful":1,"cool":1},"BtHs80BfZchbpWSG_KnYEQ":{"text":"Came for dinner this week and I loved my dinner. My boyfriend was disappointed however cit","useful":1,"cool":0},"8zT18ljUnTxmwf31umie6Q":{"text":"Love this place.  Perfect food, causal environment.  Its relaxed and delicious. It is BYOB","useful":1,"cool":0},"dkKArkZ9H_c6J2KJPpbUIg":{"text":"At first glance this place looks a little too fancy for my tastes, but it is actually pret","useful":0,"cool":1},"MRhUeYywmTaDKx_VtQ4Qzg":{"text":"Looks ok but they were noted for Mac and cheese, got here only to find that it's only serv","useful":0,"cool":0},"_lxN1jrGfL385dLXnVBvuw":{"text":"Amazing! I'm from the south and lived 3 years in Portland (the foodie city) and this was t","useful":2,"cool":0},"5AXHAWvw9thltyckKIcVLg":{"text":"Layout and decor of restaurant is nice, and on a cold, rainy night, their fireplace was cl","useful":0,"cool":0},"D-ZVfx_JY-Jp68pGYZknSQ":{"text":"Food was fantastic. Had the eggs dumaine and wife had big breakfast. Both were very delici","useful":1,"cool":0},"BPgo5-5S8vMT45Ef21XFDQ":{"text":"Arrived  for Sunday brunch, had the eggs cochon, amazing. Terrific local atmosphere and gr","useful":1,"cool":0},"dcJ0rriHjzVK67shgmsyew":{"text":"After running some late afternoon errands and having time to kill before an early concert,","useful":2,"cool":2},"3ccR_TtGWgd419o38H0OAA":{"text":"I love this place I go every time I come home  to see my family I wish they had a place li","useful":1,"cool":0},"6SDXdl8kVxKvTIrqbO17cw":{"text":"Great little restaurant with a homey feel.  The service was very friendly and helpful.  BY","useful":1,"cool":0},"DEGpFrJPqXGguPWXFPHKyg":{"text":"Splendid!! 2/2 on an excellent visit! The peach pancakes were amazing! The crab cake egg B","useful":0,"cool":0},"4nlwwmV6Q-Acf1inf0HTag":{"text":"Just ate at Eat New Orleans and it was delicious!  We had a herbed pork chop with roasted ","useful":1,"cool":0},"woEFgOxDSJjOc3mftR77Jg":{"text":"\"Wonderful little place with delicious New Orleans fare. Loved the service and the quiet a","useful":1,"cool":0},"1KFyaC5FsrlbGPPe-D-_Xw":{"text":"Interesting menu with some great new combinations - will defiantly try pulled pork with eg","useful":1,"cool":0},"k0ku3ijhx4HdGKXfzAnWXQ":{"text":"Excellent services and pretty good food.  Our waiter, Nick, was awesome, helpful and very ","useful":1,"cool":0},"Xlv1u_OEV_H9p7mLGvrTlQ":{"text":"We went to EAT for lunch today. I was excited to try the crawfish pie, but unfortunately t","useful":2,"cool":1},"7oxQVGFK7qZJWrhQ4qBTNA":{"text":"Service was pretty good, we were able\nto get a seat quickly on a night a Mardi Gras parade","useful":0,"cool":0},"-anJ36o9pomJUsrbInh4FQ":{"text":"I was pretty excited to eat here, after checking out the menu before hand. It certainly ha","useful":5,"cool":0},"TIM1neirx-D4wcawWyIGlA":{"text":"This was the best dinner I had in New Orleans, all three times I've visited for work and l","useful":6,"cool":0},"YBeNhmqNZSgHiyMWxXL-Xg":{"text":"I loved getting to walk here from my hotel! I came here for dinner on a weeknight and got ","useful":1,"cool":0},"hRLk4RQnurA44WuTjeHqnA":{"text":"This was simply the BEST meal I had in New Orleans. Period.\n\nI came for breakfast on an ea","useful":1,"cool":1},"iel4l-dJ9WvTGB9Iidgs9w":{"text":"This place was amazing!! It was a very nice change of pace from all of the standard fried ","useful":1,"cool":0},"uIb5LoSqLqQLbWIPDcAv4w":{"text":"Amazing place.  I should have stopped in here more on my last trip.  Food was outstanding ","useful":3,"cool":2},"YH2myclPCSl27W2FEpT7RQ":{"text":"This place has really incredible creole soul food. Located on the edge of the Quarter it's","useful":2,"cool":1},"YdUTDZ4y5Fd6F-HvkscSFg":{"text":"Absolutely delicious. Our only complaint is they weren't open for dinner on Sunday :)  Lov","useful":0,"cool":0},"J1MCk3t1sfdhHiT92u86Rw":{"text":"Southern comfort food - fresh and simple.\n\nI tried the Trio on a weekday lunch- starts wit","useful":1,"cool":0},"X0JVwUnI4ps3qS9YxDcVZQ":{"text":"This is the best breakfast I ever had in New Orleans. This is a must try place.  I would g","useful":0,"cool":0},"Bla81M0P7IyFu6y_9P2VRA":{"text":"Super!!! Essen perfekt! Eigener Wein kann mitgebracht werden, 1. Flasche for free, 2. Flas","useful":0,"cool":0},"5AtC0B5loQrLLPCqOVPBug":{"text":"I got more than what I expected. My mom and I were provided with open seating and greeted ","useful":1,"cool":0},"GiefXo1i4moBUQBGe7tGUg":{"text":"Awesome brunch! Highly recommend this place for some great eggs, grits, bacon, biscuits, e","useful":0,"cool":0},"uRnaiVjhyn2Paolj_G0ITA":{"text":"Excellent value in the French Quarter! Original cuisine, tasty food and friendly staff. Br","useful":1,"cool":0},"mzOOfE3ackOUH67hvadMfQ":{"text":"I came in with a small group of friends, largely because of the number of positive Yelp re","useful":0,"cool":0},"B3J2o6WW2NtBAOBuEHvVbQ":{"text":"This is a small restaurant in the French Quarter a couple of blocks from Bourbon Street. I","useful":0,"cool":0},"ZUEKbVT_q0W-GAQSdQLYhQ":{"text":"I was in NOLA last week and went to Yelp seeking a good local option for dinner with frien","useful":2,"cool":1},"42RFddswwyBEL1euA8nnkA":{"text":"We really liked this place. It was small and intimate. The food was wonderful. It is a nic","useful":0,"cool":0},"5Gna1-Jg2bxK-f-8WWGGIQ":{"text":"I was really happy to have found this places, as it didn't feel touristy or cheesy, but se","useful":1,"cool":0},"GdGtx3USbGjL-OesVTfZwg":{"text":"I'm giving 3 stars dispite my lack of enthusiasm for this place, because the food wasn't b","useful":3,"cool":0},"EWcOlX2J9nZ6FRZR8hng1Q":{"text":"Pretty good.  Everything was fried.  Crawfish boullete and the coconut cake were the highl","useful":0,"cool":0},"CsKQHrxo0smdzUmXJlE7xA":{"text":"Another trip to New Orleans meant another dinner at Eat. Once again, it was exceptional. D","useful":1,"cool":0},"iYIhq8q3xTtQTW3wCsKRxg":{"text":"Fried green tomato plus conchon (fancy French word for pork). Hubby had the blackened catf","useful":1,"cool":0},"MxY8FXdVTaz2_d4OSVK6Bg":{"text":"Good fresh food, reasonable prices, and you can BYOB without a corkage fee.We had the Gril","useful":0,"cool":0},"Ya4MexrCO0XiTWsy6qFtVQ":{"text":"This place is fire. My friends and I hit it up the morning after a long mardi gras night a","useful":2,"cool":1},"IUW_TZWkI2Ot1YeYRH3OBA":{"text":"Eggs Dauphine, spicy deviled eggs with smoked salmon and crawfish boullet's!!  For brunch,","useful":1,"cool":0},"ryhLcNplU4x27Z04zhJMKw":{"text":"Delicious!!! Had brunch here, but also would have liked to have dinner. Everything was fre","useful":1,"cool":0},"M2K9unfIPF0ZKHtEb8PAGQ":{"text":"Food was good not great. Great service, great environment. \n\nIts BYOB, but they do have a ","useful":1,"cool":0},"ylAGNfRoSFKazaDq0HZB8Q":{"text":"What a wonderful restaurant!!! We had a great experience!! Food was delicious, service was","useful":0,"cool":0},"FBKNXGJcp4yq0xJQtMPZLg":{"text":"This place should not be called 'Eat', it should be called 'Drink' as that is what you wil","useful":1,"cool":0},"n5m8OGqHPARPedAjLLpu7Q":{"text":"We popped in here for breakfast Saturday morning. It is a laid back, small place a bit rem","useful":1,"cool":0},"134vgoe0J774bGSrVgBq2Q":{"text":"Poor service.  There were several tables open and I was told there was an hour wait.  To m","useful":1,"cool":0},"VrtZf64NYfuKJL_sPK0XJQ":{"text":"My party of four went here for dinner last night and had a great time. The atmosphere was ","useful":0,"cool":0},"w5jBgt4FQXBSxb4xhbTpYQ":{"text":"Dined here with a party of 6 and we were accomodated easily, which surprised us considerin","useful":0,"cool":0},"NSvII3DDGsp3iaEHAU2tuw":{"text":"This is a fantastic little hidden gem a few blocks off busy Bourbon street. Everything we ","useful":0,"cool":0},"3auWZzu_VlFlJkWDdCp3Xw":{"text":"Stupendous! The smashed potatoes were to die for! The atmosphere was trendy, but tolerant ","useful":0,"cool":0},"0cknxhokbkxN5GpbXfREkg":{"text":"Small, quiet locals restaurant​ on quiet side street off raucus Bourbon Street.  Friendly ","useful":0,"cool":0},"AQCo3glKtb07I5g-PuqZoQ":{"text":"We went here after reading all of the raving reviews only to find that the only thing good","useful":0,"cool":0},"mwoVO103yw5gjpBbK_SJNA":{"text":"What a fabulous restaurant. It takes awhile to get the food, but you can bring your own dr","useful":1,"cool":0},"rO-R291CMKIfpiaIuqsJPg":{"text":"Randomly found this place whilst walking home. Solid food, great atmosphere but a bit slow","useful":0,"cool":0},"lRQ8UC9BXddWbi6HEZCMYw":{"text":"I had the cochon.  It came with mustard greens, a side (I chose butter beans and shrimp, w","useful":1,"cool":0},"JJYjDqeuVwrrya6MN7_TWw":{"text":"Awesome for brunch! Outstanding menu! Fried Green Tomato breakfast is highly recommended! ","useful":1,"cool":0},"wFvQ3Cv9KFPK27wF4emvdQ":{"text":"I went here for brunch on Sunday after reading many recommendations.  A fairly long wait, ","useful":0,"cool":2},"LhMi65UJj3ju2Fvqi9RZGQ":{"text":"I went to several places over the course of 4 nights in NOLA, having entrees ranging from ","useful":1,"cool":0},"2ixeuYJ-Zj6NHao6FzOAHA":{"text":"Nice, quiet spot.  BYOB, but there is a wine store around the corner.  The wait staff was ","useful":0,"cool":0},"Ew3pT6UFW1s4LAlYNOwpLA":{"text":"Service was very good. Our waiters were very friendly and quick with the coffee refills. T","useful":1,"cool":0},"9VF0iMvdE97ivjMHEqXNKw":{"text":"The only thing that kept me from giving EAT 5 stars is that right now the restaurant is BY","useful":2,"cool":1},"noBj04r-gwts3jz8QnCyYA":{"text":"This was BY FAR the best dinner we had in New Orleans.\n\nThe place is cute and it's byob, w","useful":2,"cool":0},"O6Nnb_Ac2Ky2ivhTPP1N5g":{"text":"Fantastic! Ate here for dinner and then came back for brunch. Everything our family of 4 o","useful":1,"cool":0},"mg1X-rTDdQ4KyWX8H00UDQ":{"text":"Eric and I went with a group of people and it was a delightful experience. We all shared j","useful":2,"cool":1},"wGNjgNj0VxE3exRkPXShzQ":{"text":"Stopped in here for a late lunch with a friend last week.\n\nIt is a really cute place. It's","useful":6,"cool":1},"-ClUCNwpKYaHugnG1p9i8w":{"text":"Happened upon this place as we were bimbling around and stopped in for a very good lunch..","useful":2,"cool":1},"KODSO47M04qrdJbpCAI4og":{"text":"Love this place! It's on a quiet corner , BYOB, with the best range of starter plates that","useful":1,"cool":0},"atgmFD6L2FOQP26EyyukYA":{"text":"This restaurant is nestled in New Orleans and is a type of soul food fusion place. My boyf","useful":1,"cool":0},"ZLjazxLlhYDxla3JdfVyFg":{"text":"I think this was the BEST breakfast I've ever had. Wow!\n\nThe Boudin Balls, smashed, with a","useful":0,"cool":0},"2htQarPzGivZD3p96cBzFA":{"text":"Ok.  I had to go back again this year and this this my favorite place for brunch.  The Cra","useful":0,"cool":0},"mcXfI4luG_FH_9SfhsQn5A":{"text":"Dinner in the quarter! We wanted yummy and satisfying food and we wanted to experience as ","useful":0,"cool":0},"Sb1FoZL_FZtL2jdeRYD9OA":{"text":"As simplistic as it gets New Orleans fare that truly rocks.  The decor is very streamlined","useful":1,"cool":1},"3rjUDO_Y6N4nrkcB-3Zb2w":{"text":"We came for a Friday brunch. We walked in and thought we entered through the wrong entranc","useful":1,"cool":0},"4RkNjC5sKL67vr1M4Oxv8w":{"text":"Crawfish pie was incredible. Almost like a casserole - perfectly seasoned. Fried green tom","useful":1,"cool":0},"dFUOvR1vDhrsvpt9qKzAig":{"text":"I never even knew what a grit was until I ordered them at this place and man, do i love th","useful":0,"cool":0},"B1lY3Rcv1mTihxliyjNQCA":{"text":"The entire atmosphere is a world away from the good natured debauchery of bourbon street. ","useful":2,"cool":0},"BJuY-Kj6RoUuEv91A6f9Qw":{"text":"We had fried chicken and shrimp/crab fettuccine. Big portions. Just the comfort food we we","useful":0,"cool":0},"pb8MofILxVDY80ZfrITNow":{"text":"Loved this charming farm to table Cajun restaurant. Loved the quality and freshness in the","useful":2,"cool":0},"i8QIz_jY9oXwXfefSbxGPw":{"text":"Saturday morning breakfast was really good.  We wife ordered the Eggs de Provence and had ","useful":1,"cool":0},"kCzN8jwg4IhrUl1r99YyrA":{"text":"Our first dinner in New Orleans. good service and nice ambience but it was freezing cold. ","useful":1,"cool":0},"_1nlGSnlm8QaWetRjNVmFw":{"text":"After reading Yelp reviews, I added Eat to our short list for brunch while in the Quarter.","useful":1,"cool":0},"9fO2oNuebCF9wwb9BJExvw":{"text":"Walked in close to end of lunch time. A cozy cafe at the corner. Seating was cozy.  Ordere","useful":1,"cool":0},"V0vnOEAH_liQ6EvJ9Kh2ww":{"text":"This place is great! The prices are fair and it's BYOB. I had the chicken and dumplings an","useful":0,"cool":0},"w6ieZ5Ef2IceMXHhKWihYQ":{"text":"When I came back to NOLA for the Rock n Roll New Orleans half, I knew this was one of the ","useful":1,"cool":0},"Han-PIW83qsyd1VhQy4WGw":{"text":"I'm not much of a brunch person, but I always feel lucky when I get to the Quarter for an ","useful":1,"cool":0},"OtCK1aFzdYfltEMILE-VOw":{"text":"Love the way food is approached here but have to say don't mess with biscuits and gravy!  ","useful":1,"cool":0},"Oh9bVJGABWiHB1UmROOWvA":{"text":"The best brunch I've had in a long time.  My only complaint is that their weekend brunch m","useful":0,"cool":0},"ZOElU5EG1aaVFLqs4EFmyw":{"text":"We were looking for a classic Southern breakfast, and Eat New Orleans was perfect - except","useful":0,"cool":0},"vyJbxK-N-9egDCBV3Z-Hpg":{"text":"My wife and I came for dinner on a Saturday night without reservations, but the place fill","useful":1,"cool":1},"kJjnnKw0kIhTIWiyqHJQiQ":{"text":"Our first trip to New Orleans.  Decided to scan the French Quarter for a location close to","useful":0,"cool":0},"irvKJe74Eo5wrnhZwOzXBg":{"text":"So it's BYOB- go get the best Bloody Mary down the street first at Good Friends (St Ann an","useful":0,"cool":0},"AiwJzpm-RaKhoeKvDYKyqA":{"text":"Eat was highly recommended to us. While our breakfast was delicious, service was terrible.","useful":0,"cool":0},"zWUzaci1u1CT3JAW-RnQxw":{"text":"Very nice location in the french quarter! Inside is very well curated in New Orleans kind ","useful":1,"cool":0},"i3qHRmKwTuo8H3lrEy3iYw":{"text":"We stopped into EAT for lunch on our first day in NOLA. The space is modern and sparsely d","useful":2,"cool":0},"eAsdC7ymB3-UMwPuHpxLpQ":{"text":"I had one of the best brunches here this morning.  The food here is outstanding, thoughtfu","useful":8,"cool":3},"xcHPCuV3zFbcjxA1c9xIvQ":{"text":"Wow what an amazing brunch in the French quarter a real local place doing some amazing thi","useful":1,"cool":0},"sf379ycYzenLf7Utm68EXQ":{"text":"Oh hell yes!! Just... Just off the tourist track. This is the place for carefully made sou","useful":1,"cool":0},"pW-KcWPLlqPIMKVJPOUO_Q":{"text":"Decided to come to this restaurant out of the clear blue. I wanted to eat New Orleans, wit","useful":0,"cool":0},"52qyAY6iTOdd8ORP46dN6w":{"text":"Great food. Prices are reasonable. They let you bring your own alcohol and the first openi","useful":1,"cool":0},"2NIFCTjuAhMH58f0wJCKRA":{"text":"Well, another good little place for just walking by. 2 meals. Wife got the pork benedicts ","useful":0,"cool":0},"zVpC7l6Xn12r8tjAOYtQXA":{"text":"After taking a historical walking tour we decided that EAT was our place for brunch. There","useful":1,"cool":0},"94nWdAECCrZjGaWvsegatA":{"text":"Loved it!  So glad that we tried this restaurant.  To start, we were greeted immediately a","useful":3,"cool":0},"zyn9NjqJwPQo1KfRus7DoQ":{"text":"Both my wife and I were a fan of this place. I had the Trio (white beans, gumbo, stuffed p","useful":1,"cool":0},"YuhvlFAOl4tAhQb1ui_ocw":{"text":"This is one of my favorite places to go when I'm in New Orleans!\n\nWhat's not to like? The ","useful":0,"cool":0},"CGufWFBi6BKV9FWKypmMTQ":{"text":"I've been to EAT on several occasions, but only for breakfast and brunch so I cannot speak","useful":2,"cool":0},"Fn00hQtHPVQ4fVBnzUemFQ":{"text":"Our server was nice, but the food was awful. Music was way too loud and really terrible.\n\n","useful":1,"cool":0},"qvp0knVX4btbAyO9CybAlA":{"text":"Amazing breakfast!  Grits and shrimp OMG! A must go. Small place but absolutely must go.","useful":0,"cool":0},"fO9HKgHbGaM-MUFBSHD7Eg":{"text":"The waiter was extremely nice and provided great service.  Unfortunately my fried chicken ","useful":0,"cool":0},"0l7bmunzP_ofyxCkoNrGzA":{"text":"Fried green tomato breakfast...we've had breakfast all over the Quarter and Eat is by far ","useful":0,"cool":0},"oL-Qw1E2HqKRwUgk_b2qgA":{"text":"Eat was a favorite but our last trip was a Flop.  Some of their standard best aren't on di","useful":1,"cool":0},"8GtX58UXUpw9y1JDHoKoLQ":{"text":"Wow!  So understated, nestled away in a quiet corner of the French Quarter, but the food h","useful":1,"cool":0},"LBm2ObukG8bHQ4cWBMhhGw":{"text":"Loved this place!!!  Went for dinner and will be back.  Ordered both the  Fried green toma","useful":1,"cool":0},"EqJ8BXcgSLD3FAbREsC0Rg":{"text":"An excellent place for elevated home cooking. It's comfort food taken to that next level. ","useful":0,"cool":0},"aS-dLj4KhUjKJvqZfOQ0pA":{"text":"Went here because Port OCall was packed, and I was hungry for food with more class. The fo","useful":0,"cool":0},"yl2YEFqF4b4rn18FE0Hjtw":{"text":"Our waiter was pleasant and very efficient; the prices were good. That was it for the good","useful":0,"cool":0},"RRUjTkEuCOd1zRm7DvIAPg":{"text":"I have not written a review on Yelp in a long time. After spending 3 days in New Orleans a","useful":0,"cool":0},"wLiglmgDxCESqW3qfzwQ2A":{"text":"My BFF and I came here for Brunch while vacationing in NOLA, it was a great experience. Fr","useful":1,"cool":0},"4z3HIEK5bXipgZPtej5uJg":{"text":"Great breakfast and service....Despite the long wait to get in, the food was real good....","useful":1,"cool":0},"9AEB2SHBcNQJ9tZa_EkGdg":{"text":"I ate here 2 days in a row bc the first day was awesome. I would have given 5 stars for th","useful":0,"cool":0},"QsjR4TkOg6-ZpY4zoh1fHg":{"text":"I ate at Eat for lunch while I was in New Orleans. It is very cute inside with colorful pa","useful":0,"cool":0},"MDuIEjMxhS_xii_LBM-bAQ":{"text":"I have eaten here numerous times. This last time the food was very good.\nBelive me a true ","useful":2,"cool":0},"anc8h9RaZyXDKbhyD4-roA":{"text":"Excellent brunch menu! We tried the froed oysters which were soft and tasty, and the okra,","useful":1,"cool":0},"7-oR-zVrD94dl5njEZzfAQ":{"text":"I was in New Orleans for a work trip and wanted to try some southern-style cooking. Eat Ne","useful":2,"cool":1},"7_NqZUrn3bo8ec-zR9csaQ":{"text":"The food here is amazing!   Very fresh ingredients and cooked to perfection.   I love the ","useful":0,"cool":0},"256fYmr_4z5TZM4BdFkx5Q":{"text":"It has all the right components that should make up a restaurant that I would love, but th","useful":0,"cool":0},"Eab0NPH5oQt00-6KqiIJOw":{"text":"We stopped in at Eat on our last night in New Orleans and were really bummed out that we d","useful":1,"cool":0},"pzmumUBJ_tmiqQbmNfTAFQ":{"text":"A friend and I stumbled upon this place (for brunch) during our vacation in NOLA.  It was ","useful":0,"cool":0},"redvmRvgxLziNzP-jSDENg":{"text":"Tears. Tears of  joy everywhere. Then quickly followed by tears of regret. Because then it","useful":3,"cool":1},"IhrcD0kKdg3QZeHcSdJKlQ":{"text":"One of the best meals that we had during our five day stay (15+ meals). The bread budding ","useful":1,"cool":0},"dSgeB_kBwtUHYfqUS4hrwQ":{"text":"I think I smiled the entire time through our dinner experience. Beautiful little restauran","useful":0,"cool":0},"ReuqISHNg6VrkH_VlTullQ":{"text":"Wonderful dining experience.  The food & service were spot on.  I had the fried green toma","useful":1,"cool":0},"T0R_b6ZHcFuID8zofcgUGQ":{"text":"Breakfast was phenomenal! Fried green tomatoes with homemade remoulade, grits, eggs cooked","useful":1,"cool":0},"bGJPbjK4bQeKjD5AuegnNg":{"text":"Amazing breakfast!  Actually the best breakfast I have ever had while visiting NOLA and ma","useful":4,"cool":2},"jjhE-KHcsgfq7UfplLt2yg":{"text":"I visited this restaurant while on vacation in New Orleans. Cute and quaint restaurant. Fo","useful":0,"cool":0},"kWF9Ma4aW-P7RAPRYGcojw":{"text":"We, me and my husband,had an excellent dinner here!\nTried the crawfish boulles/balls as an","useful":1,"cool":0},"ahgHVgML-Ukx9aOEy_Y_yQ":{"text":"Perfect for a table of 2.  Went in with 1 bottle of wine, no corkage fee on the first, $15","useful":1,"cool":0},"C2tvgmPXzFemZP52p6as_A":{"text":"Literally found this place on a whim.\n\nJust about to close for the night, had a nice small","useful":1,"cool":0},"Y4MRp_kxCC24hXz6JZwUBg":{"text":"Enjoy the butter beans and shrimp and the portabella sandwich. BYOB is a plus; there is a ","useful":0,"cool":0},"lCb_eJ-nSRBDM6G-LbpLWg":{"text":"Been there so many times and this last visit portions were so small..chicken fried chicken","useful":2,"cool":0},"XmMn7FeD8EcqAFJAGoXBiQ":{"text":"Solid.  Great food.  Local ingredients.  Friendly service (but don't be a table of one - t","useful":0,"cool":0},"XYMYsa2Um1HgaNTzhJTUVQ":{"text":"Great service & food! Food is southern comfort. I had the 'trio' of red beans, gumbo, and ","useful":1,"cool":0},"0H0ArWqLwTcppgmu3s_lAg":{"text":"If you want to have an all-out-eat-a-week's-worth-of-calories-in-one-meal type of brunch (","useful":1,"cool":0},"shKaILArAGXNUQ5cFbLFPQ":{"text":"While in NOLA - Eat.   \nHave been in town for 3 days and have eaten here 3 times.  If you ","useful":0,"cool":0},"0hm1cbXItTM_uoxrluZO9Q":{"text":"The only reason I didn't give this place five stars is because I don't just throw around f","useful":0,"cool":0},"tKxc3Oeb_Q7Czf-uUtXNmg":{"text":"This place is a hidden gem for most tourists.  I wouldn't have found it if it was not righ","useful":1,"cool":0},"VTPBeYmt82Nm0roAmjadgg":{"text":"Went here for Sunday brunch with the fam. Everything was top notch. Great service-they gav","useful":1,"cool":0},"JDYSbWCOHhBlwsZuqGx8tQ":{"text":"We happened by this place on our way to the Voodoo Museum, and since we were famished we d","useful":0,"cool":0},"NLc8HptAbpljtaMH1linBA":{"text":"This is my second time visiting. First time I wasn't that hungry so I had the deviled egg ","useful":1,"cool":0},"dY0lM2mPOAhm3m6LEAEKVQ":{"text":"The food, service, and ambiance were on point. The Banana Fritters were so good!!!  We'll ","useful":0,"cool":0},"wD8oyVYHKovPq7shKHtNew":{"text":"Ate here one more time last evening before leaving. The roasted garlic appetizer was perfe","useful":0,"cool":1},"wzzgA2C5tqZ0jHKKFtT1CA":{"text":"Great local place. Authentic foot, great service, relaxed but blissfully reasonable noise ","useful":1,"cool":0},"B2RkrpoBwCbVllOiTGefLw":{"text":"Thanks yelp! This place was great. Super tasty. Don't know much about Cajun food and the m","useful":1,"cool":0},"k5fkvvlh_TURJXB3G1uuEw":{"text":"Very good service. BYOB makes it a value brunch...  Make your mimosas! Big Breakfast great","useful":1,"cool":0},"1nSGuwnFcrw8nFRt5dUxcQ":{"text":"I came here once last year and visited it again while I was in town. Great service and the","useful":0,"cool":0},"j6Ip85AkZ7i_zC_KyOBQ2A":{"text":"It's a restaurant inside what looks like it's been adapted from a regular home. So you wil","useful":1,"cool":0},"tox7Fbh5_Y1re_hz1Go7mA":{"text":"I really wanted to rate Eat higher but we were disappointed because many of the entrees we","useful":1,"cool":1},"4WLMnVP1MOVxPHOvmziuJg":{"text":"Okay, the ambience was nice, the service was good, but the food was okay. Out of everythin","useful":1,"cool":0},"tDEvqGce_kgitcuVzJ768w":{"text":"Eaten here over multiple incarnations. Have eaten here in past for breakfast. This was fir","useful":1,"cool":0},"0JjNT4O1gR8ZubU6UCpO8w":{"text":"Atmosphere blah! Service was bad. Food was not great. We could have just gone to IHOP and ","useful":0,"cool":0},"Ag_qci8rOnw4LAWDiuccTQ":{"text":"Absolutely excellent breakfast/brunch and service. I had the soft shell crab Benedict the ","useful":0,"cool":0},"KVL8DbgEN_pjvNy-ETwbpg":{"text":"Wasn't impressed.  Baked macaroni and cheese was actually spaghetti noodles.  Didn't enjoy","useful":0,"cool":0},"JCsR6resLjt9FBguZhpdfw":{"text":"Great prices. Good food.  Very comfort, down home food with a gourmet twist.  A friend had","useful":1,"cool":0},"UAgqiuSucsc9dvOoqNmmSQ":{"text":"Excellent authentic NOLA food. Perfectly done appetizers: chicken livers, yummy fried pick","useful":0,"cool":0},"7ejxsM41E-ObHaKiQtTytw":{"text":"Ehhh. I heard great things from Yelp and down other locals mentioned it as a definite plac","useful":2,"cool":0},"5ColBpUhN0UAqAsIjzj5cg":{"text":"Delicious food, amazing flavor , and great service. The crab and and shrimp fettuccine Alf","useful":1,"cool":0},"Db01fiDVzo4eElpZ8pWp-Q":{"text":"i love their lox and bagel combo breakfast. it looks heavy, but it's just a perfect way to","useful":0,"cool":0},"FdvhOPxpHRpND2RNefB_Xg":{"text":"Caesar Salad had overpowering cheese.  Service was excellent for a large group (20 people)","useful":1,"cool":1},"cw7NK6_0VDsByvyHwpt10g":{"text":"If you don't get the banana fritters....I'll punch you. Seriously the best thing ever. You","useful":1,"cool":0},"TbNk88bG694CuTTLUDFvtA":{"text":"BYOB. There's a store just down the street where you can get yer booze. \n\nBrunch is amazin","useful":1,"cool":1},"qn9LmDn6LNtyNjrsn-KM0Q":{"text":"We walked in just as the place was getting busy. We had an amazing dinner here tonight, Ch","useful":1,"cool":0},"7y6kIiNaVJwULs2zXgwM4w":{"text":"Good service. However the food doesn't stand out to me as much compared to other places ar","useful":0,"cool":0},"XLYp4M2Vx2HBDwHUoZ3y5Q":{"text":"The biscuits, the fried chicken, the chochon dish, and everything else we had was great!!","useful":1,"cool":0},"6RFHmwht5dWNknXJ-tkPlQ":{"text":"Small intimate restaurant. The fried green tomatoes were tasty. FYI, It is BYOB. Crayfish ","useful":2,"cool":0},"cvpdnjMbPDrje4Uw85s2Sw":{"text":"Highly recommend Eat for brunch in the French Quarter. Small, spunky, and southern.\n\nI ord","useful":2,"cool":0},"JjS1sZ2xSnVgrIbj16FYHg":{"text":"Overview: I came to New Orleans as a tourist and found this place on yelp. I can't compare","useful":1,"cool":0},"DSy8OuRJzlK-zsMIVyetTQ":{"text":"This was our first dinner in New Orleans on 3/10, after a long drive from Florida. I would","useful":1,"cool":0},"Bv7bq29OJo4eBCXEWXAk3g":{"text":"Incredible brunch. Gumbo was only ok. Service was great. Bring your own booze.","useful":1,"cool":0},"n-zK1UITaa63GgY7idOZ6w":{"text":"Went for dinner, it was awesome! I had the chicken fried chicken (w) garlic mashed potatoe","useful":1,"cool":0},"88wtDWleOU7j3NRLEwREvg":{"text":"Quaint, quiet, and awesome food for the value.\n\nWe came here on a whim as it was south of ","useful":2,"cool":0},"xBZ-NF-4AEgi9W4jyzrDbw":{"text":"This place nailed it.  The red bean gumbo is awesome!  And only $10 a bowl.  I would get t","useful":0,"cool":0},"nw5cMl34kOg_6lTYoIW34g":{"text":"Absolutely amazing!!!!! Breakfast was hearty and delicious! Don't miss this restaurant if ","useful":1,"cool":0},"mpdeLv0_SI-OB-uv-7Lvng":{"text":"The fruit and grain plate was beautiful and very taste. The fried okra was over the top go","useful":3,"cool":1},"EWj6RF460dcf7mO0qmjhMw":{"text":"Great vegetarian options. Love bringing my own bottle of wine!","useful":0,"cool":0},"LCcGaWDogebJWaKpv05B4A":{"text":"First off get reservations..it is well worth it. Very quaint small place that is perfect f","useful":1,"cool":0},"QRc4t4x4nlt6KJH_c2eaSA":{"text":"Everything here was delicious - definitely one of our best meals in NOLA! The food could'v","useful":1,"cool":0},"gwHA2QRquQc5pGSE9RKzWQ":{"text":"I came here with my husband for brunch. We couldn't decide what to order so we asked our w","useful":1,"cool":0},"LHiTD3wOTtgbyxZ_xDGEKw":{"text":"Terrible!! All food was over cooked and bland. Go anywhere in New Orleans other than here.","useful":0,"cool":0},"_1cVsfRSgWciQB9aRX7VSg":{"text":"Excellent brunch. Service was pleasant, if a little slow/sporadic... but the food was grea","useful":0,"cool":0},"6L-A-STTZLrwkUkA909W7Q":{"text":"Food Hounds... when in Rome - eat like the Romans do; but when you're in New Orleans, Loui","useful":4,"cool":0},"F9dG9EKk7A1SB2jSkZkuGg":{"text":"** 2.5 stars **\n\nEat was a perplexing dining experience.  This post-Katrina restaurant ser","useful":6,"cool":2},"wF006q-T2LSAjjMHUkJLug":{"text":"The food was good but my portobello sandwich was soggy and I had to cut it with a fork and","useful":0,"cool":0},"8Tpjct8w4ZQO-1EM7pQF4w":{"text":"Not sure what it was about this place but I felt as if I walked right into a quaint French","useful":1,"cool":0},"ZRosUho5fH9R70cNQ-fPLQ":{"text":"Came here on a Saturday night, it's a little dark but the music is a nice volume and the w","useful":1,"cool":0},"zVHsixB5TimGOkndRqfL5A":{"text":"I always have a great New Orleans meal here, relatively inexpensive and BYOB for the first","useful":1,"cool":0},"36haC47mGgMWAkOurRlZYg":{"text":"The food is something special and it's sad that the service was just so awful, but it ruin","useful":1,"cool":0},"ivctQFif2CG7xgPr1sSXmA":{"text":"My family and I went here for dinner and had a terrible experience with the waiter, Jeffre","useful":2,"cool":0},"fmPZ7WZBU6m7A_FTBOAjeg":{"text":"The absolute best Southern Brunch!\nStarted with the fried green tomatoes with remoulade.  ","useful":2,"cool":1},"CdWrvCwe4OxXpQ4YRQbvuw":{"text":"As usual, EAT delivers quality food with great service. Big Breakfast was just that and th","useful":1,"cool":0},"_JodaQwMooQV3lmk38qlvg":{"text":"At the recommendation of a local, we chose Eat for our first meal in our weekend excursion","useful":0,"cool":0},"2HS9OSW0zo-lJ50Kr_MjdQ":{"text":"at 9:40 pm, as a party of one, I was hustled into a table. Before I was handed a menu, I w","useful":2,"cool":0},"Xxasrl0UsLjwjyaZ5bCNwg":{"text":"Absolutely delicious.   Five of us came on a Saturday night and only had to wait around 20","useful":1,"cool":0},"DxXjAHOVgH2F3tIOBNdCGg":{"text":"Hmmm...not too good.  We were not impressed.  Food was marginal at best.  Very salty with ","useful":0,"cool":0},"-l0x-bSnvW-LVkEKfXXVjA":{"text":"Loved the down home fresh food. Unassuming place  with a nice atmosphere and friendly staf","useful":3,"cool":0},"F6rjYY0M1KbIVJ8DedW3ZA":{"text":"This place is just about as cute and homey as it gets. From the oh so adorable waiter to t","useful":0,"cool":0},"M1HIydfOvTZI3h2Beelk7A":{"text":"First of all, the service is great. We arrived without a reservation so we couldn't get se","useful":4,"cool":0},"KPsZbnKVBHwHcs7ko4OUoQ":{"text":"Prior to our 2pm bike tour with Confederacy Cruisers we had enough time to squeeze in a de","useful":1,"cool":0},"9s_UfexwttZL0cvgZGb7og":{"text":"Fine Dining at reasonable prices\nYou can tell the chef is trying to do that little extra w","useful":1,"cool":0},"Ug9WbPoYXC8O6i6QN57Ajw":{"text":"The food: I've been here a few times. I've tried the biscuits and gravy as well as the blu","useful":2,"cool":0},"GLdzpOvHQTwlesCsbNcSKg":{"text":"Quaint place... great atmosphere... great attentive polite staff... I got the chicken frie","useful":0,"cool":0},"LD9ADccTKmsMRAzzWuDhAQ":{"text":"This place was great! We didn't have a reservation but managed to get us in pretty quickly","useful":3,"cool":0},"ktGVG3bWSMSzSWuIwfGkTg":{"text":"A gem? Umm... No. The food was not good at all and the service was even worse! People that","useful":2,"cool":1},"BAU252iMqsPYwEkCl9Nxow":{"text":"Delish southern food. Banana fritters yummy!  Everything is fresh and very good. Gumbo, gr","useful":1,"cool":0},"rNNoZ1IEkTcxPIR5becFbg":{"text":"This was exactly what we were looking for, and IMHO, as good as it gets as far as brunch i","useful":4,"cool":1},"R_2ahR31ZFveTbsICTOWsA":{"text":"I was staying in the French Quarter for a friend's wedding. I didn't want to eat like a to","useful":0,"cool":0},"YgLRllituWp3HwhmKxEI6A":{"text":"Great for intimate dining or a nice quiet date!\nBad for a group!\nWell...I normally really ","useful":3,"cool":1},"OmpWyRnLmNdvi_OpgqHQyQ":{"text":"Definitely one of my favorite meals during our recent trip to New Orleans. \n\nMy parents ha","useful":7,"cool":5},"TlNxlPiTOsfXa4jMfykQKw":{"text":"One of my favorite places to have dinner. The food is awesome as well as the service and s","useful":1,"cool":0},"gTyvjTa-5CM2LCMq1UjU2Q":{"text":"A homey setting that serves comfort food. Our waiter super friendly and enthusiastic about","useful":1,"cool":1},"BlZh9gKxTrvLVlGjJdKOeQ":{"text":"All our food was delicious.  The salad dressing was homemade and the gumbo was delicious. ","useful":2,"cool":1},"_fHJbQaHwgbCsdWy0taZ5g":{"text":"Took other friends from Dallas for the brunch today. They really enjoyed the food. There w","useful":1,"cool":0},"pbXrviL6zxjdwI5JV3AhbQ":{"text":"So good went back two days in a row. Food is innovative and expertly prepared, service rel","useful":0,"cool":0},"k1zqArEweW9ucbFsCGa1KA":{"text":"A friend and I were in Nola for a night and our hotel recommended this place. I had the bl","useful":2,"cool":0},"QBfYBkNXOd6h08uph0jE7A":{"text":"This was such a cute little place! \n\nI came to New Orleans for work last November and am n","useful":1,"cool":0},"AXtf06tA8hlNCBDsxjjDzQ":{"text":"One of my favorite stops while in NOLA. The food is fantastic, the service amazing, and ju","useful":0,"cool":0},"3n6Ce3qahwTY_UqCCCksvA":{"text":"I have heard about this place through many friends of mine and decided to come in on a Fri","useful":1,"cool":0},"dHV2-bhCU9c8jVXSL8vhEg":{"text":"went on a Saturday morning. proprietor was awesome. great recommendations around town. tha","useful":1,"cool":0},"umTWPVloMre0f_4iY36Ygw":{"text":"Came here based on great yelp reviews, and it did not disappoint! It's a cozy, yet chic re","useful":3,"cool":1},"scATLDPRshk5FPkJdAR4vQ":{"text":"On our first night in New Orleans, our hotel lead us here since we had not made a reservat","useful":0,"cool":0},"_EUdbIMPJnWCwrHu6CUazg":{"text":"Called in an order to go---Fried Green Tomatoes, Chicken Livers w pepper jelly, Shrimp & W","useful":1,"cool":0},"g5tZ4I5HzK4or5Wj20lBaQ":{"text":"Great atmosphere!! Super good food! It's BYOB, so before you go, stop at Good Friends bar ","useful":1,"cool":0},"_9U6kr0al6o_BYZkQuRgdQ":{"text":"We went to Eat for lunch. We could not order brunch menus because it was Tuesday. So, we o","useful":2,"cool":0},"9YHF7kyBNQ64Djk7PuYHiw":{"text":"We arrived just as EAT was opening up for the night.  I was starving, because in an effort","useful":3,"cool":2},"fYN9x6C0QoJbfD_8wGqg7A":{"text":"The special tonight was pan seared scallops with garlic grits, and this was the best thing","useful":1,"cool":0},"PNmfBrTj-CK3Yxk-TMS32g":{"text":"Fooled by yelp reviews, just went there for a to go sandwich. Paid $15 for the saddest por","useful":0,"cool":0},"DqZxfE5WiX584Ccw7vCONw":{"text":"Andouille cheesecake. Finally got to try it... sooooooo worth it. I didn't know what to ex","useful":1,"cool":0},"OUfwxQ5yPdFY9REJJtLNtg":{"text":"We were looking forward to trying this place. We drove from Houston (on vacation from Euro","useful":1,"cool":0},"ZpsYzdeOb16v2pn0_kUkIQ":{"text":"Super Mardi Gras Sunday brunch! Awesome service. Specials were amazing- King Cake pancakes","useful":1,"cool":0},"FVIJvGuSAiyNOwG4wjheLw":{"text":"The owner of Eat contacted me personally and apologized for the service my family and I re","useful":1,"cool":1},"VSfwd-FVT4bQdVMdjNTBdw":{"text":"Absolutely delicious local and reasonably priced dinner! BYOB though but there is a liquor","useful":0,"cool":0},"MrUQxPA6DFC0n2hqmZjWpA":{"text":"For our last meal in New Orleans, I really stuffed myself at Eat!  I ordered the crawfish ","useful":2,"cool":1},"nETkMVN9jkGnu4hNZxKrdg":{"text":"This was a lovely break from the Bourbon St noise and chaos. It was dimly lit with soft mu","useful":1,"cool":0},"mgSqBNboen9G20KyuHF2_g":{"text":"Loved the place it self. Nice simple meals and its BYOB so you can't go wrong","useful":0,"cool":0},"gvyw6407kZijokN50Dmhcw":{"text":"This was one of the most memorable restaurants I dined at while in New Orleans for busines","useful":1,"cool":1},"TQZKMXvKcaqrSqPSXOknsA":{"text":"It's so cute in here. Shabby chic and modern. Loves it. \n\nThe waiter is also super cute. \n","useful":1,"cool":0},"2AyRSkM8wkpnoKJP46JEKg":{"text":"The food and atmosphere is nice and chill. The only problem is there were fruit flies ever","useful":1,"cool":0},"OOtjG5oOeTWd1yAHZ_tTfA":{"text":"Stopped by to share a starter and a couple of sides. The fried green tomatoes are just per","useful":2,"cool":0},"psCbK9hJuzvEXlnYEKsqhw":{"text":"We waited for a table for five minutes and were then told they were full. I could clearly ","useful":1,"cool":0},"o4ER1urmKVzDK6srbH74PA":{"text":"Shrimp n grits da bomb!  Great brunch place.  Even though it was busy the staff was friend","useful":1,"cool":0},"saDMIMremLnYyOzs0o-GDg":{"text":"Vert slow service, no liquor license, mediocre food.  Just one guy waiting all the tables.","useful":0,"cool":0},"aUZFhGl7E5EKk48Za07XNw":{"text":"Actually 4 1/2 stars.  Great prices.  Friendly service.  If I lived in NO, this would be m","useful":0,"cool":0},"JqcLfPt_CYXvuD3b2-EHyg":{"text":"I wanted a lunch which would sustain me throught the 5-hour flight back to SF, so I droppe","useful":2,"cool":0},"RNiwNjFWIKWOXj0jwbDkLA":{"text":"When in NOLA Bourbon Street is great once. I could go to \"Eat\" over and over. Why?\n\nThis f","useful":6,"cool":1},"cotab0ppZQdRI6F7vAoUmA":{"text":"We tried this place as it was highly spoken of on yelp, but the food was average at best. ","useful":1,"cool":0},"-ClaEopzGqU_6UrQMHJffw":{"text":"Found this place while a weekend stay in New Orleans, great vibe and the staff are nice as","useful":0,"cool":0},"80eV4G7fH34Xz0EKlk0D0g":{"text":"Great food and great service. My husband had the big breakfast and it came with fried chic","useful":1,"cool":0},"DpSvsiuVp1wn4z19sIaOMQ":{"text":"Despite a few nitpicks, I enjoyed my recent meal at Eat. After a lot of walking in the col","useful":0,"cool":0},"mdNG2wcfNeliDSiojHy5Kg":{"text":"This was one of my favorite meals during our trip to New Orleans.\n\nFrom the minute we walk","useful":2,"cool":0},"28gu4qZrrDapm5aUspR01A":{"text":"Delicious brunch spot!  The restaurant is in an old house in a quiet section of the quarte","useful":1,"cool":1},"pJkikTTzKl0giKLLqEXjeg":{"text":"Wonderful for a nice quiet dinner or Sunday brunch. I always order the Artichoke dip, (the","useful":0,"cool":0},"31UIuXij4K9sky-kozgjVA":{"text":"All around excellent from appetizer to dessert! Small, quaint atmosphere and great service","useful":0,"cool":0},"4VW4fPFLODDeAxb7-zSPNw":{"text":"This is a really special gem of a place.  Very gourmet and authentic cuisine.  We shared a","useful":1,"cool":0},"P5_bgpGH88IbfeNEd9G6Ww":{"text":"Thanks Yelp - for helping us find this Gem in the French Quarter.   We had our best meal i","useful":0,"cool":0},"QDROG8Z5xD2qINypD1cimA":{"text":"This place was right down the street from our hotel, the Inn on St. Ann. We went for brunc","useful":2,"cool":0},"cfflYFYUbN1wGuQ6QG4Saw":{"text":"Without doubt the worse service I have experienced in the US ever! Waiter bought out deser","useful":0,"cool":0},"ahgsk2NELOSMqUNWlHki3A":{"text":"Definitely worth the walk.  My husband, who is a pretty good cook on his own, had a crawfi","useful":0,"cool":0},"-elcG4L5ddtEdBzBXh6tKQ":{"text":"I will definitely go back to this place again. I like the vibe of the place and it wasn't ","useful":1,"cool":0},"q44r0_5acN3yA1fBg-NBvA":{"text":"Cute place! Friendly service! Deviled eggs are scrum-diddly-umpsious! Oh the bread, hello,","useful":0,"cool":0},"_d777F3q4naoGV4bk_hXdA":{"text":"Food was good not great Cajun fare. I'm from sw La. and though the menu was fairly authent","useful":0,"cool":0},"Hd-hgF5thmtCbwBZfY4ofA":{"text":"Consistent service!  We enjoyed the special red proper soup, shrimp fettuccine, stuffed be","useful":2,"cool":1},"HAo9uiB2uMhtAXn786gDaA":{"text":"I went to Eat on my first evening in NOLA. I was only In town two nights and this was my f","useful":0,"cool":0},"Rm_8C6zFsf7WR3IbLXSzJA":{"text":"This unassuming Creole cottage on the edge of the French Quarter has a simple delicious an","useful":1,"cool":0},"ppUWn_jXHDCY8bJW4cse7g":{"text":"Eat is certainly one of the best spots for brunch downtown.  Though it's expensive, the po","useful":1,"cool":0},"WNrwZGZOauEqY78QHnAEjw":{"text":"Ordered the chicken and dumplings and a cup of gumbo. Took almost an hour to come out and ","useful":0,"cool":0},"EzoBZW7QtFdP6Krm5xx9Iw":{"text":"Had a fun laid back early lunch here! Home-made deliciousness!!! I had a yummy po-boy with","useful":1,"cool":0},"QbtsJXauUElwrTsbt1INAw":{"text":"Great food, but the service was lacking a bit. They were really annoyed when we showed up ","useful":0,"cool":0},"IT7t34NNpGd2oxg25hqG_g":{"text":"The catfish was amazing - it was literally one of the best meals I've ever had.  Service w","useful":1,"cool":0},"ntw74XPV9zgn60d1p0hjAg":{"text":"This was the best meal me and my future husband ate in New Orleans. We arrived at 7 withou","useful":2,"cool":0},"f4xJkpDj8ilVzL-kVF9d7w":{"text":"A solid brunch choice, Really more of a 4.5. Oh Eat your biscuits and gravy with bacon on ","useful":1,"cool":0},"Y_HHe-AzKlazHelzRVjw3w":{"text":"One of my favorite little restaurant in the French Quarter. Go in for brunch because their","useful":1,"cool":0},"YSvVi5bDJYUyDQ3T1QlWPQ":{"text":"While in New Orleans, you should really eat a meal at Eat.  I mean, it's easy to remember,","useful":2,"cool":0},"cEwd_JyLvaIm_Dfuhoqggg":{"text":"What a nice surprise. BYOB. Quaint house-like setting. Great ambience for a nice quiet din","useful":1,"cool":0},"qYeQ0AtsITrkcCfVc7STlQ":{"text":"Didn't care for it. Our server seemed shaky, nervous, strange -- not sure what was up w/ h","useful":0,"cool":0},"yy6JA8uDkl1dJzwEy3KDIw":{"text":"Dinner there 11/05/2013. Arrived early without a reservation, and were lucky to get a tabl","useful":0,"cool":0},"NG5BRHyb8MDRlsaaD0ue0A":{"text":"We were in NOLA back in November and this was on my short list of amazing dinners.  I had ","useful":1,"cool":0},"O0opvGFK2pmzLlip7oNQIA":{"text":"Ummm, if I lived in New Orleans I would eat here every week. I find that I'm becoming a fo","useful":1,"cool":0},"UbxgXS6kGqq3sscBdUOEwA":{"text":"Delicious food and great dessert! Very cute atmosphere as well and  bit away from the craz","useful":0,"cool":0},"QDQxewzs3ZRtLLromj2zqQ":{"text":"Cute little brunch spot. Super nice staff. Went with three other friends and we all ordere","useful":1,"cool":0},"sIJwXCvFP36B0ewwopSTMg":{"text":"Wow. We stopped in NOLA on the way to Florida for a family vacation, and consulted Yelp fo","useful":1,"cool":0},"7SAXDIyM9ewoJ_NwO3CXew":{"text":"Absolutely love the eggs dumaine....a must try! I came back to this restaurant a second ti","useful":0,"cool":0},"TMyefuNLOJ_FfJ_2MOYoEQ":{"text":"delicious! friendly waitress. i had the Eggs Dauphine, which i loved. the eggs came out mo","useful":3,"cool":1},"7fQmaYzUvVXzPnEpDNq5eg":{"text":"Delicious! I had the chicken fried chicken and the fried green tomatoes and really enjoyed","useful":0,"cool":0},"j02xj5QfLSbCsd34hfKT2Q":{"text":"Not five stars because service was a little slow.  Worth the wait.  The sweet potato waffl","useful":0,"cool":0},"vSciObsWkMzwqvMcuPh-MA":{"text":"We arrived at Eat just as they were opening the doors one morning and managed to beat the ","useful":1,"cool":1},"-A3D1MGjzNr0YOlf5STl2A":{"text":"Delicious lunch here last week. I had the catfish lunch plate. I have never had better cat","useful":1,"cool":0},"4wFI945zKi8ldtjMaIqs7g":{"text":"Eat has delicious food, and with a BYOB and no corkage fee it is a great place! Fried Gree","useful":2,"cool":1},"OZyALAZKkyU5pnNb-tBGKQ":{"text":"This place was the shiznit. Great service and equally good food. The breakfast is made fre","useful":1,"cool":0},"TyP8in5QiX5TYPrnR0Hxiw":{"text":"Gumbo- The gumbo was okay.\n\nRed Beans and Rice- I liked this dish the most. Chunky pieces ","useful":0,"cool":0},"cYqiO1lYpwkDXxRuru8Iaw":{"text":"Good food, good price, and huge portions. I wouldn't order the chicken fried chicken agin,","useful":1,"cool":0},"n8EbuPGroR7SjMg5DHsDaw":{"text":"Beautiful inside. Service was great. Small Caesar salad to start then chicken and dumpling","useful":1,"cool":0},"s14FqSWbtq0zN1O3oYLVuA":{"text":"Price was high.  I guess is location for the tourist to come by. Would I go there again?  ","useful":0,"cool":0},"tVtnBM6jHgAq232Ivug-Vw":{"text":"The shrimp and cheddar omelette for brunch is amazing, I had to savor each bite! Nice ambi","useful":1,"cool":0},"ZgFe1dtCh6pC9ogg8ypfJw":{"text":"The food was great and really reasonable. I recommended it to several friends in from out ","useful":0,"cool":0},"Ksc5hmsBvnQaElL3jmWndg":{"text":"Crawfish boil frittata and my husband had a breakfast plate with peanut butter banana panc","useful":1,"cool":0},"BiCmbiPqHmE0GpzD-qNptg":{"text":"This place is tourist trash- forget about it now. \n\nFrom the description and prior reviews","useful":1,"cool":0},"i4Sf6FthtPJeQ8ExIv5q3A":{"text":"Do not miss this place if you're in New Orleans. It is fantastic! Came for lunch and had t","useful":1,"cool":1},"gYOtGtnCgih2Ougd_ULd9A":{"text":"I've been to Eat twice now... weekend brunch is to die for and the lunch was nearly as inc","useful":0,"cool":0},"-cjCp6bj2GYO7ns-jNfPJA":{"text":"When looking for food in the French Quarter it's hard to avoid the Bubba Gump, Hard Rock, ","useful":3,"cool":0},"eXg1ypPCClWYTi7t6gxH_A":{"text":"I wanted to like it.  Really, I did.  But the food didn't measure up.  Great atmosphere, f","useful":0,"cool":0},"pkofU1GLI4WndEwTfkbDDg":{"text":"This place was amazing! The food is awesome and the service was great! This was our first ","useful":0,"cool":0},"cMIUPeqnahe1UtQGMs0LaQ":{"text":"Took the family, had a fantastic \"southern comfort food\" meal.  If you like home cooking t","useful":0,"cool":0},"O62c00y-dyBoaV9_ySwpCg":{"text":"This was one of the best meals we had on our 4 night, 3 day stay in New Orleans.  The hote","useful":0,"cool":0},"vtEPWVRFxzOFsHfExlp1KA":{"text":"Tuna was prepared perfectly, fresh and delicate, the Brussel sprouts could have used more ","useful":0,"cool":0},"ECicUiRfmdqhwVifyU1B5Q":{"text":"I have been here off and on for awhile now and I have yet to have a bad meal. Eat is a gre","useful":0,"cool":0},"fFcki7aPC1WIuiWzU4TL_A":{"text":"I will keep it short and sweet.  This place is awesome.  Went in for brunch on a Sunday mo","useful":0,"cool":0},"3-mOugexTln2sogImoSrGA":{"text":"It was a good breakfast place to eat. Nothing special but a decent breakfast. The coffe wa","useful":2,"cool":0},"uclBRC0tepzRxoXbQ9oIPw":{"text":"We loved this place! It was cozy and warm on a very chilly night. We had a party of nine a","useful":0,"cool":0},"s2sCw9GEXbItATfJsq_amg":{"text":"I brought my party of 14 there last Sunday for the first time and i couldn't have asked fo","useful":1,"cool":0},"yZtMUiDXYOsamTKc4s96WA":{"text":"Great food. My friend had the Ceasar Salad, wich had perfect cooked chicken breast and sal","useful":0,"cool":0},"g-M2BO8yHOAc_WwX0-IxQw":{"text":"This was the best food I got while staying in New Orleans and probably the best breakfast ","useful":2,"cool":0},"0FUy7iduRiFDCpAeyDwBaQ":{"text":"The service was ok we had to ask for toast 4 times the BBQ shrimp was terrible I am from N","useful":0,"cool":1},"zC0PF45qfmOXfH427vJkHQ":{"text":"This was a recommendation from an unknown source, given to me by a trusted source. I shoul","useful":2,"cool":1},"ssE0jEzOndP9gm4jKQ_LdA":{"text":"Not bad food but an incredibly rude bunch of sassy gays for a waitstaff who basically kick","useful":1,"cool":0},"WuHwpESbypxTb5eEZ3hsTg":{"text":"This place is awesome!  We got there about 30 minutes before closing last week, which I al","useful":1,"cool":0},"k6ChMwADX2mqBmZV9Db-gA":{"text":"Eat. You'd think a restaurant with the name of America's favorite pastime would indulge yo","useful":1,"cool":1},"nbCq-1dqEuY84fyGva4Nig":{"text":"We met friends of ours for brunch while in NOLA on Sunday because it's one of their favori","useful":2,"cool":0},"SuXSPS4r3f2NOx83RJfENg":{"text":"My app (egg rolls) taste frozen, my main course taste frozen, and my dessert (red velvet c","useful":0,"cool":0},"hDZoDuWP9ovNM8qEImtDsw":{"text":"Food was tasty and the service was great. Small little boutique style restaurant with a wa","useful":1,"cool":0},"QgO9-sYM-jUthWGCDDK0bA":{"text":"I was brought here by my cousin, who I was visiting in NOLA, not knowing anything about th","useful":0,"cool":0},"poL870-CTiGNEYhGKFrsyA":{"text":"Gourmet Cajun food is the best way to describe Eat! Loved it! Had the Trio plate and it wa","useful":2,"cool":1},"Hr__lvbmaOwCn8yaSTQyng":{"text":"I really liked the fried green tomatoes and crawfish pie.  The food seemed lighter and mor","useful":1,"cool":0},"v2xsBEYupne1FJDniqInRA":{"text":"Now guys, I eat all types of food and this is the best that I have had in NOLA.  Looks tre","useful":0,"cool":0},"uF0ziFpfBGFw3PzUwBt2Vg":{"text":"Good restaurant. . .loved the Monte Cristo. . .it's definitely my favorite.  One draw back","useful":1,"cool":0},"BFIDaMjnmnbTdOKd_E3RyQ":{"text":"Admittedly, I came in here on a bad note. It took an absurd amount of time (90 minutes, at","useful":0,"cool":0},"vxDeC2ZYnEDb9Mxvx_9pmQ":{"text":"Sometimes I forget that the French Quarter does indeed have normal places to dine in. I've","useful":1,"cool":0},"ro0AeYpt0nt5ZrMCKZcabw":{"text":"Wonderful!! I was in New Orleans for my 21st birthday and was excited to try all of the fl","useful":1,"cool":0},"qITPCWIzZZVwuhpt_cNM0g":{"text":"This Cajun-Southern restaurant is in the French Quarter and was suggested to us by a frien","useful":0,"cool":0},"4zC7vouTUgpKDVAGIKeD0g":{"text":"I am saying 4 stars because the food was that good but if you go, just know that the servi","useful":4,"cool":1},"b2JSZ4hNVCgy-rvId_sr0w":{"text":"The party I was with came here on our first night into NOLA. We did not know this was a BY","useful":1,"cool":0},"58QGv-H_8FfOgCbTjVhj8g":{"text":"It was almost empty when I arrived. Cute place. Cute servers. No wine. Boo. \nSalad took 1 ","useful":2,"cool":0},"k31ToxXbuEzaY1B__uiA2Q":{"text":"My family loves this place in the Quarter for brunch. It's never disappointed us. The eggs","useful":1,"cool":0},"cC0cgz9KHq1edJy_pIJnig":{"text":"This place is simply amazing! They don't serve alcohol, but you can bring in your own! I h","useful":1,"cool":0},"6L-xiH5uddB72MxQnww-uQ":{"text":"This place is amazing!!\n\nOur first trip to NOLA and we even went back twice to EAT!!  The ","useful":2,"cool":0},"ppwLxTbmduCL1mw0gUJgDg":{"text":"We went for brunch - it was not crowded, given that it's off the beaten path, but the food","useful":0,"cool":0},"i10UvQe3immLCFwBNvUFfA":{"text":"this adorable restaurant was right down the street from our friend's home where we stayed ","useful":1,"cool":0},"wPZQ1UUhnKKZnyRcCGdKcg":{"text":"Crawfish pie...amazing.\n\nHomemade pineapple marmalade and biscuits, amazing.\n\nBest brunch ","useful":2,"cool":0},"GLTHlKccP__uDOUvC6oR4g":{"text":"Trying to break away from our pre-arranged schedule, the tourists in my companion and I ag","useful":3,"cool":0},"m2dVj51b6u2AnBLHwCzEGg":{"text":"The best breakfast we had in New Orleans. The gumbo was perfect. The fried green tomatoes ","useful":0,"cool":0},"1sqzXgfCyUQvF9E4IAicnQ":{"text":"This place was absolutely awesome. The waitstaff were welcoming and friendly with a perfec","useful":1,"cool":0},"I2Ul9G2qU0SrVh5pv0FaNA":{"text":"Our Lyft driver recommended this place to us when we asked for food the locals ate and we ","useful":0,"cool":0},"85YFuoL14Vi2mA4l020RdQ":{"text":"Great breakfast!  Worthy of the wait.  Pulled pork & greens, fried tomatoes with eggs,  be","useful":0,"cool":0},"Uv_rTA59ZsERhlQ6OIIq4Q":{"text":"Definitely would not recommend this place to anyone based off of the experience I had and ","useful":1,"cool":0},"TqXYpjvKRRl4T37BLXF52w":{"text":"I liked the food, but given the amount of amazing cuisine in New Orleans I would only rate","useful":1,"cool":0},"REiaR_hC28fxNj_O_QjpTw":{"text":"Incredible food. Table of six came for brunch/lunch. EVERYONE'S DISH WAS FANTASTIC. It's d","useful":1,"cool":0},"FLewhLZ9_qmHO_63nOsj1Q":{"text":"Service was terrible.  They couldn't push two tables together for eight people even though","useful":0,"cool":0},"XnX3MXoiUqaPiu90eitDzQ":{"text":"Was visiting NOLA for a conference from CA and brought in a party of 9 to Eat for dinner. ","useful":0,"cool":0},"sfkJDz4ENY3FJNK_E4zrQQ":{"text":"The food was absolutely amazing here. One of my friends got the southern fried chicken and","useful":1,"cool":0},"jzvsOAt_18P8yG5wuNJ5vg":{"text":"Delicious regional food, attentive and professional service, casual decor. We ordered the ","useful":0,"cool":0},"L7IT-GQTyMR1pc18MUrdGQ":{"text":"Very good food - nice staff, No liquor license, so it's BYOB and no corkage fee! The fig a","useful":2,"cool":0},"2rqmgUGpzrb7W-mw31r3eg":{"text":"This is some of the best food in the area, with real mildly-spicy Cajun/Creole food. I'd c","useful":1,"cool":0},"Xt2GmGfAi2P9MTh-coaiaQ":{"text":"This is one of my favorite restaurants in New Orleans.   The fig and blue cheese, the frie","useful":1,"cool":0},"6W8L-Tv6TYks2DMsgyQryQ":{"text":"Waited almost an hour to get in this place................but it was amazing.\n\nGreat selec","useful":2,"cool":0},"J7Qzg-fg1H0XF5yaVoVkEg":{"text":"The room is nice and the food decent but the customer service on our visit was very poor. ","useful":0,"cool":0},"ldG-pAu5lyz6x9A91gEh7A":{"text":"Very good! Had Crawfish Boulettes, Banana Fritters, Chicken and Dumplings, Grits, Bacon, a","useful":1,"cool":0},"No9ATGyrxVQBpSeN-cgNnQ":{"text":"Lovely spot for brunch in The Quarter! Extra plus, it's BYOB! Bottle of champagne plus a c","useful":2,"cool":0},"_swMlrNWSyLFUhLneNrgOw":{"text":"Second time in NOLA Nd second time at EAT\nExcellent food again, possibly the best breakfas","useful":1,"cool":0},"azayigBsvpD3TM961UwBug":{"text":"After stupidly trying to get beignets in the french quarter on a Sunday morning and gettin","useful":0,"cool":0},"2ZG4H2eg-LzWjQ_Him6ayw":{"text":"Awesome meal!  Searched good restaurants on Yelp before we headed out and picked this gem.","useful":0,"cool":0},"LsJZjTPs42PeqkHOJ44Jgg":{"text":"The clocks were set back but our bodies hadn't gotten the memo so behold, we were up an ho","useful":2,"cool":1},"dOpE0LMGi6YKwuaPsj0g5Q":{"text":"Loved this place! It's a BYOB restaurant, which we didn't known ahead of time, so we stuck","useful":0,"cool":0},"7-dlpQDCjVMOqnfngy2NZw":{"text":"Rather enjoyed this local eatery. In the tourist heavy \"French quarter\" this was a nice ch","useful":0,"cool":0},"iB50XbHm0vL2e1tJQA0Y-w":{"text":"Eat was one of the reasons I gained ten pounds on a recent trip to New Orleans for Jazz Fe","useful":5,"cool":2},"PJU-N8pybcs8z8k6lDvvQg":{"text":"Went here for dinner last night after a long day on our feet. We tried the gazpacho to sta","useful":1,"cool":0},"eGfQ6ps2wnQzO5CyBnSYpw":{"text":"You should try the food and the restaurant is nice. My experience may have just been an is","useful":0,"cool":0},"OUnxwvITyPgLULf3EH0Ebw":{"text":"The food we ordered was delicious.. A few items we wanted were already sold out or they ju","useful":1,"cool":0},"gYAHg4R8Asaz-dNgYNpSig":{"text":"Fig Torte and crab claws were very good. The fried green tomatoes is the reason that EAT i","useful":1,"cool":0},"3DXgsAWPG0pYItz8RLgVVQ":{"text":"For our last night in New Orleans, we decided on this delightful location in the French Qu","useful":1,"cool":0},"kjgVuFqi7hnIYwYO7Su_Uw":{"text":"Comfy cozy feeling of eating at a best friends home with delicious food and great service.","useful":0,"cool":0},"bhhfNsyn3d1-EW3m8M5z2Q":{"text":"Party of four (including two culinary school grads) for Saturday brunch.  Excellent menu. ","useful":0,"cool":0},"RVdwHvJa9Yx2YA3n_RSY4A":{"text":"My relationship was on the rocks. (Yet another pretentious and expensive NOLA restaurant).","useful":1,"cool":0},"PtSPZUsbGgxf0jwUPilROg":{"text":"My girlfriend and I thought it looked a little pricey at first but changed our minds once ","useful":0,"cool":0},"4ysoLp3EBtZyN2bhd8CXJQ":{"text":"Prices were a bit much for the portion size. Overall the shrimp and crab fettuccine and ga","useful":0,"cool":0},"JViOapc0NGAMqaRUvs1lcg":{"text":"We were wandering around Bourbon looking for a decent place to eat and found this aptly na","useful":7,"cool":1},"OrSMKGkUPBfhJvnH92rQ-A":{"text":"Blue cheese and fig torte, served with fresh bread and balsamic reduction may be the best ","useful":0,"cool":0},"IbMZABl4FHSuEPTSkf75mw":{"text":"I have been in town for a conference and asked numerous people for recommendations on a re","useful":3,"cool":0},"91-1gVSq8_S8EHMycum6xg":{"text":"Wonderful place for brunch. The staff members are so friendly and the food is incredible. ","useful":1,"cool":0},"UFNsFRaenD9C43Q9n8WwOw":{"text":"I first tried Eat about one year ago. I was unimpressed then, and after my recent experien","useful":0,"cool":0},"2mVye18Oz9MYqzc2wVg2dg":{"text":"I'll start by saying I am going to eat here every time I come back to New Orleans. Really,","useful":1,"cool":0},"L6CgHxVT8jzoCz54cZ9G9Q":{"text":"On my first night on a recent trip to NOLA, I dined here on the recommendation of, well, Y","useful":3,"cool":1},"BU6R61I_6sYPMj-RgpMsyg":{"text":"EAT indeed! I had the chicken fried chicken with a side of sausage and a ceasar side salad","useful":0,"cool":0},"R0UmyWUVylu0uVzbWV7bug":{"text":"Excellent food quality, nice cozy atmosphere, and nice staff.  What else ya need other tha","useful":1,"cool":1},"H4BUWX_8O0JRkMdQKmHpaQ":{"text":"I was curious to find out what the hype was about.  I ordered dishes recommended by other ","useful":0,"cool":0},"-VbgAouMu1xb2VVU-kPdcA":{"text":"About three years ago, we visited Eat for the first time and it wasn't very good. We'd bee","useful":1,"cool":0},"sRnQikqXeV7im1r1CPNKOQ":{"text":"Food was fresh, interesting and tasted great - what more could you want :) Place is small ","useful":0,"cool":0},"W--JRvBKZ7aO0XS0_Eys-w":{"text":"This place is a hidden gem on the corner of Dauphine and Dumaine. Hands down the best brea","useful":1,"cool":0},"13zEgirI5b2bj51Exn7JYg":{"text":"Poor service of odd, bad food.  I ordered three sides: smothered greens, smashed redskins ","useful":2,"cool":0},"d6DVUYVKykD2NQokkv3fdg":{"text":"We felt they were a little on the expensive side, but they went out of their way to fit us","useful":1,"cool":0},"omiM-fFma6uzsKDIxE6tIQ":{"text":"The food was really tasty and the service was nice and helpful.\nThe first soup we got was ","useful":1,"cool":0},"6xmjaWDBNpfP0ayBCwtVcA":{"text":"The food here was excellent. What a great choice for breakfast! We are stuffed and probabl","useful":3,"cool":1},"vW0vRd5TWJg8XBQak_9duA":{"text":"Came here for brunch yesterday. We arrived just before 11 am and had our pick of tables. S","useful":0,"cool":0},"mA9GCGPhOTfHjF8mGKjVmQ":{"text":"delicious and friendly - trio sampler and BBQ shrimp were amazing - gumbo was the star of ","useful":0,"cool":0},"IVPVfAW6lGCrCl7YT-QtcA":{"text":"I just got into town this afternoon for a first visit and I really wanted to find somethin","useful":0,"cool":0},"uqxHitHX78xKdSnwXcd4xQ":{"text":"I was very underwhelmed with Eat. The place was charming, sure, but the food was not good.","useful":1,"cool":0},"CGTzki8bGtE1GWUx7oE4Pw":{"text":"I just think it's way too expensive!\n\nthe food is ok.  How I put it is that I would come h","useful":0,"cool":0},"le3fP5kKwv8v6h7Oap3x6A":{"text":"I discovered this place from a Trip Advisor review of Le Pavillon Hotel. My husband and I ","useful":2,"cool":0},"nMlLxwr7YaXmfA-j5vzeRQ":{"text":"One of the best \"happenings\" to come out of Katrina -- EAT is a small, casual, delightful ","useful":1,"cool":0},"bEJN68FogIYuX-G1tiHOaA":{"text":"We wandered in here around nine on a Tuesday, starving and exhausted. Eat did not disappoi","useful":1,"cool":0},"pGoqcRJ476syXc4Paomu3A":{"text":"The food here is so. Fucking. Good. I had the crawfish boulettes, red beans and rice with ","useful":1,"cool":0},"Ps9FLauc1XMlHiyHY_JQVA":{"text":"We had dinner here last night and were very pleased.  Alan made 7:00 reservations. It was ","useful":12,"cool":11},"xoGPYj15v9zfNkCwMxsheA":{"text":"I really enjoyed dining here. A real friendly bunch, lively atmosphere without being too l","useful":1,"cool":0},"6SvzUE4vl0zwjTtvj2X7eA":{"text":"Nice and quaint! The wait is a little long but I promise you it was worth the every picayu","useful":1,"cool":0},"Fex6EeIEiQf2Ok0DnM_xAg":{"text":"So, I'm disgusted. I came here and got the shrimp and crab fettuccine. They. Do. Not. Clea","useful":7,"cool":3},"kzU9qFMMY2PocLYx5BVIww":{"text":"I'll echo Alison S. : with all the places to eat (Eat!) in New Orleans, there's some anxie","useful":4,"cool":0},"kT9CWZNI2KFN8b1yITaeow":{"text":"In town for a wedding weekend, and having been to NOLA several times over the years, I'm a","useful":3,"cool":1},"TeYUC1oBkEbOI0JpFW5hcw":{"text":"We thought long and hard where we wanted our last meal in the Quarter to be and everyone w","useful":3,"cool":0},"BCPJrqPsRAkOqsUB1EldGQ":{"text":"Very friendly staff and clean, food was great, the fried chicken livers and chicken gumbo ","useful":1,"cool":0},"ZRGNwuW34ImypyXgQ71_9g":{"text":"This place is pretty neat and has a pleasing menu. However the service is lacking. They're","useful":0,"cool":0},"80DCeMjyvuYRbZ3q8sWKsQ":{"text":"I had the GUMBO and the CRAB CAKES...amazing. I wish this was the first place I went to in","useful":1,"cool":0},"2ImWCJjq35VTiXzSGJujzg":{"text":"Quaint comfort food kind of place. Deviled eggs were on point and the burgers are the way ","useful":1,"cool":0},"e3z3-LKUsSgq7Ykj_1pGIQ":{"text":"I went with a group to Eat over mardi gras weekend and was completely appalled by the lack","useful":0,"cool":0},"KCY7Bw9lP1R_NYSyFBJ6sw":{"text":"My husband and I just ate lunch today at EAT and had a great meal.  Be prepared that if yo","useful":0,"cool":0},"ialJXccKNJDT45VPejKHJQ":{"text":"We went there for brunch on a Saturday. No wait times.  A cute and casual place with frien","useful":1,"cool":0},"HRi2R1T4VZF9rQ1JMWb6QQ":{"text":"grabbed brunch at EAT on the way out of nola.  i had the big breakfast (chicken fried chic","useful":0,"cool":0},"qoLPaQLOKoz0_x7MLkOlag":{"text":"Un restaurant plutôt sympa sur Dumaine, dans lequel on mange assez bien dans une ambiance ","useful":0,"cool":0},"ZrHcFuP-0dyN5Zuu0tWgWg":{"text":"Awesome. Order off the specials. One of the best I have been to in NOLA.  Have been headin","useful":0,"cool":0},"UDJR331rAjbs76ykMZJSLQ":{"text":"Such a fun little New Orleans gem! If you're looking  an authentic meal, minus the \"touris","useful":2,"cool":0},"ng1u8iZb9qKmc1i7crVdog":{"text":"Eh. Good, not amazing. Mac and cheese sucked. Disappointed in food based on reviews.  BUT,","useful":0,"cool":0},"ta-D-L77VM7z3IAKK27OEA":{"text":"We had the special, ( A grilled scallop and bacon sandwich) along with the wild mushroom s","useful":2,"cool":0},"gB7APIvoDaoIT3wm084coQ":{"text":"I rate this place a 3 1/2. It has nice potential but is lacking focus and more sophisticat","useful":0,"cool":0},"t76WNCctotJzIr6Cq3yluQ":{"text":"Byob and huge plates?!  I'm in.\n\nI've only been for brunch but I've devoured everything I'","useful":1,"cool":0},"bF3oDUkjxL_0CMRVzwqtPg":{"text":"I ate at several high end establishments while on my recent trip to New Orleans. This was ","useful":1,"cool":0},"wese4EoL55i1Fj45_aXGOQ":{"text":"This place is a diamond in the rough.  Absolutely loved the ambience.  It was really nice.","useful":3,"cool":1},"kkKFI04R3kMqLHFJBYG3-Q":{"text":"Friendly servers and cute styling. BYOB is a new concept for me so that was interesting. N","useful":0,"cool":0},"OAKRT_0GrHt6fisu0m2BYQ":{"text":"This place is delicious!  Everything is well seasoned and fresh. I had the pork tenderloin","useful":0,"cool":0},"7zNdMJdsK4sPes8x9VNqJw":{"text":"I am vascillating between three and four stars here....I wish there were halves!  The firs","useful":0,"cool":0},"RWNi93J5i9iyp_yf5Yvf9w":{"text":"Conversation with dude from Pepper Palace:\n\nDude: So where are you going for dinner?\n\nMe: ","useful":4,"cool":2},"-XyQK404QQ6ltDfU_ffnvA":{"text":"I would give Eat 5 stars just for the pineapple sorbet, which tasted exactly like fresh, s","useful":2,"cool":0},"ZBmCAVhJDnI20FW-qBHvsw":{"text":"We stumbled upon this restaurant (No, not drinking.) on our last night in NOLA.  Just wish","useful":1,"cool":0},"Q-gAkcUqIj_fvz-WJrJBYQ":{"text":"Loved the ambience of this place, the service was excellent (and the servers were cute, a ","useful":1,"cool":0},"zhy_Otzm_a_J0CygY9r2Ig":{"text":"The food was very good/excellent and the prices were a true bargain, in good part because ","useful":0,"cool":0},"78auLSM0Lwkfu_ZEA4n0RQ":{"text":"Posted earlier from 2 evening's ago dinner. After that decided to go again for lunch yeste","useful":0,"cool":0},"hClN1YrTpIct4jTU6JrR3g":{"text":"Had a very enjoyable dinner here. \n\nMy date loves the fig torte - not my thing, but it sti","useful":0,"cool":0},"wUAIjpv4l5djnDhX9U0JKA":{"text":"So delicious! The food was fresh and amazingly prepared. The service was friendly. It is a","useful":1,"cool":0},"pLnhFJvrSLfHKLXaADKHxw":{"text":"This is ok. Nice lil place to visit to get a different experience then your usual high end","useful":0,"cool":0},"m7nNna2pU4TczJPwV31acg":{"text":"You need to eat here. Best fried green tomatoes ever. Amazing remoulade.  Fruit salad was ","useful":0,"cool":0},"vcghOmdFaIBqzgus8b-D8w":{"text":"We were recently in New Orleans for the weekend and for our last night we decided to try a","useful":1,"cool":0},"4xZHqyt1eXJx-rYKoQxJMw":{"text":"The most atrocious place. Please do not go here. I wanted to eat here , I called in advanc","useful":1,"cool":0},"tw0dpvh9Elj0F8_cY6RuXw":{"text":"My wife and I squeezed in the door 20 minutes before they closed their lunch service. They","useful":1,"cool":0},"Jkc024RTtu6nE4T-_0GYKA":{"text":"my favorite place to eat in NOLA! the food is excellent; they have an amazing brunch menu ","useful":1,"cool":0},"MqWB3KqAobCZYKbTYFILsA":{"text":"EAT might be my favorite moderately-priced restaurant in the French Quarter.  \n\nI've been ","useful":3,"cool":2},"aW1egczRsIWvWjui4cn1Mw":{"text":"Every single item on the menu was a piece of culinary art! Very friendly staff and nice lo","useful":0,"cool":0},"JnJkHFCWej2pUIrUSFKyxQ":{"text":"I was in town on business and met up with a friend who now lives in New Orleans.  She want","useful":1,"cool":0},"x9R7k2c6dYGQYNZe1eyEfQ":{"text":"While strolling the Quarter in an evening supper hunger daze, we searched and asked for pl","useful":5,"cool":5},"KC7AyOyqDE0sr_AKqTEFJg":{"text":"Close to and recommended by our hotel.  The setting was contemporary and light.  Service w","useful":0,"cool":0},"rIaU0ctlpC1oaaTkZgBLJg":{"text":"Friendly tip... Make a reservation!  We are here last night and the food was amazing!  We ","useful":1,"cool":0},"-194NudAuUd5z8AIVSeYMg":{"text":"Our new favorite place to eat breakfast! The fried green tomatoes were awesome! Definitely","useful":2,"cool":0},"a8eRwqyawibHaHAS2xAluQ":{"text":"This was hands down the best meal I had while in New Orleans! The wait staff was very frie","useful":1,"cool":0},"NewWZPcxhWf7M4szbpyTQQ":{"text":"Crawfish pie was one of the absolute best things I've ever eaten. Tasted like a New Orlean","useful":1,"cool":0},"HbW1QggRhuBvzQKHDg2bcg":{"text":"I've been meaning to review this place for the past month but haven't had a chance to. I v","useful":1,"cool":0},"V6NsjiTww6EJ0RlIWjORng":{"text":"We ate at Eat our first night in NOLA. A reservation was made several months in advance be","useful":0,"cool":0},"yB09B0XUEwJa3cmipDIfzQ":{"text":"When I say this is a don't miss spot in NOLA, I mean it. I have been to the French quarter","useful":0,"cool":0},"zJYEfBGGMw3P3zv3ajUW6Q":{"text":"This place is pretty solid.  :)  It's somewhat close to the Mahalia Jackson Theater so wen","useful":0,"cool":0},"YIBm53Ctavf9n2SaX6Hi2g":{"text":"In a town known for delicious food, Eat distinguishes itself by bringing a fresh, modern a","useful":0,"cool":0},"9aXjoLktWx8OBNE9twGh8Q":{"text":"Cool little place in the quarter. The stuffed bell peppers were good as homemade. Nice for","useful":1,"cool":0},"bLcSevklCxsoh2HVNx2Wzw":{"text":"Just walked in and had a delicious breakfast. Very courteous staff who accommodated us for","useful":0,"cool":0},"WOvii3HyMPulKMFnY4reBw":{"text":"last week i wondered if it would be possible to convince Eat to freeze and send me some of","useful":2,"cool":1},"ax-C6uvvEypbNFc9XtGsug":{"text":"Best brunch in the Quarter! Service was super friendly, food was exquisite. I got special ","useful":0,"cool":0},"laFmv8oanJYSGOXY130Y-Q":{"text":"As far as I'm concerned, whoever invented brunch is worthy of the Nobel Peace Prize. Mind ","useful":4,"cool":0},"7jy0J_ko5eMv_H5FbwlwBQ":{"text":"I am so glad that I ventured away from the debauchery of Bourbon Street and found this pla","useful":0,"cool":0},"97wGD1X-K-SFsA4NtjdHcg":{"text":"I ate here the first day of our arrival over Labor Day weekend. I ordered a special that m","useful":1,"cool":0},"CTxfDUFfzNxZhBpV2BJX7g":{"text":"I've never been disappointed here.  Delicious meals, intimate but not pretentious, and a v","useful":0,"cool":0},"WOSW5Ypz9yJ3vw9E0612qw":{"text":"Service was good. Food was okay. We got the blackened fish with Mac and cheese and asparag","useful":0,"cool":0},"8vraH3yExfpR-twHREJfqw":{"text":"The food was delicious. We got a fried green tomato appetizer and the chicken fried chicke","useful":0,"cool":0},"c4ZUEUl6STtwkFJRuO6KgQ":{"text":"This place is great if you want to waste money. You come to New Oleans to eat hot Cajun fo","useful":0,"cool":0},"mnASl-KJgOUtTYPhj8BAHg":{"text":"Yikes! Not sure how this place ever got 4 stars. Hope I can help even this out a little. F","useful":1,"cool":1},"oculLm8b3gJl8EySuoh3xQ":{"text":"eat here. So far I've had the BLT, the burger, the flatiron steak, and well...I don't reme","useful":0,"cool":0},"XjLixHVYCzYSFEyyVU6Ivg":{"text":"We went a couple times while in town.   Good but inconsistent:  from \"oh that's not ready ","useful":0,"cool":0},"3sf3LgkQ4k2dFpQGgmy0pQ":{"text":"Eat continues to amaze.  Have been there for brunch several times over the years and it ne","useful":0,"cool":0},"rYPSvyE0F8K7J00JPyzujQ":{"text":"Meh. It was alright. I wanted to try this place out since it has really good reviews here,","useful":2,"cool":0},"4moRoW6-y1qkJ-lwlHHuhQ":{"text":"This place was very elegant and delish! We were actually referred to by a bartender named ","useful":0,"cool":0},"t-0_1Y5gzKqzoXBoRCUeVg":{"text":"My wife gives it a 5. She had a salmon nightly special and loved it along with fried green","useful":2,"cool":0},"KOJpB_MBkjbKf8iOyLBgQA":{"text":"Fantastic place to get your crawfish ettoufee fix.\n\nGreat white table cloth restaurant in ","useful":1,"cool":0},"xfdADQahcwFsPFDgxuBQ7g":{"text":"In town had to go\nHad the special lamb chops-OMG  unbelievable.  The wine sauce was velvet","useful":1,"cool":1},"xWOVsLmkFexBgi5LQF6bpQ":{"text":"Amazing restaurant, food, staff, and price. I have eaten here several times now and been m","useful":2,"cool":0},"tP1hFOZELFojDL3Z3D02iw":{"text":"Excellent brunch place. \nConsistent high quality food and service. \nWe've been there 5 tim","useful":1,"cool":0},"TbjZzaMCmrz_QfkvJfU5lw":{"text":"Had dinner last night and find this restaurant a nice change from other nola restaurants. ","useful":0,"cool":1},"jNUzsjfXxmXDM_WnW0t0ig":{"text":"Absolutely amazing breakfast. . A bit pricey but well worth it.. I come here every time wh","useful":5,"cool":1},"eS5z1zhrUAraTlgd3kqNog":{"text":"This place is a true gem. Great service... One of the best meals of my life. Fried chicken","useful":1,"cool":0},"YKljq4A6XgetEJDJrNo3JQ":{"text":"Service was a tad slow however Super friendly.   Food was good.  We were over the moon wit","useful":0,"cool":0},"yxn7YXuOmTSP6oyvn9hUZA":{"text":"This place is truly delicious! They don't serve alcohol but that wasn't an issue. There wa","useful":2,"cool":0},"_inFJSisc0p4q3IUSw9M2g":{"text":"EAT was a nice treat while we were in NOLA for the 2008 Voodoo Music Fest.  Maxx, our wait","useful":0,"cool":0},"1RNqlvwOXUw458da_dC-1A":{"text":"Eat is worth the wait. We started off with the blue cheese and fig torte which was so tast","useful":1,"cool":0},"NciJhiunFsGSUqvltgWNMg":{"text":"Food was ok, service was slow, kind of an eclectic menu not good if you have a picky eater","useful":0,"cool":0},"fLh4RJQmkn5pf60HgmIWqw":{"text":"Staff is great but food is kinda greasy, overbearing, and a little overpriced. I guess its","useful":0,"cool":0},"aPqudt3VRxQDSaA4hRlkBg":{"text":"Quaint little restaurant in the French Quarter. The prices were reasonable and the selecti","useful":3,"cool":0},"zO_4wx36KTL9PNqSdyRYQA":{"text":"We found this place on a gorgeous Sunday as we were biking around the French Quarter.  It ","useful":0,"cool":1},"3YFCPsnwUc7fI7mBiXCg-w":{"text":"Small & hip but not cliché.   It's b.y.o.b. but they do not charge you a corking fee for t","useful":1,"cool":0},"50lWk0vYOKPP7WSJ-f2xvg":{"text":"We went there for brunch on the morning of Bastille day after the run with the bulls.   If","useful":1,"cool":1},"oeVksBKTr_9ihHYp1MrrFQ":{"text":"The ambiente in this restaurant was from start to end awesome. We had a funny and friendly","useful":0,"cool":0},"rMfpGWfv0VuL8p3z8wwrNg":{"text":"It was just a few days after Hurricane Isaac passed through New Orleans. My party of four ","useful":4,"cool":0},"TtrvHpFmRRyDOoV2JyiRDA":{"text":"Best food we had all week. Banana Frit's were a solid addition. All 4 of us ordered someth","useful":1,"cool":0},"GdhqVLA3i4RkDXaIZqYkrw":{"text":"Honestly i enjoyed the small house feeling and the decor of the place very much. Then to t","useful":1,"cool":0},"u7PSw8d1md_1fCon-5mlAA":{"text":"Went for brunch.  Had the White Cheddar Frittata.  Was good, except there was half a cup o","useful":0,"cool":0},"FqwkPOeYPrCdVtb56DdrfQ":{"text":"One of my favorite NOLA spots.  \nGet the fried green tomatoes, I can eat the whole thing b","useful":4,"cool":1},"kgkkaPQdrfQdyodBx-kZug":{"text":"Everything at this restaurant was top notch.  The servers were helpful and kind and didn't","useful":1,"cool":1},"JJLRpr5RKmvXpwHASwnPgw":{"text":"We love this place. Fresh quality, wonderful service, good atmosphere. They never disappoi","useful":0,"cool":0},"Hx2OZ4YuWgEZwkqHWjtzLw":{"text":"Crawfish Boullettes: just ok. Nothing special. A bit salty.\nChicken dumpling:  excellent. ","useful":1,"cool":0},"zbPIOMFRP8S5yN5CWoZ6jw":{"text":"I have to give major props to our B&B innkeeper for recommending this quiet, unassuming li","useful":1,"cool":2},"WiCYyqeEec__DFLtV0TrUw":{"text":"The best restaurant we have been in New Orleans. Not expensive, and a great bang for the b","useful":1,"cool":0},"ymntNcUd3BcGvH7r9iSmUA":{"text":"Everything our table had was delicious. The cochon was juicy and flavorful and the fresh s","useful":1,"cool":0},"xOkSZ8BARHIQMH0Gg2OKMg":{"text":"Are you kidding me with this place??? \nFirst time eating there. \nI'm a huge Morrissey fan,","useful":3,"cool":2},"ivqYOTxnfPNomZzcBnU6Xg":{"text":"I'm embarrassed to say that, as a consummate New Orleans foodie, I just went to Eat for th","useful":2,"cool":0},"9-PcGcBF4x1OeIulW6sgxg":{"text":"Loved the food here.  I had the crawfish pie and fried green tomatoes.  My friend had the ","useful":0,"cool":0},"vT9wWJK1Qwbc6AJmOjN5dQ":{"text":"Incredible gourmet southern food in the French Quarter. Sophisticated haunt for foodies-- ","useful":1,"cool":0},"yb9o9n6kCu0x5H9kmFSVyQ":{"text":"my favorite type of place, very artsy, clean lines, tucked away but close to the french qu","useful":0,"cool":1},"N2XNPpTALxu7jwDhAUU-Xw":{"text":"The food was delicious. I had the eggs benedict for brunch. The service was a little slow ","useful":1,"cool":1},"lGMlSeLrZcrDbBr4oLcMwQ":{"text":"This is one of my favorite restaurants in New Orleans.   The fig and blue cheese, the frie","useful":2,"cool":0},"EfkzSyQuTKzaaYT9ueytmg":{"text":"Always good, and rarely busy. It's a go-to for me if we're looking to dine the FQ without ","useful":1,"cool":0},"cpOs6C_0hwX6je4FpCnKCA":{"text":"A search of local breakfast places turned up EAT. The menu sounded really good, and the pr","useful":0,"cool":0},"43EBjNIGUbXMsokd-P_liQ":{"text":"Been here 3 times over the past 2 years and it doesn't let me down. Great steak, others go","useful":1,"cool":0},"WVDbPzROoUzewetVuRMcVg":{"text":"really underwhelming unfortunately. We had dinner there, smoked BBQ ribs which were the be","useful":1,"cool":0},"mvL-sQiZu9AwgsJFQcMBQQ":{"text":"I love going here for breakfast; it still gets 5 stars for breakfast, but dinner was a 3 s","useful":2,"cool":0},"CcuNFA7EfhajzJHdKxT2Fw":{"text":"I love giving 5 Stars when they are deserved! I also only give them for the portion of my ","useful":1,"cool":0},"1lhHjxaJnnVo1gyKu3aJpw":{"text":"Blue cheese and fig torte.... gooooooood!!","useful":1,"cool":0},"PuoPWRXzHx0nWBflUQ4qpg":{"text":"This was my wife and my favorite place that we tried over Easter weekend.  I got the trio ","useful":0,"cool":0},"9xgnpMqrR5Zialcf3vMAHw":{"text":"After a long day of walking around, we spotted Eat and thought it would be a good place to","useful":0,"cool":0},"fgraxLh6AJCKLs4UqPNe5g":{"text":"Great food!! We had the soft shell crabs and chicken and dumplings.  Perfection in the mou","useful":1,"cool":0},"XiKCL3QSt5Zs_FHLDKZmjg":{"text":"We looked forward to eating here when we were planning our trip to NOLA based on the revie","useful":0,"cool":0},"r3JsCil1R9D0fWFydhf_dQ":{"text":"Love this place! Very welcoming and great service! Food is great! One of the best gumbos I","useful":0,"cool":0},"klBpqHS73JaB1mc2EZsClg":{"text":"Casual eating, the menu is small but the food is great.  Daily specials.  This restaraunt ","useful":0,"cool":0},"AVR538uetEM8mf6rtzs2QA":{"text":"This is a cute little breakfast/lunch restaurant with outstanding Southern/Cajun food. The","useful":1,"cool":0},"mKC0LAQnNaSleVz6eyG8Ng":{"text":"Was just okay. Nothing special. Had the blackened catfish, asparagus and baked Mac and che","useful":0,"cool":0},"eclcLVqvVYiXvWsbK0cNwQ":{"text":"DO NOT GO FOR LUNCH! They are so slow. We took over an hour and a half and I didn't even g","useful":0,"cool":0},"IjMx8hTSHAoo3ez00edrqg":{"text":"We had the fig & blue cheese tart as a starter. It was delicious but not at all what we we","useful":0,"cool":0},"czt4zIp_weL-bd0ROrIiTw":{"text":"this was one of the best meals we had while in New Orleans.  We shared a series of appetiz","useful":1,"cool":0},"7CO0hDQ4vycxMKVg90YJzA":{"text":"Oh man.  I came here for brunch with the ladies since it was right down the street from ou","useful":2,"cool":1},"ijpfbkyxxTUpA-cQNz2FJg":{"text":"I really wanted to love this place. I really did. Really. The restaurant itself was adorab","useful":1,"cool":0},"sk1jVSAdPIwHhlC5uz2Jvg":{"text":"On a recent visit back to my former home in New Orleans, Eat was one of the surprise highl","useful":0,"cool":0},"evQSdI50pAZhv3cbzWXCxg":{"text":"The food is fine.*\n\nNot if you have to wait 40 minutes for it. \n\nWithout an apology or exp","useful":1,"cool":0},"RKjkShRG1qR_ftQ29bAJwg":{"text":"This place must have the best grits in the south. I seriously never had better grits. We h","useful":1,"cool":0},"koQycSrdz3jCf3yDYRbaOA":{"text":"I had lunch here with my wife and we were very impressed.  The food is very good, made wit","useful":1,"cool":0},"MSeZ2NJdyB73TJr0yLWmoQ":{"text":"Very good food and great atmosphere, the crawfish pie very good. Will be back.","useful":0,"cool":0},"tWJqYlpcxCeRr0dSnn4XEQ":{"text":"After reading the great reviews on Yelp I was ready to really like this place! It's in a c","useful":1,"cool":0},"dDiRGEsZodxmZasOY6yLnw":{"text":"Kinda disappointing. Wasnt what i expected. They ran out of rice so gumbo wasn't same. Cra","useful":0,"cool":0},"mBLIdjL2Rn_xYP7pyeTHRQ":{"text":"I got a kick out of the simplicity of the name here. I had a funny visual of a highway sig","useful":2,"cool":0},"cwVga2ygkdz4FsuN6y-ruA":{"text":"This place was really good. I had ribs and mac and cheese which were very good and my fian","useful":1,"cool":0},"X0TloiVekHQC-fuaG_vqzw":{"text":"Food was great we got there as they unlocked the door service was good and waiter gave us ","useful":0,"cool":0},"b6ZfBjn1oKPf8afu_hhXHQ":{"text":"The staff was courteous and accommodating to our party of 8. They worked so hard in spite ","useful":0,"cool":0},"vJuwP3CV6AxeY3-wEoILjw":{"text":"Wenn man genug von Fastfood und Snacks hat, so sollte man einen Abstecher ins Eat wagen. D","useful":0,"cool":0},"-ZK5psY1lV3UP2xYo4zzsw":{"text":"Just returned from a nice brunch at Eat, the food was good, particularly the fresh fruit, ","useful":1,"cool":0},"IKnqZEQPw6azDTYDzKMZ0A":{"text":"As a Quarter resident have been for lunch periodically and always enjoyed the food but lat","useful":0,"cool":0},"05Madgm0JufRuPR9dp-nOg":{"text":"My friend was told this place was really good, so we tried it one evening for dinner. The ","useful":0,"cool":0},"TfKE1oghZ3UyV9z3v3uYQg":{"text":"The restaurant was a little surprising and the food was very yummy! The waitstaff was a li","useful":0,"cool":0},"zxQNv6OZbiK8qkPbFgz40Q":{"text":"We couldn't decide on an entree so we made a dinner out of 5 delicious sides. It's a great","useful":0,"cool":0},"2gWvj9Ww0E96c2iBoHEU_g":{"text":"Always amazing food and service. Love love. The staff the food the location and always lea","useful":1,"cool":1},"F4yceSrCZxcT8lfXErozgw":{"text":"The food was very good but not extraordinary. The ambience was fun and interesting while c","useful":0,"cool":0},"EH1sqwaufW8Z7l6imTR0jQ":{"text":"I dropped by today because this restaurant was on a list of restaurants that qualify for m","useful":2,"cool":1},"zuMBdvdjqLmAAJ57Agvc7g":{"text":"Definitely a must stop in New Orleans! I had the couchon and mustard greens with fried gre","useful":0,"cool":1},"C0uhESkwyY64NfQ8p_F8DQ":{"text":"WOW! I came here before and absolutely loved it. I recommended it to everyone. I came agai","useful":1,"cool":0},"sOja0SWSW3FLsE3pvgLw6A":{"text":"Fantastic place. Please, PLEASE order the Brussels sprouts. They were fantastic. I woke up","useful":0,"cool":0},"iMPcxSVpGJFfUsGuYj0Ipw":{"text":"Something bad has happened to this restaurant. Perhaps we should have been tipped off as t","useful":0,"cool":0},"ba5KDwtPOfkgbCKI029Cqw":{"text":"Well I'll keep it short and sweet since this will only put a scratch into the many positiv","useful":2,"cool":0},"ikWy9Yciu4rA97O7vwakpA":{"text":"Tucked a little off the beaten path in the French Quarter, this spot has a hipster ambianc","useful":2,"cool":0},"NHzP6tU6AyRUDwlqkhI-dg":{"text":"Grabbed a quick breakfast here and couldn't ask for a better experience. Friendly staff, g","useful":0,"cool":0},"53VTij5O2Xxidtd62yy6Hg":{"text":"Great food, good atmosphere and polite and courteous staff. The only hang up is they don't","useful":0,"cool":0},"8T9MV5sazMlAsuIJ0pLVyA":{"text":"Just had Saturday Brunch at Eat and it was amazing!! Started with fried chicken livers and","useful":1,"cool":0},"v6jA_KygTr23W9-unLA4gg":{"text":"This is our second visit to EAT. The food and service was so good we had to come back. Wel","useful":1,"cool":0},"1VDG1dW2HEaR7vDk4YAuxA":{"text":"BEST dinner I had during my week-long trip to New Orleans, hands down! Started with a smal","useful":2,"cool":0},"QLLfk5TV9QYccUYFMexHGQ":{"text":"Good news - there was no wait. But now I know why. Food was was too expensive for the qual","useful":0,"cool":0},"PW40NkaYiLo96mF1jZnyXA":{"text":"Omg ...Where do I start as a local I always have my reservations about certain restaurants","useful":0,"cool":0},"2oGASqKAW_YnIXrYyzhhMw":{"text":"This place was quite underwhelming. The good reviews made me expect something better. Ther","useful":0,"cool":0},"-vx-L1mJZZ-aImZAqaTrcA":{"text":"Awful service. Worst I've ever had maybe. Pretty good food but our waiter clearly had a lo","useful":2,"cool":0},"BcE9EP1FZGJiEOmyU6-A2g":{"text":"Yes this place taste real real Gooood! My first meal in New Orleans and it did not disappo","useful":1,"cool":0},"Uboa__tcYNJ5l3CyAyxr2A":{"text":"Stopped by for Friday lunch. The parking was surprisingly easy. I saw numerous spots avail","useful":7,"cool":1},"Tj0XYGBrIvqAXogMsE0gEA":{"text":"Overall, this was my favorite meal in New Orleans. It represents a version of contemporary","useful":3,"cool":1},"PuCstYh7iN-OQzDA_iWU_w":{"text":"If you like taking two hour lunch breaks, this is the place for you! Such slow service and","useful":1,"cool":0},"2VXkHD85oOlO4_vgn2IHYw":{"text":"Waited nearly 2 hours only to be told the kitchen was out of food. The table before us wer","useful":1,"cool":0},"dze0fjDF888M3Os-dCGi8A":{"text":"My husband and I came to eat on vacation and we liked it so much that we came back for ano","useful":0,"cool":0},"4lOegsfcZBiXB-7wjIaD4w":{"text":"After reading some reviews in different blogs, I decided to try this famous restaurant for","useful":0,"cool":0},"LXfTHhR-B8zDK4lJiJUUmw":{"text":"Came here this morning for a super quick breakfast before a tour. I had the grit bowl with","useful":1,"cool":1},"QpprUGkt_r7KQYseqjyswg":{"text":"Note: There is no alcohol served, but it's BYOB - everyone brought a bottle(s) of champagn","useful":8,"cool":0},"2LgiMntbp5Vrr3voMGG-0Q":{"text":"This place is soooo delicious. We had the chicken livers and deviled eggs for appetizer.  ","useful":0,"cool":0},"KmU0Bo7PT8SPRKq5MOdyQw":{"text":"Well now (late December) is the time for \"best-of\" lists, and if I had to make a \"best mea","useful":5,"cool":5},"ApxJqF03SEVPAJQ9PtDD0A":{"text":"So happy I found this restaurant! I'm in New Orleans during an incredibly busy time and wa","useful":2,"cool":0},"VtJxgdIsZbftVkItCUTW5w":{"text":"Best Ley Lime Pie ever!  All the rest of the food was delicious too and the services was g","useful":0,"cool":0},"6PnYodabDxoyhasFjZB4hg":{"text":"This place has won the best meal on my weekend trip to New Orleans. To be honest, I didn't","useful":2,"cool":1},"fei0NKGbRFqElsTLCuTd3Q":{"text":"Close to our hotel, no really high expectations but the fish with asparagus we had was per","useful":0,"cool":0},"42BEEzwe7huVBsqxuc44Zw":{"text":"This restaurant has come a long way since it opened as a new concept from its progenitor, ","useful":0,"cool":0},"X81EPZLnRVOXszECEEkB_Q":{"text":"Splendid!! 2/2 on an excellent visit! The peach pancakes were amazing! The crab cake egg B","useful":1,"cool":0},"R1VMxjkUEHmQCbRiNcQzgw":{"text":"We had a reservation for 8 people at 7pm last night (5/21/19).  The dining room was full w","useful":0,"cool":0},"AUOrV4_KlO9SbzimdhPImA":{"text":"This place reminds me of a place at the CAMP in Costa Mesa, CA.  Very hipster/trendy like.","useful":2,"cool":2},"XjbXXGw2Yk7hBeDqL7kQJA":{"text":"My husband and I stumbled upon this place for dinner on our last night in NOLA and I'm so ","useful":0,"cool":0},"gSSXiEUnlsxj6dfmLwAaWA":{"text":"This was without a doubt my best meal during my stay in New Orleans. Pricey? Sort of. Wort","useful":1,"cool":0},"4TQuTZEGMYyfaUibl6Dkhw":{"text":"This past Sunday, I got to experience for the first time Eat Restaurant in downtown New Or","useful":0,"cool":0},"033CMaxqFOOIcP9DQaZjGw":{"text":"If you're looking for a pleasant brunch place, Eat New Orleans is not too bad. I ordered t","useful":0,"cool":0},"BaWFVFQH5jyTa6zPblOEpQ":{"text":"EAT, a rather simple name for a restaurant.  It's kind of like naming a hospital, LIVE or ","useful":1,"cool":0},"Tg5eQnXWWCjlJTzbp-Uqsw":{"text":"Good casual restaurant with good service and a pleasant environment.  You may have to wait","useful":1,"cool":0},"3R2M-IMpAMBhaSMjXK0dZg":{"text":"Food was good but service was lacking. I'm not sure if server was overwhelmed or not. Upon","useful":0,"cool":0},"76uUf-xBOzVVbQZhCO0vQQ":{"text":"This was our first stop in New Orleans and after the 8 hour drive we were all starving, mo","useful":4,"cool":1},"-SosoNJx3WrSssAgxEq80Q":{"text":"Red Dress Run day is a day that starts early, and goes long...with much drinking and debau","useful":4,"cool":1},"LuQeE6fJpXlH2iQ-XQavAw":{"text":"Cutest restaurant ever!\n\nHubbs and I came here for brunch as soon as it opened. God damn w","useful":2,"cool":1},"Ykt9QEinFoz5L61yBRYCgA":{"text":"Sometimes surprises can come in the form of the unexpected.  My sister, Catherine decided ","useful":0,"cool":0},"P5dCJbX3MhFeDFIZdIODUw":{"text":"Another rock solid place to eat in the quarter. \nRecommended by our last stop Spit Fire Co","useful":0,"cool":0},"3EQXOzI3nLBjyBFpbMtvAQ":{"text":"First stop on my trip... \n\nThis is a cute laid back spot in the French quarter. It's away ","useful":1,"cool":0},"8mDoeMoMvh01x6aN0YEzcA":{"text":"Food: Yum!!! We both got the prix fixe, which means you choose a starter, 1 sides, a main,","useful":1,"cool":0},"tJVXBXpnXqKM2l9bCDFkYQ":{"text":"Great fresh food! Blackened catfish and grilled asparagus was outstanding. Gumbo was terri","useful":0,"cool":0},"bA4qD2NZiS4nyJ6dr5sRKg":{"text":"The watermelon salad was good . The fig torte was good . The house veggie burger was good ","useful":0,"cool":0},"a71tuOgVPBQDdtk-VWjchQ":{"text":"Decent enough food, but I was underwhelmed by the gumbo and the stuffed pepper, while deli","useful":1,"cool":1},"GD7FQrqwPFBS2sYOoaKM1A":{"text":"OVERRATED! OVERPRICED!OVERCOOKED!....We were here for a conferance and went to this place ","useful":0,"cool":0},"ZwF8lJZ4TB24_ngAa5ylSA":{"text":"I came here for lunch on a Friday. The place was cute spot on the corner - clean and nicel","useful":1,"cool":0},"8f3xloGA8k0dk4e6ckuI_g":{"text":"We were the first people into the restaurant. It took almost 30 minutes to get our order c","useful":1,"cool":0},"Zq1f-d-RZJqZk0gud8dQUw":{"text":"Went there last night with a group of 7 co-workers.  I was concerned that a large party mi","useful":1,"cool":0},"TfPtefUaK5ehSpG3mPwhtA":{"text":"A favorite for years. Every time I have the pleasure of eating here it's always better tha","useful":1,"cool":1},"PVGJKlVvJE2K9XeVTI1opQ":{"text":"~I'm basing my review on their brunch menu~\nWe were a party of four and overall, the food ","useful":13,"cool":15},"puave-6GfloXtM56-j7KhA":{"text":"Quaint!! Homey! Delicious, feel good food with a bohemian and earthy flair. Very clean and","useful":1,"cool":0},"QzKg_YozG-qyuq_-K6RpXQ":{"text":"Excellent breakfast yesterday  (Friday) , started with Winnie's Crawfish Bisque with  stuf","useful":2,"cool":2},"R-g7O2grEvSOQlacIMRpSw":{"text":"I went here for dinner with some friends and had a great experience. I got the roasted stu","useful":4,"cool":1},"H834EWBQLFTVSkQZWBp7xA":{"text":"Our server was so rude we left before he even got drinks. He didn't say a single word to u","useful":1,"cool":0},"37rI3R4koKSe6DUOizxzJQ":{"text":"Eat takes southern, cajun, and creole cuisine and does simple, elegant, and delicious vari","useful":3,"cool":1},"QsSyVNMHLgMQO6QqA7hVcQ":{"text":"Kind of a hidden gem in the quarter. Weekend brunch is always fun.  At dinner  pay attenti","useful":0,"cool":0},"yBstycmxBzQyKScYrRBzbA":{"text":"Eh. Just eh. The food was good, but it wasn't anything special.\n\nI just got eggs, toast, b","useful":0,"cool":0},"vy6ppSLayNV8Vv03_bkIKg":{"text":"A very good French Quarter neighborhood Bistro is the best discrimination of EAT. Small, b","useful":2,"cool":2},"FIEr5JU7RJlJ-l6rBLTmZA":{"text":"It took over an hour to get our food and most of it was under cooked and under seasoned. W","useful":0,"cool":0},"XUkzcFz1bScJOoJXFPZvJg":{"text":"My bestfriend surprised me by picking me up and bringing me here. First off, I'm not a big","useful":3,"cool":1},"1igjafiC9e7ie7O1y4A3Rg":{"text":"Five of us had a great dinner here.  Lovely interior, nice staff (though the need to staff","useful":1,"cool":0},"z-5IhMNAG0ZeADDV4QxbHQ":{"text":"This was pre covid I visited. It was my first brunch in New Orleans. My friend and I were ","useful":1,"cool":0},"kkViEVi_hxvlJiZtkFhDKg":{"text":"EAT.\n\nAh...what a creative name...(NOT). It actually makes me wonder if the owner (or co-o","useful":16,"cool":15},"Vg-F6i4zA1fWewftPRNWag":{"text":"Wow. First off, more than half the menu was crossed off. My partner and I are not picky pe","useful":3,"cool":0},"gjTd9MFeYocNzFL8EU4z-g":{"text":"Hidden gem, food was great, service was great. Food came out quickly, you almost feel like","useful":1,"cool":0},"eyFXtc_oN3lbx57k5zw5aA":{"text":"This place must have changed hands. After 2 horrible meals, we will not be back. The good ","useful":2,"cool":0},"SsA5vbIyd0B5oPQ27h7gnw":{"text":"This was my first meal in N.O. and we couldn't have picked better.  Sat brunch, I got the ","useful":1,"cool":0},"QKI02UWiupTgXoUXbT0azg":{"text":"We waited 20 minutes for our table. The food was great. It was my first time eating Cochon","useful":1,"cool":0},"0801PP0VbNDs0YsTSpFYoA":{"text":"I cannot say enough about this place. I made reservations for my friend's bachelorette par","useful":2,"cool":2},"uzM00kBWG4opqwPqPuNl-A":{"text":"Wow what an amazing brunch in the French quarter a real local place doing some amazing thi","useful":0,"cool":0},"RJdCLL4jhYTj46OKJAmJrA":{"text":"I've been dying to try this place in the quite, cute little part of the quarter so luckily","useful":1,"cool":0},"M4n3ErW0znix0BJd-59P1Q":{"text":"So far I've only ordered.  But I can tell by the smell these Fried green tomatoes about to","useful":1,"cool":0},"lRUvCMAM-I9z5VOsNwiamQ":{"text":"Although this restaurant had really good reviews, I found it to be very lack luster for th","useful":1,"cool":0},"byXmujSubaCQ68hDGhWUUQ":{"text":"I'm so glad I came here. The location was a little  sketchy but restaurant is pretty. The ","useful":1,"cool":0},"bJcs_l4J2u7ihm0uKNahnA":{"text":"Amazing place. Great little spot. My husband actually found this.place on Google and we th","useful":0,"cool":0},"3vsv4I8LIRTDyY7Z8MMNDg":{"text":"Had to have something crayfish when I was in New Orleans. Found it at this great little bi","useful":1,"cool":0},"5Wx5AHg6MbwQCtBen33-8A":{"text":"Visiting Nola and wanted some place off the beaten path that locals love.  EAT was recomme","useful":1,"cool":0},"57Q3hs9vIyBuwYQYzgMvQg":{"text":"I had great biscuits and gravy here. The gravy was awesome! Menu was a little limited, but","useful":1,"cool":0},"gw_jgsqgbjI8BlhAT6zxUQ":{"text":"Yelpers didn't steer me wrong. Loved the eggs dauphine! The fried green tomatoes were cris","useful":2,"cool":0},"YiBpDOV3S1DnWO6e2G4EEQ":{"text":"We had our anniversary dinner here our first night in NOLA. The atmosphere is very cute an","useful":1,"cool":0},"WuXDQ2XDuyJD3CDDGPv2oQ":{"text":"My favorite restaurant the last time we visited NOLA. I came back twice! The gumbo is noth","useful":1,"cool":0},"ADrIZngT0vi7g19eq2DuBg":{"text":"This place is off the beaten path in a quiet neighborhood.  Employees are upbeat and effic","useful":0,"cool":0},"XbbVtjf3h4LbXZwazyewIA":{"text":"This place was a chilled New Orlean scene! But the food was wild! I mean that in a very go","useful":0,"cool":0},"2_wcfAQkcqEYUAfcnYAcHw":{"text":"This place served us some of the best food we had in NOLA during our four days in town. Gr","useful":1,"cool":0},"btuLUWRGE90_HK6zfAFqPw":{"text":"Skip this place. Judging by prior reviews it must have been good at one time. The food was","useful":0,"cool":0},"G_6OLdPLnaeRqJXHdp0l8A":{"text":"Food isn't amazing, but could be worse. Good selection if you're looking for non-seafood c","useful":0,"cool":0},"A91ZCUgBqwm5kYknPGcxwg":{"text":"Tucked away on a quiet corner in a residential area of the French Quarter is a small gem o","useful":3,"cool":2},"98-9mSeCvBgAjd4XoQF9Yg":{"text":"I wish there was a place like this in the Bay Area!\n\n- Cute and casual ambiance.\n- Had a 3","useful":2,"cool":1},"y7bFoFsMxcEya4VqdP9plQ":{"text":"My boyfriend and I had the best brunch I have ever eaten.  We started off with amazing spi","useful":2,"cool":0},"DZlYnq2hdMi19lJzgcAAJA":{"text":"Crawfish pie not good.  Was cold and looked and tasted badly. Got a replacement of stuffed","useful":1,"cool":0},"AIZtdMqbOA3rg2dewcM2bA":{"text":"i am always on a search for the latest and greatest.  \nand thus, when i had the task assig","useful":1,"cool":1},"dd0RuvUSrhYrAtidPDkwQA":{"text":"Great restaurant.  Good food and service.  Took a little while to get food but everything ","useful":1,"cool":0},"c8-Pi-zMjaErTIkq-pMakQ":{"text":"Kind of a fancy pants looking spot, but when we walked in and heard some great 80's new wa","useful":20,"cool":16},"FVk1txwLEBsNBrqdanCCsA":{"text":"This was the first restaurant we ate at in New Orleans so it was our first taste of local ","useful":3,"cool":2},"S445FOhv9aC5FhATNXqD1w":{"text":"Going to Eat New Orleans was something that i told my friends we MUST do..i had read all a","useful":3,"cool":1},"kSxM3ID1A3DyVmI2UMfQJQ":{"text":"I just ordered from here through Uber Eats and it was amazing! Planning on having leftover","useful":4,"cool":2},"u6wlIxHz5LnFUFGeINqfxw":{"text":"Everyone that visits NOLA must go to EAT.  This was my second time there and it did not di","useful":2,"cool":1},"Q5zjXwWsbwhopw4FyH8ICw":{"text":"On a Saturday night when every restaurant had a wait, we did a \"Yelp-Nearby\" search and we","useful":1,"cool":0},"uViacxuCoN_cNBvMruv4ug":{"text":"This was one of he best meals I had when I went to New Orleans. The place is unassuming, l","useful":2,"cool":1},"nLKSKr3mV4Qax9543FAvfw":{"text":"Great place for brunch that is BYOB! They're located next to some liquor stores for you to","useful":0,"cool":1},"GXTJacWvT99sxvK3Y2Zw5g":{"text":"After not really liking the Cochon and Greens (lacked flavor), I asked for something else.","useful":0,"cool":0},"NZkcfM_EfmyUz40z0nV3IQ":{"text":"We came here before heading to the Warriors game last Friday and had a nice dinner. I woul","useful":7,"cool":6},"16TtsVdDopA_ItYdn7ZQUg":{"text":"YUM.  Super cozy atmosphere, delicious food, friendly and attentive server.  The fried gre","useful":2,"cool":0},"EfOhravLdfHUkAmtXjUm_w":{"text":"This may be the best breakfast in New Orleans. I'm kind of stuck on the Eggs Cochon, a del","useful":4,"cool":2},"KBKmG4-fldqNn1gNEA01hg":{"text":"I happened upon this restaurant because of Yelp. It was near where I was hanging out, and ","useful":0,"cool":1},"-WTZNyaEiqVlAaWaE16viw":{"text":"Came for dinner when it opened.  Great food.   Excellent service.   Worth waiting for.   F","useful":0,"cool":0},"O2EvV1ksaafXWbaJBlxfEg":{"text":"Great food and a fun atmosphere for brunch. We were encouraged to grab bloody's up the str","useful":2,"cool":1},"fhKrNFlEGdm2nNAg7oB39Q":{"text":"Off the beaten path, yet still accessible. A cute little converted house with great servic","useful":2,"cool":2},"F2Z9YLlxwAFr-9mLISdmjw":{"text":"Excellent and unique food near the French Quarter.  Lovely atmosphere and good service.  W","useful":0,"cool":0},"hA7HISRyGyvt4RO-4_HJpw":{"text":"My wife had the 'chicken and dumplings' which turned out to be chicken pan pie and 'macaro","useful":0,"cool":0},"F0pFcMonpA2c2eorG41Dmg":{"text":"I was so glad that we discovered this place while we are in NOLA for a long weekend. \n\nAs ","useful":3,"cool":1},"J0c64YADAOA9bwjQ7qniIg":{"text":"I liked it.  Good food.  Interesting but accessible menu.  Good service. Comfortable atmos","useful":3,"cool":1},"8TcthkRtR6uXM3KZyB3o9Q":{"text":"i don't know cajun or creole from adam, but i do love the food here.\n\nfor couples, i recom","useful":0,"cool":0},"gEMcpszwpFRLrWGee3NabA":{"text":"I love this place. The decor is cute and charming. Staff is friendly and the food is just ","useful":1,"cool":0},"gbaTvGAZVw6ORNHN66XgKg":{"text":"We arrived at 6:30 on a Thurs night and had no wait. It's BYOB but we weren't drinking tha","useful":1,"cool":0},"ZCbbNXxlJ-4H7UWEt84JiA":{"text":"A little hidden gem off the chaos that is Bourbon Street.  I had a conference in New Orlea","useful":4,"cool":1},"8iy6CNp6SLEBSi87NlvvRQ":{"text":"My husband and I came to eat on vacation and we liked it so much that we came back for ano","useful":1,"cool":0},"Z9GDNUoj4IfNOLPJ4Jnd_Q":{"text":"Came to eat dinner and just decided on appetizers. The deviled eggs were eh. Too much vine","useful":0,"cool":0},"_9CbktB2M89BPhW0ITSBoQ":{"text":"This is a gem...I happened upon it.  The staff was friendly.  The food both for dinner and","useful":0,"cool":0},"z_dRya_rI1kol5HtrqQ6sw":{"text":"Cool little place.\n\nCame in for lunch and had a great meal.  I knew it was going to be goo","useful":2,"cool":0},"93rFjNS_bjjiY97zV5OcXw":{"text":"You can BYOB!!\nGrant ( our waiter) was great!! Super nice!\nFood was good too!\nI got crawfi","useful":2,"cool":0},"spWiJzwnCMqNkKVKP7m7NA":{"text":"I would give it 4.5 stars.\nFood was very good! Nick was our server and he was great. Very ","useful":2,"cool":2},"Qk7nSTxsxVUq05BiFfRktA":{"text":"My girls and I flew into NOLA for my bachelorette weekend, and we were 10 strong.  We had ","useful":4,"cool":2},"6Gwyd7WN_yBA3DHL69s3YA":{"text":"This little restaurant is absolutely adorable! I really enjoyed the atmosphere! \n\nI ordere","useful":1,"cool":1},"mLcsCHzhRj9HVrd7ANm4Tg":{"text":"Eat NOLA is tucked away in an area slightly out from Bourbon Street, and is styled in a hi","useful":1,"cool":0},"N0J-wnWcm5LBE85q4IPkLg":{"text":"Great service. Our waiter was wonderful. \n\nCrawfish Boullettes- so good! The sauce was del","useful":1,"cool":1},"wRwCaJV8yR0IDQqQD9MzYg":{"text":"Eat New Orleans was the BEST meal I had in New Orleans and I regret not going back! But I ","useful":1,"cool":0},"hIdRvPgdnlZiwSDbCVa7DQ":{"text":"Went here for dinner on a Friday night. I like the decor and service was good.\n\nI was crav","useful":1,"cool":0},"CUOjRexfNMXpZcnpS812fQ":{"text":"A lack of alcohol (not even beer & wine) separates Eat NOLA from virtually every other NOL","useful":4,"cool":3},"O_AzyLDXVRtPEMO-hX8dWw":{"text":"This is my newest GREAT find while visiting back in NOLA. Sadly, Yelp didn't direct me her","useful":1,"cool":0}}