{"obRsaH82OcP62brqFfrU3w":{"text":"One of my favorite places in town! I always go there first when looking for any type of th","useful":0,"cool":0},"PqBXFXQKLdX-f6lKqBejww":{"text":"Not friendly AT ALL . Spoke to a man that said I can bring in balloons of any kind, young ","useful":0,"cool":0},"vfzbM_pq0ssNqufow-p6NA":{"text":"This place is great for so many reasons!  Its downtown, its not a chain, they have a varie","useful":2,"cool":0},"c0eHefcvW06Sc0IKbuZdVg":{"text":"I am in love with Amy and NOLA Party & Costume!  I was planning a party on no budget with ","useful":1,"cool":0},"iuUINILmkEEGPHqoP0Pr5g":{"text":"By far my favorite costume shop in New Orleans. It's close to my place, so I never am far ","useful":7,"cool":2},"tqo0qo-OWLow5K6rtdQCgA":{"text":"Amy, Rocky and the staff are awesome!  They allow you the time needed to peruse the racks ","useful":2,"cool":0},"imvgFIZw02eNpI2Zmyd55g":{"text":"I hate Party City with a fiery passion.  I love this store. Here's why:\n\nParty City is con","useful":7,"cool":2},"wZaS56ZlwzazDp_bpT4H8w":{"text":"Lots of great costumes, well stocked and very helpful employees. I went in to get some cat","useful":1,"cool":0},"tpc_vIlfXUg72Gj4vC2LvQ":{"text":"Amazing selection of halloween costumes and extremely friendly and helpful staff. One of t","useful":2,"cool":2},"RqMOa5n97sdpsnQKzb-egQ":{"text":"As someone who sucks at coming up with creative and/or witty costumes (and too lazy to mak","useful":5,"cool":2},"RXWnao-RGNovh99Jnv8mtw":{"text":"Yay - this place is everything magical and what you'd want in your one-stop-shop for every","useful":3,"cool":1},"wWGk3w5KmD7qLa_jT9B_uw":{"text":"Amazing amazing place !  Called at 5:30 pm est for ballon delivery for my daughter's birth","useful":0,"cool":0},"DR0ffEjt_wg0ov9MuSB2Pg":{"text":"This is one of the coolest shops staffed by the coolest people in the city.\n\nHere is the s","useful":5,"cool":2},"vSxnLo7vxlbZLJNVN1LXkQ":{"text":"I'm a costume shop junkie. I want to own a costume and makeup shop one day and somehow car","useful":6,"cool":3},"vWq5SMcqdhEKIPHc-McABQ":{"text":"I'm kind of surprised that this costume store hasn't gotten much Yelp love!\n\nFor Halloween","useful":2,"cool":2},"x7Mnpkds_FlRKETxav4dYA":{"text":"Somehow I had never stopped into this old school CBD costume shop. I was surprised to see ","useful":4,"cool":3},"HUY01gJ_RzGiA4RPQ6GFWg":{"text":"Love this place! Decided on my costume the other day and found EXACTLY what I wanted for a","useful":1,"cool":1},"MVqM0gBHdjrpRqGWIZ8vSQ":{"text":"Yelp never fails me!!!!! Well at least not this time...\n\nCame to New Orleans with my littl","useful":4,"cool":1},"8MvfDpc9DpuD0KQhjV8kVQ":{"text":"This is a very well organized costume store, even though it may not look like it. They hav","useful":1,"cool":1}}