{"aAcQibR3zWOvk4atbCM3SA":{"text":"Definitely recommend for anyone looking for a delicious meal at a reasonable price. The sh","useful":0,"cool":0},"sqr0RQ1UmstPWpXRvbASeQ":{"text":"This place was so yummy and decently priced. I felt that the escargot would have been bett","useful":1,"cool":1},"i-2Z69kuP4jmq6PRU12zKg":{"text":"Trying to find a restaurant in The Big Easy that serves vegetarian is not an \"Easy\" feat\n\n","useful":9,"cool":7},"B_p9TM_h82Jw2fVkjsV_8Q":{"text":"Excellent food, ambiance and location! I ate there for lunch during this trip to NOLA with","useful":0,"cool":0},"dcHdEts2GSKZJvI74kf3hw":{"text":"When giving friends from out of town a tour of the French Quarter, one can only expect the","useful":1,"cool":0},"VIobe63lPQYn5FkKVPC45Q":{"text":"Best meal in New Orleans!!! I was in a group of 4 and we were served by Travis, Susan & Ca","useful":0,"cool":0},"wnGWCZIS3jLu4O7894qNFQ":{"text":"Had brunch on NYE weekend. The decor is wonderful, you feel cozy the my minute you walk in","useful":0,"cool":0},"oaOUXtp8uRtBPPTGmbSaNA":{"text":"Muriel's is a great stop in NOLA. The goat cheese and shrimp crepes are by far the best fo","useful":0,"cool":0},"x-OF89Y84uXvSRbeIskdfQ":{"text":"When you dine at Muriel's, check to see if the 2nd level is open for visitors. If so, you ","useful":6,"cool":3},"OIcT7WdkhcZtSeGfTKqbkQ":{"text":"The pork chop was fine but the wahoo was over cooked and dry. To their credit, they comped","useful":0,"cool":0},"c6eoMSSx3nI_Dr19cIvXXA":{"text":"Jazz brunch was amazing! \n\nFood - everything we ordered was great! Thanks for all the yelp","useful":1,"cool":0},"-zZ8GmZGzaNvGZj_ir0yyQ":{"text":"Delicious!  Great ambiance.  Attentive staff.  Cool history (rumored to be haunted).  Grea","useful":0,"cool":0},"u7XyKzuUljqxgARFenPY7A":{"text":"So I've returned to Muriels on a few trips with groups since my prior review, and it was f","useful":0,"cool":0},"tFmLTovdnvNhcNVGicpr4A":{"text":"Went here last week on my first trip to New Orleans.  It's a very fancy place, although my","useful":0,"cool":0},"wlckgLxuUHfEJacg1-0jEw":{"text":"Muriels has delicious food and fantastic service! The goat cheese and crawfish crepes are ","useful":0,"cool":0},"mPhKUByRHPOIWPuAanTl5w":{"text":"Fantastic restaurant located in the the heart of Jacksons square! The ambience was very cl","useful":0,"cool":0},"68kekO9vGU9bxG5G6UT0kw":{"text":"Wonderful!  We had the shrimp risotto and fried green tomato stack-amazing!  For entrees, ","useful":0,"cool":0},"YLFrgDDTxBA7Ky7ommdi-A":{"text":"I wish I could offer 3.5 stars but I cannot and 4 would be too many.\n\nMy date and I tried ","useful":0,"cool":0},"qg6IKOMAnKFVnIS0RWmkQw":{"text":"I ate here with my colleagues after a long day of meetings and we certainly enjoyed the ve","useful":0,"cool":0},"XK4tVbUwJ2M7dG6z3yD2hQ":{"text":"A neat old building with a history in the heart of the French Quarter.  I have had a few t","useful":0,"cool":0},"An_cVNHCWBzERHxyHHSElQ":{"text":"Great restaurant. Very cool and classy decor, a super nice waitress, and excellently prepa","useful":0,"cool":0},"ANTpZv19joHxpYbYM7UP-Q":{"text":"Went here on a pub crawl so my review is only for the bar area.  Place was nicely set up o","useful":0,"cool":0},"EDdlYX1uUA7QwW1uVXJeFQ":{"text":"What a lovely place! Just celebrated my engagement here and everything was perfect! We had","useful":0,"cool":0},"_82QAGEC659lZzFsnlwuHA":{"text":"Made a quick stop in New Orleans & we're so glad we stopped here for lunch! The food was a","useful":2,"cool":0},"Ob6fdASAfvSdIhKJrIZxYA":{"text":"Muriel's is wonderful. Great food and impeccable service. We ate in the dining room for lu","useful":0,"cool":0},"D28T_csp1vrIcqUUe_TEVQ":{"text":"Beautiful building, great service and amazing location. Unfortunately the food was simply ","useful":0,"cool":0},"LSF6Nk-KIC6A6tvKFbE6zQ":{"text":"FANTASTIC from the bread served at the table to the dessert. They made me an incredible ho","useful":0,"cool":0},"uVFNhEoLp7LxDY9TcpeN2g":{"text":"Great food but over priced; but so are most of the local eateries in the French Quarter.  ","useful":0,"cool":0},"NSZMY_RsYEPg-rhdZAn4ig":{"text":"I'm so happy my wife talked me into going here last week (July 11). It was one of the best","useful":1,"cool":0},"a95XuMBV8u-be-P3e2VE2Q":{"text":"Went here for the Sunday Jazz brunch and loved it! Started with Bloody Mary's and the goat","useful":0,"cool":0},"StxbqzJb7BpOlnvUSsbKsA":{"text":"I made a reservation at Muriel's for myself and three friends, after reading the glowing r","useful":2,"cool":0},"RFjxk6HKbS5mHANp2EXUVA":{"text":"Food was salty and overrated, short pour on a glass of wine. Service was great, ambiance n","useful":0,"cool":0},"CbS4J93wbtiCe5W1tUOo8Q":{"text":"Very very good and kid friendly! Had the duck and a Sazerak! The atmosphere and the best b","useful":0,"cool":0},"LTG9yc9TcYI57CeRsz4-Vg":{"text":"Just ok food you find anywhere.  Nothing representing NewOrleans.   The desert bread pound","useful":0,"cool":0},"00xsSpRQZkbsDi9Kn-0rCg":{"text":"Kind of a bummer. Muriel's used to be one of my favorite restaurants and I work in the qua","useful":0,"cool":0},"kJIztUNSgc0SqvsSDqtQ2A":{"text":"This place has excellent southern desserts . The staff is also super friendly. It's a grea","useful":0,"cool":0},"BYSt96taOL3bghUNRhkZSQ":{"text":"We enjoyed a drink up on the balcony before our 6:15pm reservation which was a great intro","useful":1,"cool":0},"rCyCeFHR7pI0kt53czkIdw":{"text":"We recently dined here with a large group while we were all in town for our annual convent","useful":0,"cool":0},"8kjR9cMsxLMqYV24o41kJA":{"text":"We were NOLA for the FQ Jazz Festival and tried their goat cheese crepes and they were ama","useful":0,"cool":0},"yXbjSuozWHowZajt_-6t_Q":{"text":"We had a lot of great food on our weekend trip to NOLA, and this was the last place we vis","useful":1,"cool":1},"7Q4OHliLk46yk1cCJ_Ss1Q":{"text":"Eggs Veney!!! I would eat this over and over.  Dressed in suit for brunch.  Most were casu","useful":1,"cool":0},"VxPTY69aJOUoHZX1gZf46A":{"text":"We've never had a bad meal at Muriel's.  The food is consistently good, the service (espec","useful":0,"cool":0},"5eLPko4Vs4HNOLAtFttKzw":{"text":"BEWARE THIS IS Not an upscale establishment...  MIGHT AS WELL EAT AT BOURBON STREET .. arr","useful":0,"cool":0},"C_3E1D7nslDFvZtZjXY1Zg":{"text":"We ate at three places in NOLA over 36 hours. Lunch at Muriel's ruined us for anywhere els","useful":1,"cool":1},"2UUCpOeQNuyOcbfS0SSp-g":{"text":"Is 5 star reasonable?! YES!\n\nI had turtle soup, pecan coated puppy drum, and bread pudding","useful":0,"cool":0},"hIoiRQWdqEEWeAlLtt_nPQ":{"text":"Delicious food for the price. Above average service. \nThe étouffée was so/so, it was tepid","useful":0,"cool":0},"7b7uO3GC-ZmDmiwlTaPS-Q":{"text":"Turtle soup was interesting, and unique. The seafood stew was too salty. Atmosphere was go","useful":0,"cool":0},"MEnV9LgF4SMQa1QxA2ewUg":{"text":"We had our concerns about going to a restaurant right off of the tourist area of Jackson S","useful":0,"cool":0},"8Lo4LOalhpNQJXEHceUNDQ":{"text":"If you are looking for an amazing meal, served by competent waitstaff, this is it.   We ha","useful":0,"cool":0},"c5yyjYBLIHTGVF2XHhmThA":{"text":"From the relaxed and spacious atmosphere, to the classic New Orleans décor, to the attenti","useful":0,"cool":0},"_IdvlnE5Tl4CQoXEY1MsIQ":{"text":"Went here for Sunday Jazz Brunch, amazing food and service. Jazz trio was excellent, only ","useful":0,"cool":0},"Xc7Ay4IXE7nb1XjPWwLAFQ":{"text":"I may be jumping the gun by giving 5 stars for a drink, but I have to. I have been to NOLA","useful":1,"cool":1},"7dzY9MGZp0bF-nPE75rB5A":{"text":"If a very loud dining room bothers you, stop here. I will return but with ear plugs. The p","useful":0,"cool":0},"tYTGR6z4gkrJ5HItlWk56A":{"text":"I thought this place was a little stuffy and loaded with tourists. They even made me take ","useful":0,"cool":0},"upPW19wjr6fRR8KFOXArCw":{"text":"My family and I took a 5 day vacation to New Orleans and we just happen to walk by this pl","useful":0,"cool":0},"HZ0w4ssy4aSgvePffXX-pg":{"text":"Loved it! We made a reservation and everything was ready when we arrived 5 minutes before ","useful":0,"cool":0},"sEfEv5OeFb-7u2CRkAKdNQ":{"text":"Best gluten free meal I have ever tasted. Dedicated gluten free menu. I had the pork chops","useful":0,"cool":0},"l6Rt2aPcc96WPKsI2QCwkw":{"text":"Muriel's had excellant service (thanks to Rebecca) and very good and tasty food. The first","useful":1,"cool":0},"DMihcOg7vQdT7HC1zqTOKg":{"text":"Muriel's made my 25th birthday amazing. Due to flooding, we had to push our reservation ba","useful":0,"cool":0},"n7oLrtrNjcCS_z9io1T6Xw":{"text":"While on vacation in New Orleans we were exploring the French Quarter and wanted to find a","useful":4,"cool":0},"D4PIGmYIVcG1zcxuZkoQzg":{"text":"Holy crap. This place is haunted!  One is the of the oldest restaurants in NO. Theres a ta","useful":2,"cool":3},"Q1FMruWRVY1xaBo2IYDdew":{"text":"The definition of a 5 star restaurant.  (I know I grade easy, but if I was a food critic f","useful":1,"cool":0},"JuYV3BTkAgQfGLw5_QQvIw":{"text":"Not sure what is going on with Muriel's but we had a disappointing experience this past Ja","useful":0,"cool":0},"cBI6PHPuGFhoUKQvBrd-sg":{"text":"Excellent lunch special and cheap bloody marys! Staff was very friendly and professional. ","useful":0,"cool":0},"MpMxpMPsjW4WGIdTQ271sQ":{"text":"I'm a native to the New Orleans area and I sometimes get upset at the restaurants in the F","useful":0,"cool":0},"Np7dIJHIS3bg-9aVwztx9A":{"text":"Walked in on a Tuesday around 11:45 and was seated for lunch looking out on Jackson Square","useful":2,"cool":1},"28wHPsbTuEsBmEduiEpWNg":{"text":"The best thing I had here was the red velvet ice cream cake...actually one of the best des","useful":0,"cool":0},"tUKS5xTsvxXZWt-MG-sigQ":{"text":"I am only giving 3 stars because I expected more from the service because of the well-know","useful":0,"cool":0},"Vo8izNqpezapaCTdiRel0w":{"text":"Place was packed but got a table for 4 anyway. Sever was great. Loved the stories about be","useful":0,"cool":0},"HtblCXqctQvCO28PfezEpQ":{"text":"We arrived in New Orleans for our wedding anniversary and decided Muriel's was the place f","useful":3,"cool":3},"IkIdLZx7ZRIO4vNtVsAkNQ":{"text":"Most restaurants had an exceedingly long wait time for our party of 8, but Muriel's had a ","useful":0,"cool":0},"lei7HMgDtDgubhSXv0VuDg":{"text":"Amazing! We made reservations through opentable.com and were seated promptly when we arriv","useful":1,"cool":1},"83gHaGE3U-dodJT4KgGaYQ":{"text":"This place was quite a surprise for being so close to the French quarter with a ton of tou","useful":0,"cool":0},"3fIwHRegjdIAhrOwPe9w2A":{"text":"This place was excellent! Reservations are a must here. My wife and I had Sunday Jazz Brun","useful":0,"cool":0},"fV3Zi_mc6SGCOAkWYYz51A":{"text":"One of my fave places. Born and raised in Metairie, and it's the perfect place to take out","useful":0,"cool":0},"Xoa22qui2YpmuBx8-KfuwA":{"text":"We just missed lunch so the only thing available to us was appetizers, salads, and soups. ","useful":0,"cool":0},"DtPd2OohYbNFoqfVji1Ceg":{"text":"I am writing this from the table... The food was so amazing that I needed to rate it ASAP.","useful":0,"cool":0},"rI_jiQFzaOoaDX8EFpqg1Q":{"text":"As firstimers to NOLA...we spent the day in the French Quarter drinking, shopping and seei","useful":0,"cool":0},"CJh4H2XTvVcvXMdehon83g":{"text":"Sunday Jazz Brunch was pretty delightful, just a few minor complaints kept it from being f","useful":7,"cool":7},"2hsbLNvaC36EceJmx07B8Q":{"text":"My wife and I went here yesterday for our last dinner of our NOLA vacation. Reservations a","useful":0,"cool":0},"DiOob-e6SMU8XUkln53DXQ":{"text":"Went two nights ago for dinner and had a very pleasant experience but it was slightly lack","useful":0,"cool":0},"AqhVCkHmaZOVnZUO2Bbz3Q":{"text":"Best complete meal of my life. The whole meal was lovely (my best complement for food). My","useful":0,"cool":0},"dsrAy3o2ctXRedh8m1C2IQ":{"text":"This is a great place for a nice dinner in the French Quarter that won't break the bank.  ","useful":0,"cool":0},"OlZggYp2Lw-HjNvv_vyJMw":{"text":"Wow. Where do I start. The BEST dining experience me and my wife have had in the French qu","useful":0,"cool":0},"SwAI-ghQ0LD_BeTg9vTkww":{"text":"Very cool restaurant with an enclosed courtyard. Our two waiters were very attentive the e","useful":0,"cool":0},"ZyxmubGQLa32bI2GtxQ_UA":{"text":"I'm not sure I can write a review to adequately convey how truly excellent tonight's meal ","useful":1,"cool":0},"71mVzHsVtt8GqGmAc3VZpA":{"text":"beautiful restaurant with amazing service. food was great too!","useful":0,"cool":0},"ZMhy5CfTzBIoobSoQgmpNw":{"text":"Excellent good, ordered the pecan crawfish and it was absolutely wonderful. I would highly","useful":0,"cool":0},"q470zivqg25tximypgxAaQ":{"text":"Yet another fantastic restaurant in New Orleans...amazing food and atmosphere.  It was rec","useful":2,"cool":0},"RzL_oixrUNYUcnXE-GZJEw":{"text":"This was the best restaurant we visited on our weekend trip to NOLA. The food here is unbe","useful":0,"cool":0},"Xkm7keLzPg__It3Al1lxAQ":{"text":"Excellent food. A nice change from all the Cajun/Creole (although I love it too). Nice Fre","useful":0,"cool":0},"8fRWLlSTFaxPiNNe20fp-Q":{"text":"Found this place right next to Jacksons square and it is spectacular.  Everything was grea","useful":0,"cool":0},"cUv97tz8VRgGkZFiC3KWjw":{"text":"Try the pecan crusted drum. We were are a party of four. Three had the fish and all rated ","useful":0,"cool":0},"1_e3PNh3aTj8fJb85cp7cA":{"text":"After my wedding we came to eat at this place. Wonderful drinks, my salmon was wonderful. ","useful":0,"cool":0},"w7V9rKY5c4uVPlxg-KWZZQ":{"text":"We went back and gave it another shot, loved it so much we are having our wedding receptio","useful":0,"cool":0},"jmy2U5w6Tz5yAFWDwVWjzA":{"text":"I loved Muriel's! Great atmosphere, very attentive wait staff and the food was exceptional","useful":0,"cool":0},"SBA9BHaVX2vfKxxBNAvfaA":{"text":"Not the touristy place you would expect in the heart of tourist central.  Gorgonzola tart ","useful":2,"cool":0},"W2TvSd_24AdLrDNuQ9lPHg":{"text":"My friend and I stumbled upon this restaurant at the same time one of the managers was out","useful":0,"cool":1},"A4UskFLbGYvvRcrTVfYZYA":{"text":"Great food that stands out--whether it's the fish, alligator appetizer, desserts, etc., al","useful":0,"cool":0},"TXtuYmYmwO98eHpi90I3Bg":{"text":"Wonderful food and atmosphere.  Classy but not stuffy.  Highly recommend any of the seafoo","useful":0,"cool":0},"9w2PyyufTauHWReGGKkQog":{"text":"Great food, amazing service! Liz and Jennifer were very attentive and Liz gave great sugge","useful":1,"cool":2},"zIslJ7Gucq2M1ZaB-hSOKg":{"text":"It was a hot day, looking for some refuge from the heat and find a good meal.\nWe came to t","useful":0,"cool":1},"RiZp-RvEKESgWDxUjaE81w":{"text":"Excellent food, outstanding service, wonderful atmosphere!  Highly recommend!  I had the s","useful":0,"cool":0},"zQh5S-EM_OM02XjFUqHRmQ":{"text":"Double cut Pork Chops, Baby Drum, Escargot and Crawfish & Goat Cheese Crapes were all wond","useful":0,"cool":1},"WEynDp0OC5WLW2xaQ0-1OQ":{"text":"We stumbled upon this little gem after we ended our ghost tour.  The tour ended at this re","useful":1,"cool":0},"zxgblL4rxflNiTTd92vpEg":{"text":"Came here for Valentine's Day with another couple and we all loved it!  The food was excel","useful":0,"cool":0},"DzNfg6uA0nYALr_OsE3UKQ":{"text":"I am getting ready for our trip to New Orleans this Halloween and was just fantasizing abo","useful":3,"cool":2},"9Ibfjf9sNapjBiEIqr3RMQ":{"text":"We ate lunch here, and the crawfish etouffee was the best I've tasted (out of 3-4 other pl","useful":0,"cool":0},"2ZJAc6UMKaSbbzSn2p9EOw":{"text":"Very disappointed in this place. I had high hopes for this place. Food was decent ( FYI yo","useful":0,"cool":0},"zSMHeyyELiUSsXT19t3_qw":{"text":"Had the pork chop. It didn't live up to the hype. Our party had two orders of the pork cho","useful":0,"cool":0},"XwAkFX3CEPQcmwS7VmbCjg":{"text":"WHAT A GEM! WHAT A GEM WHAT A GEM!\n\nNot a tourist trap, despite the location being right t","useful":1,"cool":3},"732d7BJR4_5qNV-zssw1EQ":{"text":"I came here for a rehearsal dinner on a Friday night.  The place is charming and the food ","useful":2,"cool":0},"C9nVa84QJmB8phS4QJq-bA":{"text":"We didn't dine here, just escaped the best to enjoy a glass of wine and some cocktails whi","useful":0,"cool":1},"twnPQti_8ojbX9U9qUwF2g":{"text":"Interesting and traditional decor but the food was just okay. We tried the sunday brunch.","useful":0,"cool":0},"WkOuf7vhqanRL0FJOU9IDw":{"text":"The staff was amazing, impeccable service. The food, unbelievably tasty and at a great pri","useful":1,"cool":0},"auw3wFV3WI0RBbKNmbKC9A":{"text":"Beautiful place, Excellent music, and friendly staff. The singer in the music trio had an ","useful":0,"cool":0},"Dr8Ze5Q1Xcida2SjUscsdA":{"text":"Overall, Muriel's was a pleasant experience; it's definitely more lively and active than s","useful":0,"cool":0},"agaX1X0m_u1eFReG3f2MTg":{"text":"Apparently this restaurant has caught a lot of flak for poor service. And good for them, t","useful":0,"cool":0},"se1MnasVKpvluxH-aJO7cQ":{"text":"Muriel's deserves a 5-stars for several reason:\n1. Excellent food\n2. Immaculate service\n3.","useful":2,"cool":1},"wUjRzDnIP1LoYklVcg3aVA":{"text":"We had 9pm fri reservations for 14 ladies for a bachelorette dinner. We were seated prompt","useful":0,"cool":0},"a7b9wzb0q1gyQOWCXxnJZg":{"text":"I absolutely LOVE this restaurant!  The venue is great, the waitstaff are helpful, knowled","useful":0,"cool":0},"FGQ_ksW3yjq7TnfR2cGuIg":{"text":"Muriel's is by far one of the best dining experiences present in New Orleans today. This i","useful":0,"cool":1},"JvALy48scWLkDVvAdCBqRw":{"text":"Our Muriel's experience was a 5 star one from start to finish. We had a reservation and we","useful":0,"cool":0},"yvqQAq01BNV6Ns5_54pbNA":{"text":"From the moment we stepped in service was excellent. Drinks are very tasty. Food is amazin","useful":0,"cool":0},"5AjlUUCGdiBwMX8sCNXb0w":{"text":"Building and ambience beautiful!  Food was amazing. Had the crepe appetizer and changed en","useful":0,"cool":0},"oBB_yFLdkAZac5q7HN1K0g":{"text":"This location is great because it's so centrally located, historical, and extremely charmi","useful":0,"cool":0},"BBDdx_n4gXTikpzVzjgNDw":{"text":"They were able to sneak us in as a large group on a busy night. The crepes were amazing as","useful":0,"cool":1},"-1XiUejVadFAojeIvwtL0A":{"text":"Wow! We had decided on a destination wedding in New Orleans. I started researching online ","useful":1,"cool":0},"O0G5ao_vRGxNZx1K5jWZRA":{"text":"We went here for our 10th anniversary dinner. It is a gorgeous space, each room unique and","useful":1,"cool":0},"fY5GD4HNcOygmLOW5N9a0g":{"text":"In the middle of Jackson square, this beautiful converted home had the most amazing menu. ","useful":0,"cool":0},"TY6CLfw6Sek3zj3JGuS7Iw":{"text":"After the wild mushroom gnocchi I really wanted to give it a five-star rating BUT I had or","useful":0,"cool":0},"Jf4i3jQi5lcC9Nrm-2oZ6w":{"text":"Visit began with a surprisingly rude and disappointing restaurant experience with the host","useful":0,"cool":0},"LJMGwQbZXCtq1D3L-4a73g":{"text":"Well, for the price we paid, the server was condescending and the food was good but not sp","useful":0,"cool":0},"nMOa9rOlyU43boQEpwbU7g":{"text":"Wow! This place is awesome! There is so much history and the designs of the restaurant is ","useful":0,"cool":1},"_S6aUXJBTpeHs_G1lFdXVA":{"text":"Hands down our best dining experience while on NOLA. The food was excellent. We had been g","useful":0,"cool":0},"aQkYeiAbJaV__ZKLdyZt9g":{"text":"I was born and raised here, but this was my first time here. Very great food. And my cousi","useful":0,"cool":0},"4ynZJ_bjJov9SvhXtyel5A":{"text":"Mixed feelings. It has a very rich history, and is definitely a great place to visit if yo","useful":0,"cool":0},"Ze75MYjxEq9XJZW34bw5og":{"text":"We had a wonderful experience at Muriel's tonight! My sister raved about the sweet potato ","useful":1,"cool":0},"G8COyCkfN0xfnneig9Lqsw":{"text":"Recommended by the concierge of the Astor Crowne Plaza.  It was a Thursday night.  We orde","useful":0,"cool":0},"2tW7dzAz9DnvfCcC44G02g":{"text":"Went here for brunch on a Sunday which offers a Sunday Jazz band with brunch. The food was","useful":0,"cool":0},"-fPbHUJQNUfZ1mx7Xd_BnA":{"text":"We had the best experience at Muriel's.  My husband had the pecan crusted drum and I had t","useful":0,"cool":0},"mqwhQwqQ0dM9WMZzcQeCKg":{"text":"We had lunch at Muriel's today at 12:30 I had the vegetable soiree (sp?). I have eaten fin","useful":0,"cool":0},"qp95KrpXVuhCbsszJGBKuw":{"text":"There were four of us and we all enjoyed our meal.  After looking at some of the dishes th","useful":1,"cool":0},"wyvqswSaUXtJs0EqMZQThQ":{"text":"Came here with a bunch of my girlfriends. Ordered the duck hash with poached eggs. Super y","useful":0,"cool":0},"2odC7iXeA4_iAfi4xZcsfA":{"text":"Found this gem today via the yelp app on my iphone.  What a wonderful lunch followed be an","useful":0,"cool":0},"HDtadNL9dc-Fcezk0fmv5w":{"text":"We came here for my cousins bachelorette weekend and stop here last minute they got us in ","useful":0,"cool":0},"Nd0rZaaAIor8L_Sh6P4HEA":{"text":"Solid three.  Food was totally OK, somewhat expensive.  It's a great, loud place where one","useful":0,"cool":0},"Qs8DKpJ-AFeyHWEoqW72cw":{"text":"Great atmosphere. 2 servers were on it every step of the way. Shrimp and grits are probabl","useful":0,"cool":0},"4R3snBDTrH-4WUAkyqq8qQ":{"text":"We went for the Jazz Brunch on Sunday morning and were more than happy with the food, the ","useful":0,"cool":0},"6swHTtY4nID3yh44xw9-gg":{"text":"My wife and I chose this restaurant on our last night in New Orleans. The food was fantast","useful":0,"cool":0},"nbZ8fhzesU3u48cYHiPlZA":{"text":"Really a lovely place, very solid.  Great atmosphere down near Jackson Square with exposed","useful":0,"cool":0},"bcqKW0XJo4w6p2OTLBlWGw":{"text":"This place was recommended by locals to me. Definitely a must-go restaurant if you like se","useful":1,"cool":0},"VB8FRj3zCHjVElDneGP2EQ":{"text":"Location was good, right on the square. Judging from the crowds, I expected greatness. My ","useful":1,"cool":1},"XZP2YsyG0VCzDkfDMX4LRA":{"text":"Best brunch I have ever had. Everyone at my table agreed. Went on a Sunday morning and the","useful":0,"cool":0},"iOqgFffBfKhzNgZlCLgQuQ":{"text":"I was here for brunch on Mardi Gras weekend. I made reservations two weeks before since I ","useful":0,"cool":0},"7x3ZQJygAlMQ1G3n3eZTew":{"text":"Delicious. I can't say enough about the food prepared at this place. As with most restaura","useful":4,"cool":3},"9BPNMQeJU3S--GE9TsTavg":{"text":"What a lovely evening.   Our wait staff, Jenny and Gary, were on point the whole evening. ","useful":1,"cool":0},"QoC22VFgZl7tgHPacBweEQ":{"text":"It's rare when both my wife and I can say we ate the best of something at a restaurant. Fo","useful":0,"cool":0},"c-9TACNcFB5BAwSqzMoDHw":{"text":"Best meal in NO, so far. Shrimp crepes with goat cheese were outstanding and the bread pud","useful":0,"cool":0},"c9vnfW56C5l_ThCtOGDhfQ":{"text":"Lots of New Orleans Service here!!  Wait Staff was EXEMPLARY of the Quarter!!\n\nBeautiful d","useful":0,"cool":0},"g59s9wwMEVWefx0DEyAIkA":{"text":"Wonderful place in the heart of the quarter! Food, atmosphere, service and servers make yo","useful":0,"cool":0},"cmRFj2YFGRQjMyfP-07jGQ":{"text":"Went here one time with a large crowd. The service was amazing and it seemed like even the","useful":0,"cool":0},"r-0a8WFqQGzzpbNVHlD1qw":{"text":"Love this place for their Jazz brunch. Very attentive service and they were happy to tell ","useful":0,"cool":0},"-WeEIYQhrs6rXOG4AtytRg":{"text":"Muriel's is an extremely nice environment with a very beautiful dinning area.\nOkay, now on","useful":0,"cool":0},"6J__4IfIW4THPiMOoM_Xhw":{"text":"Had my graduation dinner here and everything from the service to the ambience to the food ","useful":0,"cool":0},"haNorWspI3MqC3E-XjtmSg":{"text":"I really enjoy eating at Muriel's.  I recently took a colleague in for lunch and recommend","useful":0,"cool":0},"C76-YM4D_p2q6r_S99y9FQ":{"text":"Delicious! Excellent Service!\n\nI'm from California vising New Orleans for the week and sto","useful":2,"cool":1},"F-ImlvludR52KCsNBQSSwQ":{"text":"Muriel's is clearly a step above others in New Orleans. The location is great, customer se","useful":0,"cool":0},"7GiyvFg4CUonx5FUN5JqAw":{"text":"Lovely Staff - delicious food - Location with History! Come early - make reservations!","useful":0,"cool":0},"dm_LaeeaPF_1xKQSIDeGmw":{"text":"We have eaten here several times for brunch, and I've had a great experience. We were here","useful":0,"cool":0},"4_gPbkyWM0t_0svDM_af9A":{"text":"This is a very expensive restaurant.  First time for a cauliflower cream soup.  Atmosphere","useful":0,"cool":0},"y6eGVEtqnznYUnVFF43X4Q":{"text":"So we are at Muriel's on the balcony,  they won't serve you drinks or food. So do they thi","useful":0,"cool":0},"EUkAXdZkxUOX2f-C2ZJRvQ":{"text":"What a wonderful place to have dinner in the quarter. My friends and I were in the city to","useful":0,"cool":0},"DAnSZA91V1InrsO43CVOrA":{"text":"This was phenomenal food! We had the Goat Cheese Crepes, very rich! Sauce is almost like a","useful":0,"cool":0},"yBqgPctyj89aY0xUBs2giA":{"text":"Holy mother of Christmas, this place is my favorite new find in New Orleans. I went here i","useful":0,"cool":0},"qabqzETl8Oa6ZJwWlY1bDw":{"text":"I was in NOLA for a meeting and went to Muriel's for lunch with a friend. I grew up in NOL","useful":1,"cool":1},"iSLG_-w0wTxjAshig_iGfQ":{"text":"This restaurant should have a five star rating  not only because of it's  atmosphere but b","useful":0,"cool":0},"zu7kUa3EOKP9RBrKy7oPFg":{"text":"I learned about this restaurant through French Quarter walking tour. At the end of the tou","useful":1,"cool":0},"YyS8I8RU2brIlj9gnYynMg":{"text":"Ashley the waitress was excellent. Everything else was terrible, especially the manager an","useful":0,"cool":0},"qbpfXBYLRkCHKnQLY5Z3jA":{"text":"In a week in New Orleans, dinner at Muriel's was the best meal that we had. Our waiter Kev","useful":0,"cool":0},"nb-wlf3-Y6oFa5JQp4xVpA":{"text":"goat cheese and crawfish crepe, ftw!! this was really good and sort of creepy with that cr","useful":1,"cool":1},"uYWwLHoSWiIefMeaYcjVaA":{"text":"The atmosphere is good for casual dinning. We went for our anniversary but just wanted to ","useful":0,"cool":0},"OKbqNRIIoQMEuF0G-4KLTg":{"text":"Come for the food, tolerate the service.\n\nMuriel's wasn't our first choice, but it was a c","useful":5,"cool":4},"pjOhjgWaglhoGLCRn4aj2Q":{"text":"Delicious food with a great atmosphere. From the moment we walked thru the front door we w","useful":0,"cool":0},"Fc_mTHkVUCRCYukBdcpq8Q":{"text":"Everything about my experience here was amazing. We started with drinks in the bar. I had ","useful":1,"cool":2},"32mSbAje8oX76GdGD2fnWw":{"text":"Late review. Went here with my kids for brunch during the holiday season. The food was fre","useful":0,"cool":0},"9FLPpLJ6KGs_l39qqB3uQw":{"text":"All three of us had 2 dishes each and each had a bite of each other's dishes and each bite","useful":1,"cool":1},"aOM5GMu4lohT-jkYlwvSuA":{"text":"My husband and I ate brunch at Muriels on Sunday, and the entire experience was perfect!  ","useful":0,"cool":0},"fiR9w8NZQYgPy_SVfGiAxw":{"text":"I debated giving Muriel's four stars, the reason being that the food was delicious and alm","useful":2,"cool":0},"wt02JZeba4I5wCHkJo8g-g":{"text":"What can you say this place that hasn't already been said, seeing how it's been around for","useful":0,"cool":0},"HYWXgMTjIze1cWtsEm2dfA":{"text":"Bottom line the food was not up to par for the price and what you would expect. I don't kn","useful":0,"cool":0},"2PPNLm6eqp1Yc_Qw7Q5hXg":{"text":"The 1st time here the food was delicious, brunch not so much.  The dessert was beyond deca","useful":0,"cool":0},"drF-kvwgyBrLcfBZNT17gg":{"text":"We had our daughter's wedding reception in the upstairs salon of this restaurant. The food","useful":0,"cool":0},"OY3kSleoXTSRmSr7IyYWQw":{"text":"This place was so beautiful on the inside and the food was delicious. We went with a rathe","useful":0,"cool":0},"g8mCPE27blG_MUnLdXkJLA":{"text":"We've been coming to Muriel's since it opened.  Always a great experience.  Service is goo","useful":0,"cool":0},"cD3MCcuiT-uXBEIhlV0P4g":{"text":"Beat meal I had this past week in New Orleans was here! Wonderful ambiance, food was delic","useful":0,"cool":0},"cF7nhxwc5zYjYIKypJG6jA":{"text":"Situated just off Jackson square, Muriel's is a surprisingly relaxed and casually elegant ","useful":0,"cool":0},"s5cWn0TJntg69GZXZV15nA":{"text":"Hubby and I (locals) and my mom for dinner for Reveillion (special fix price meals meant t","useful":0,"cool":0},"pdDjoDIGJelSPxJiDo7KfA":{"text":"We simply had drinks on the balcony, but they were superb! As was the view! Would have lov","useful":0,"cool":0},"xdHAAvcQ51rCcWPOOpfnrA":{"text":"This is just for the bread pudding.  Googled best bread pudding and this is what I found a","useful":0,"cool":0},"mYFZRIadh-nfJPMA2kpzgw":{"text":"The best food! Great atmosphere as well! The bread pudding was the best in town!  It is a ","useful":0,"cool":0},"fykkv0ifmNo2KZqj_7wgAg":{"text":"I was extremely fortunate to dine at Muriel's for a wedding rehearsal  recently.  After ye","useful":1,"cool":1},"LaFKoIIYbAcSdi6yFSoTSQ":{"text":"I've been dreaming of this place since we left New Orleans four months ago, them and Café ","useful":0,"cool":0},"XyKqMpIe9Q_K0bzuDIZ-Qg":{"text":"Very crowded place! Food was OK. Waiters were friendly. Pork chop was not cooked properly.","useful":0,"cool":0},"KGy3imenRK6nBHDUpBn2_A":{"text":"Absolutely transcendent meal. This is the reason I go out to eat, to have something I can'","useful":0,"cool":0},"dj1Ir8d0mml7yGA2MlOw5A":{"text":"Muriel's was the best value I have had during my NOLA trip. We had (2) of the special 3 co","useful":0,"cool":0},"-Y0nTxQHGquOypeNjTTzNQ":{"text":"I am surprised I have not reviewed Muriel's sooner- I have been here several times. Each v","useful":13,"cool":8},"3nxpi7rZMhg14nCu0BjxqQ":{"text":"Got in under the wire for their pre fixe lunch deal. Had the goat cheese and shrimp crepe ","useful":0,"cool":0},"vPHgcOqHlzpmFw8DIDQMFQ":{"text":"Stopped in for a late lunch and our meal was excellent. The turtle soup with sherry brough","useful":0,"cool":0},"IT_wJq3yXrJr7zAQ44Ps2A":{"text":"What a find! My coworker and I made reservations here on the last night of our trip and it","useful":0,"cool":0},"7io8iSYX6o4NM8dxacCd6g":{"text":"Great food, great service. Must order the goat cheese and crawfish crepes - original recip","useful":0,"cool":0},"lUKPC1b60B5livs-0Q5NJg":{"text":"Had friends in from the San Francisco Bay area and wanted them to experience the exquisite","useful":1,"cool":0},"zjWh98VnB5TxTpQGpVgv1g":{"text":"Absolutely delicious. Ordered from the Ne Orleans lunch menu which offers choice of soup a","useful":0,"cool":0},"E2BWDx0BjIh19K2vvq1CQg":{"text":"My husband and I moved across country this past November and stopped in NOLA for a few day","useful":0,"cool":0},"2RymrZxyW3iTkcrZnhgwiw":{"text":"Cocktail review only\nThe drinks were ok. The ginger mint julep was pretty bad. The view, h","useful":1,"cool":1},"OFXPf-Az3o7dnuVxdtHTvg":{"text":"Overall a decent experience.  While I have had  better omlettes, the service was good, the","useful":0,"cool":0},"gGjtUtM9hwrcKwxrmRxoLQ":{"text":"I had a pretty good meal here last year and went back for another taste.  I wish I hadn't.","useful":1,"cool":0},"OyjFU8RCRti1F96AyEr4bw":{"text":"When I die, I hope heaven has the Crawfish and Goat Cheese Crepes, it's definitely my favo","useful":0,"cool":0},"eBTnAGvRx4rs63tXy2SGuQ":{"text":"I attended a wedding luncheon at Muriels in the Plantation Room. I try not to get my hopes","useful":0,"cool":0},"6347XNjoVNRe5QwcJATj4Q":{"text":"Visiting New Orleans for the weekend and roaming around Jackson Square, I know Muriel's is","useful":0,"cool":0},"rql9IgicDhPLnyBeU1yvSw":{"text":"I'm not from New Orleans but both times I've been there I went to Muriels. The place is am","useful":0,"cool":0},"UnU1xfdrsqvEpzRY_yri_w":{"text":"Dined there twice: once for Saturday lunch and once for Sunday brunch. Wait staff on Satur","useful":1,"cool":0},"VO9qAf-sS_vmkBK_Ll4BTQ":{"text":"Difficult to find a gluten free menu in New Orleans so I was relieved to find this place. ","useful":0,"cool":0},"sn7MQYZr1s558PW5nthyEg":{"text":"Beautifully decorated and the food is unmatched. Service was the best I had in the French ","useful":0,"cool":0},"BUZvjtMsTOsUUorGoStMfQ":{"text":"Great food, great service. A little on the pricier side for the area, but well worth it.","useful":0,"cool":0},"rvlXO7SZ7n2fxbvZKupyPQ":{"text":"Sauteed redfish filet stuffed with crab and eggplant stuffing... need I say much more???  ","useful":0,"cool":0},"is13gna81h7dRMiLL1Je2g":{"text":"We only came in here for drinks during lunch time. Can't beat $4 bloody marys! & they were","useful":0,"cool":0},"zp2JhFXEE0KuBN8GHp_sDQ":{"text":"Muriel's continues to be one of my favorite places in NOLA.  \n\nThe location is awesome... ","useful":0,"cool":0},"-VIXNocqZcR8fHLr3uP59A":{"text":"Great food in an area that most tourists will visit during their time in New Orleans. We v","useful":4,"cool":1},"u8B2JUeKtrW1G7GTyy_1VQ":{"text":"Incredible dining experience. The service, food and atmosphere is definitely 5 star. I had","useful":0,"cool":0},"uvyQknPiYAjABT9DE_nNsQ":{"text":"Excellent lunch on Saturday. Extensive half-bottle wine selection. We found some friendly ","useful":1,"cool":1},"S5_eoXAr8gnAG6S9qsPZFg":{"text":"This was my first stop in NOLA and it will be my first every trip back. I had the turtle s","useful":0,"cool":0},"oXPMvLIcDfE9mt6ByITFgg":{"text":"Muriel's always delivers an excellent meal.  I never visit New Orleans without going here ","useful":0,"cool":0},"khXEcjx443vF4x0F5S5seQ":{"text":"I'm in New Orleans often for work but this particular trip landed us here for dinner. A li","useful":0,"cool":0},"uFo04_ii_WsMu5wD_0pznw":{"text":"Our group of six had a variety of Muriel's food based on the pre fixe dinner. I had the sh","useful":0,"cool":1},"dpHR8idcZplIKetMqbqj7g":{"text":"Great dining experience but be prepared to pay some money.  My partner got the 3 course di","useful":1,"cool":1},"523kNTDTcmkXJ5b7pk6fPA":{"text":"I attended a private dinner in this restaurant!  Food was nice, service was good!","useful":0,"cool":0},"8Fe0m94nJm_DTw238l8ZUQ":{"text":"We tried to get into the restaurant next to Muriel's (Stanley's - see my review), but ther","useful":0,"cool":0},"_GL-tsixfX7C5pTAq1V1PA":{"text":"Beautiful decor. Service was good. Had our pre-Valentine's Day dinner @ Muriel's. Food was","useful":1,"cool":0},"UKOcJcOiWdZb_QOxP_FkMg":{"text":"Really good food and service. The room we ate in was very atmospheric and lived that they ","useful":0,"cool":0},"oALOaZK0abU9kAXjThleyA":{"text":"First resturant we went to in New Orleans and it was perfect.  Our waitor was very knowled","useful":0,"cool":0},"YBOfb0rEONqrniU55JJLHQ":{"text":"We had the BBQ Shrimp and the Bayoubaisse. Amazing! Both among the best meals we've ever h","useful":1,"cool":0},"cTJfx_jkPw39GbtUBzCYQQ":{"text":"I did the three course meal here (for a total of about $35) on my last night in New Orlean","useful":1,"cool":0},"4YXF98b9ct4U5thLBuG_oA":{"text":"Very impressed with our Saturday night dinner. Reservations were difficult to get, so we e","useful":0,"cool":0},"xA8QHUCtBiTgZ-0SXKifQA":{"text":"The food and ambiance for the jazz brunch was amazing. We ordered the tomato stack which w","useful":0,"cool":0},"MGjQJXEaLdR2lqsSUdJzAw":{"text":"Amazing food and people! Had a gumbo soup, goat cheese crepe, and beef + salad. Everything","useful":0,"cool":0},"mpC-HikJPCwtUPo-0HSCYQ":{"text":"I've been here for private parties, dinners and Sunday Jazz Brunch more than a dozen times","useful":1,"cool":2},"QiRmn4Rz0U7dvic1DJscQQ":{"text":"Had my best meal in NOLA here tonight. The puppy drum and flourless chocolate cake were am","useful":0,"cool":0},"dVHBp462rEapQccPXFP9ng":{"text":"was not treated with the respect I expected.  Ordered the fish special - a wahoo served wi","useful":0,"cool":0},"rIDe2qg0eVrxpIbTybdFWA":{"text":"Fantastic place to eat on Jackson square.  Great for families and friend s alike. Atmosphe","useful":1,"cool":0},"nL8bY8skkaYhk7KCZUeG_g":{"text":"Lured into a \"jazz brunch\" for Sunday during which the band played for approximately 5 min","useful":0,"cool":0},"XYR0lSnFx9aSlAfOJpmHVQ":{"text":"Great food. Great atmosphere. A must do for anyone traveling to the French quarter. The hi","useful":0,"cool":0},"bPFODxBkKrDLqcogCjJ-GA":{"text":"Yum, yum and more yum. \n\nMy husband and I were in NOLA with our 6- and 9-year old children","useful":0,"cool":0},"7wo4mLNGCbSq5v3FZOBl7w":{"text":"Greatly enjoyed the ambiance of this place. The three-course option is a great deal! I hig","useful":0,"cool":0},"5FIktPEQ2DFeSK5PLmbl-g":{"text":"Had a go at the Table d'Hote menu (prix fixe). Started off with the gumbo, which could hav","useful":0,"cool":0},"XW6Kkpp-L-bn2_7GKqPvjg":{"text":"The soup of the day was potato leek and it was delicious. It had a type of sausage in it a","useful":0,"cool":0},"JNJGxqn5iVDZfilvYjJZ4A":{"text":"Hands down the best meal we had the entire time here. Not a only was the food mouth wateri","useful":0,"cool":0},"2-7v-8UF7tCUeIbreOLP3g":{"text":"We hosted an event here last night and the atmosphere was perfect, the food was incredible","useful":0,"cool":0},"AktUzfixwaeJ_zRXz3-_Bw":{"text":"Only went here for a drink (Brandy Milk Punch) on the patio, which was fun. The decor insi","useful":0,"cool":0},"itGRw2X8Op0X2dbkvUOuzA":{"text":"Fantastic food, great atmosphere very friendly staff.  I ate here over 10 years ago and it","useful":0,"cool":0},"8GKRQPvIk-0d7uYmWasnFw":{"text":"Started with the crepes stuffed with goat cheese and shrimp (these shrimp had the snap I n","useful":0,"cool":0},"XyqK69eqojC4hoiQgD3Pyw":{"text":"The staff is so much more friendlier than past visits with the manager letting us know tha","useful":0,"cool":0},"cxCDPkYSOSBB0cTbbM_fuw":{"text":"We had brunch here on a recommendation from a friend of ours that lives in NO.  We were no","useful":0,"cool":0},"cfePeQ4wLQfrlEQbFr5flA":{"text":"Great food, excellent service. A 10 minute walk from the hotels on Canal St.","useful":0,"cool":0},"K97ICOlXHkxsYXeLE_hqCQ":{"text":"Unexpectedly wonderful. I had walked by this place on our last trip to New Orleans during ","useful":0,"cool":0},"z7zdSrGvFymxMv2nRytOTw":{"text":"Food is AMAZING. But when we went our waiter just walked off mid conversation and when we ","useful":0,"cool":0},"X4pX2fI3Qs4FVd_2KvSZTA":{"text":"Came in for dinner for my moms birthday and had an amazing time. The history of the buildi","useful":0,"cool":0},"y3Mnv12Uf5_T_upQkUXq7w":{"text":"Excellent restaurant, food was absolutely delicious. Prices are reasonable and atmosphere ","useful":0,"cool":0},"L_JKOTlMIWL2v335YC1O-Q":{"text":"The pecan crusted baby drum was incredible. The bread pudding was good but could've been a","useful":0,"cool":0},"DIhRGtUCD3BhvcHUKkBJEw":{"text":"What an amazing place! I came here while in New Orleans for a conference and I loved every","useful":2,"cool":0},"IstHepJMq78uLntuZbx_HA":{"text":"Four stars for the food, and an extra star for the great service.\n\nMy boyfriend and I dine","useful":3,"cool":1},"IP0QXTJSB9rQSm4eJINNdA":{"text":"Dinner is served at 5:30p. I got there early at 5:10p, a waiter stopped me at the hallway ","useful":1,"cool":0},"gSv8_hcN8BexJbuUBxupMA":{"text":"Muriel's is a gem!  An outstanding value for the price.They have a pre fixe menu that is p","useful":1,"cool":0},"h22pDq64akniC8S7Zj-Ewg":{"text":"Very nice service and staff. \nProbably the best bread pudding in town (maybe even above Th","useful":0,"cool":0},"13pZ6LqkFFSluDh2Q7MlBA":{"text":"I must start with saying I just might have made a bad order...\nThe service was really grea","useful":0,"cool":0},"rCDvjYUzLzSzjaM4kQcDBw":{"text":"I hosted a private dinner here last year for 30 people.  \n\nMuriel's came highly recommende","useful":0,"cool":0},"TCen7MQfcOK0d_ZOjyOx9w":{"text":"The service was remarkable, the food exquisite and really deserves a 5 star rating, unfort","useful":0,"cool":0},"OZ9zDkkokq5X1ta-UkWQHA":{"text":"As regular visitors to New Orleans, we make it a point to visit Muriel's for the Sunday ja","useful":0,"cool":0},"j2oG7FK23derm-oY7bEJLA":{"text":"In a city where even the B-team restaurants would rate five stars in other cities, this is","useful":0,"cool":0},"7sqG3QpVHiu0Wou-2EEwfg":{"text":"Went for the jazz brunch. Both the jazz and the food were outstanding. I had the shrimp ca","useful":0,"cool":0},"nDV3R271FK5M_yxNKwvu8Q":{"text":"While the crab cake was not for the connoisseur, it was for the everymans palate. It was t","useful":1,"cool":1},"wXS7rk_-daycEnq84khG2w":{"text":"The host/ess (we ended up coming here twice) were nice and we were seated quickly without ","useful":1,"cool":1},"fPpi30bTXc11F5PotpupBQ":{"text":"I ate here with my family the last weekend, and wasn't as impressed as I thought I would b","useful":1,"cool":0},"mpGrz7uS8V4WtrBqhHyUEA":{"text":"My friends and I came to this restaurant last night (visiting from out of town). Our food ","useful":0,"cool":0},"ujqt0oHjP1UjcPygcxsNUA":{"text":"Sunday brunch with family (16 of us )...amazing atmosphere, service and food is even bette","useful":0,"cool":0},"9-XftYSxUGgT-VI28wy1jA":{"text":"Lunch at Muriel's is a family tradition. ALL dishes are favorites. The bread is amazing!","useful":0,"cool":0},"mjyazWrtsBaTa6lei9d7Zw":{"text":"We had a pretty perfect meal here.  We found ourselves in the Quarter on a Friday night wi","useful":0,"cool":0},"fPFItZD_BOOHWTxp5dZTsg":{"text":"We tried the wild mushroom Gnocchi, and also the pain perdu for dessert which were both ou","useful":0,"cool":0},"jxBSGxFt-mFavJ7OM-XpqQ":{"text":"After taking a tour the first time I was in New Orleans and hearing about the ghost table ","useful":0,"cool":0},"iLPQMdwrIVGPR5KRshD8aA":{"text":"Great food and great service! Since the location is in the tourist hub I definitely was sk","useful":0,"cool":0},"G8lBIYJk3ml8a25aYqi58A":{"text":"We had an awesome experience at the rehearsal dinner. The filet was succulent, and the wai","useful":0,"cool":0},"s5BjFcSczkW1VJyDkLZtXA":{"text":"I was very impressed with Muriel's. We went for the Sunday Jazz Brunch. \n\nThe staff were k","useful":0,"cool":0},"UDxGL3QHGVvf3AqXkjxcVg":{"text":"This was the PERFECT place for a swanky family dinner. The actual building has that cool, ","useful":0,"cool":0},"Ukw1vb_m8S3uPOCgb9QSLg":{"text":"good food good waiter. but this woman who may have been a floor manger spoiled the mood by","useful":1,"cool":0},"TnRLqaEiV4ltpt3xfQobcA":{"text":"A classy old restaurant with excellent food.  Not a cheap place to eat, but worth the pric","useful":0,"cool":0},"upEUOHrD_c84F3jJuN6SVA":{"text":"This place is so yummy!  You simply must dine here.  \n\nMy three friends and I made a reser","useful":0,"cool":0},"crrm947sB5WFwxoqLtJ4jA":{"text":"food was great but service is very bad. our server never asked how our food was or if we n","useful":0,"cool":0},"K_O0L6xFrVAV-aPB3ZYpNw":{"text":"The atmosphere...I love all the portraits and ghostly feel. Prefixed meal is the best deal","useful":1,"cool":0},"f4FhJGcUTBg2Z67nxXXW3Q":{"text":"Definitely recommend this place for a weekend jazz brunch. There are two dining rooms, and","useful":1,"cool":0},"RYk3AoWUvyglNdUD1aJQTw":{"text":"Ate here during Coolinary (August). Excellent service. The fried gator, seafood bayoubaiss","useful":0,"cool":0},"x7gDwbehBPxjHiYoa57qkA":{"text":"OMG!!!!  Muriel's was one of the best dinners I have ever had!  About 9 co-workers and I w","useful":2,"cool":0},"A1rTw9f2or7lLlUN8DXmKg":{"text":"Went on a News Years Eve thing. Price Fix, \"Banquet Style\" Pick your choice of three kind ","useful":0,"cool":0},"EA75xOR_CmgwrdQiX1meqg":{"text":"This is a great place to have business meetings in New Orleans. The wait staff is a bit ov","useful":0,"cool":0},"r-4K5bBP4lz2_o_TQIOjBg":{"text":"We went with a group of eight,  including a baby, in between lunch and dinner. The staff w","useful":0,"cool":0},"TKEsBCbFgwVYhb6uN1Tn9Q":{"text":"Call me heart broken!!!! Muriel's of my dreams has passed... I travel to Nola several time","useful":1,"cool":0},"9RikAirbVMofIdUQOPTMMw":{"text":"so great!! I had the goat cheese and crawfish crepes for an app! INCREDIBLE! like little p","useful":0,"cool":0},"l8Jl6ADvZwSJfkgreb1xvw":{"text":"Best place hands down to get the best turtle soup in NOLA! And the Bloody Mary's are scrum","useful":0,"cool":0},"4kEv_FerM7fRi1v5bZaZpg":{"text":"This place is great, amazing food and service. The gnocchi appetizer with their bread (whi","useful":0,"cool":0},"dWB8fBNKE-OW1c34dM0cuA":{"text":"I would give this restaurant an extra star if I could for the friendly waitress from New Y","useful":0,"cool":0},"tH_rAF4V17GZW1vYW24KTQ":{"text":"A great place for lunch with a mix of visitors and locals.  They have some good specials a","useful":0,"cool":0},"7NK0sBfirVbXDZU433g5Sg":{"text":"Muriel's was the first stop when we arrived in New Orleans. The restaurant was everything ","useful":0,"cool":0},"fjdoS9FDY6HPksk3HXseUQ":{"text":"We made a reservation, then arrived 45 minutes early and were seated with no problem- a bi","useful":0,"cool":0},"xDOe3pq1D6LOSMkcHBRlnQ":{"text":"I had dinner at Muriel's last night and it was absolutely delightful. We had no reservatio","useful":0,"cool":0},"owLJjQXC3dyJpks9esUYzA":{"text":"Such a delightful restaurant with the bomb bar! We decided to try Muriels for dessert and ","useful":1,"cool":1},"gO9mesuiF410zJ9CEffv0g":{"text":"Great spot for delicious food right in the heart of the French Quarter. We stopped in for ","useful":0,"cool":0},"ggYBkq-iuQ2sTD7uR7a9ag":{"text":"I've never had a better dining experience. Muriel's three-course meal was the best I can r","useful":8,"cool":5},"Qaoj57TlBdKcRyYhC7belg":{"text":"Very nice atmosphere. Great location in the quarter. The wine and aps were very good and a","useful":1,"cool":0},"QqoCESNu3IcC9lACjKsoKg":{"text":"This is a beautiful building with great ambiance. Staff was awesome. Great location! The f","useful":0,"cool":0},"_3QKp2PBnxPloqa2P2htVw":{"text":"The food, drinks and service were sub-par. Upon ordering out drink, we were told that we h","useful":0,"cool":0},"5eTkn94RPYVVUVyxJcu1zw":{"text":"Stopped in to have a beer and sit on the balcony that overlooks Jackson Square. The staff ","useful":0,"cool":1},"ICW-dp9LOAdYFjkQ44w-gw":{"text":"We stopped in Muriel's randomly one day while headed towards Cafe Du Monde.  It was kinda ","useful":0,"cool":0},"JAzV6XGIK4mhLU5iyFTMng":{"text":"I wasn't impressed!  My husband had the pork chop which he said was good...I had the fish ","useful":0,"cool":0},"XoZNZmCcwIxUkM1HxGhFsA":{"text":"Love the bread....mmmmm. Love filet and shrimp. Love the music and red room with chandelie","useful":0,"cool":0},"53PgfSPaod3DRoE2V75Z3Q":{"text":"Dinner at Muriels was the best meal I've had since I've lived in NOLA. (4 months)\n\nThey of","useful":4,"cool":0},"4gK8aqdfxc6GoQs-1AGPXg":{"text":"My first taste of drum fish, it was delish!  Get the cheesecake appetizer, savory and rich","useful":0,"cool":0},"NNRt48zWu9uFlVJ2OXjqxw":{"text":"Great atmosphere in the courtyard, really romantic atmosphere and great ambiance throughou","useful":0,"cool":0},"Xif5uxzSbB2cujmShuATGw":{"text":"Muriel's has been my best dining experience to date!\n\nI went to New Orleans in September f","useful":0,"cool":1},"YP2rQLouqTj10Cf6dfLy6A":{"text":"Stopped in for  some food after hearing so many good things about his place. Let me tell y","useful":0,"cool":0},"9APhXae35vkjEaHIDpSBLg":{"text":"I had gone with a bachelorette party and ordered from the pri fix menu. Everything was won","useful":0,"cool":0},"3ru-kq017lCRMjlpOfu_BQ":{"text":"From DC. We had an amazing dinner night in here. Recommend by Amex card. We ordered 3 cour","useful":0,"cool":0},"Ibi8N4tWLEN_cDCt8WhKyA":{"text":"Came for the Sunday Jazz Brunch.  The Eggs Benedict was so good I gasped when I took my fi","useful":1,"cool":0},"cdHG8GSqS4oRxGRyXUCDKA":{"text":"Great atmosphere and amazing food!  Turtle Soup was delicious.  Blackened Red was perfectl","useful":0,"cool":0},"J63g0kNVlCcqIOfSdjA-Yg":{"text":"We were in NOLA in October 2012 for a convention, and spent a good bit of time walking aro","useful":0,"cool":0},"vXxgctSNVdGR8_D-vvPB_g":{"text":"I am a huge fan of deconstructed salads. The traditional \"chop everything up and put it in","useful":4,"cool":5},"FhURI21wajlJKj2d9E8CHw":{"text":"Pros: Food has excellent taste, portion sizes are good, atmosphere is elegant\nCons: Servic","useful":0,"cool":0},"rlEpV-81XWtq-8PeamXTug":{"text":"Hurricane and Bread Pudding, need I say more? \n\nThe hospitality at Muriel's cannot be matc","useful":2,"cool":0},"DNDdJ914rjQ1bSWPYNy8hA":{"text":"Eat the bread!  \nI know I know we stay clear of bread but this.... this bread right here w","useful":2,"cool":0},"njQtmij95Y5MWKAGMqeeGw":{"text":"At at this restaurant yesterday and it was an enjoyable experience. The food was  good and","useful":1,"cool":0},"FVk6yX9YOsZ3EDTDr6ESfg":{"text":"So I have finally come to accept that my favorite restaurant that I DON\"T eat at enough is","useful":2,"cool":2},"U5wXI2xYAU59BllT0Q60gA":{"text":"A group of us went here for dinner. One of the really good things about Muriel's in additi","useful":2,"cool":1},"yzEgRxW62WT5VentZPmIEA":{"text":"I attended one of the best rehearsal dinners in my life at Muriel's. Absolutely spectacula","useful":0,"cool":0},"Ap07vFL0acRr0fbbi3zE4A":{"text":"A nice place to eat. The service is superb. Great food and good drinks and awesome dessert","useful":0,"cool":0},"tMwxJ8-IQpjx00NnxpSDqQ":{"text":"This is a dining experience you will never forget. Muriel's brunch is absolutely amazing a","useful":7,"cool":4},"DIQW3K4fNkEY1AaVlyiWxw":{"text":"It started bad from the beginning. We ordered martinis and asked that they be served very ","useful":4,"cool":0},"bJjY2YS3_rCgniT-uWRajA":{"text":"Stopped in at Muriel's on the square and what a pleasant surprise. It had been 3 years sin","useful":0,"cool":0},"4McXHTHFkKKFkovRTVsglA":{"text":"Wow...this was a great dining experience from the shrimp remoulade, blackened redfish and ","useful":1,"cool":0},"4z_kGiL-i7Y6GgxBsrKtHg":{"text":"Pretty high scale looking place but not too expensive. Excellent customer service. I was t","useful":0,"cool":0},"_6q_15tbnJMltgaSc0vJOA":{"text":"Terrific location, history, and decor. Ample drink selections and nice menu. Our food qual","useful":0,"cool":0},"t6E4KHQXCsH9dqwBZ_i0eg":{"text":"Excellent food and service. Baked oyster app was amazing. Bouillabaisse was one of the bes","useful":0,"cool":0},"_4uRPO1d26v9p0UahEiNtw":{"text":"Go for the Sunday Jazz brunch! But make sure you make a reservation ahead of time. The Jaz","useful":0,"cool":0},"iiaOI8KqHjyrEd1mGR1WPg":{"text":"Muriel's is known for its haunted past. They even set a table daily, food & all to prevent","useful":0,"cool":1},"kuEChm4irHmMKSuTQFL8jg":{"text":"This was one of the best, most reasonably priced meals that we have had in NOLA.  My husba","useful":1,"cool":0},"cF32-7MGRX09OA8j1BZOWQ":{"text":"We decided to make reservations and have a birthday brunch here.  There was a very limited","useful":0,"cool":0},"5UNabcEiUX14zWpNVeUDlQ":{"text":"Visiting New Orleans in August when it's 95 degrees with 1000000% humidity has it's perks.","useful":2,"cool":1},"VuWsMJOh2fAanKe3g7YkqA":{"text":"I'm going to have to say my experience was just okay. I was really surprised considering a","useful":0,"cool":0},"jXdClpt5GY2jqqdOwNIVgA":{"text":"We came in last Monday to try the escargots,  but there were none available for preparatio","useful":0,"cool":0},"XWyRCHvQPXmk5sDodyLtZg":{"text":"Looking back at my reviews I can't believe I haven't left one for this incredible place. T","useful":0,"cool":0},"eqkwe4LyXk4iIvzVFL3Lpw":{"text":"Went for lunch on New Years Eve - we has reservations and a table was actually waiting for","useful":0,"cool":0},"XU9gb7V7x5Pzk1zq3F64EA":{"text":"We had a work celebration tonight at Muriel's. It was awesome. We each decided to try the ","useful":1,"cool":0},"gn-QW0QAbAc1hYvZr6AGjg":{"text":"Amazing.  Best tomato ever with the eggs bene.  Perfectly cooked.  Eggs perfectly poached.","useful":0,"cool":0},"6dEfHfShC9vyFL6lQMA4EA":{"text":"Came here after a bad experience at stanleys.\nI was given 5 star treatment and the food wa","useful":1,"cool":0},"OEJL42UkV3Gx-zAysI4Nvw":{"text":"This place is the definition of what a high end restaurant should be like.  Amazing, frien","useful":0,"cool":0},"zK1K9E8-93G6qAs8TSj-Tw":{"text":"Certainement l'endroit avec la plus belle vue sur Jackson Square. Vous pouvez boire un coc","useful":0,"cool":0},"Y9TqgTfp6zgzusexY20klQ":{"text":"Went for lunch on a recent trip.\n\nService was excellent; lunch was delicious ( I ordered t","useful":1,"cool":1},"gawtGi-20zxx2w5-DkmYJQ":{"text":"This place was absolutely wonderful! the food was so good and the service was amazing. eve","useful":0,"cool":0},"FQwhHa0OE_lJ20u8w8aFaA":{"text":"There are lots of good reviews for Muriel's and all of them are deserved.  This is a beaut","useful":0,"cool":0},"DZNoIMhngwH9KYc7iBr76w":{"text":"Got in on a Saturday morning with last minute reservation. Excellent choice! Service was s","useful":0,"cool":0},"KerH8_kGawWt77nFtUUEHg":{"text":"Stopped here solely for the crawfish crepes..... amazing! We say st the bar, dined, and ha","useful":0,"cool":0},"eVQj7A3_VI6RgCH5-MU8kw":{"text":"Clearly I'm in the minority here, but in my opinion there are far better restaurants in NO","useful":2,"cool":1},"2xz05B3a18cSw07iuho50A":{"text":"Omg...It's so amazing and delicious food.I love it...I really recommended.Good choice and ","useful":0,"cool":0},"xupClSwatok3Js2xSA-jsg":{"text":"This was an excellent stop for a \"light\" meal before going to hear John Boutte at the Cath","useful":2,"cool":0},"dZZcqjQM06_UCe8_0HEqCg":{"text":"This was probably my favorite meal out of my stay here!  Goat cheese crepes.  Need I say m","useful":0,"cool":0},"t8KOkE9Kupstpoz7TKd6vw":{"text":"We never miss this place when we go to New Orleans and it didn't disappoint.  Six of us us","useful":0,"cool":0},"RpnBq94a2EkrU9OcNraW2w":{"text":"I was in town for my birthday, which happened to also be during restaurant week! I ended u","useful":0,"cool":0},"qasoLhBpeHbPzYAiqTY67A":{"text":"There are a lot better options in the French Quarter.  A local told us to come here.  We o","useful":0,"cool":0},"GUGjKpXmUfub_pd2e_XnMQ":{"text":"This is an upscale restaurant with a formal setting and service.\n\nThey called the day befo","useful":0,"cool":0},"sXwSC-O_Bg0-HVUfhBZN2Q":{"text":"Great location and atmosphere but the food is just bland.  Not a lot of flavor, it seems t","useful":0,"cool":0},"S1lt2FziaUluQoKtEvZunA":{"text":"Still my favorite nice restaurant to eat at in New Orleans. I love that they not only have","useful":2,"cool":0},"cPYO2FkOaUUyqFOnjQ8prw":{"text":"I will start with the only negative issue.  The turtle soup, while delicious, was way too ","useful":2,"cool":1},"9ByAY-ZJ4J8vM94tqoNBSg":{"text":"Holy amazing food. Go for 3-course creole menu if it's available - you'll spend just as mu","useful":2,"cool":1},"Tl2eTBMzrfTmPLaVYH-xyA":{"text":"Excited to find this place in Jackson Square it's a lovely place in an old historical buil","useful":0,"cool":0},"6Ls15S30rbFidfd75a2VXw":{"text":"I've been here a couple times. The first few were amazing and I couldn't stop raving about","useful":0,"cool":1},"CG49diiTcBJdrcy2WyQ92Q":{"text":"Amazing pork chops! The pre fix menu is a good deal and seems to be always available. 39.9","useful":0,"cool":0},"mTQHbJcnpC_WucF5OKBfXQ":{"text":"have attended convention gatherings held here multiple times. has the haunted feel occasio","useful":1,"cool":1},"lVUBRDgHobkKngvjIFyWWw":{"text":"This was an amazing place. The food was incredible, drinks awesome, and service impeccable","useful":4,"cool":1},"POtejQCAXFEFdt9pxYHcug":{"text":"Every time I'm in New Orleans I make it a point to come here. The pork chop is fantastic!!","useful":0,"cool":0},"xMJYYNoPJW9oFwzekbYuwQ":{"text":"Wow, what a great place!!  We ordered the 3 course and came out full and satisfied!!  Hubb","useful":0,"cool":0},"G5C7UnczjOGwnJccTZJWcw":{"text":"One of the great New Orleans restaurants that flies below the radar. This is slap bang in ","useful":0,"cool":0},"SVoFu17MaUayX2X4Ug6bIw":{"text":"Loved the ambiance, the service, and the food.  We had the turtle soup, gumbo, duck breast","useful":0,"cool":0},"5asjviwtJCGnLJmbbttp-A":{"text":"Had a great dinner last night with wonderful wine. Would definitely recommend the magnum o","useful":1,"cool":0},"sCDiG_rtIqY2qnKmU_6x7Q":{"text":"Beyond disappointing. From Chicago, came here with my girlfriend on Thanksgiving. They had","useful":0,"cool":0},"mIo3aJEgML5oImSc95qNKg":{"text":"THINGS TO ORDER: TURTLE SOUP, AND THE GOAT CHEESE CREPES. YOU WON'T REGRET. \n\nBeautiful at","useful":3,"cool":1},"Dr0kT4J6RhX0VyjZc4dvVw":{"text":"It seems to me that Muriel's is under-appreciated, and I can't see why. It is possibly my ","useful":2,"cool":1},"6t9Cczacfqrj-wtxO5DMyw":{"text":"Food was above average, decor had New Orleans atmosphere which we loved and the staff was ","useful":0,"cool":0},"RH97wPsSwcEz6cUOSXkedw":{"text":"- Very good service\n\n- The pacing of each course was a couple minutes too slow, but that's","useful":0,"cool":0},"32v3nlVtkzSJ1MlwAbsi9Q":{"text":"We ate here twice during our visit, both times for lunch/brunch. Both meals, including coc","useful":0,"cool":0},"3VQrF5H2_yKFrZgZYYfV8g":{"text":"I have only been to this place for dinner a few times, and for drinks about half a dozen t","useful":1,"cool":1},"9DNEc4QOo9x70gh4qWLbZw":{"text":"The shrimp and goat cheese crepe is SOOOOOOOOOO FREAKING GOOD!!!! The rest of the meal was","useful":0,"cool":0},"9ddKq1e9Iecy71-zturHtA":{"text":"The food here was high-quality -- as you'd expect for the price -- and I appreciated that ","useful":0,"cool":0},"5AYF3XIMOxvAKbSzgFI5_g":{"text":"Pricey but good. Came here for brunch. Cute atmosphere (almost stuffy) but great service!!","useful":0,"cool":0},"NMbRZ2Rr6xFCX-SBBl3rhg":{"text":"Wonderful dining experience. Pan seared salmon was perfectly cooked and flourless chocolat","useful":0,"cool":0},"6DgVKzXzm1UPyO-oulTDDQ":{"text":"Did not have a reservation. The hostess made it happen for 6 hungry girls on a Friday Nigh","useful":0,"cool":0},"jn63ZsJOoIO4RtMCk9NGOw":{"text":"Had Mother's Day dinner here with my wife and 3 year old daughter and it was phenomenal, a","useful":1,"cool":0},"DU6M7uCuc-vkoN0L4fuiwQ":{"text":"Added to one of our \"will definitely go again\" places in NOLA. The dining decor is fabulou","useful":1,"cool":0},"jwz9KO80bZ-CDFlloVeH2Q":{"text":"First time dining at Muriel's. I absolutely loved it! I brought my mom for her birthday an","useful":1,"cool":1},"EldSMF0-dC1kRUHmBU-lcQ":{"text":"We visited on Easter Sunday for a late dinner, reservations at 8:00 There were 7 of us din","useful":0,"cool":0},"Ax46Jq4MyAsZWtvxHth2bQ":{"text":"As part of a tour group having prepaid for dinner, I expected a \"select\" menu of a few ite","useful":0,"cool":0},"i6RezyH4II-7LklTi0cDHw":{"text":"Came here for lunch. The atmosphere is nice and it's close to Jackson Square. My husband a","useful":1,"cool":0},"L-DhVUgvDkva5TH779YUZA":{"text":"Excellent restaurant and going upstairs to experience the seance room is super cool.\n\nComp","useful":0,"cool":0},"np7Uykt8aAUNYMkAmQcz_w":{"text":"The last time I ate at Muriel's was in 2006 and the food was fantastic.  This week the foo","useful":0,"cool":0},"5JkaufXXAZ7QHvfjHstogQ":{"text":"My wife and I attempted to have lunch at Muriel's on a hot, summer day (July 3); however, ","useful":0,"cool":0},"VDRBW3pmESIakwQAmivhfw":{"text":"The most imaginative cocktail menu I've ever seen. Complete and utter shock to the taste b","useful":0,"cool":0},"zCoz7F_TejMyVzoqL7qSuw":{"text":"One of the less touristy places in the Quarter.  Great, great cocktails.  All the food we'","useful":0,"cool":0},"DCFUIF7VNm8KrHeDHvdzGg":{"text":"Fantastic stop on vacation. It was a little fancier than we were dressed but they made me ","useful":0,"cool":0},"VJ5nIYHcXPmivJhFNtsZFg":{"text":"My wife and I had Thanksgiving dinner (special menu) at Muriel's and we couldn't be happie","useful":0,"cool":0},"V7fnJOhPyBoKhcV-Pl7A2g":{"text":"The Veal and Crab were excellent.  The best meal I had in New Orleans that weekend.","useful":0,"cool":0},"Us1UFEadukqwVbljOmkv-Q":{"text":"Delicious Southern creole menu.  Turtle soup for lunch was outstanding!","useful":0,"cool":0},"uaoVEXNkn8v1h45DBEUg6Q":{"text":"We chose Muriel's based on a local chef's recommendation and were very happy to have taken","useful":0,"cool":0},"Jlk7puWY23iYQX2OuIMexQ":{"text":"Based on the wealth of positive reviews we were expecting a little bit more from Muriel's.","useful":0,"cool":0},"y62z2xlV-IE5JHfQ1SMvUA":{"text":"I can't wait to go back to Muriel's!  A lovely, intriguing setting (where haunted meets hi","useful":1,"cool":0},"X1XbxnQxC5jHk-hw5Gw3sg":{"text":"The food, location, and history of this place is great. Check out the ghost's table and up","useful":0,"cool":0},"0U_yFnubGAi_CNIHIgHEkw":{"text":"We ate here this past weekend with a group of 11. Everything was excellent! We all had the","useful":0,"cool":0},"TxLEIgukwW3unakfKb_CmQ":{"text":"I was looking for the best jazz brunch in New Orleans and ended up going with the majority","useful":0,"cool":0},"cu2snRSlaJUYxmGWCSdhlw":{"text":"We were told about this place by a tour guide so we thought since he was a local. .this wo","useful":0,"cool":0},"y6MkwkyXncUwt9L6jyi4fw":{"text":"I'm a local, and I highly recommend the Sunday jazz brunch. Great food, great music, and g","useful":0,"cool":0},"Rbv9i_8PamWq_gv2rP1XmQ":{"text":"Excellent service, prices a little bit more than the casual dinner, but worth it.  Very ni","useful":0,"cool":0},"T-cx0yURffNkPkzZ9Iimlw":{"text":"All of us got the menu deal since it was the best option. I got the shrimp and grits which","useful":1,"cool":0},"r_tgSz9sLGb3cRRFQtAxlg":{"text":"This is my favorite restaurant in NO.   I come here every couple of my months for work and","useful":0,"cool":0},"HktMuEKss4jQWj_LDkThnw":{"text":"I have heard wonderful things about this restaurant.  I can only speak to the atmosphere a","useful":1,"cool":0},"-Z7zzDg5Y6pn7YIwmz37kQ":{"text":"We love this place. We've been many times and just as good every time. We usually get the ","useful":0,"cool":0},"1dMOmKqDa2oIS8W_vh__qg":{"text":"Had a celebration dinner at muriels recently with my family.  Our food was simply amazing!","useful":0,"cool":0},"56P7_NXS05487JsA-9smYQ":{"text":"Probably my very favorite restaurant in New Orleans! My mom and I were visiting for Christ","useful":0,"cool":0},"goIAEm2Br7swFI-vXvvqYA":{"text":"This may be one of my favorite restaurants in New Orleans! Great service, beautiful restau","useful":0,"cool":0},"W83g466Zj2dmby2mwbQiww":{"text":"Food fantastic, service excellent, atmosphere energetic. Wonderful building and location. ","useful":1,"cool":0},"QzS9zFEcZ4b-8DMrKWdtzw":{"text":"Two words: Bread Pudding.\n\nWe came just for the bread pudding, which didn't bother them a ","useful":3,"cool":0},"IUjlD59nsJFA5NpVYJ6Y1Q":{"text":"One of the best places in New Orleans. Great food. \n\nGet a Pimm'c Cup and get crunk.","useful":2,"cool":0},"ALSXOENVp6Ze4gGxaYjn6g":{"text":"A solid meal in a great location.  The waitstaff was friendly and the restaurant was prett","useful":0,"cool":0},"ExPgjPHqcdtB4r0__qwPJw":{"text":"This was one of our favorite restaurants while visiting New Orleans! I love the cuisine an","useful":1,"cool":1},"Ecp_LFUmVoIpomdqJdYBkA":{"text":"All I have to say, is get Double Cut Pork Chop. Honestly, this was my most memorable meal ","useful":0,"cool":0},"ktdPImPq_IwQ_vL2nmudWw":{"text":"PRO:  The quality of the food does match the price.\n\nCON:  VERY starchy white table clothe","useful":1,"cool":0},"rzXO9PS8maH67yuSFc4MoA":{"text":"Gorgeous atmosphere for old world romantic setting; impressively quick service; fresh catc","useful":0,"cool":0},"UV8ALwTT1xk6G_AKx3I_XQ":{"text":"Possibly the finest Food and Service in all of New Orleans. Reasonable pricing for incredi","useful":0,"cool":0},"ixXpr7XEao_uWlVonH7zfA":{"text":"Hostess lied and turned us away from getting drinks on the balcony.  Admit to being dresse","useful":1,"cool":0},"KMOxReF1UcWXkgRQQUp2PQ":{"text":"We stopped in for a light lunch and was greeted and seated right away.  The decor was very","useful":0,"cool":0},"wJAbcxnS9cvWlznlS2RLEg":{"text":"Liked everything we had...didn't love anything. Wellll, except our server. We sat in the c","useful":0,"cool":0},"tL3-cB9mHBsZ948GmgCeqQ":{"text":"One of my friends talked this place up, so I decided to make reservations. I can't believe","useful":1,"cool":0},"rnG4g__PkkjZNS5faXAWog":{"text":"Food - Shrimp with goat cheese crepes are freakin awesome. Wine selection was excellent. \n","useful":0,"cool":0},"TQ29st9QNxuebjadJUaiRg":{"text":"You know what? I wasn't that impressed. Yeah, I said it.\n\nThe service was apathetic, the f","useful":4,"cool":2},"0yehBQIMxwYlohT0Zc38IA":{"text":"I wasn't expecting the food to be THAT good, but it was. It came out super fast so I'm not","useful":0,"cool":0},"VhNXrd1uzH3wWLkXaMzYDw":{"text":"Just perfect !\n\nThe restaurant was recommended by friends and it didn't disappoint. \n\nServ","useful":0,"cool":0},"z3LRWS8TDgHP1bRkOXmoGQ":{"text":"This was so amazing.  We shared a three course prix fixe menu.  House salad--crazy good.  ","useful":0,"cool":0},"T8G9DMZdW9kdwg-m-8SOyg":{"text":"u gotta take your drink upstairs u can watch the bands and enjoy the beautiful view . insi","useful":0,"cool":0},"otJo55HFnTBbM-lB2XS6CA":{"text":"Outstanding! I had the eggs benedict (with salmon instead of ham for a $5 upcharge), mimos","useful":1,"cool":0},"lzPfGDqLQb93iZpHsWu9OQ":{"text":"This was undoutably one of my best dining experiences ever.  The Sunday Jazz Brunch is a m","useful":0,"cool":0},"lAXa043ekBou_xi9XFnS6Q":{"text":"definitely call to make reservations and you'll enjoy your experience here.\n\nthe location ","useful":4,"cool":1},"P4r0GOihl8E5akMko_xwAg":{"text":"Came here on a weeknight and it was almost entirely empty. I really enjoyed their turtle s","useful":1,"cool":0},"RfSIvz22y8CR-T0KmXaygA":{"text":"Stopped in on a wet, cold afternoon on the recommendation of another merchant and cozied u","useful":0,"cool":0},"voSa8A-ITKp2ahGyG-HfRw":{"text":"Oh Muriels, how do I love thee.......\n\nSo everyone orders their tuna medium or medium rare","useful":1,"cool":1},"goAjT4xeKDuM4xhYqFXbAw":{"text":"Excellent service, some of the best I had in town. Beautiful surroundings, the 'indoor pat","useful":0,"cool":0},"jSwfO9UR39Qxko6D2dPU5w":{"text":"Overall: good meal, will go back to try other items\n\nFood Quality: 9/10\nFood Quantity: 7/1","useful":1,"cool":0},"2QmvOn6lRxCd4ZZ8gXkZPQ":{"text":"Now this is what you call a lovely jazz brunch.\n\nFamed for hosting a ghost every day (prev","useful":1,"cool":1},"SQaI5ltJk6MwdiPf390nPw":{"text":"Had the 3 course prix fixe dinner, the goat cheese mascarpone crepes as an appetizer, the ","useful":0,"cool":0},"zcP42Dodb3C2pHP-Aa258Q":{"text":"Great surprise here! Just dropped in and had crawfish and eggplant soup which was really s","useful":0,"cool":0},"BNk1Qe4K5mQGgHzUnPp5VA":{"text":"Service was really great waiter was attentive and friendly. The floor manager or owner mad","useful":0,"cool":0},"utG1sF_1H7JAy4eXUP4kgQ":{"text":"Absolutely amazing food and great experience!! Everything was fantastic but the crepes and","useful":0,"cool":0},"Nn_WszDacuBZ65PNBI5OFg":{"text":"Wonderful service and flavors.  Our waitress actually recommended a cheaper wine to comple","useful":0,"cool":0},"5_ydLeadaR5x2FsLmWt1pQ":{"text":"We dined here during the week after making reservations on Open Table.\n\nWe were seated pro","useful":0,"cool":0},"_YIQqDPDSdUajVVcjPnltw":{"text":"My friend and I made a reservation for Sunday night, which was a good thing! When we got t","useful":0,"cool":0},"uebOEgA04TvZByjNzoBnTQ":{"text":"attended a rehearsal dinner in a private dining area (pretty large) upstairs.  service - t","useful":0,"cool":0},"yGuiF2vUvREuSgMspUm_TA":{"text":"Went here just two days ago as part of my bachelorette party weekend with some girlfriends","useful":0,"cool":0},"UV0ZWkjkYX_QTbChBzsIWQ":{"text":"TOURIST TRAP!!!\n\naverage food. average service. above average prices. food takes too long.","useful":1,"cool":0},"-n70odh1eJfMAfjx0Xa2hg":{"text":"I had been to a wedding reception here years and years ago so I wasn't really familiar wit","useful":1,"cool":0},"I3tCMX2_ZNSOMdkSlnB3gg":{"text":"Terrific dinner as part of Coolinary month in NOLA. Service and the atmosphere were on tar","useful":0,"cool":0},"u9fiKOPQM9aLDdJSc7F0nw":{"text":"The food is better than prices reflect, which is nice in a touristy area like the French Q","useful":4,"cool":2},"i1dfGawMhEMb6FI5cFH-aQ":{"text":"Had a really good dinner here, though the service was inconsistent.  My first course was s","useful":0,"cool":0},"M9JkfcfsVYTcw0pBvh80Gg":{"text":"Located right off of the artistically rich Jackson Square, with live jazz music happening ","useful":2,"cool":2},"9PljyM9H1kcLOCtzGvGoWA":{"text":"Excellent food but very pricey. The waiter was very nice and courteous but just did not ch","useful":0,"cool":0},"rvFmxzVqmrwcBNc6rhV70g":{"text":"Highly recommended!  Muriel's looks very cute from the outside, complete with gas lanterns","useful":2,"cool":0},"FHc6--y6sf8timmIwpsabQ":{"text":"I wasn't to hungry when I came here so just ordered a couple small things...the house sala","useful":0,"cool":0},"gUNknA5j-kiN9p_X91FOKQ":{"text":"So full...want to die...everything was so amazing.  We were torn about ordering the turtle","useful":0,"cool":0},"ebGOU-xJT3xSDX3j_LFnGA":{"text":"My first dinner in New Orleans was at Muriel's (@MurielsNOLA), a contemporary Creole joint","useful":0,"cool":0},"WV3XIAbsfXKAgIIHpsq1IA":{"text":"Muriel's is always a great local choice for lunch or dinner.  I highly recommend the goat ","useful":0,"cool":0},"f4iKzOBs23b8Dx_YG32vwg":{"text":"Muriel's is the place where food memories are made.  Every part of this meal was perfect, ","useful":3,"cool":2},"1yBShaLkvNKpP9R_1YZlGg":{"text":"Bless you Muriels! This was the highlight (food-wise) of our trip to New Orleans. The hubs","useful":0,"cool":0},"WDKGc5Tnwk_AwvQFDLngkQ":{"text":"The slowest service ever, no team work among the servers. We ordered 3 drinks, 2 came at t","useful":0,"cool":0},"b_w1GvE3wRVI8T1ntjOhqw":{"text":"I went ghost hunting in the seance room with my husband after dinner.  None of the picture","useful":0,"cool":0},"nyzxFUhziQbl-dafu3LqZw":{"text":"The garlic soup and savory cheesecake were delicious. My husband had the tenderloin salad ","useful":0,"cool":0},"GWE_VYhejcP-0BMcaQJnPA":{"text":"Excellent service and even better food!  I was entertaining important Clients and we wante","useful":0,"cool":0},"ibPiJMLLgzd4UFBdmFGrGA":{"text":"I had the goat cheese crepes with a shrimp sauce that was absolutely outstanding. And my w","useful":0,"cool":0},"SOg8Ty2pr7wMyZWCWhSsHQ":{"text":"We enjoyed the jazz brunch here this morning. We walked from our B&B and were a little lat","useful":11,"cool":9},"PCYQjQ7sq2ffW3E00jS-JQ":{"text":"Incredible food. We had the prix fixe menu which consisted of goat cheese and crawfish cre","useful":0,"cool":0},"CPe83G3ZM9_vZOWVm1i2WA":{"text":"Finally had a great meal in NOLA. For as much as this town is known for food I have found ","useful":1,"cool":0},"TMM4CM4phPm5AFYyjM3o5w":{"text":"I came to NOLA from Brooklyn, NY with my father for his 60th birthday.  Muriel's was the f","useful":0,"cool":0},"GpyNDq1Sz6HwPyvsi-UEoA":{"text":"The food was surprisingly great. Our server went above and beyond to help us find somethin","useful":1,"cool":0},"hESHEyERwS1A0Sp5hdjkYg":{"text":"Drinks are killer.  They make a great old fashioned.  Shrimp and grits is the go to entree","useful":0,"cool":0},"0oINKzOswYFgu8E7Y9qq6g":{"text":"Muriel's delivered on the best meal I had in my short stint in NOLA, and I should be clear","useful":1,"cool":0},"Wx10CfwWQ7HUBxw8QDrM9w":{"text":"We enjoyed brunch here.  The shrimp with grits was fantastic - good quality jumbo shrimp w","useful":0,"cool":0},"NnAYqJWvr0ezX_sAZG1MPA":{"text":"I know this is near a tourist area, so I didn't know what to expect. However, the owner of","useful":0,"cool":0},"N_sok3W2XnshFa_ayY_rIg":{"text":"Maybe it's because it's in a high traffic tourist neighborhood, but I was expecting a lot ","useful":0,"cool":0},"3Ax47E824hgcATwqxwK02w":{"text":"Visited here on a recommendation from Frommers guidebook on my first visit to New Orleans ","useful":0,"cool":0},"t4N_dTAWxGoKKz4-45OBeg":{"text":"Great location in middle of Jackson square. You could argue that it is a little bit of a t","useful":0,"cool":0},"9n6Ed7mkdq-zLbULzjOKEA":{"text":"This was easily the nicest restaurant I dined at during my stay, even though I did it with","useful":2,"cool":2},"y2YrsmJnywCpN_A3d16Ohw":{"text":"I hate telling anyone this because when you find something this good it just gets busier. ","useful":0,"cool":0},"koZGFcQePT7CETEJMcJ_4w":{"text":"My second visit to Muriel's.  I cook Creole at home for special occasions, so I like to vi","useful":0,"cool":0},"XmTJX2xLCOCb_jHB-UTpPw":{"text":"Everything was delicious! Started with the beet salad followed by the redfish, then bread ","useful":0,"cool":0},"Mv2crsSySiIaliJZcdzCaA":{"text":"Love the soup, the service and the location. Ask to have a before or after dinner cocktail","useful":0,"cool":0},"nV5n9Xfyt7EHLc8QMHrS8g":{"text":"I really liked this place! The food was really good. I had the shrimp and grits and the se","useful":0,"cool":0},"4moo9MxAEVgbOQei9UWEeA":{"text":"If you're looking for a fancy dinner while in New Orleans this is the place. This is a whi","useful":0,"cool":0},"2-nKlq_vp2XmniPVtMpzoA":{"text":"Amazing food. Amazing service.\nI proposed to my wife here this is the restaurant we will d","useful":0,"cool":0},"065qh6S9CJMGnx4UYF7xFA":{"text":"Have dined at Muriels twice - both times the food and service were outstanding. Pleasant a","useful":1,"cool":0},"rvFQL0IfKtDO3dKMnmuxwg":{"text":"Very good! Husband and I enjoyed the \"prix fixe\" (spelling?) menu and were vey happy with ","useful":0,"cool":0},"VVQ1u9UR6StVRlhHqpv0ug":{"text":"Excellent food (duck breast, glazed sweet potatoes, pork chop, and crème brulee). Professi","useful":1,"cool":0},"_QLmRsNTFGmUfgabr9uiMQ":{"text":"Muriel's was a great place from the beautiful ambiance to the decor and staff. It provided","useful":0,"cool":0},"aGd9KUevxl_ZS6L54RHOig":{"text":"Holy portions bat man! My husband and I came here for our 10 year anniversary dinner and d","useful":0,"cool":0},"bEoPWik6zAND71WlpCkZPw":{"text":"Another place checked off our list of \"places to eat in Nawlins\" in our most recent trip t","useful":1,"cool":1},"huB19h2sao1mRcSnEzNUug":{"text":"Wow, enjoyed the atmosphere and the wait staff. While here one should try the Turtle soup.","useful":0,"cool":0},"s-aej1vevxfxViiU8NZi8Q":{"text":"My husband and I visited Muriel's to celebrate our Anniversary. We were seated between a S","useful":0,"cool":0},"pFmqXVlpWDMQ9Mdy36uNmg":{"text":"Nice atmosphere and drinks overall. Moscow Mule a bit too sweet. Amazing shrimp and goat c","useful":0,"cool":0},"xJBR2JkdhQ7isVAlgfRWIQ":{"text":"I did a lot of research before making a reservation at Muriel's. We were seated and waited","useful":1,"cool":0},"JyUHK8c8qqvb6QUNTy9leA":{"text":"Had a wonderful meal, great ambiance. Pricey but worth it.","useful":0,"cool":0},"tQr1FddMZ7Ispi2yCWAhag":{"text":"While not the most interesting food I had on my trip, the food was excellent and the servi","useful":0,"cool":0},"1SNTguFMn5jBWt2KLG_7XA":{"text":"Must go for the Sunday Jazz Brunch, it creates a nice little ambience. I had the New Orlea","useful":0,"cool":0},"BN6lwm-j3iiagXweum6cfA":{"text":"Great location. Friendly service. My personal favorite of the place is its ghost seat with","useful":0,"cool":0},"5oCnzDzKYoR2Lyh4AAM4gA":{"text":"Soo cool.. have a waiter show.you around there is some really cool things to see.. their f","useful":0,"cool":0},"LeGAbvNMCiIJzm7Tpph5Pg":{"text":"Ate dinner at the bar.... Nicole was the best in NOLA! Very attentive and professional. Dr","useful":0,"cool":0},"2086vfm090oSJMDU6-JsBw":{"text":"My husband and I have been going to NOLA for 17 years now. Our favorite place to stay is P","useful":1,"cool":0},"yKy_QtfRFafC_cuR6VkkhQ":{"text":"Great location on Jackson Square, excellent food and service.  A make you want to return e","useful":0,"cool":0},"6eBO9VmmgRDTwFutHjZeAw":{"text":"The only redeeming quality is the service.  We ordered the prix fixe menu of crepes, shrim","useful":1,"cool":0},"Rt-KjsAfO03TtYeeQSpPxg":{"text":"First of all, the waiters were quite friendly. One dropped a glass, but the staff just lau","useful":0,"cool":0},"aT3YptROa8gWY-8-tHjEbQ":{"text":"Went here with a friend for a fun night out.  Long story short, my friend managed to lose ","useful":0,"cool":0},"gmF5dJJTOJIpM-Uhwbwfvw":{"text":"Beautiful place. Decent selection of foods but very pricy. You can go upstairs and see the","useful":0,"cool":0},"Lpf8SS77RbqY65PPna46dQ":{"text":"Enjoyed a recent Sunday brunch while visiting the French Quarter. Lovely surroundings with","useful":0,"cool":0},"7Bsd27gsbtDoxY1ZABe7FA":{"text":"Great experience for our group on a business trip. A traditional new orleans foodie place.","useful":0,"cool":0},"H6H512KFz3qGdeDykvByBQ":{"text":"My grandfathers brought me and my husband here for my birthday. My husband was sceptical a","useful":0,"cool":0},"SUpRniJqJiUkVIVCrMc8Xw":{"text":"Decadence, amazing staff and mouth watering food.  This beautiful restaurant has so much c","useful":0,"cool":0},"fVudjTkXb3keotn-TcueDg":{"text":"So my boyfriend I made reservations to Muriel's for Easter dinner. We were both excited be","useful":2,"cool":1},"0AIiM547LJm9Bhc0fXG4Ig":{"text":"Came in for a quick lunch and the service (and the food) was spectacular! Katie and her as","useful":0,"cool":0},"U91_loIaYUVPAtb1OCqR9A":{"text":"Great atmosphere and delicious food! We enjoyed the 3 course meal and a bottle of wine. A ","useful":0,"cool":0},"8BbM9O2Yd_DGbXyQyXtAag":{"text":"I've been on New Orleans for 4 days now and Muriel's was by far the best dining experience","useful":0,"cool":0},"jJ-MTO9rvF-DzviYPDFo7w":{"text":"Great food. Lots of flavor. Great staff. Very accommodating and friendly. Had the shrimp a","useful":0,"cool":0},"vnJLRogDAeBMrzZa7g9JdA":{"text":"Lovely atmosphere, flawless service, jazz trio circulating around the restaurant.  Pork ch","useful":0,"cool":0},"0CQMZnipM03ZQYAcRNV7qw":{"text":"NPS = 4\n\nExcruciatingly slow service.\n\nIt took us an hour and 15 mins from the moment we o","useful":3,"cool":0},"yFjDdqOGNkBa7kfJyxdT1g":{"text":"Absolutely amazing food. Perfectly seasoned and cooked. The shrimp and grits is the best I","useful":1,"cool":0},"SsiWfc83a5DXchKf5lhceA":{"text":"Depending on what you're looking for, Muriel's is a great spot. I got the double cut pork ","useful":0,"cool":0},"0VoVCWTsbWMxCGFTkTp5uQ":{"text":"My favorite dinner in the French Quarter. Muriel's is really a cool spot, and it's haunted","useful":0,"cool":0},"Uqx2U-Bw6HpXB0lUtastlg":{"text":"Love the looks of this place so classy and the bar in the back has an old speakeasy feel t","useful":0,"cool":0},"imRWpXHdHGRRPjrhPKsPWQ":{"text":"YES, YES, YES!\n\nGood location on Jackson Square. Fantastic service. Calm ambience. Absolut","useful":1,"cool":0},"SN4t-QKgUhLdSIb4fxq9Zw":{"text":"Technically I didn't eat off of the menu, we were there for a rehearsal dinner.  The food,","useful":0,"cool":0},"7oMrXRoY36Srk9WgYp3IAA":{"text":"Went here for dinner. The turtle soup and shrimp and goat cheese crepe were amazing. The d","useful":0,"cool":0},"Qb2fKVVrmDm-GSUIZpPntQ":{"text":"My wife and I celebrated our first anniversary dinner here and it was delicious. We did th","useful":0,"cool":0},"wyxF6IygUDN_UOBT2bPPBQ":{"text":"I love Muriel's and I come here every time I'm in NOLA! The brunch is fantastic, and there","useful":0,"cool":1},"l8aecF_ghcezcNRYeFTvDA":{"text":"Go to the back bar and order the crawfish & goat cheese crepes! The best food dish in New ","useful":0,"cool":0},"URwk0ARK_N9ohvPVCg6P4Q":{"text":"Went for dinner to celebrate our anniversary. Good choice. Great food. I mean, really grea","useful":0,"cool":0},"mRrlrN_3DZOaHr0BZyF-ow":{"text":"Lovely place to have a nice dinner or grab some dessert.  Service was nice, they work in t","useful":0,"cool":0},"rsoeXvjZv2JF1hik1XxLHA":{"text":"Interior: 7/10, Food: 9/10, Service: 9/10.\n\nGot into New Orleans really late and drove aro","useful":0,"cool":0},"-vGzbT-k-wz9gO5poi7GcQ":{"text":"My husband and I had our 5th anniversary here the weekend before last, and Muriels did not","useful":0,"cool":0},"jzi9NzKVKWmZM8gejBFxlg":{"text":"We went in and sat for 10 minutes. Checked out the menu while waiting for waiter. The menu","useful":0,"cool":0},"RzaUANXBibAD3YQVpFlfmg":{"text":"Brunch at Muriel's was great today. My wife, daughter and I were bumming around the French","useful":0,"cool":0},"mAUWloRe2taCY1MYdzkQuw":{"text":"The only reason I give the restaurant a 2 is because of the attentive staff. We made reser","useful":0,"cool":0},"TstVgprPfkb_Wz9opfDQCA":{"text":"Overlook the tourist trap location, the crowds and the busy Jackson Square action, and ent","useful":0,"cool":0},"fhJHd6DGL12KuZEV56kNeQ":{"text":"Went here for the dinner for our pre-bachelor's party festivities.  The place is business ","useful":2,"cool":0},"zQymuHFFoxr6fwovVQistw":{"text":"Kind of stuffy, but the duck was fantastic.  Pricey......and chatty waitstaff.","useful":1,"cool":1},"2LydUfStS_bWENnoLYqlow":{"text":"I had the turtle soup followed by the pork chop ending with créeme brûlée with a bottle of","useful":0,"cool":0},"fjZ96d1YBKDMGlQwRk3QYw":{"text":"My husband and I had a reservation for 6:30pm on a Tuesday night (thankfully so) because t","useful":0,"cool":0},"lmaLtmi8PD86SUTUF9WTxg":{"text":"Food was great.  I had the duck which was cooked to perfection and had a tasty sauce with ","useful":0,"cool":0},"SXmmjJMA42s-GYA4Cbc6dg":{"text":"Best meal I've ever eaten! I had the blackened catfish with crystal hot sauce butter!","useful":0,"cool":0},"y4XYRRYNJ0coiMUrku4DpQ":{"text":"The ambiance of this place is 4 star on its own. I was here a few weeks ago for a Sunday j","useful":1,"cool":0},"NLZA-PeyQjo8azklPIyEBA":{"text":"Ask for the courtyard. Bloody Mary's are killer and super delicious along side an oyster p","useful":0,"cool":0},"xmYHqlyCQz2AdbSNEDk6jQ":{"text":"My friends and I had a reservation for Sunday brunch.  Though we were seated promptly, the","useful":1,"cool":0},"Rjealyt0a5-3IkLdVQf8tA":{"text":"I came here for brunch with my parents and my fiance and our experience was just OK. I was","useful":4,"cool":1},"FqqEPF-Vx0uJ7GTVjITe9g":{"text":"Wonderfull place with great food I want to go back one day.","useful":0,"cool":0},"tDBRTqGmMB6GjL8iUhc0jA":{"text":"This is definitely a need to stop brunch place should you find yourself in the French quar","useful":0,"cool":0},"2yoy4EV-MSdxJBUgIdbV1w":{"text":"What a great restaurant. Starts with the location next to Jackson square. Goes to the arch","useful":0,"cool":0},"Zno953EDkvEODf9kzVqpow":{"text":"Pretty tasty lunch, but the bread pudding was out of this world. We went back multiple tim","useful":0,"cool":0},"5kX1tLbDTaf7YyhPOpnH3A":{"text":"Muriel's is a classy place. Visited on 10/16 for dinner and had a very pleasant experience","useful":0,"cool":0},"tkt1eYNp-bT64ZlM9BceDg":{"text":"My wife and I were enjoying a trip to New Orleans and found the most amazing Cajun restaur","useful":0,"cool":0},"M4CKf5MeNreEZHlZd7mJ5Q":{"text":"We were a bit under dressed and overly loud, eating in a beautiful room with attentive ser","useful":2,"cool":0},"kZE8alfVw0W4Z8mYq8Wf5A":{"text":"Overall I was impressed with Muriel's.  When we stopped here on Saturday afternoon to make","useful":1,"cool":2},"luxczD31G2xBV0qrZdGNdA":{"text":"Hands down Muriel's served up the best meal during our NOLA visit, and since it was our fi","useful":3,"cool":1},"Bfe_3GuYSKXAc6XxzcynKQ":{"text":"Sunday brunch! Jazz music (starts at 11), and amazing food with a wonderful ambience and w","useful":0,"cool":0},"tWMsml_uh1PfpwUI8Rlnsw":{"text":"Stopped in for a late afternoon bite.  Staff set a corner table for us even though it was ","useful":0,"cool":0},"0O9-UKPsLiLWokPjXmoFoQ":{"text":"We are in town until 5/27/11 and had the joy of Carey and Jeremy's service at Muriel's las","useful":1,"cool":1},"n5Y3QkWWe5xlr9ElI1bQBw":{"text":"Muriel's is one of the restaurants I highly recommend you dine at whenever you're in New O","useful":0,"cool":0},"w7WfSA5vi6CyL_8K4t3MVA":{"text":"Amazing!! Had the goat cheese and shrimp appetizer, shrimp and grits, and bread pudding. E","useful":0,"cool":0},"5y1jlsdTEAceArsa4fR8gQ":{"text":"When in New Orleans!\nBest Meal of the Decade for both of us! We will make this a must stop","useful":1,"cool":0},"DIlURfAtyaPdni-uXz_34Q":{"text":"For its location, location, location then this is the best restaurant in New Orleans. Righ","useful":0,"cool":0},"UWk5icZ55QroeTXfSdGpng":{"text":"Beautiful decor. Relaxed atmosphere. \nMust try the Potato Bacon soup. \nTried Shrimp and Pa","useful":0,"cool":0},"6Lnww4whdmzqyoAI0Bh1Xw":{"text":"Crepes were my favorite,they were great.  Service was excellent.  I was expecting touristy","useful":1,"cool":0},"MWV7JehJCjUp1dfv0iERNQ":{"text":"I had high hopes for Muriel's as a friend had recommended it highly but I was disappointed","useful":0,"cool":0},"yK0oq4-5TSoVnAUdJtoDiQ":{"text":"I have lived in New Orleans for about 4 years now and I think this was my best dinner and ","useful":1,"cool":0},"ezsyXe4NSOF7onelWKueRA":{"text":"We dropped in for lunch today. I had the pecan crusted drum fish with spinach. It was WOND","useful":1,"cool":0},"8xQhWhR2_MNZOVVd3qj0rQ":{"text":"Stopped at Muriel's for lunch after an awesome Voodoo History Walking Tour.  Wow!  It was ","useful":0,"cool":0},"dh9oeE4M9Bb8SjQKmFeX4w":{"text":"Food was great! I loved the vegetable curry and the beet salad. Nice to find some good veg","useful":0,"cool":0},"5WVoymafjYpmeI-ekL4W7w":{"text":"Love this place! Went for dinner Friday nite--gumbo and especially shrimp and goat cheese ","useful":0,"cool":0},"UwaNnP-W3IpR8AwH4POW8Q":{"text":"I turned my meal choice over to our waiter Kris and waitress Sarah. Without question they ","useful":0,"cool":0},"-gfwDow-cJ1o8bwYaI2JnA":{"text":"Excellent meals, very accommodating front desk (we had to move a mistaken reservation), go","useful":0,"cool":0},"LazY7Lu1h5K5FhYd97KRuQ":{"text":"Terrible service. Made dinner reservations for a mid week night. Arrived 1/2 hr early and ","useful":0,"cool":0},"viqJ0n-TuIZMLIuAaRKY9A":{"text":"Wow wow wow the place is like a grand vampire pad in True Blood. Great wine list. Oysters ","useful":1,"cool":0},"zgpXD2dtQeQpL_txTMz1YQ":{"text":"I agreed with Jonas, Service is great, don't remember the name of our server but she was v","useful":0,"cool":0},"UJ-wE3Opt7zc8vQP07PANQ":{"text":"Initially I had a hard time finding a fine-dining restaurant that would reservations for a","useful":0,"cool":0},"pRDrJq1fcBbn-iVVBvIRaQ":{"text":"My last night in Nola, my friend who used to live there told me I had to come here and hav","useful":0,"cool":0},"zyO_oMisWuvqYQTNiNY9Rg":{"text":"Just can't say enough good things about this place! This was my first time here after comi","useful":0,"cool":0},"xNX4yvJjsGcC59aC5RHveg":{"text":"The food was great here but the servers are kind of unprofessional with the way this busin","useful":0,"cool":0},"DhaZiG-c0X4-F0tKaf9xog":{"text":"Food was average... Bread pudding was awesome. Service was absolutely sub-par for the pric","useful":0,"cool":0},"YDP_eNnQjqnEHZuR3RW_bw":{"text":"I love this place.  My husband and I tried to have our wedding rehearsal dinner here but i","useful":0,"cool":0},"NwhwlVbwf-54RZ7ZrUtOlQ":{"text":"Took 50 minutes to get drinks and 3 hours to finish the meal and leave. Painfully slow, an","useful":0,"cool":0},"5Je6KpDN7q8Z1F7MSHHrlw":{"text":"After crawling through the stench of Bourbon street Jackson Square was refreshing. We just","useful":0,"cool":0},"n1U_DQLn15PK84dX0IF1VA":{"text":"Really neat formal place. We were in the area for a parade and asked if there was a dress ","useful":1,"cool":0},"k-ESC5-fH9yBHzsIMf87aA":{"text":"We had our department Christmas lunch here. They gave out a little room on the second floo","useful":1,"cool":1},"tL4rF0R0mP6o0X2t2Jt7Vw":{"text":"It's hard to rate any restaurant in New Orleans below 4 stars, and this one is no exceptio","useful":0,"cool":0},"FGq8TOiuOVdMECvyn1PElw":{"text":"We came to Muriel's for an anniversary dinner.  Amazing food, very kind staff (who took no","useful":0,"cool":0},"Sevt81vNBYzKrzWSlFq_BA":{"text":"What a delicious meal! There were six of us and we had five different entrees tried at our","useful":1,"cool":1},"gnAl42vADSyYTs8uPJZqgg":{"text":"No balcony dining. That's why we chose the place. But limited for time so we dined here an","useful":0,"cool":0},"uxiFss2wFNpdMaOwmNJ1pg":{"text":"Wow. We happened to walk past this place during our haunted tour. The tour stopped in fron","useful":1,"cool":1},"fRlsYJBEJQH69SZBmCzhlQ":{"text":"Very enjoyable evening!  The service was very attentive and always with a  smile.  To star","useful":0,"cool":0},"ylZ9_iwKEmqRXBX8ed74Pw":{"text":"I had the $16.50 lunch special which included a soup or salad and an entree. My soup was t","useful":1,"cool":1},"GdQy7WqaDBjqJn1WzQ578g":{"text":"Came here for lunch.   Seeing the high number of raving reviews I was expecting great thin","useful":0,"cool":0},"88BaP8bnYPI0WonFkaacNA":{"text":"I've had experiences with Muriel's from 3 different prospectives now.  As an event planner","useful":4,"cool":1},"X7O_cuGxIlbJzS5991JkRg":{"text":"Oh. My. The food here is... Amazing. Had the pre fixe menu. The gumbo was good. But the nu","useful":0,"cool":0},"QNHOoY4fwNFbY5JAEKYbQw":{"text":"This restaurant was right next to our hotel and we loved it!  The location on Jackson's sq","useful":1,"cool":0},"cAu_QmjbTBfNe9vkWxGkDg":{"text":"On c'est arrêté dans ce restaurant pour déjeuner, on c'est vraiment régaler pour un prix v","useful":0,"cool":0},"f-Xbvr5J87WSbNSHr4uzXw":{"text":"Dynamite spot right in the heart of Jackson square, an absolute must do for Jazz brunch fo","useful":0,"cool":0},"Qc8rHf4onhb-OsxE5DIipg":{"text":"The pecan crusted alligator and the bread pudding were amazing. The service was great as w","useful":0,"cool":0},"1sX_utxtdOnQOzlpPxgTTg":{"text":"Two words- Stay Away! Besides the cockroaches crawling on the walls, the server was cold, ","useful":1,"cool":0},"sIZn1XA7RHa7LntzNukk5A":{"text":"Unimpressed!\nBecause we didn't have reservations they put us back by the bar.  We saw many","useful":0,"cool":0},"DEHYbSjr4yFnQ5rzFQkRnQ":{"text":"This restaurant was recommended to me by a coworker since I was visiting the city. It's re","useful":1,"cool":3},"BlD-kC75acCQwjSqXCmP7A":{"text":"Great food, great location, and a wonderful  New Orleans setting. Loved the salmon entree ","useful":0,"cool":0},"UAlKW3a2Flh8WO13C3-vQw":{"text":"We went to Muriel's for the shrimp and grits and were not disappointed.  The grits were cr","useful":0,"cool":0},"TaonTLxJRnBGfJZ85tcZMQ":{"text":"Muriel's is set in the heart of the French Quarter and in an area that caters to tourists.","useful":1,"cool":0},"pRzM64s0FriNH7FZPDhYSQ":{"text":"Murial's can tend to get a bad rep because of it's location in Jackson Square knee deep in","useful":1,"cool":1},"uTdiSE3zEUJiLRcMrCHFXg":{"text":"We had a  delicious dinner served by a very friendly wait staff . The interior design is r","useful":0,"cool":0},"GHTZ0fraaU-Y7sxHWwwyiA":{"text":"It was Restaurant Week and was mostly filled with loud tourists. Service was excellent and","useful":1,"cool":0},"BZewVRF6zXRTWX9VVGD80Q":{"text":"Food was excellent and the atmosphere was fun and in tune with the haunted reviews. Make s","useful":1,"cool":0},"5of_hjSLFieQ6xLGQSCHwQ":{"text":"Delicious food in a town you expect to find nothing less than exceptional fare. Portions a","useful":0,"cool":0},"r6zCUr7C_JILzfQfhm-QDA":{"text":"Came back to NOLA with some friends from NY and wanted to take them to Muriels as perfect ","useful":7,"cool":1},"0wCU-Pl0rQXIAGGFLFQa9g":{"text":"Delicious food! I will def. come back here when I visit.","useful":0,"cool":0},"L0eONAN8FNRXM-Szmj2lDg":{"text":"Went with a big group and enjoyed outstanding service and great food. We arrived early for","useful":0,"cool":0},"Q6bTJjMZAifhRf0EhA3UEA":{"text":"Our waitress was rude and had an attitude. The attire is supposed to be dressy but they al","useful":0,"cool":0},"UBGbd7dUSIT6uucjdjHtKQ":{"text":"I recently visited New Orleans and had heard only positive things about this place, I had ","useful":0,"cool":0},"oA9cimdD991V6DOuBYJN1A":{"text":"Muriel's is located in a really popular area in the French Quarter, in Jackson Square. It'","useful":0,"cool":0},"Sr1BHbACdlZxP5TmxKZWcQ":{"text":"Fantastic atmosphere and ambiance. But most importantly, the food was amazing!  Literally ","useful":0,"cool":1},"2Fmmi0pRBKeba1kxQHE7Pw":{"text":"Not only is the location PERFECT - and the Air Conditioning works! - but thwe food is grea","useful":2,"cool":0},"6FXQMKQALG_qLaOXZxis7Q":{"text":"This place is very traditional, famous new orleans, located on jackson square.  I'd always","useful":0,"cool":0},"1TQIoE6Dg0HrdjOfjh4jnA":{"text":"This was the first place I ate in New Orleans. We sat in the indoor courtyard. The waitres","useful":0,"cool":0},"wTWmIvslhMFkhVZHPhlcBg":{"text":"Wow, this is a fun place with the bonus of having terrific food! Every time I go I have to","useful":1,"cool":0},"WNiAGQuidl7oJY_-JLDzsA":{"text":"Great spot!  I come here with tourists as this is a gem.  The upstairs is filled with beau","useful":2,"cool":2},"1dxxva1Ua-quD6BJT8r5YQ":{"text":"First rate service, excellent food. Despite my pedestrian appearance we were promptly seat","useful":0,"cool":0},"VsXHhr3xtcPh65C1MGIllg":{"text":"Wow. Such an unexpected surprise! I started with the most amazing cocktail - honeysuckle v","useful":0,"cool":1},"a_TU-ILXrq8OcXx_hqH5lA":{"text":"Such a lovely place with so much history behind it.  Our food was so grand we visited twic","useful":0,"cool":0},"8pVvJXyJiWCzZBvCJ1btnQ":{"text":"Worst food and service I've had in New Orleans. Food had clearly been sitting out for a wh","useful":0,"cool":0},"NibmgHbnySbMhCg9l0papg":{"text":"Yum!!\n\nWe liked it here so much that we ate dinner and lunch here at two separate occasion","useful":1,"cool":0},"O6hyFe0z1vlt7jDE3jV37w":{"text":"Me and my wife are 2 days married and ate here for thanksgiving. We were greeted by everyo","useful":0,"cool":0},"KSaNtIIYdimev61va-_CWw":{"text":"The dress code here is more like casual, due to the flurry of tourists dropping in. I even","useful":0,"cool":0},"SWqjScFgxAQ7n8yBo_cpGA":{"text":"Had our last NO lunch here before flying home and so glad we chose Muriel's!  I ordered th","useful":0,"cool":0},"lWsyhaeX89_7mddLkMaYLw":{"text":"Great atmosphere and old world feel.  Good place for tourists, just thought the quality of","useful":0,"cool":0},"0tomo-9JoQWC9L_qJ9uB6w":{"text":"Impeccable service and delicious food. I was dining alone in the French Quarter and chose ","useful":0,"cool":0},"BtjddLXnAJGxvzjx7AreEw":{"text":"Excellent food and service with beautiful surroundings! Pricey compared to other places in","useful":1,"cool":0},"L9Ow-Abks2i7C9_nsq7o1w":{"text":"Great good. Amazing service. A little pricey but worth it. The seafood bayoubaisse was abs","useful":0,"cool":0},"e52l5DnegX5LP-QpMD2ncw":{"text":"Fish outstanding.  Literally, seemed right off the boat.  Beautiful setting on Jackson Squ","useful":0,"cool":0},"KwaDKz2eb2H70URRkEFyjg":{"text":"Muriel's never disappoints!! \nThe food & service are always excellent. \nI had the stuffed ","useful":0,"cool":0},"pYxQLloF1634EMOeVFhUkA":{"text":"Came here for dinner with a coworker during our short stay in NOLA and left incredibly imp","useful":2,"cool":2},"cNxDRZx0cctOnCpRYJH0tw":{"text":"Came here for Saturday brunch.  I enjoyed a sazerac to start.  And I tried the strawberry ","useful":0,"cool":1},"jT7jDDSnKiZ--8fJqCjwKw":{"text":"I have been coming to Muriel's every year and each time the service, food, and ambiance ar","useful":2,"cool":0},"9ZxQImU3S91KE7ChFp_IGA":{"text":"I ordered the Oyster Bordelaise. I didn't realize that I should have brought my scuba gear","useful":1,"cool":2},"1nBznYvng9XBPFTasPPivA":{"text":"Beautiful, formal restaurant right near Jackson Square. Everyone was dressed nicely with o","useful":1,"cool":0},"h3Ro3Qim230wgQeToSBuHQ":{"text":"Wow! Where to start! My aunt had her wedding reception here this past weekend in the small","useful":0,"cool":0},"XAc5WboJpfrRJuEV0fLguQ":{"text":"Adequate is the best description for this place.  Nothing horrible and nothing wonderful. ","useful":0,"cool":0},"Z7XyIqG7FEBcjLAAM7srWg":{"text":"Everything was great except the mashed potatoes. They tasted like instant potatoes and ver","useful":0,"cool":0},"FuowiQtP2S_aad3mI1axhA":{"text":"On a suggestion from Milton at the Royal Sonesta we made reservations on a Saturday for tw","useful":3,"cool":2},"a5kg0j-tNtV67KPhZbkJmQ":{"text":"Upscale joint on Jackson Square with some New Orleans touches.  Nice looking dining rooms ","useful":0,"cool":0},"TXszL7FknbZxISHYcOH8Uw":{"text":"Always a must-go every time I come out to NOLA. The entire staff is always welcoming and p","useful":0,"cool":0},"9ebKy5iYGI_sZSA_mkdwOw":{"text":"My boyfriend and I had our one year anniversary dinner here. Everything was excellent from","useful":0,"cool":0},"5ZSD7LIm0d_INrQphEDd5g":{"text":"While visiting Nola for my 40th birthday, my daughters birthday and my son's deployment (h","useful":1,"cool":1},"uJmoV54MGsoecSItfdpanA":{"text":"This was our 2nd visit to Muriel's and it was perhaps even better than our first visit a y","useful":0,"cool":0},"HO_icQDQQfr_rykQ4mOXnw":{"text":"Food was good, but the highlight of this place is the bar drink specials and the seance ro","useful":0,"cool":0},"FxtQ5iYsG5JhN49z38YiDA":{"text":"Great wedding venue. Lots of third world charm, smart bar set up - no wait for drinks. Nic","useful":1,"cool":0},"EPZNZ4jZCcP5vzorND-AWA":{"text":"Great environment, great location, great service and food!!! I highly recommend blackened ","useful":0,"cool":0},"KRaCTtRo6fBZoyQAZ8CtJg":{"text":"The food is delicious and the service properly attentive. The three-course fixed price men","useful":0,"cool":0},"E-zsSMpB7BL_dY3EsAXWbg":{"text":"Had a lovely lunch time on this July 4th. Very nice restaurant in a great location. Food w","useful":0,"cool":0},"rN3avI-p2eLVsgFuGnXy-Q":{"text":"Wonderful food and service. The place is not cheap but the experience was great. The place","useful":0,"cool":0},"v56MKKTwO5-ygmOvO7rINw":{"text":"The food is top quality and the atmosphere is very elegant. The view from the restaurant i","useful":0,"cool":0},"CnieDYkNfUxeGY1nmMD1lw":{"text":"Cute NOLA staple eating location.  The food is average for its location/area.   I would de","useful":0,"cool":0},"2MDolAGOHJfrRYz0PCFWPQ":{"text":"Service was impeccable, meal was well timed. Both my daughter and I had the prefix menu. M","useful":0,"cool":0},"pyN473mAsd6VdtcazMrSsA":{"text":"We think Muriel's is absolutely fabulous. From the moment we were greeted everything was f","useful":0,"cool":0},"c_VfDpnpzRLmZqwFxNH13w":{"text":"Excellent jumbo shrimp and lump crabmeat salad, fabulous hand mixed hurricanes. Also great","useful":0,"cool":0},"ck9zCviIQYrm8bI8ma_Gew":{"text":"I went here for a private event and was very impressed with the whole event.  We started o","useful":1,"cool":1},"CaLZ1J4WFRkeexInpAw6HQ":{"text":"If I had to use one word - WOW! What an experience. The ambience is great - you can still ","useful":0,"cool":0},"3YzG1COvj7sJe8CCgek3UQ":{"text":"Service was great... just didn't like the food. Was here for dinner. Had the crab cake app","useful":0,"cool":0},"FCDiC_8XWTe3HNPJJmmxAw":{"text":"First time to try, called Muriel's at 2:21pm to ask if they had Valet or private parking a","useful":0,"cool":0},"55cavkfSVzi2mZ3TcV9Chg":{"text":"We made reservations at Muriel's and asked if they would allow us to see the haunted table","useful":0,"cool":0},"UQeOYQMXHRJCzMAsjm0Zhg":{"text":"The way I described this restaurant I think is apropos.\n\nIt's like a Mercedes Benz car tha","useful":3,"cool":1},"IQsnekNDncy8RuBPrpRIsw":{"text":"Stopped impromptu during a walk in the rain.  It was about 1:30 pm on Father's Day and the","useful":0,"cool":0},"lcB40aONC3W5oZ8KvkSsXA":{"text":"This place lived up to the hype. I'm giving 5 stars due to the team having the holy trifec","useful":0,"cool":1},"VNdMVwmTMagQZfN1QIQkow":{"text":"Mediocre. They have a few notable dishes. We had poor service and were seated next to a se","useful":0,"cool":0},"4yZAHDju_mdTdSWZ1ur6Dw":{"text":"Came here with a relatively large party of 8. Right when we settled in, immediately I noti","useful":3,"cool":0},"IIkgtBb1cp5379enK80Opg":{"text":"Muriel's ended up being pretty overrated and touristy. There are tons of wonderful places ","useful":2,"cool":0},"zQ_ynoE7a4QDeFQiNVaOIw":{"text":"My wife and I both loved Muriel's on Jackson Square.  We were sat at a nice table by the f","useful":2,"cool":0},"slte1eO9_FZsqnTN9q_39g":{"text":"This was our first stop in NOLA. The food and service were excellent! This place is more u","useful":0,"cool":0},"ZVJbJ0jK3vCZLq-6YnqGqQ":{"text":"Don't forget the bar. It is all the way in the back. If you are looking for a different ty","useful":0,"cool":0},"FsupeHGPHq18ZWANT0zN7g":{"text":"Went to Muriels for brunch yesterday and had to make some tough decisions!  Eggs Benedict ","useful":0,"cool":0},"ABl16MaJBC6yaMjJ9nDoTw":{"text":"The salmon and turtle soup was outstanding! A little loud since the majority of guests set","useful":0,"cool":0},"Ct52FmFt58t-wAl0Nxvtfg":{"text":"On a recent Branch Managers Trip to New Orleans for work six of us roamed around looking f","useful":0,"cool":0},"Ce5XC5H5G7cKcAMYBrYCaQ":{"text":"We had a high expectation of this restaurant. My wife and daughter wanted to eat there as ","useful":0,"cool":0},"zSgFxsb-fXE-mxrqgv8ZvQ":{"text":"excellent food ..... wish I can cook like this.   The lump crab cake is amazing.  I had br","useful":0,"cool":0},"3yqLc1XDBaeJ0UX6Abc1zQ":{"text":"Service was excellent! The items with a star were exceptional.  Food was really good, but ","useful":1,"cool":0},"Dhqbi0NkLtetwLRdj3RhFQ":{"text":"Very good fish and salad; wonderful historic building. Wait staff somewhat inexperienced. ","useful":1,"cool":1},"bE9Jypn6e5XY1K09tCNIWA":{"text":"The wife and i went for lunch.\nWe had the goat cheese crepes which i would give a 10/10\nSh","useful":1,"cool":0},"JJ0pEFs3haGeY6G6MujqDQ":{"text":"Beautiful establishment. The tomato basil soup of the day was unreal. The turtle soup was ","useful":0,"cool":0},"x6M_qw9gA1kGTscLH2cl9Q":{"text":"For the past ~15 years, I have enjoyed the food at Muriel's. Before I was diagnosed with c","useful":0,"cool":0},"tgB0wmzU2jaGPGsPpdJDRA":{"text":"I had such a wonderful time in this place! A few girlfirends and I made a trip to New Orle","useful":1,"cool":0},"F-jkMEk5__TftbR8qmS-Ag":{"text":"The food was exceptional.  Very complex and well presented. \nWhat more can i say.  \nHad th","useful":0,"cool":0},"hZ-hQ3zvQOTYrZpGHfuh_Q":{"text":"While in New Orleans for a family trip, the tour guide of the cocktail tour we took recomm","useful":0,"cool":0},"6JgG7NWm5CdTgcGihfEmcw":{"text":"Everything about this restaurant is great. The food, service and atmosphere were all fanta","useful":0,"cool":0},"8ITAYciO-PN6rdxzhIn9sQ":{"text":"This place was amazing. The service is more than 5 stars, they take care of you like you a","useful":0,"cool":0},"4Vav3g23xmuFuhM4ZKalKw":{"text":"Food was too salty and I always came for the dessert, bad service and food.","useful":0,"cool":0},"QWOcXebf6w2AZizef0N6UA":{"text":"Excellent atmosphere. Excellent Service. Our table was ready and waiting for our scheduled","useful":0,"cool":0},"3Iq0FY4xLfOF-7qV1DckKQ":{"text":"Love the ambience and the food. I had blackened catfish which was recommended. I swapped t","useful":0,"cool":0},"B3xHaaf-T0NgAPXO8Z7Dxw":{"text":"Everything was delicious and drinks were great. Service was okay; probably the only thing ","useful":0,"cool":0},"fa5SIC37DVSgz-tTzdVmlA":{"text":"very busy restaurant, lucky for me I made reservations.   felt like the clock was set back","useful":0,"cool":0},"znv-_ynBZCunLe6Azd1E1w":{"text":"This was one of the best meals we had in New Orleans - all of the famous, traditional plac","useful":0,"cool":0},"75-ZeLmjLTUTMgJMVAdJYA":{"text":"I went to Muriel's for lunch recently with a group of friends. We had a reservation, but o","useful":2,"cool":0},"4e3JnG43owpaS_Wbp1_8eg":{"text":"Best meal in NOLA. Girls weekend trip. We had the Chicken, pork chops and the shrimp and g","useful":0,"cool":0},"d9IGohqslno3Tm6xEHbvAw":{"text":"Overrated in my opinion. Spiced bread was un-impressive. Seafood gumbo was the saltiest I'","useful":1,"cool":0},"JF1dy4DHVj8_Js-Wp20bQA":{"text":"Came here for Sunday Jazz brunch, did not need a reservation and only had about a 10min wa","useful":0,"cool":0},"pJ4nTJpPRS-BZic7xDng-w":{"text":"We came to New Orleans to celebrate my 30th birthday. Made reservations for Muriel's the f","useful":0,"cool":0},"dhL2omaMKMWZidvv-bte8A":{"text":"Food delicious, Our main waiter Chip rude and smug as hell!","useful":0,"cool":0},"znLP8ot1v7VqWfiBnd-CxQ":{"text":"The goat cheese crepes are absolutely amazing!\n\nAnd for a full metaphysical experience, I ","useful":0,"cool":0},"j61-7BZ-k7E30-rqtHsG_g":{"text":"Part of the annual JazzFest tradition is setting aside a night for a big dinner at Muriel'","useful":0,"cool":0},"pOcD4rLg_3xkEaEgkdpbOQ":{"text":"Food was expensive, but the quality was standard, very nice staff and great location, righ","useful":0,"cool":0},"W3d1zr7CiRqi1Uf0FWZKow":{"text":"Loved our dinner at Muriel's. We just happened to be walking by and decided like the menu ","useful":1,"cool":0},"9MfG_hjfU6h-rZ5z4M0Izw":{"text":"Building is supposedly haunted from a suicide many, many years ago. Sat out on the patio a","useful":0,"cool":0},"RwluinJ2lsQVk1gMXEyxDw":{"text":"This was my first trip to New Orleans and I was determined to try as many restaurants in t","useful":2,"cool":1},"5dcCSEW40jkLT9hJ4EVaNw":{"text":"I was there to meet a friend. Went for a drink an found the back bar. Nice. Bartender help","useful":0,"cool":1},"PNo7IWZFnpDJus0E3BllWw":{"text":"Food was great and staff was friendly! Would have liked to have caught the band allthough ","useful":0,"cool":0},"KMYMVm6X6PpGg2RyDuICyA":{"text":"I am native to the area but have moved away from because of jobs. Whether you are a local ","useful":0,"cool":0},"qJPfjgfZ4JoXBZuL8InNwQ":{"text":"After reading and asking about many restaurants in the Quarter my husband suggest this, he","useful":2,"cool":0},"_ImBm4Os5zsfu_-V7DGvLw":{"text":"I had my wedding here last night!!!!! I ate here last year around Thanksgiving and loved t","useful":1,"cool":1},"Z0xC20mry-19vNKTXY26FQ":{"text":"Had a great meal at Muriel's on the evening of September 11.  The food at this place didn'","useful":0,"cool":0},"mBrpYYfPaTwXhK2o_q4YUg":{"text":"I have to say I really enjoyed this place. The staff was great and accommodating. I can se","useful":0,"cool":0},"Bj3QifGMUOvRZBEeOyrTPA":{"text":"Charming fancy setting. Fantastic food. Superlative service. Reasonable prices. For me, it","useful":0,"cool":0},"w2TEHKzx0wcPWBQ_idbHIA":{"text":"Awesome food. I had the romaine salad...nothing special. The pecan crusted puppy drum was ","useful":0,"cool":0},"xq6y5hRKZcewgsJ0dm6HNg":{"text":"This is service as it was meant to be. The staff were professionals and offered some of th","useful":0,"cool":0},"_RPffiWFFp7ZDwwQKt2_tw":{"text":"After reading some great reviews, we made reservations to Muriel's. I was spectacle that i","useful":0,"cool":0},"EtZhx0ws_Q6zKPzip3h4Fw":{"text":"Best dinner ever! Ask for the write up on the history of the restaurant and the ghost stor","useful":0,"cool":1},"2evublBFlAOtFW9weF6A0w":{"text":"I loved my experience at this restaurant. \n\nThe service is one of the best I have ever had","useful":4,"cool":2},"kv6jdPK4kEPAL4JedmDOYQ":{"text":"The restaurant itself is adorable and a great atmosphere. The servers when you asked them ","useful":1,"cool":0},"0FiMl_yw1EaYO4oyVJqWuA":{"text":"This is a nice restaurant, so on the pricier side, but nice atmosphere, good staff and del","useful":0,"cool":0},"1n0J2jc7f4DpwMp6AfBErA":{"text":"Hands down one of the best restaurants I've been to! Food was absolutely amazing!! The gro","useful":0,"cool":0},"4qb_y52JaHSylOB03SSe_w":{"text":"My wife and I \"found\" Muriels by chance, just wandering around the French Quarter around 9","useful":0,"cool":0},"kGUTNp2thwKWCCIo7t_iNA":{"text":"We came for dessert and to check out the haunted room. I had the bread pudding and my part","useful":0,"cool":0},"zOwxIX2e_O80K_G71160Ag":{"text":"Tremendous food!  Loved our visit there from all aspects. Shared the gnocchi with mushroom","useful":0,"cool":0},"3ICZPwbngIx0tns63bO0lQ":{"text":"Amazing wine, Bread was ok. Service is great even though they were very busy. We had Bouda","useful":0,"cool":0},"2jZ2zpknwtSa-Up1YitvHQ":{"text":"When the wine is the best part, you know you didn't have a good meal.  This was a major di","useful":4,"cool":1},"J_C6nnxBZ481C0-OiPQ3Wg":{"text":"I have been to Muriel's twice now; for brunch and for dinner.  The brunch experience was m","useful":0,"cool":0},"5tOMEWIiIDkTng_AzoKNXw":{"text":"I had a recommendation from a local to come here and was sooo disappointed. Had the crawfi","useful":3,"cool":1},"iZOUVrx5rEaCyDxm1G9Ixw":{"text":"I thoroughly enjoyed my Cobb salad and my son enjoyed his poboy.  Good service, not great,","useful":0,"cool":0},"QcwOFT5cJt5gKa8kQR4Nxg":{"text":"Beautiful restaurant, inside and out. Staff was professional and presented well. The food ","useful":0,"cool":0},"fLAC8bNSrea-fgz7W0c6KA":{"text":"Possibly the best meal of my life!\n\nWe ended up here kind of on a whim, and I couldn't be ","useful":1,"cool":1},"_IFt-1UxaH0IiAovMjmQcw":{"text":"Horrible service. Waiter doesn't know what he is doing. Spends way too much time at the co","useful":0,"cool":0},"rmpXxkC0huUiS1fHxANunA":{"text":"I'm usually not one to write reviews but I felt this was called for. I was visiting New Or","useful":0,"cool":0},"zjibM3CK2cxcfnjJOdPpNA":{"text":"Just happened to get in. In town for business during a busy weekend, and we kept getting w","useful":0,"cool":0},"U_2qlaepC20MkEdOfHRYxg":{"text":"What a truly excellent place for a meal.  The drinks are creative, inventive and prepared ","useful":0,"cool":0},"mnDPSQOaFSP0R9KWPkhNSg":{"text":"Impeccable meal, service and ambiance!  We stopped in for their Sunday jazz brunch.  Wow! ","useful":2,"cool":1},"nEVHyY8jhS3TMFpne0ECnw":{"text":"On the Fly: This is one of the best restaurants in the French Quarter area.\n\nThe long stor","useful":2,"cool":1},"Sbe-6TqBQlM_M0viuV0Nxg":{"text":"The ambiance and service here are impeccable.  The wine we had was delicious - loved that!","useful":2,"cool":2},"E6Hw6JLN6ynQSW0SvS17Sw":{"text":"This is my favorite restaurant in the square. Get the 3 course meal. I'm not usually a fan","useful":0,"cool":0},"i0p23tjL3UUBeMMzkMlCdA":{"text":"Fantastic food! I had the goat cheese crepe appetizer and the blackened redfish. Both were","useful":0,"cool":0},"tJBnzYcwkALJUdWrk0wXPQ":{"text":"Muriel's is the New Orleans experience rolled into one restaurant. Great food, southern ho","useful":0,"cool":0},"DwNT83hgvaZ9xKS6A-8mYw":{"text":"Pecan crusted drum is amazing as well as the turtle soup our cocktails were great we had t","useful":0,"cool":0},"zdJvIEN6WpjDNjzzOM6O4Q":{"text":"What an experience. We went for Sunday brunch. The building is amazing-beautiful and histo","useful":0,"cool":0},"2AneySB0V3mWT5S6f6lUUg":{"text":"With drinks brunch was 80 bucks- that felt steep and I wasn't \"in love\" with the food. It ","useful":0,"cool":0},"N55Ic1RIR7mXBK7PrPUeOQ":{"text":"We had a great dinner here. We had a mishap with a glass of wine being spilled after order","useful":0,"cool":0},"XCAVQoRk_RX7XhVp6rXPQw":{"text":"Between 3 and 4.\nThe pork chop was great although you might want to ask for it medium beca","useful":1,"cool":1},"1sPmIwlwnw8v1zCMAqCvww":{"text":"Beautiful restaurant and amazing food. A must go if you are in New Orleans! Make sure to c","useful":1,"cool":1},"UNb1ks0POdCr1wn-qSrzWw":{"text":"We were recommended this place by a couple of our friends. It was close to our hotel, so w","useful":1,"cool":1},"SVP4sSTnvUwKqRn0NSmrTQ":{"text":"We came here for our one nice dinner of our trip. Both my grandma and I ordered the pri fi","useful":0,"cool":0},"I3Itqg3Kfbzt2Nn_lYJ7Hw":{"text":"Our meal was AMAZING! Incredible attentive service. The chef prepared a delicious special ","useful":1,"cool":0},"9BsOCSRH64FfgEWJZl4PUg":{"text":"The best thing in Nola. We went here twice in a row. We got to dinner a tad late (10:02) b","useful":0,"cool":0},"6cezK58ZpXMbt0CLHFI3Ow":{"text":"a group of newly friends decided to have dinner at this restaurant and what a delightful e","useful":0,"cool":0},"jgGMiVvJcleD5xVyv19_dQ":{"text":"The food was absolutely incredible, and the service was so wonderful. The shrimp and goat ","useful":0,"cool":0},"Qe7CYRWEIF11NTTjA96VMA":{"text":"The red fish was amazing.  Romantic setting, great service.  A keeper!","useful":0,"cool":0},"1Q-jjw92Tt2BHRdRBg25xw":{"text":"This was the first place we ate at in New Orleans and it was the biggest disappointment. T","useful":1,"cool":0},"fZKZwkX7tpL6-Q8H0b_u4A":{"text":"We made reservations earlier in the day. The restaurant is situated on the corner of Jacks","useful":0,"cool":0},"Pzcf5wKX5IrRTdOFEyMUqQ":{"text":"As a local, I wouldn't normally have thought to dine here but that's where the visitors wa","useful":5,"cool":1},"08tFnTR5EHgNeqhvaC5Kqw":{"text":"This was the first spot we went to during our first visit to New Orleans... and I would sa","useful":3,"cool":0},"TCIieYU0TbGDO0xgohgbZw":{"text":"We had a 3 course meal. We had soup of the day, shrimp & grits and chocolate cake. None of","useful":0,"cool":0},"Hj1DZc3I99ZBObWYeDT-Ag":{"text":"The BEST spot we ate during our trip! Our whole group greatly enjoyed the food and service","useful":0,"cool":0},"iCElXraNnN2beU2xTr2Dpg":{"text":"I've eaten dinner at Muriel's a couple of times before and was always happy with their foo","useful":1,"cool":1},"ubfbqxvn6jRBh8RpncBjVA":{"text":"Excellent food, excellent service.  I started out with a hurricane for a cocktail.  Super ","useful":0,"cool":0},"HO7BESc2-gosfYeZxQ0sPA":{"text":"We went for the the Reveillon dinner special during December. This roughly translates into","useful":6,"cool":4},"ZMZNJB-bf_W-Bjl4pA-kkw":{"text":"I've only been to the bar which is quite nice.  It's a little pricey for cocktails but the","useful":0,"cool":0},"WNx3GOnD9AG4L1FdnWUDtQ":{"text":"Hostess was completely rude! Too many great places in Nola to put up with a shitty rude di","useful":0,"cool":0},"ZBfQ41jRS5PT2Ts99b9Q3Q":{"text":"This was a recommendation off the internet. So far away from the 4 stars it was given. The","useful":0,"cool":0},"0W-iyJOBDeOlEq_O96tHIg":{"text":"Overrated restaurant. After reading about all the great reviews, my husband and I came her","useful":0,"cool":1},"kbHsNC5-IEiLzMmU5hhKGw":{"text":"We went for the Sunday Brunch and it was delicious! The service was outstanding.\nThe atmos","useful":0,"cool":0},"KRqdy3mvEcVoGN0nqCPhoA":{"text":"This place is good but a good portion of the enjoyment is just the reputation and history.","useful":1,"cool":0},"j1bRsuDGBzWW65qMeZQ2hQ":{"text":"I came to Muriels with a large group (10 people), and thought it was good but not great. T","useful":9,"cool":7},"s1WJ3c9V7GWt6YR7X1mK7w":{"text":"Great food and a lot of nice people there ....def go !  worth it ....also interesting wind","useful":0,"cool":0},"HTQXPhNaeyCAdrTb43fktg":{"text":"We stopped in here for lunch on a Monday in tee-shirts and shorts. I'm thinking the people","useful":0,"cool":0},"hRoytr1q27XeXDIwRciUJw":{"text":"OMG.  Don't quibble about menu prices.  Just get over to Muriel's at 801 Chartres for the ","useful":2,"cool":1},"EAZFveQLKD6w5kJV4oRBag":{"text":"Classic, well prepared cuisine.  Jenny and Gary were funny, engaging and professional.  Th","useful":0,"cool":0},"KpuQRQ13LKIpv2Xj5jKd6A":{"text":"I haven't eaten here in years, and took my mother and daughter here for lunch.  I was look","useful":0,"cool":0},"c6EODNPXFxaAbicnyltRRw":{"text":"Great atmosphere in an old building with lots of character. Drinks were good. Staff was ve","useful":0,"cool":0},"JFbLZbY2_F0lEECrK-CI0w":{"text":"Me & my wife were walking around through Jackson Square and decided we were hungry. We stu","useful":0,"cool":0},"7KWKFVRF8GmVUWhRGg-O1w":{"text":"Decided on Muriel's after researching on Yelp for a place that serves good bread pudding. ","useful":0,"cool":0},"fM59izBDvWvoeLcrWfG8QQ":{"text":"Out of all the amazing places in NOLA I picked Muriel's to celebrate my boyfriend's birthd","useful":6,"cool":1},"haUtLN2iN2sAzMGfNdEC-g":{"text":"Tourist trap! Not sure which of those words to place the emphasis on, either.  The whole r","useful":0,"cool":0},"VSOUXMrzZgeuU2P0EB4MWQ":{"text":"GET THE BREAD PUDDING. lord. The vegetable soirée was heavenly and the bubbly was on par. ","useful":0,"cool":0},"EBh09K_i7G5hhyuwht6AEg":{"text":"Really good honest food without being super special!! Nice, friendly efficient service. A ","useful":0,"cool":0},"AnEosOehgmhJKQJJ2Qdxjg":{"text":"We ate here based on the rave reviews on Yelp and it was a disappointment.  The $29.99 fix","useful":4,"cool":2},"YAe-UPF5Q5OLjU0eOH10Qw":{"text":"I thought Muriel'a food was very good.  Went there with a group of colleagues during a con","useful":0,"cool":0},"MrPNKN1oRbT7pXozG4LBCw":{"text":"Very nice spot! The food was delicious. I had the crab & shrimp salad. The greens where fr","useful":0,"cool":0},"5TL_mtFRvNewTH6tyeK5Wg":{"text":"Visited here for a family birthday while on vacation. Was a great dining experience from t","useful":0,"cool":0},"uxeA6cTM_rmFcnRPBXkIoA":{"text":"Good, but mixed feelings. The food is good. I found the wine list a bit disorganized. The ","useful":0,"cool":0},"7gZxwNkgl3s8Tg24UuHEmw":{"text":"What a great meal and service was awesome.  Manager came by and made sure it was to our ex","useful":0,"cool":0},"yXKkuwWfmlWROj6E0xmnIw":{"text":"Had a great birthday dinner hear. Participated in the coolinary August festival   Had the ","useful":0,"cool":0},"c9p1v5CiQ5jeCjPFnUzQUQ":{"text":"Service was attentive.  Experience and atmosphere right on.  Good location for a business ","useful":0,"cool":0},"xTXBJpgKd1eNCYAzZfKKcA":{"text":"The gallery attracted us to this location. We wanted to have a drink overlooking Jackson S","useful":0,"cool":0},"YDB1-VwVBtBB925HHxGM5Q":{"text":"Sorry..very disappointed. I won't speak about the food. Some was good..some was lacking th","useful":0,"cool":0},"ebDdaoWZ_40tFgh_c3_P8A":{"text":"Consistently great food at an appropriate price. Fantastic \"burnt sage mojito\" special.","useful":0,"cool":0},"Pwpoy59HmmLD4S_SW5bBBg":{"text":"Had a lovely dinner, started with Jambalaya and leak and onion tart, very good. Main cours","useful":0,"cool":0},"omwjchohUMsOCRjz8j25tg":{"text":"I asked a few local friends for good food recommendations in the Quarter and am glad they ","useful":1,"cool":0},"T6nHeoZSkfBiFHm_3B6C1g":{"text":"Outstanding Sunday brunch. Everyone at the table was very happy with their meal. Grillades","useful":0,"cool":0},"djWjCJbKK1lkguTujv3mlA":{"text":"Absolutely loved it!!! I ordered salmon with rice and green beans. My boyfriend ordered po","useful":0,"cool":0},"hgZnbFiZIgWQ7XtnWwGIiw":{"text":"The food is great. We had the crawfish étouffée, the seafood gumbo, and stuffed peppers. I","useful":0,"cool":0},"jK0sCkPbm6o6gFjaEoD-tQ":{"text":"The menu sounded really delicious. This was our last dinner in New Orleans so we wanted to","useful":1,"cool":1},"gFTkyxMbzskk10c-rUXDlA":{"text":"I simply called to ask information about possible reservations and was immediately turned ","useful":0,"cool":0},"9UGmOTI0C2HmXBrDy3MSxg":{"text":"We went for our anniversary and I made reservations.  I told the hostess when booking the ","useful":0,"cool":0},"ylmrLnOGxJWaT42Ugqmd_w":{"text":"Very Impressed.\n\nWe had just finished visiting Jackson Square for the first time and takin","useful":1,"cool":0},"xEQcjJJqrnCIuJGpeqNRVA":{"text":"This is a fantastic place for lunch or dinner. The staff was the best in New Orleans we ha","useful":0,"cool":0},"ZYQ_cvcB_R5mPDUGawWxlA":{"text":"First I will say the food is amazing. My husband and I came here last year during our hone","useful":0,"cool":0},"uHAVwQxmYTPhZKv7A8efJQ":{"text":"Came here on a walking / tasting tour of New Orleans. Left here thinking that people reall","useful":0,"cool":1},"AiI_jrcUFUL4dOeLSGRzZw":{"text":"Found this spot through Yelp and it's been the talk of our trip.  Amazing decorum and ambi","useful":3,"cool":0},"p07xF9g11B96Y85Dv5n3JA":{"text":"Was hands-down the best place we ate all week.  The drinks were good, they had some amazin","useful":1,"cool":1},"zzilLXvqqIxUaKhg6hfOiQ":{"text":"First let me start off by saying the food was very good! I had a pork chop and others had ","useful":0,"cool":1},"9Hs1GuqY1d82Equ1VbBoLw":{"text":"Nice restaurant in the heart of the French Quarter, the food is very good but not spectacu","useful":0,"cool":0},"26N5xTNV_Hdxfp39d4fZ5g":{"text":"Extremely beautiful restaurant.  Great fixed price lunch menu as an alternative for those ","useful":1,"cool":0},"S_xjzCDiAFbT1q-PlP30Rg":{"text":"This was my first meal when I came into New Orleans.  One word:  Exceptional.  I came in i","useful":1,"cool":1},"kXJWc3_eCrWyzQl71R0Ppw":{"text":"Great service! The front desk lady was very sweet to tell me my little cat is cute. The fl","useful":0,"cool":0},"p3PjB-ddIvXvFWqJiGj0JQ":{"text":"The service was great! We were welcomed by the staff as well as the owner as soon as we en","useful":0,"cool":0},"h_B6QzHil5pp7NP8frWl-w":{"text":"Saturday brunch at Jackson square.  Location - perfect. Great service and staff. We sat in","useful":0,"cool":0},"nogxcf-bqaaz39v98nOEXQ":{"text":"Came here as part of a cocktail tour.  Had the Pimms cup at the bar.  Excellent. The tour ","useful":1,"cool":1},"7qFWqdmm_Nhav12oEooLXg":{"text":"I was pleasantly disappointed. Yes disappointed. Maitre D' was wonderful to seat us within","useful":0,"cool":0},"8xPMk8g4dKTkKoYH2kpKbA":{"text":"I really wanted to love Muriels, but our experience was very hit or miss. \n\nPros: \nPecan e","useful":1,"cool":0},"lme05PzsaCZ0SCYA-zREcg":{"text":"Went there for a Sunday Jazz brunch. Food is awesome - my fish fillet with pecan crunches ","useful":0,"cool":1},"WAiWM7FPXvA2blCbLu8fFQ":{"text":"I love the impeccable service. The Satsuma salad was so well put together, kudos to the ch","useful":0,"cool":0},"8FKxl-gszhMo5ozg0FtvIw":{"text":"Extremely cute and you get the entire fine dining experience, as in the server will put yo","useful":0,"cool":0},"Oil-1s9m_T0b44mmu1iA5A":{"text":"Unfortunately very disappointed with this place. Saw it being displayed on a ghost tour an","useful":0,"cool":0},"_M8yU6QTPMTFmAmFHI3ylA":{"text":"Pretty good jazz brunch.  Need reservations but we managed to get a walk in table.  Shrimp","useful":0,"cool":0},"mcq9HDEj5jCvSBpTeYVjCQ":{"text":"The atmosphere is nice and the staff is attentive & friendly, which is why this isn't 1 st","useful":0,"cool":0},"w3iivKERhqKbM-2Qe4kxNA":{"text":"Arrived a little early and was seated right away. The staff was very attentive and friendl","useful":0,"cool":0},"3g_JWczMpkJgLnmF68h7Kw":{"text":"Popped in here on our first night visiting New Orleans. The boyfriend and I were on the la","useful":0,"cool":0},"j_N_FO_4i3zvPyTdvvb8pg":{"text":"This place probably doesn't need another good review but I will leave one anyway. We came ","useful":0,"cool":0},"JX3ieLcZbpl6FOqABjtHrg":{"text":"We selected this place for our anniversary dinner and we are glad we did so...the food tan","useful":0,"cool":0},"kkPcHxTUYOYGeiRRtmY8Sg":{"text":"My friend and I were in New Orleans for a convention.  Being from San Francisco and self p","useful":0,"cool":0},"j7L8PT6E4cK1ejLzjbKFYQ":{"text":"Amazing food and amazing service!!!  We split the 3 course meal... wild mushroom gnocchi, ","useful":0,"cool":0},"MnLpVoTZWeX822p1QsfkHA":{"text":"Ended up here because we were a bit lax on making reservations and they were the only ones","useful":1,"cool":0},"gZbLxq6izwbALqu_lQzfJQ":{"text":"Very enjoyable lunch specials at a discount. We sampled the crawfish crepes that were abso","useful":0,"cool":0},"_yxwDuRD1TpQ5BGyRf2PlQ":{"text":"Most amazing atmosphere and the food was unbelievably delicious! I had the blackened red f","useful":0,"cool":0},"ec2GXU4-WrB2l6U0vtO_ew":{"text":"[ Visited in October, 2010 ]\n\nMuriel's is upscale Cajun/Creole in the heart of the French ","useful":2,"cool":1},"7cRUcas3zqNVruOusXsK3A":{"text":"Upon arriving to NOLA, my best friend and I had made pals with a few of the locals who tol","useful":0,"cool":0},"3kXl_g7KTEmgaCFGDZ1TCQ":{"text":"We had a reservation but still had to wait another 20 minutes for a table to become availa","useful":0,"cool":0},"W9RlBF1Av4wWIIfwQ3RMHw":{"text":"I went to a dinner that was supposed to last 2 hours; the service was so slow it actually ","useful":0,"cool":0},"hJC0Oy6Prl611_Z2-h6Kng":{"text":"This place was great.  We went here for lunch and were very happy with the food and atmosp","useful":0,"cool":0},"jAgJ-CcH4yYBJSowccSXRQ":{"text":"Had brunch here and enjoyed it immensely. The food was very well prepared and presented. T","useful":0,"cool":0},"o5G1dTEhCVyKWrIXOUI5uA":{"text":"The food here was very good. I really enjoyed the shrimp crepes with goat cheese! Amazing.","useful":0,"cool":0},"c9La1sPrxq6Q16c_hE4hyw":{"text":"Muriel's could be a very elegant dining experience but it fell short on several fronts. So","useful":0,"cool":0},"nqGaQ8YdzK2YvTsIsFTUNw":{"text":"Surprising pleasant find for our last evening in NOLA. Warm greeting from staff, courteous","useful":0,"cool":0},"HQkfU5xLooFL_PdYiDTPKg":{"text":"If I could've given this zero stars I would have. My husband and I walked in planning to h","useful":0,"cool":0},"u6xk5wADymgYa3J-wgTn_A":{"text":"Absolutely beautiful aesthetic inside! Felt like I was in an Italian courtyard while still","useful":1,"cool":1},"6cuTAPNFp1Tt8TO1FiaqoA":{"text":"The ambiance is fun and the waiters attentive.  Convenient because it's right on the squar","useful":0,"cool":0},"xrhzKCQNBpwbs85r1s6OjA":{"text":"Spent our 20th Anniversary dinner here.   The staff and service are the best in the French","useful":0,"cool":0},"i_DfwR8BYry8al0XjlMPtA":{"text":"Sat for lunch at the bar, and I had the pork chop with sweet potato puree and spinach in a","useful":4,"cool":1},"Rv8-yGQzphC98SmaRnf1zQ":{"text":"My first trip to Muriel's was like day to night compared to my second (and final) visit.  ","useful":0,"cool":0},"mhI7xP3gezQZKzldM1yCnQ":{"text":"Outstanding! We came across Muriel's while on a Ghost Tour of the French Quarter. The haun","useful":0,"cool":0},"o7SGWWz6HUYbYBduMSW-Eg":{"text":"We went to Muriel's for Sunday jazz brunch.  I had the alligator hash with poached eggs - ","useful":1,"cool":0},"oshQlpE6L_AQFJbsQTuLqw":{"text":"Clearly, this place has enough reviews to tell anyone to go there, but still I feel compel","useful":0,"cool":0},"qp11gEyF2PpwB8Jj35t-VQ":{"text":"Where do I begin...? \n\nI made reservations via Yelp. I saw a special offer for $31.95 for ","useful":3,"cool":0},"nfGQGAni33K5rxOwup_u_Q":{"text":"Great place to eat. \nWe had stuffed mirliton, pork chops and pasta. All our dishes are wel","useful":0,"cool":0},"_eiJbksbQSmPfcKh19AdRQ":{"text":"Muriel's has good food. The wait staff is helpful. The atmosphere is very nice. This is a ","useful":0,"cool":0},"6tJF4MDRZlphHZdhQCLG1A":{"text":"Was there once with the meetup group on Saturday, April 11th for French Quarter Fest. Had ","useful":1,"cool":0},"sjx2eMMczHUpKUsR8W8yOQ":{"text":"We dined here on a Sunday night with a group of six people, and it was the best experience","useful":3,"cool":1},"qXo51JbA3Uk4kChr27C74g":{"text":"Beautiful, historic building in the heart of the French Quarter. We were so excited they t","useful":0,"cool":0},"POLVI5voMDCl0On20Jjcmw":{"text":"The jazz brunch menu was great, we liked everything we had. I wish the musicians spent mor","useful":0,"cool":0},"8KYT58CLAgK1xRt8KfyhXw":{"text":"They were very accommodating to our changing reservations. Highly recommend and their food","useful":0,"cool":0},"swJy6TD5gf9E-vXzzmWi2w":{"text":"We had early reservations (when the doors flew open) and although my family was severely u","useful":0,"cool":0},"UOILCN-IsO05eEhxxskxug":{"text":"The food was pretty good. The gumbo is excellent and the prefix menu option is a great val","useful":0,"cool":0},"miTQjsLwlC62hPJU5lYLsg":{"text":"Appetizers amazing. We had shrimp crepes and the shrimp remoulade. So tasty. Would go for ","useful":0,"cool":0},"41SnN2KjuWEI4NMZCV5sYw":{"text":"Food and service = excellent at this establishment..  I had the turtle soup, wood grilled ","useful":2,"cool":0},"5MCBvNaV11G2k4nEn3k9TQ":{"text":"After waiting in their nextdoor parking garage for 10 minutes to give our keys to an atten","useful":0,"cool":0},"aA8NBWUOX56pomC9S-O1Ug":{"text":"This place came to us as a recommendation from a past resident. Wow!! From app to dessert ","useful":0,"cool":0},"IN-MDsEAcW8m9oAP59_uyQ":{"text":"I lived in NOLA a few years ago pre Katrina and just went back for the first time in a whi","useful":0,"cool":0},"FEMvzARdk2qrQNjXqMSAeQ":{"text":"We always try to go to Muriel's when we are in town,so were happy to obtain a reservation ","useful":0,"cool":0},"LjabdyWM9kL_HaN8nj-ovg":{"text":"Service was terrific. Food was suprisingly bland and not well cooked. Chicken was dry, fis","useful":0,"cool":0},"6zBStwViXOqGXI86mJoJgw":{"text":"Great ambiance and excellent food.  The service was very professional and attentive too. O","useful":0,"cool":0},"j4Nx5RNQLgDdK2WEWNXSMQ":{"text":"My most detailed review ever!\n\nI forgot to take pictures so this won't be long. \n\nOur grou","useful":5,"cool":4},"s3f4UQ4h5G1_wl1JZvj1ew":{"text":"I haven't gotten many chances to get out of NYC much other than overseas so I was pleasant","useful":2,"cool":1},"cOVbuuTqAjf9-gouE-n3fA":{"text":"Silly me...I'm reviewing Muriels on the bar only, I needed more time in New Orleans, wish ","useful":0,"cool":0},"OrHtYr__rz6ARTECB73OuA":{"text":"We went to Murel's late one Friday night. The food was fabulous. The red fish was simply d","useful":0,"cool":0},"9e-AwKGWBn83afKY4aiCDQ":{"text":"For what this restaurant appears to be, they really missed the mark during our dinner for ","useful":5,"cool":0},"EQkUo0AzUPLc1fujEoMzVw":{"text":"Only had drinks at the bar. The El Diablo was really good (very spicy). Very clean restroo","useful":0,"cool":0},"v-uxpEYbowJF9vvSfM0RLA":{"text":"So sad, Yelp. You led me astray. \n\nBased on all the positive reviews of this place, I scur","useful":7,"cool":1},"MRXBwFz5VP05mplZbM6P0g":{"text":"Had dinner here with my husband and a friend who was  going back to WDC.    All of us enjo","useful":0,"cool":0},"wyZNStHzc54yCWghwfUfXA":{"text":"Saturday lunch with no wait. Staff attentive and courteous. Eggs Benedict was so-so. Chick","useful":0,"cool":0},"6XM1pSTkohdIQEamgUE98A":{"text":"Recommended to us by concierge yet service was Terrible. Ordered salad, brought wrong one.","useful":0,"cool":0},"ufAKCOOlWkMSY-SzgxrkKg":{"text":"I've had dinner here several times as early as Feb 03. \n\nAffordable pre fix dinner which I","useful":5,"cool":8},"6R1lLx_jUE8D2ZytAa0AuQ":{"text":"One word for this place \nAlessandra \nWe have come back and forth from Texas a few times an","useful":0,"cool":0},"R3c3L7xHqgLmDhYrc_gLGQ":{"text":"Enjoyed every bite of both our meals. The pork chop was tender, juicy and simply delicious","useful":0,"cool":0},"6OJff7yy8iEqAX8_4V--Xw":{"text":"A pretty good value for the food. A nice gesture was to bring my 19 year old a small taste","useful":0,"cool":0},"Wzbb1DOg6KjEhp8UiDoINg":{"text":"Enjoyed a nice impromptu dinner with my wife.  Great service from a Destiny and Kendall.  ","useful":0,"cool":0},"jxgj38duobTULrrOgMIGoQ":{"text":"Antebellum sophistication and charm with an excellent cellar reasonably priced. The corn a","useful":3,"cool":1},"3lnI3gxgGk0-OXtUXerRgw":{"text":"Just got a soup and salad here. Not bad at all. Nice place inside, more on the fancy side.","useful":0,"cool":0},"yLDv9d9ms9gtH-j7sTAtJg":{"text":"Overrated....  Average food at best, rude staff, and way over priced.  It was the shortest","useful":0,"cool":0},"F3iFKeZx5eO1J01emUDgPA":{"text":"The food was alright.  There were definite highlights- crab imperial was delicious as was ","useful":1,"cool":0},"zvO4v_2ZOkKf1AD3aorhtg":{"text":"I must admit I kept going out to eat this last time in New Orleans when very hungry. So I'","useful":0,"cool":0},"mI_YCsovHbbLC4Adya5U8Q":{"text":"Skip it.  Food was so so and service was terrible.  Had to ask for refills on drinks twice","useful":0,"cool":0},"sg7w3R35xWDvmwNLN1t-1Q":{"text":"Great food, great service.  Our waitress was extremely helpful and everyone in the party l","useful":2,"cool":1},"Si3U8WqxsF_oZDBTdh8gqA":{"text":"I really, really (really) hate to be in the minority here, but I had a very port experienc","useful":1,"cool":0},"0z6UgRXgYKpe_CGsXUDzWQ":{"text":"The food, drink, and atmosphere were all lovely. \n\nSomething about our waiter, though...he","useful":1,"cool":0},"9YpnItExWAycfOo4jZMWVQ":{"text":"I unfortunately didn't get the chance to eat at Muriel's because of their ignorance and di","useful":22,"cool":3},"pviqHTAt0dyK0q8FIhBw_A":{"text":"Just the vibe to expierience in the french quarter. Have a drink in the balcony, then come","useful":0,"cool":0},"KEYS7LdJe9lhp5nhKXLm6Q":{"text":"Super busy as all places in NO. Sat at the bar and enjoyed a nice glass of wine. Friendly ","useful":0,"cool":0},"sbLU6I03w_jtu2hkLcUHLw":{"text":"Great ambiance.  Decor really well done inside.  Very lively on a Saturday and makes you f","useful":1,"cool":0},"A_Drc_pbItdr1g6noGysMA":{"text":"Awesome meal and the service was great. This was the second time we ate here and the quali","useful":0,"cool":0},"LYVFVn9NNsRPZah5qGOaeA":{"text":"I really have a lot of love for Muriel's the food is great the servers aren't snotty and t","useful":2,"cool":2},"9z_u2yKspn6tEZEa9rqKNA":{"text":"It really doesn't get much better than this.\n\nI was afraid this was some overhyped tourist","useful":2,"cool":0},"lPepnGml1XTLJw3xzVmGkg":{"text":"This was one of the best meals I've ever had.  From the service, to the food, it was just ","useful":3,"cool":0},"Z-NJEp01fMYNRuTqdr3_2A":{"text":"We were running out of time to eat before a ghost tour. We were dressed for walking not di","useful":0,"cool":0},"2Em4TnndFwu0JPxaaxgl4g":{"text":"Yup, those goat cheese crepes really are as good as everyone has previously yelped about. ","useful":3,"cool":3},"PJMuJaxzeNAi53iQluVClw":{"text":"Located smack-dab in the hustle and bustle of Jackson Square, it is hard not to take notic","useful":2,"cool":1},"kQGt9xLYnSUXSqoujWqIcQ":{"text":"If you are looking for a great stop for a cocktail in the French Quarter Muriel's is the s","useful":0,"cool":0},"KogSuY_JF6vG2rN4MBFOpA":{"text":"Fantastic! Had the chicken and andouille sausage and it was fabulous! Service was wonderfu","useful":0,"cool":0},"2Va3Ht0tcJDjMnxplObFpg":{"text":"Amazing food in a beautiful restaurant. This is my favourite restaurant in NOLA! Make sure","useful":0,"cool":0},"t9IF6m4qBKSewdaSQpEi9g":{"text":"Went for Mother's Day brunch.. Loved the ambiance, the food, service, and music was amazin","useful":0,"cool":0},"SQEURFhjTbbw68tFoVnJxg":{"text":"A stunning example of New Orleans hospitality. \n\nI must admit I dine here regularly, and f","useful":2,"cool":2},"DjMX5sYh-x8xFOJg6lBmkQ":{"text":"I once feared this place was just touristy hype, being right on Jackson Square.  Not so!  ","useful":4,"cool":1},"1NrLw56rfOil7-ctTQMAVA":{"text":"I wasn't completely jazzed over the food, but I did love the Sunday brunch jazz band (pun ","useful":1,"cool":1},"IhzBuWTX-C2M90AGO1avgg":{"text":"Muriel's offers a 2 course lunch special for $17.95, $4 drink specials and will validate p","useful":1,"cool":0},"HIAG31C0FW8oveDoHbiyag":{"text":"We had two wait staff trying to help us but not the most knowledgeable but acceptable. Hea","useful":0,"cool":0},"uxsLDfLrSOQ3fu51HOGZ-w":{"text":"The bar in the back is a great place to grab a drink in all of the craziness of the French","useful":0,"cool":0},"vgCSVuiamQPVIidSRy-JUA":{"text":"Went here for dinner on a Friday night with reservations for 6 pm. Restaurant was already ","useful":0,"cool":0},"NeBXe9IcajZe7DhevD84dQ":{"text":"We availed ourselves of Muriel's bargain Bloody Marys as soon as we sat down;  very refres","useful":0,"cool":0},"_LwZV9fXbwOioB5Yqly5uQ":{"text":"We have eaten at Muriel's a number of times over the years and have never been disappointe","useful":0,"cool":0},"nZ10OMce0kQmBfSzIVKCKw":{"text":"Muriel's is located in what seems to be an old-style city mansion. It has a gorgeous decor","useful":0,"cool":0},"kboR_-Qid_PG5ioY1-zLkQ":{"text":"Upscale dining and service. Exquisite food and cocktails. I recommend the Honey Child.","useful":0,"cool":0},"Pe8ftzpD4pZc--SczsWciw":{"text":"We enjoyed the food and had good service. The environment is very formal and classic New O","useful":0,"cool":0},"stXhDJgHWcaxq-_s0PzEKw":{"text":"While the food here is very good, the service, at least what my party of two experienced, ","useful":3,"cool":1},"HQMsnTiiuv9iBlJv2tY5yQ":{"text":"We were in NO last weekend for a girls trip.  Muriel's was recommended so we made reservat","useful":0,"cool":0},"MQ6kF4QQhH3kmZeUSn0ZBA":{"text":"Still in love with muriels from our previous time in nola. Best Louisiana drum I've had in","useful":0,"cool":0},"RYv8JFKoBAbDOohmymK3RA":{"text":"This place was pretty great. I went with a group for Sunday brunch. The goat cheese crepes","useful":0,"cool":0},"fCN7qyJxlrUSPY1Xmnuapg":{"text":"I'm going to give this one star, which I rarely do (I usually rate on another site where I","useful":0,"cool":0},"IWO1rm3sYTX1N-lV6w5xzA":{"text":"Strolled in to Muriel's on a whim. We were starving... it was there. We arrived after the ","useful":0,"cool":0},"yKBI8HtVfxpZRw46MoS5fA":{"text":"Nope nope nope!  All the hype to be let down.   Two stars was a stretch and only because I","useful":0,"cool":0},"N2y3GVlqqiTb1MaB3ZZtmQ":{"text":"The ambiance is what sells the place. The food is what should encourage you to run from it","useful":1,"cool":0},"rCIr0xC5_mk6QbPAteRhwg":{"text":"We planned ONE fancy night out while in NOLA, and Muriel's satisfied.  I get ultra critica","useful":0,"cool":0},"-PsWVJvPWBFVePqsOEpW8A":{"text":"This was a very nice restaurant with a very homey bistro type environment. The staff was s","useful":0,"cool":0},"Sz5r-po66xT3PAqwXL0vow":{"text":"We came for early New Year's Eve dinner. The food was great but I feel rush to leave they ","useful":0,"cool":0},"31JDnbsYfAZN_ruqLyE1QQ":{"text":"If I could give Muriel's ten stars, I would.  I originally zeroed in on Muriel's Jackson S","useful":1,"cool":1},"VhuorcemhlozBMkE4ClrIg":{"text":"Nicole was an absolutely awesome server! She took great care of us and is a great represen","useful":0,"cool":0},"K_LLpkeO8E9MQPHk6n2X7A":{"text":"Visited on a recommendation, while on my honeymoon last week. Lovely decor and ambiance. T","useful":0,"cool":0},"4dHCXPOqkf0P-NjIL2kWuA":{"text":"Wait staff was awesome and the decor was great. We had pre fixe dinner. The turtle soup wa","useful":0,"cool":0},"9F3484GxwOIWfa98N9S1dg":{"text":"very pretty big place right by jackson square.  walk in to big room, with probably 15 foot","useful":3,"cool":1},"IwpGU36keyIf1Sa6kIuAGA":{"text":"Muriel's is in my top favorite places I've ever ate. \n\nThe first time I wandered in was ab","useful":1,"cool":2},"9n24Cqrv3AT7p7kF8X762g":{"text":"Gluten free menu is okay, though I would call ahead or look it up online to be sure you're","useful":0,"cool":0},"gKZUFoV9GqRxDHWoRDqpfQ":{"text":"We are locals, but it was our first time to dine at Muriel's.  The service was excellent, ","useful":0,"cool":0},"9kKwEBPdFMFbbLMjqjBWOg":{"text":"Went on a Friday with a party of six. Everything from appeitzers to dessert was delicious!","useful":0,"cool":0},"XNVhzWvqt03JLNcouSaXhg":{"text":"Outstanding experience at Sunday Jazz brunch. Excellent food, service, and ambiance","useful":0,"cool":0},"WRc2pSptPP8_-ijB5dPDvQ":{"text":"Murals is the best place in the French Quarter to get the classic French New Orleans exper","useful":1,"cool":0},"oPkbuR-bJjbYwxuRd0Cz8g":{"text":"Right by Jackson square, we thought we might be walking into a tourist trap but the review","useful":0,"cool":2},"aPqf8ef8Q-xEDJCbpbUWcw":{"text":"This was truly a treat being able to dine here. My crawfish étouffée was the best that I h","useful":0,"cool":0},"qOnknAtKc5xIJfZvc91WFA":{"text":"I will always have fond memories of my trip to New Orleans and Muriel's will forever be a ","useful":0,"cool":1},"5KEvKt_69oPCsZ8mX3ZoDg":{"text":"The hostess seated us and then we waited for about 15 minutes without anyone coming to our","useful":0,"cool":0},"0tAADFrVM7qCP_Lmijnj1g":{"text":"Great lunch. There were long waits at Cafe Amelie and Stanley's nearby so we were glad to ","useful":1,"cool":0},"tchHxIXO8xBZY1jrGAhpXw":{"text":"One of the best gems in New Orleans. Fun atmosphere and amazing food! \nIf you are looking ","useful":0,"cool":0},"YKwfJXjkB0pK8FBFZlttnQ":{"text":"Wow - what a meal. Wonderful service - professional and accommodating. Amazing soup, most ","useful":0,"cool":0},"0X9efZkAJZ5qKJ5CA0Rnzw":{"text":"Really amazing cuisine, overall a good experience. The service did seem a little rushed fo","useful":0,"cool":0},"ZkD-T3Nvo2XdDtdlP1Sypw":{"text":"Really bad service. Nobody came to serve us for a very long time. We had to constantly ask","useful":0,"cool":0},"MVQEmy64FrDGwWbmSgdQ0w":{"text":"Really great service and I definitely enjoyed my shrimp & goat cheese crepes! Such a beaut","useful":1,"cool":1},"YheuuRUMMLQxXgbF8capnw":{"text":"Came here last night with fiancé and friend. Our friend is allergic to gluten and we came ","useful":1,"cool":1},"BUW76zuG4Tu55Nnbfhl-XA":{"text":"The location of Muriel's is so prime. We were seated quickly and the serves were great at ","useful":1,"cool":0},"3Obd4PMvuO1xeKKcmet5JQ":{"text":"Amazing food!  The staff was super friendly and informative.  The place is lovely and has ","useful":0,"cool":0},"D_uUJhXzalw1hcQDIiEnEQ":{"text":"We love this place. The food is always outstanding and something surprising to make each v","useful":1,"cool":0},"tE6mZW52j9fKMr38R8xc8Q":{"text":"The pecan crusted baby drum had a delicious rich sauce and the pork chop was probably the ","useful":0,"cool":0},"Y0UI6Nz0uIr7vBwfbCNK1w":{"text":"My general rule for food in New Orleans is to put your finger on a map of Jackson Square a","useful":2,"cool":1},"dNabQBKyWFQMnAoDC1IhZA":{"text":"This might be the most delicious meal I've ever eaten in my life. Went here on Valentine's","useful":0,"cool":1},"20u_rDOaPIjVDmW-ICCLMQ":{"text":"Surprisingly, this was my first time dining at Muriel's. Their 3 course for $39 seems like","useful":5,"cool":0},"qTUB0wGouBo7wJP5Cl5nCw":{"text":"We were very disappointed with our visit to this restaurant. We were looking forward to it","useful":0,"cool":0},"k3aOh0ioY1Fs5JKoJ0OsVA":{"text":"Came here on a Saturday afternoon for brunch. They were extremely accommodating with us ch","useful":0,"cool":0},"tjfGpgFT7vEA-nUDPftY_A":{"text":"So good and not so expensive \nTry the turtle soup it is amazing \nThe staff is very very ni","useful":0,"cool":0},"WC-N5c56BPrJ-sRqrVgS4A":{"text":"First off, I live here, and I work as a server, I'm pretty laid back about service and hav","useful":2,"cool":0},"L2AcOCDqsi4X52HJytt2fA":{"text":"We ended here by mistake. The food and the service was good. The goat cheese crepes were m","useful":0,"cool":0},"YkDjWl-DXG06G5s4-86a7g":{"text":"I just realized, I've actually been to Muriel's and I can post an actual review!\n\nEverytim","useful":3,"cool":2},"b5h6FW7J9TsOPV3oR_I_rg":{"text":"I am a local, and Muriels has been my favorite restaurant in the Quarter for many, many ye","useful":0,"cool":0},"_5lG6RnX3wQ0snT6w2bWAQ":{"text":"Finally had dinner at Muriel's. My wife had Duck Jambalaya and I had the Filet. From the m","useful":0,"cool":0},"ZNI0uZ08rhV6oGD9iDr1Cg":{"text":"This is a great place to eat.  The location is perfect for before / after drinks in the qu","useful":3,"cool":2},"RyNJfckEduyzixj6UAYQ-w":{"text":"Chose to eat here while traveling through with our family.  The atmosphere is very pretty,","useful":0,"cool":0},"64kw0J0mp0_umAt8pY0b1g":{"text":"I ate here for the first time this past week and was delighted.\n\nI made my selections from","useful":1,"cool":0},"6HQdOlB11YvR7EV1MF974Q":{"text":"Love the wait staff- professional, fun and fast!! The food is out of this world! Last Week","useful":0,"cool":0},"w4sC4te5YD3oEdwKcMA9hA":{"text":"Just passing by for a quick bite and a drink. $4 Bloody Mary or martini specials. Wife had","useful":0,"cool":0},"I1mPx13rln_bHwTdq-JxNg":{"text":"Great service, packed restaurant. Food was good but I wasn't amazed. Fiancé thought it was","useful":1,"cool":0},"mdAyfJsoMf4YDE-_VbcKBw":{"text":"Ok.  Seriously, this has been the best experience.  The manager here, Lawrence, was fantas","useful":0,"cool":0},"MA5B-LQI-n6x-ZCDT4bEEg":{"text":"Once more, Muriel's has proven the best all=around \"fine dining\" restaurant/bar in the New","useful":3,"cool":0},"00Tspiq4feBEIlCccQMX0g":{"text":"I really liked it.The drinks were strong.The food was well seasoned.The service was attent","useful":0,"cool":0},"LVn_kj3XdOGeXC-ZHiubVw":{"text":"Surprisingly pleased with this heart of the Quarter restaurant. The service was excellent ","useful":0,"cool":0},"-0W_UarrDL7jVuimKFoPvQ":{"text":"We went here for dinner without reservations. The maître-D seated us in the \"court\" area s","useful":0,"cool":0},"YXulNkl6hIskLdmG0L90Eg":{"text":"It was one of our last nights in New Orleans during our honeymoon and our original dinner ","useful":2,"cool":0},"VTDHOtvcqO7KQFZpmqd2GQ":{"text":"Overrated  the shrimp and grits are overrated. I sent them back. They were a 2/5. The goat","useful":0,"cool":0},"E-alZJ9ZvlVV_cL1c5iD4Q":{"text":"Enjoyed Good Friday lunch special ~ staff was very accommodating ~ we had a 6 month old ba","useful":0,"cool":0},"ndUGkEIkQsbsxvRF6F_cow":{"text":"We ate here on our first night in New Orleans.  My friend had been before and couldn't wai","useful":0,"cool":0},"DF8oX67H3_kVtNVeAd3mAw":{"text":"My husband and I dined at Muriel's last night. I had the seafood feast and my husband had ","useful":0,"cool":0},"tqX6P-UbCEChfe1yVO_cug":{"text":"You need a reservation for the restaurant at dinner time. The variety of the menu is great","useful":0,"cool":0},"ICAH9Ru_IiPT6D4YMO_bKw":{"text":"This was recommended to us by our haunted walking tour guide!\n\nAbsolutely wonderful all ar","useful":0,"cool":0},"iRvxu00nohsMxc9ob4Ys3g":{"text":"Good food and atmosphere. The waitress was nice and courteous. She was very attentive. The","useful":0,"cool":0},"qFWSkV_nPOyq4xS_NJy6Jg":{"text":"After scouring the reviews of a number of French Quarter Sunday jazz brunches, my husband ","useful":2,"cool":0},"XyMew_9I7wdVfEjApdFmDA":{"text":"Muriel's feels like deep French Quarter with deep reds and browns and brick walls....sumpt","useful":0,"cool":1},"_9ZTb121unRpnDscuAzOMw":{"text":"My first visit at Muriel's did not disappoint! I highly enjoyed their Mushroom appetizer a","useful":0,"cool":0},"ueQsVECvka3tk2RuoOyBPg":{"text":"Pretty good food. Didn't like the crepes. Liked our entrees and desserts a lot. Okay atmos","useful":0,"cool":0},"mXNILFE4ONKMOSWzvUJ7MQ":{"text":"We went to this restaurant for lunch on Veteran's day based largely on the reviews that we","useful":0,"cool":0},"1KcxM4_MJgmAQR6GRJDrzA":{"text":"My husband and I made reservations online for Their Sunday Jazz Brunch! We were greeted at","useful":0,"cool":0},"cZ0f21H5NyfHyHQlH6QP8Q":{"text":"If you've read the reviews on here, you should know by now that the food at Muriel's is am","useful":0,"cool":0},"KzAUBdFGpeOUjsRQ_iFNEA":{"text":"We came here for a bachelorette dinner and had a great experience.The staff were all very ","useful":1,"cool":0},"zczsTpNMWsZltHKK7u72xg":{"text":"I went here for Saturday brunch and it was delicious! I have Celiac's, and traveling to NO","useful":3,"cool":0},"6cNTDN0kNBCmQuiEJsw_rQ":{"text":"Amazing find! The food is absolutely delicious and reasonably priced. The crawfish étouffé","useful":1,"cool":1},"xEXQoU-3EdOIhFsdhxOywg":{"text":"I have eaten her many times and have never been disappointed with their food. One of the w","useful":0,"cool":0},"2BFFZ5RbEJg28Z10NH6Qfw":{"text":"The food is just to die for but the staff is what really distinguishes this place. They ar","useful":0,"cool":0},"yktEvAaYMlwRutYoxgUVnA":{"text":"Fantastic food and cocktails, and excellent service.  Plus the ambience of the restaurant ","useful":0,"cool":0},"My6ntvh_vpIsGFkwLGMCeQ":{"text":"My husband and I dined at Muriel's for his bday while visiting New Orleans. It was by far ","useful":0,"cool":0},"hMJ4Pol_CPfonHn45zIEQg":{"text":"Maybe it was because we had just heard tales of a resident ghost on a ghost tour but we lo","useful":0,"cool":0},"QcBwORmZ-zXXLvcUAcaccQ":{"text":"Loved everything about this place. The food was amazing, awesome location, the service was","useful":0,"cool":0},"1InPCOUGklEbJKgLuXhJbQ":{"text":"The reason why the low rating is because we arrived 5 minutes before \"lunch seating\" ended","useful":0,"cool":1},"b4bXHXsYk5Z--2yMUA24Fg":{"text":"Beautiful ambiance, fantastic service, and really good food! I was even able to get a tabl","useful":0,"cool":0},"SPOOSI-7V4BCiOQ1835zTg":{"text":"Small but extremely tasty portions. The fix Prix table d'hor had very good choices. The wi","useful":0,"cool":0},"5NmEXzZZasHC0imrpLjfqg":{"text":"Fabulous food and service. We had crab cakes, gumbo, shrimp and grits, shrimp crepes, and ","useful":0,"cool":0},"DvzPUskpk2aeRS0xKVhgCw":{"text":"I'm gluten intolerant so this was on my list of Nola restaurants that provide a gluten fre","useful":4,"cool":0},"otiS_Shoam8EY9Wb4_8BHw":{"text":"Loved Muriel's. Went with husband and 9 year old daughter. We both had the fixed dinner me","useful":2,"cool":1},"P_tDrDgy4-Brt-35PoeWdw":{"text":"Great location right in Jackson Square.  The food, decor, and service are always great (be","useful":0,"cool":0},"M-GW_1XCc5TJzDaTE5OknA":{"text":"Loved the ambience. Good service and the prix fixe menu a great value . The only reason I ","useful":0,"cool":0},"nGrR3ZoKLk6JH_WnrwKPfg":{"text":"Great food and fun place with amazing atmosphere! Lost a star because service was terrible","useful":0,"cool":0},"j49STikJNkhlpjgtx7Jhqg":{"text":"We had a large party of 7 and made reservations and we were promptly seated at our reserva","useful":1,"cool":0},"d_E-Vtk1aa5SiheLzsPyqA":{"text":"Went for brunch, got mimosas, pecan drum and duck hash. Everything was outstanding, the dr","useful":0,"cool":0},"IlVYDx0pT4ycPtZ_kD4wxw":{"text":"I would like to say thanks to David L. for being such a wonderful waiter! We were travelin","useful":0,"cool":0},"f527uGr1IegN7uxB1vl9Hw":{"text":"I have to say this was definitely the splurge meal of the week.  We got apps, entrees and ","useful":0,"cool":0},"9Y-AsKlG45enhA7WdYwchg":{"text":"Simply amazing food and a wonderful staff...We totally enjoyed our meal here and we look f","useful":1,"cool":0},"K-zNesZGgaRC1FKYhOexrw":{"text":"While in New Orleans for my bachelorette party my girls and I dined at Muriel's. The servi","useful":0,"cool":0},"Wygy5jbBKz7sNxiY5ZaCyA":{"text":"Absolutely love this place. Had drinks and enjoyed the atmosphere. Make sure you go upstai","useful":0,"cool":0},"WPLTnj7t5g3SI90OvoH3Yg":{"text":"One word: Creme Brulee French Toast!  Oh wait.. that's four... bother.  Anyway, that's wha","useful":0,"cool":0},"2v18Td7oWEUT1CgF1hrylA":{"text":"An oasis among the tourist masses. \n\nMuriel's Jackson Square is a quiet respite among the ","useful":0,"cool":0},"u4UJGMjU0Q0zh-en52SCiw":{"text":"After dinner at another Restaurant we went to Muriel's for dessert. The reason we went to ","useful":2,"cool":0},"ylZEoztOY9YGyTRkRBkqOQ":{"text":"I really enjoyed this restaurant. The staff was great, the food was PHENOMENAL!! the gumbo","useful":0,"cool":0},"MtpqwJJNCvjvSTX_y7E1ag":{"text":"Excellent food, service and music. My wife had the seafood gumbo and crabmeat imperial, gr","useful":0,"cool":0},"LwutXFgFtnZa7gqZHkE5_A":{"text":"So the service here is 5 stars but the food just didn't live up to they hype for us... \n\nW","useful":4,"cool":0},"LxnrrY4DfSY6kk4eIRNYyA":{"text":"Review is for drinks only.\n\nCocktails are delicious -- I tried the cucumber/elderflower/gi","useful":1,"cool":0},"XW8-mpjpc-9d6vAXt2X5gQ":{"text":"Based on all the reviews on here I made reservations for Muriels last weekend for my famil","useful":2,"cool":1},"GFRb6Rcf4XX759SA6v2usA":{"text":"We came here late at night. It was quiet and empty compared to the craziness of the rest o","useful":1,"cool":0},"yd4uh31X2NLZth5nHp4s2A":{"text":"Gnocchi was some of the best! Great Sunday jazz brunch. Beautiful restaurant great locatio","useful":0,"cool":0},"upt_t6jBG5FBm4sugwq5EA":{"text":"The service staff, the place and the food was excellent.  While the alligator was overwhel","useful":0,"cool":0},"0Y5lHysZlFoZDnmoaId71w":{"text":"You cannot go wrong at Muriel's! The food, the ambiance, the location, Muriel's has it all","useful":0,"cool":1},"rfWtDC7YIIQS7rmjndRs8w":{"text":"One of our most memorable dinners in NOLA. Great food, great service and nice decor. Felt ","useful":0,"cool":0},"kA17Q0KuHmCw1sOuyMIFpw":{"text":"The double pork chop was excellent.  Enjoy the marmalade sauce and the best sweet potato s","useful":0,"cool":0},"T2cuXQVNhmnhr_v4D4jINQ":{"text":"I feel kind of bad for Chef Gus Martin. The food that we had was excellent but the service","useful":1,"cool":0},"jzhHQAvrn45tYrGM7GeEsg":{"text":"I love the \"honey child\" drink! It's the best drink I've ever had. I like to eat on the ba","useful":0,"cool":0},"hFv7vJqEykbDwEQv231MpA":{"text":"My friends and I came here for brunch on Sunday morning and enjoyed the live jazz in this ","useful":3,"cool":1},"rPgrv_FPF5z-3MHp9hF7CA":{"text":"Weak Bloody Marys. Resident ghosts. Weird Seance room with sarcophagi and lots of groovy r","useful":0,"cool":0},"23pKE6WpIRc3LlWHGHpxcQ":{"text":"Quick review : If you want a meal and dining experience to talk about again, Muriel's shou","useful":1,"cool":1},"CKCnptAM20pP-ZQdkGVXOg":{"text":"Fabulous!  Had lunch with friends at Muriel's on Jackson Square. The pecan-crusted puppy d","useful":0,"cool":0},"kZ-SbfRNHK86kcSpt88xDw":{"text":"Romantic decor. The waitresses knew the menu very well. The seafood gumbo appetizer ordere","useful":0,"cool":0},"nGYP_mtAnlBCmVaJ5f22NA":{"text":"Fine restaurant in the French Qtr. Enjoyed a very nice business related  dinner in October","useful":0,"cool":0},"kl8ORSgqbi2GPBdn5jRJyg":{"text":"This is the tourist fine dining option.  \n\nFood is good, we all got the prefix 3 course wh","useful":0,"cool":0},"A_fSgjO2GFtLomtqs_xkzg":{"text":"This is one of the best Yelp recommendations I've ever gotten. We had just gotten off a ja","useful":3,"cool":1},"OPspw0OXcaRuFeztYYAftA":{"text":"On my first night in Nola, I chose Muriel's for my first Nola dinner as a first time visit","useful":0,"cool":0},"jtP4JEHbX9l9tMz9z9aiCg":{"text":"We went to NOLA for a bachelorette party and we had brunch at Muriel's.  If you love ghost","useful":0,"cool":0},"KeyiEZsVZlsdbIZCXp_3XA":{"text":"The wait staff with exception of the actual waitress was excellent. The food was 2 star, d","useful":0,"cool":0},"_Oq5nSC_gSr5O6yiTd7s7g":{"text":"We came here for the jazz Sunday brunch. I wish we had something like this back home. Jazz","useful":3,"cool":2},"PszJYyxLytbPLFI2mkGRcA":{"text":"Most amazing Creole food.  Everything was outstanding, and with a prix-fixe menu it's enou","useful":0,"cool":0},"lyUZsVFgm2tLkIanR-Aa7w":{"text":"Beautiful ambiance- we went for a snack- wine and appetizers- the crawfish crepes were rec","useful":0,"cool":0},"vcjN5fOOW3evLnnK6n7jnQ":{"text":"This was my third trip to New Orleans. I always seem to end up at Muriel's. I was on my ow","useful":0,"cool":0},"hzh8Xngxvu7v5kSUt149Lg":{"text":"We went to Muriel's late on our first night in New Orleans.  We actually were the last to ","useful":1,"cool":0},"Br26SEbNOKihREU9D_Yx-Q":{"text":"Fancier but not overpriced, Muriel's offers a wonderful taste of NOLA. Overlooking Jackson","useful":1,"cool":0},"dPOgr07wGXatcfuMteWKVQ":{"text":"We stopped in here for Sunday brunch because Cafe Du Monde and one other restaurant had li","useful":1,"cool":0},"F1WQLlou_6bzdZ1bbSsu6A":{"text":"Excellent food, even better history! Staff was so friendly and very quick to ensure everyt","useful":0,"cool":0},"DKHZAsXM6GT52ajcj7mgPw":{"text":"A few comments before I start my review: 1/ I live in Silicon Valley, where restaurants ar","useful":4,"cool":1},"rOI07VUANF3PF9AjNmiIbA":{"text":"We went in the middle of lunch/dinner service so only had the choice of the limited bar me","useful":2,"cool":0},"O3n_zigKRvguYaFCp3Vs1A":{"text":"Nice, fine dining experience right on the Square. We started off with a bottle of Brancott","useful":0,"cool":0},"JU0zIS_YGwVaatL0ov2Wpg":{"text":"I genuinely wish I gave this place 5 stars but the reason why I gave it a 3 stars are due ","useful":3,"cool":0},"UK4cKv6zH7H_FlI54PWPXA":{"text":"Amazing food and great staff \nDecor is not to my liking \nBut food makes up for the decor \n","useful":0,"cool":0},"vuRdPqmFZnk00g1QWnwoyg":{"text":"We had a large group and Joe was our head waiter, he and his team were fabulous. We had a ","useful":0,"cool":0},"nVLeluGLdHKneD8OzekOtQ":{"text":"Was here most recently in December. This is always a must stop when I make a trip to New O","useful":0,"cool":0},"bqEghczhO6BdixW3-8vcJg":{"text":"Exactly what people are saying about the restaurant!  On point.  A must go.  There's a sto","useful":0,"cool":0},"tUdSI4hn486PbC_Pn1JLDg":{"text":"Excellent!   Went in for a drink and ended up having lunch.    Shrimp and grits is by far ","useful":0,"cool":0},"gvTI84uLIp6seeS37XYzvQ":{"text":"The food was outstanding.  We had a party of 4 and all ordered different things to get a g","useful":0,"cool":0},"DLswy5x8KfxntIxUAJhIsg":{"text":"We celebrated our 1 year wedding anniversary with Muriel's.  There's nothing more stressfu","useful":0,"cool":0},"hHBbTd2AqVv8b95LUwWllg":{"text":"I would go here for if you want to try any go to New Orleans dishes that are made to a cer","useful":0,"cool":0},"V72Zu-MFAz2iIgmI-jbgVw":{"text":"Always exceptional! The fixed price menu is about the best deal in town.  The gorgonzola c","useful":0,"cool":0},"FASbQI68z_X34hnyJP-SiA":{"text":"Came here with 7 other girls for my bachelorette party dinner. The wait staff was so accom","useful":0,"cool":0},"kU64A9EuQltjhc6nuC-3Cw":{"text":"First of all, I'm an amateur Creole cuisine chef (my day job is a CPA).  I occasionally ve","useful":0,"cool":0},"3Arrp_5HRwGgQKiR8w_UnA":{"text":"Very nice restaurant. Food was amazing. Turtle soup was to die for, eitouffe was one of th","useful":0,"cool":0},"iJrJiw-Sw7SF176yaTZT0g":{"text":"My husband and I ate here on Sunday, August 29th. Hands down the best meal while in NOLA! ","useful":0,"cool":0},"72-wgeGyYhjEIs6my0e2uA":{"text":"Let me start off by saying that my two stars are a generous gift and only because of Jamie","useful":0,"cool":0},"6CMOn1tsvnceaO_Iz_rg_A":{"text":"Stopped in to try one appetizer....the mushroom  goat cheese and shrimp crepes. Service wa","useful":0,"cool":0},"BkD8ptFC61fnCVH4MBXTpg":{"text":"Reserve the seance room with a group - fantastic food and drink! Right on Jackson Square. ","useful":0,"cool":0},"SZB2PauF9_hbF5eBQE7CXg":{"text":"You've gotta be pretty secure with your masculinity to do Gluten Free in the south where e","useful":2,"cool":0},"c1SeYc4p8V9yDlLQLnl6tg":{"text":"My family went to Muriel's for Thanksgiving dinner. They had a fixed menu (58 for app, ent","useful":0,"cool":0},"-QjS9Vfan_29PKfuCqU0sw":{"text":"Muriel's is a must for anyone visiting New Orleans as it combines delicious food and cockt","useful":0,"cool":0},"jWnPXqjlLl1ztX2M_GVYiQ":{"text":"Definitely worth a visit. Food was really tasty and service top notch. Will visit again on","useful":0,"cool":0},"02OvcOF3mVbRQg3ME0VCqg":{"text":"Worst experience during my trip to New Orleans. \n\nWe went for brunch around 11:30am, a nic","useful":1,"cool":0},"Bv_zt7Fy0fCziZnw6g4cvA":{"text":"Been there several times. Always a great place! Great food, drink, and service. Had the BB","useful":0,"cool":0},"jhMhtuYB_dWFJtHKjV6hQw":{"text":"It's hard to have an establishment, especially in a tourist trap area where you can be a l","useful":0,"cool":0},"SQswlRzPlXnekXDHR9f8XA":{"text":"Muriel's was really delicious.  When we arrived for our reservation we were seated promptl","useful":0,"cool":0},"_Ttucru8mmTXxs_FYzz6aA":{"text":"Muriel's is a must if you're visiting New Orleans. It has a rich history, in a historic bu","useful":0,"cool":0},"vL-mOXzQNgMtq-qlRqoJXw":{"text":"I went here for brunch recently and I'll start by saying the service was excellent.. absol","useful":0,"cool":0},"CISNKO3MDTIXEmPwxXZUbQ":{"text":"We went to Muriel's on our last night in NO. The food was delicious! Our group likes to ea","useful":0,"cool":0},"33aboV-lPgzmEoIY2BbNRw":{"text":"Nice restaurant, dimly lit with cool decor. It's a mix between fancy and fun decor. We had","useful":0,"cool":0},"Cl4AR97o5Iu2sqlH1I0K_A":{"text":"We really enjoyed the whole experience. Food was top notch! I had the blackened Mississipp","useful":0,"cool":0},"wg4zFubDTYi2DYyfOhelcQ":{"text":"holy moly what a delicious spot!  while in town for mardi gras this past week, the bf and ","useful":0,"cool":0},"v2ss5p1VV1X3pioUdPL9DA":{"text":"If you want a great hurricane come here. Mary does the best hurricanes at this place and I","useful":0,"cool":0},"o2j-otNJz1b-zfK-2NjUFw":{"text":"Excellent food, excellent service and excellent wine list.  The setting and layout of the ","useful":2,"cool":1},"D9HyMUknUyAgOvOfv6kVIQ":{"text":"Muriel's haunted past made it a must stop for us. We stopped in for lunch the last day of ","useful":0,"cool":0},"gQYtRVGxWvhnH9yBihQ9WQ":{"text":"somewhere between quaint colonial and cutesy trendy, Muriel's still has an endearing old w","useful":0,"cool":0},"a0lJ25gnDQSqiMHSvIbUfw":{"text":"Great ambience in a perfect location\nThey have a \"much menu\", much more affordable than te","useful":0,"cool":0},"CYl6Khe6uilg_JJVvLQcfw":{"text":"Another plug from another local tour guide.  $16.50 for a two course lunch.  Choice of sou","useful":2,"cool":1},"CcqgKp4uPCKTVf5MrxR7LQ":{"text":"Muriel's has a beautiful southern charm feel and translates this into the food.  From the ","useful":0,"cool":0},"IiXdRzMAwCRdHiQz-yOgxA":{"text":"Great restaurant, service and food!  My husband had the shrimp  étouffée with grits - oh m","useful":0,"cool":0},"l5QLWjAN2l1QDo9IYIEqgA":{"text":"Terrible service and mediocre food. Our waitress practically slammed our silverware and fl","useful":0,"cool":0},"QKSC-Ypqfwjp4lKUwzIMfw":{"text":"Look, if you are visiting New Orleans, you must go to Muriel's, just off Jackson Square an","useful":0,"cool":0},"mQ0nj97D78yb8wAjF98Yww":{"text":"Muriels is beyond amazing! From the beautifully decorated inside to the great prompt servi","useful":1,"cool":1},"9JzYgMY26AuH4zgbDuRUXw":{"text":"A most wonderful place for any occasion.  Stop by for their black box meal lunches. Very s","useful":2,"cool":2},"ojt-0g3IBH9U6GOe_H6AHA":{"text":"Love everything about this place! The food, the drinks, the atmosphere, and the service we","useful":0,"cool":0},"f0Li-fLpFxzhlgYbAL8IKQ":{"text":"Visiting New Orleans for the first time and needed a location for a date night, Muriel's w","useful":0,"cool":0},"ER8AtOKzPXt1G-15NJC1sA":{"text":"Great place and great food for our private event. Had the jambalaya, pecan encrusted drum ","useful":0,"cool":0},"rI7z4vr0CsBu10CNif--IA":{"text":"Had a really good dinner here. The crawfish and crepe appetizer was amazing. The tuna stea","useful":0,"cool":0},"qW1R_dyeTXgoaJflt5zXgw":{"text":"The wife and I had gotten a gift card for this place as a gift.  Neither of us had been, s","useful":0,"cool":0},"tbLtisncfHkB9Y7vRHZMhg":{"text":"While in town for the weekend, we went here for dinner with a large group. They were great","useful":0,"cool":0},"fGQOkWycfnxNdVDL36o5-A":{"text":"My girlfriend and I dined here this past weekend for a Christmas trip we took to New Orlea","useful":0,"cool":0},"YmYd-X4sbOgFbmMkytrlrw":{"text":"I went here for the first time during We Live to Eat Restaurant Week during lunch and coul","useful":0,"cool":0},"UJQ1n7Ux-CV4wp3Pmj3oig":{"text":"At first glance, Muriel's appears as a really classy restaurant.  And it means to be.  The","useful":0,"cool":0},"tajx5b4cSS4X4Bse0Dn_Ow":{"text":"Recommendations: shrimp or crawfish goat cheese crepes, blackened drum or redfish, bread p","useful":0,"cool":0},"njKuOULCZTHIHmvGJlMoFg":{"text":"Delicious brunch options. Excellent, attentive service. Lively jazz tunes. This was a spec","useful":0,"cool":0},"_2kNR7crJAqZywtjtSGTXQ":{"text":"Stopped here for lunch and I was without a reservation. The ladies at the front were very ","useful":1,"cool":0},"Ov8AzQ4_aF59uM0B-9z-wA":{"text":"Dang!  Another fine meal in the Quarter this evening.  First K-Paul's and tonight this.  I","useful":2,"cool":1},"ni2_XbZxtzqxajZdvKOQgQ":{"text":"This was a disappointment from start to finish. This was our first time at Muriel's and un","useful":2,"cool":0},"J0uKaIYP4If070mv8suAGA":{"text":"We first passed this place as part of our Ghost & Vampire tour through the quarter. The gu","useful":3,"cool":1},"gEJeOZRJTrTqfGEmbqgnHw":{"text":"Amazing food. You obviously have to go upstairs for the full experience. Food Choice = Dou","useful":0,"cool":0},"ZjV-6lxHRY8JBPkcMspGfQ":{"text":"Went back to Muriel's for a second dinner. We were placed in the main dining room. There w","useful":2,"cool":1},"HIjrVT0nfwN_EhOBbZZfuw":{"text":"I was invited to Muriel's with my dad for a private dining event, located on the second fl","useful":0,"cool":2},"seSsewsDaB4qQhkNoYke6w":{"text":"Best shrimp and grits I have ever had. Excellent service by Gara and Tiffany. Expensive bu","useful":0,"cool":0},"ddp7F30D3r5Ngu4yrIpvEQ":{"text":"The menu has a lot of delicious looking plates. Everyone in our group ordered something di","useful":0,"cool":0},"R6VHwLtv8sIAlCHYacDIEg":{"text":"Had crawfish and goat cheese crepes at the French Quarter Fest and it was such a treat. Th","useful":1,"cool":0},"m2qDDUCvaH-zRKqoUw8nSA":{"text":"Got a chance to enjoy Muriel's \"Jazz Lunch\" with my youngest granddaughter, Camille, after","useful":1,"cool":0},"ZTqxeKaJe1FGYOGNrFLzbw":{"text":"Delightful Sunday jazz brunch! Made reservations for our family of 5 at 11am sharp so ther","useful":0,"cool":0},"llavZ5VvpBxVQwQDiuaabQ":{"text":"Great experience, great food and great service. Coziette (If I spelled that right) was ama","useful":0,"cool":0},"k8TuK6_NxZAbFeOc4jMM-Q":{"text":"We were walking around the Quarter and decided we were ready to get something to eat.  We ","useful":0,"cool":0},"cT8z8Aj498DntGLB_uDMVg":{"text":"Oh how I love Muriel's. It's always an experience here. The food is amazing, service is gr","useful":0,"cool":0},"8y2HFYlv6ugHtdgRL3545w":{"text":"Muriel's was a great spot to hit on a solo evening in NOLA. I headed straight for the bar ","useful":0,"cool":0},"SCJ1ihCSsx3HAcZ0wfmmKg":{"text":"The food saved the service!\nMANY recommend this place to us. Went on Sunday of St. Patty's","useful":0,"cool":0},"zpyfE1-Fd-hSyNdl4Bu9hA":{"text":"I'm a frequent visitor to New Orleans, and Muriel's always has been one of my standards fo","useful":2,"cool":0},"0tnytne6UdxJHfkchtqF1Q":{"text":"Having been either on-call or out-of-town, in Texas or Florida; we needed a Muriel's \"fix\"","useful":1,"cool":0},"yGjR74qXRkDXOjVEOnTUvw":{"text":"Absolutely divine. This Philly Girl wishes there was a Muriel's up north. Say yes to the d","useful":0,"cool":0},"0xmWS9pVa2gP3YXmNa0ldA":{"text":"Best warm Rum Bread Pudding, only went here two nights in a row for the pudding.   Fabulou","useful":0,"cool":0},"hKrywAmxw9yI5RyqeLtw8g":{"text":"Beautiful on the inside and out. Great location and excellent food. Two course lunch deal ","useful":0,"cool":0},"QwM-ZiTrOBj-3Mg48_nKAw":{"text":"Was highly recommended by our hotel so we made reservations. Upon arrival we were put in a","useful":0,"cool":0},"Q8fhWybQnF_6ziyU6cACEA":{"text":"Muriel's Jackson Square - such history! Luckily my friend knew some locals in New Orleans ","useful":4,"cool":0},"cjT_EHsaISMgzv71Nz9qBA":{"text":"We've been coming to Muriel's for years. This last visit something was different: our wait","useful":0,"cool":0},"slhYy3qJe_R7OKA4vqm-6w":{"text":"Pricey and not worth it.\nMany places to choose from in Jackson Square. I was so not impres","useful":1,"cool":0},"bcYat1Na268ddgwlLX0m-Q":{"text":"We went for lunch on the recommendation of two different people.  The place itself is gorg","useful":0,"cool":0},"HuT0d_5sVziHKUzr0SQO4g":{"text":"strange experience... I was looking for the best red beans and rice and was told this migh","useful":0,"cool":0},"kwjz0gOgbYQpJD-cyvVBtA":{"text":"Just as delicious as I remember. This was my second time dining here and it was great. I t","useful":0,"cool":0},"EnpB-KVoCZSoKZHhzDXj2Q":{"text":"This is a historic place in the center of the most touristy area of New Orleans. It has it","useful":0,"cool":0},"p4MaCsYV2VYaqbhxu9ELow":{"text":"I had the honor of going to Muriel's for a wedding reception before Christmas. The upstair","useful":1,"cool":1},"2QIv2xEenFgLJNBCGhCN4w":{"text":"Had dinner with a group of 12 . Very difficult to make reservations but they were able to ","useful":0,"cool":0},"NcZ3zgTNV5XQZ_fBAXL9WQ":{"text":"The food here was fantastic. We all did the 3 course selection for $42 which was value.  A","useful":1,"cool":0},"zyqbNCK_tXkcP7w76snpqQ":{"text":"I had the best jazzy birthday brunch here. If you're looking for a celebration, you have t","useful":5,"cool":2},"J7K8-ODRBbs5rqMO7Wi-cg":{"text":"The 4 star rating is an average of my 5-star meal and my wife's 3-star meal.  We both enjo","useful":0,"cool":0},"E2glxiW80yYqVuQaM6yroA":{"text":"I wanted to give this place 5 stars (the food is outstanding and the drinks were amazing),","useful":0,"cool":0},"d9OkM1uzpD86oK5x86q9oA":{"text":"Our three course Sunday brunch consisted of seafood gumbo, poached eggs with fried gulf oy","useful":0,"cool":0},"GLW_waH-rCtYgf9x2VlQuw":{"text":"I went to Muriel's with a bunch of colleagues, while attending a conference. We were divid","useful":1,"cool":0},"YjP5KcBw1u_igoySxqwzBA":{"text":"Sometimes, you gotta get off bourbon street for a good meal.   As much as I enjoy a good p","useful":0,"cool":1},"fQKIdR0oQIMNyQwGfrCLPQ":{"text":"This was our third stop on our progressive dinner. We were able to be seated right away at","useful":0,"cool":0},"NwURcCySFHOGEaBRM_MF5Q":{"text":"Food was exactly what I was looking for! Southern flavors, sophisticated presentation, abs","useful":0,"cool":0},"RMf47E8rLaRTW_OS-xz_qg":{"text":"A fellow traveler who knows New Orleans recommended this restaurant for authentic indigeno","useful":2,"cool":2},"jAzVFzh9g6sN7omPgwx7og":{"text":"One of the best date night restaurants!\nEspecially their three-course menu amazing\nTomato ","useful":0,"cool":0},"RD4XvucmZwOA7mG1m7XgLg":{"text":"Delicious food and Cocktails! The balcony, open courtyard and their upstairs walkway is de","useful":0,"cool":0},"HBZahy6G9NKdxEDyHVQooA":{"text":"I visited this restaurant when I was in town for Mardi Gras. We made a reservation and the","useful":0,"cool":1},"WeakoqNTDyiZSA-2QH4Crg":{"text":"Another place that gave up the standard on food and service and count on tourists for busi","useful":0,"cool":0},"C1dDZqFQVwVn7jDRL_GYYg":{"text":"Stopped in here for happy hour and sat upstairs on the balcony where we had a great view o","useful":0,"cool":0},"9c4p9G0r6_-e0fuPb9gRqQ":{"text":"Food was fantastic,  from the turtle soup  to the shrimps and grits and the duck jambalaya","useful":0,"cool":1},"XOUur1uswDNpBVgcasZ_9Q":{"text":"While the story behind the restaurant is very interesting, my review is solely based on th","useful":0,"cool":0},"dFRVNA-ZUzS7y8Tpn39Mxw":{"text":"Okay. To be fair, i went straight to the bar way in back, like a good little girl. My frie","useful":1,"cool":1},"J8qP-ZadUnKPO5n1U4MWMQ":{"text":"It's ok but not great.\n\nLove the location, down in Jackson Square.\n\nAnd love the building.","useful":0,"cool":0},"a4-aywyM-6PpunvcCkaWFw":{"text":"For a restaurant in the heart of the tourist district, this isn't a bad option. The fact t","useful":0,"cool":0},"ju92byXXp1Zhyc1djxRymw":{"text":"Went here Christmas time.  They got us in without a reservation. We waited in the bar for ","useful":0,"cool":0},"tWwu76CRQxRyW3swdYpbQA":{"text":"My family has been eating in Nola for decades, and up until last night Muriel's had been o","useful":0,"cool":0},"5la0YCFKrLjVWfw90aOBug":{"text":"As I sit here an hour after being seated, waiting for my entree on a Tue night at 8:30 aft","useful":0,"cool":0},"tOs6WbLambEX9UdQCnP1zA":{"text":"Best crab cakes I've ever eaten !  The outside porch area is beautiful.  Great location","useful":0,"cool":0},"av2kRD5UkVFGl6WQPeBR1Q":{"text":"What a wonderful dinner! I was traveling to New Orleans on business and received a recomme","useful":0,"cool":0},"GLotIBMH7WQQHz0D4kEukA":{"text":"TERRIBLE! I had dinner there Saturday evening around 5:30 pm with my group split between 2","useful":0,"cool":0},"j_FaqO-Kd0mX5XV4fw8vLA":{"text":"Was here tonight for my birthday! The food fare was very good! Unfortunately... for my dau","useful":0,"cool":0},"OZlKj0jDz-upQXSx_EnSxQ":{"text":"We were excited to try to this place-- Even left our walking tour early so that we could g","useful":0,"cool":0},"OYsmpv5LFTU4xML50LlddA":{"text":"This was our third time visiting this fabulous city and we finally got to eat at Muriel's ","useful":0,"cool":0},"W6n831qhQJE-Z80s_wZ8jw":{"text":"I went here on a company sponsored event and we had the event in a large room upstairs.  I","useful":1,"cool":0},"IOr-pQC8cJCuaNNi-ujoNQ":{"text":"Me and my two girlfriends had dinner at the ghost table with Shannon as our waitress. This","useful":0,"cool":1},"R3rOI_YCMokswCH600NjHw":{"text":"I went to Muriel's during a visit last year and loved the interior of this restaurant. It ","useful":1,"cool":1},"58UujcgLF6_1OuN3aLt3qQ":{"text":"Great menu. Food was very high quality, well-made. The waitstaff were attentive, friendly,","useful":0,"cool":0},"_N8yFxc3gZfSSg50p2yCJg":{"text":"We visited Muriel's for our one-year anniversary dinner and it was fabulous...I made the r","useful":0,"cool":0},"QRw9X0Syu6QDJJVd6AwNyg":{"text":"Beautiful restaurant, delicious food and lots of history. Everything we ate was delicious","useful":0,"cool":0},"yhA_9N5uT-2-2gtD2sn8Ag":{"text":"Delicious.  My family and I went to Muriel's for dinner and each and every dish was amazin","useful":0,"cool":0},"cKx4Jp6ebQLbom4oAkzIlA":{"text":"Juicy tasty pork chop  delicious shrimp and goat cheese crepes   And banana pudding is bes","useful":0,"cool":0},"oC-nyv2ZoWjnBp3LKvLzXA":{"text":"Another awesome meal at this phenomenal restaurant!! Awesome food awesome service! Best ba","useful":0,"cool":0},"Y_42qTSNWFFpSZm55rpDuw":{"text":"One of the absolute best dining experiences I've ever had. From the staff, the service, th","useful":0,"cool":0},"92NtCHzMzIogr44fZOQJIw":{"text":"Muriel's is a very elegant old restaurant on one corner of Jackson Square in New Orleans' ","useful":0,"cool":0},"6KRFX75Dloig-6V0ehsBFQ":{"text":"Commanders Palace? Jacques Imo's? Brennons? K-Pauls? None of them compare to Muriel's. My ","useful":3,"cool":0},"7V-bxvFNhyGOCS517WwXBg":{"text":"Came with 4 of my girl friends on a busy Sat. afternoon. We all had the 3 courses fixed di","useful":2,"cool":0},"VYzc5iJILtcnxC3rAKlbvw":{"text":"Was recommended by a family friend who lives in New Orleans.\n\nCelebrated a 21st birthday o","useful":0,"cool":0},"ABcryxoVMj7Ql7AjgQJH4w":{"text":"My Dallas Ophthalmologist Son-in-Law, \"Gordeau\" & Daughter \"Dr. Nicole\" were in town for a","useful":2,"cool":0},"vLrdBrPdS5D3671fY7J-_g":{"text":"I went for Sunday Jazz Brunch. I got the wood grilled fish for the day. It was very tasty,","useful":0,"cool":0},"y_hH9o5ZpyxUVjsk7V6OVw":{"text":"One of my favorite restaurants in New Orleans, from the drinks through courses and deserts","useful":0,"cool":0},"r_qs6ir2vuKgyJpHSxHfZA":{"text":"While I really enjoyed the Sunday brunch jazz band, I was underwhelmed with the token vege","useful":0,"cool":0},"FG2E2Bl8DWMkcbKlxd8cwA":{"text":"What a wonderful restaurant. Cute, unique atmosphere, great service (Travis and Madee were","useful":0,"cool":0},"kpLFhRqaWImx_uyMaBum4A":{"text":"I'm here in New Orleans for a conference and all meals are provided, however I brought my ","useful":0,"cool":0},"mtN4lKxOVOfuCrudyqytug":{"text":"This place is very nice. A real historic and haunted place that just spells out the \"real ","useful":1,"cool":0},"Ak6zpSLTMMdz9CmNAr4Q7w":{"text":"Went for dinner on a Saturday night, and booked our reservation in advance. They were able","useful":0,"cool":0},"WN52gYqO-BdWy3BRcDBsMw":{"text":"I selected Muriel's for my birthday dinner as part of my vacation to New Orleans, and it w","useful":1,"cool":0},"ELrtWwk_u3zPJQKqd3dBXQ":{"text":"Food is good and the location is fabulous in the French Quarter. Nothing in particular sto","useful":0,"cool":0},"BhlkjNxKQmqjefx2VWVvRQ":{"text":"This place was highly recommended by many friends, but it was not open when we stopped by ","useful":0,"cool":0},"3xZmcOUF5Ux8b-Z-zTj7AQ":{"text":"As always, excellent!  My husband and I took a quick trip to New Orleans to celebrate our ","useful":0,"cool":0},"M02nKMpCZFPc84B8xgtljg":{"text":"Muriel's is receiving a one star review from me because of the disappointing service and c","useful":1,"cool":0},"J_K0GTRnj9XMd-zfQ5Xr-g":{"text":"We came to Muriel's Jackson Square for their Jazz Brunch this past Sunday.  The restaurant","useful":0,"cool":0},"quHbNeYtmWWzZfKJbOmA3A":{"text":"If you are visiting, if you are a local, if you are from out of this world and like seafoo","useful":0,"cool":0},"GlcKy_lYeP6Sb4-tVTKIQQ":{"text":"Muriel's is a nice upper-scale place to get dinner. Like a number of restaurants in NOLA, ","useful":0,"cool":0},"DcX3Glnwrf1dKUEBWvFqEA":{"text":"I ate dinner here with my co-workers.  The restaurant is located in Jackson square in the ","useful":0,"cool":1},"nmh4c0sAGGysh-zfOC_Dog":{"text":"This restaurant is magical and eerie at the same time. The whole experience, food, and amb","useful":0,"cool":0},"8HlARWMKXgwe1Pf2zO-hEw":{"text":"Located on the Square, I should have figured it would be a tourist trap. We made reservati","useful":1,"cool":0},"IXCzrW6piIS1-JsS6joOdA":{"text":"I've been here once, for my sister's birthday lunch.  We were actually headed for a restau","useful":3,"cool":1},"eCjOgYC2hlk8c1XvBDGkjg":{"text":"Just spent 6 months in New Orleans and Muriel's has become our go-to spot for great food. ","useful":0,"cool":0},"cPmadapvJ868_jObk6e_Hw":{"text":"Everything was GREAT!  The service was impeccable with at least 3 waiters servings us.  Th","useful":0,"cool":0},"oDaO5hGO1nk1IzlD7RGxtg":{"text":"My friends and I visited this beautiful restaurant for drinks with our tour guide and it w","useful":0,"cool":1},"JG1WivU7siTykfMrKbxg-g":{"text":"Let me tell you about our fantastic waitresses: Michelle and Paige! \n\nMom and I headed to ","useful":0,"cool":0},"TDzWAXQFXs_YUuOy900rKA":{"text":"We just happened to wander in to Muriel's for lunch one day and I'm so glad we did! The st","useful":0,"cool":0},"7dhvusZ5IbwL8_uZ0DZbDQ":{"text":"Very nice place, good food, good service.  Nice atmosphere too. Not my favorite place in N","useful":0,"cool":0},"CN835BpilIVXaeb2TIZtZw":{"text":"Absolutely delightful!!! \n\nWalking in, there's a sense that this place might be a little t","useful":2,"cool":1},"Qb3-Tz4ZoCIImPEC-Ko1fg":{"text":"The service here is amazing. The severs and waiters are extremely attentive. The drinks  a","useful":0,"cool":0},"a5jJh6BXJgn5xt1YZa3kkw":{"text":"Excellent seafood, terrific gluten free menu, especially for a southern restaurant. The st","useful":0,"cool":0},"xVKIu8ninJo0hKNkV0K7dg":{"text":"We walked past Muriel's several times while sightseeing and thought it looked gorgeous. Ou","useful":2,"cool":1},"pq-D4KzDi1GTo3HwYu5_cg":{"text":"We always have lunch at Muriel's when we visit New Orleans. It's such a wonderful experien","useful":0,"cool":0},"epHSEKMpgS-go6l3sRgG4Q":{"text":"Murial's was delicious and our waiter was delightful! I got the pre-fix meal with the stra","useful":0,"cool":1},"PTso9hh0dRJyHCVIkzDWRw":{"text":"Very nice experience. A biz associate recommended it to me a few years back. \nForgetting i","useful":0,"cool":0},"R5krzLMDfoTuGgL5k7Lf_w":{"text":"Stopped by here and was really impressed with the food. For my entire trip in NO, I would ","useful":0,"cool":0},"cviguTJWwvFPbQuWgBiNQA":{"text":"Very nice dinner beautiful surroundings wonderful food service and drinks... A must if you","useful":0,"cool":0},"qAC19GRQvT6izii6LeGHbw":{"text":"The restaurant was recommended by concierge.  It was literally just blocks from our hotel.","useful":0,"cool":0},"MfubJB9Tm9ChA3FovJvwMA":{"text":"Nice hostesses. Yummy drinks. Decor is lovely. We sat in the bar and ordered drinks. The v","useful":0,"cool":0},"Spq5yJldfN2_NDIaDoPZVQ":{"text":"Really great and attentive service. Loved the temperature check at door. Food items; half ","useful":0,"cool":0},"yzWn4CHOtKDmNBIQIoX6JA":{"text":"This is not FINE FOOD! this is tourist fare, plain and simple. I had my last meal in NOLA ","useful":2,"cool":1},"PJO8-iSzXLpXYRiGR7KLaw":{"text":"Romantic atmosphere and delicious food, with professional staff.  Check out the moody Sean","useful":0,"cool":0},"KdRS-zhzs8Ho76UnLWBHGA":{"text":"Wow,   What a disappointment!  I've been here several times in the past and enjoyed my tim","useful":1,"cool":1},"VSf-Fx7wTcUte2C3qGdssg":{"text":"It's been years since I reviewed this restaurant and I felt it deserved another addition.\n","useful":2,"cool":1},"Z35EIrDspnO95qdbrS3tsA":{"text":"Best meal we ate in New Orleans!!!!!\nThe service was excellent","useful":0,"cool":0},"pT_giMDI_bcrQ6Q_6fGDbQ":{"text":"Here on business for the KeHe food show. Hotel receptionist said this is her fav. Restaura","useful":0,"cool":0},"orLgrOv6OYqfzVlBvWCyBw":{"text":"We were so looking forward to our dinner at Muriel's and initially, we were impressed. My ","useful":0,"cool":0},"i82cctZOtgchccbPhlbVCQ":{"text":"Muriel's was one of my top 10 restaurants. We happened to get a waitress that was rude, un","useful":0,"cool":0},"e5yDGOYgaNuan90X3wS8PA":{"text":"This place was GREAT! The atmosphere was awesome and all of the staff was friendly and att","useful":0,"cool":0},"6aw-mSig_0obn33VVMGZFg":{"text":"Remarkably superb food/offerings, exquisite atmosphere, great service.  Not one complaint","useful":1,"cool":1},"diYA_FrCdNnqJ0V__dd_DA":{"text":"Hands down my favorite stop in Jackson Sq! A little more elegant atmosphere, I had the tas","useful":0,"cool":0},"CMpiJiFs6MZp5A-AryEn-A":{"text":"I travel to NOLa twice a year, usually for 4 days. I usually eat 2-3 lunches at Muriel's a","useful":0,"cool":0},"wNEOebjhJ08RAL3cJi22qA":{"text":"I had blackened catfish and my daughter had bluefin tuna.  We indulged with a Pim's Cup an","useful":0,"cool":0},"mcY1FkmN5CR1sIGpbu8cwA":{"text":"Cool atmosphere. The service was friendly, but incredibly SLOW. Unfortunately, the food wa","useful":1,"cool":0},"JKiiV9KQD9QNhyRB3wzzRA":{"text":"I had one of the best meals of my life here today!  I had the brunch omelet and it was to ","useful":1,"cool":0},"kME3V_pj3zrsbvejnwzLKg":{"text":"Visited on Friday and my man was sweet enough to book the ghost table for us. The standout","useful":0,"cool":3},"d-3UYC57jqS3zwJSJ9i-QQ":{"text":"One of my favorite places to visit in New Orleans! Always consistent food and beverages. T","useful":0,"cool":0},"yOPs2bFam8u8Ey0R07QUqQ":{"text":"Very very good but I preferred fins. The decore is superb and service is quite good and th","useful":0,"cool":0},"gHjg8lPAb9iDiMrV5epPzQ":{"text":"I finally tried Muriel's after having passed it up somehow during all these years of NOLA ","useful":1,"cool":0},"EKu0P0f_Bin0xUGvTiTaHg":{"text":"Wonderful and unforgettable birthday dinner. Superb service and food. Everything was simpl","useful":0,"cool":0},"uEdUPn2kTnsjcPXlRhHBaA":{"text":"I recently traveled to New Orleans for a friends wedding, and I was looking to get a  real","useful":1,"cool":0},"cFtU11f1yJOUS95LatVkDg":{"text":"Very good food. We tried the Sunday brunch we will go back for sure.\nVery friendly service","useful":0,"cool":0},"Gs71NFMP3Zon41KGPJfcZQ":{"text":"What can be said about Muriel's that hasn't been said before? There is a reason this place","useful":2,"cool":0},"n8z1_FUMd2ndG0fH0OlaNg":{"text":"Food and atmosphere was wonderful.  The problem was the service.   Once the waiter realize","useful":0,"cool":0},"JqFhrt2Ay0mK1qmDvV_90A":{"text":"Hidden gem at french quarter. Very quiet, elegant atmosphere. Lunch is reasonably priced a","useful":0,"cool":0},"YyczBuWx-ZB7Nn-sj0O_PA":{"text":"I came for lunch twice recently and have had a wonderful experience both times! The two-co","useful":1,"cool":1},"vKSRFG8_dPYTtHWNebGHHw":{"text":"I went to the brunch on a whim. Disappointing food for the price, but the location is beau","useful":2,"cool":2},"i6q-vDapD9aMQ2LI7dKdXg":{"text":"Exceptional customer service. A mistake was made in our steak order and it was immediately","useful":0,"cool":0},"lpSyqzjV-ooWdWvM_8-oOg":{"text":"This place delivered. I felt like a lot of the food in NOLA was overrated, but that wasn't","useful":0,"cool":0},"qYIw8DFcioSqLd07wk7aRQ":{"text":"My mom was visiting from out of town and she wanted to go to a restaurant with a New Orlea","useful":1,"cool":0},"rwlrxwDdzGl00BAFpQGRGQ":{"text":"Duck hash was good but not great, needs a sauce to bring it all together. More than just a","useful":0,"cool":0},"9Rg2zz-cs12RU6NYP-nAHA":{"text":"Food was under cooked. Service was bad. We actually had two waiters and really bad attenda","useful":0,"cool":0},"82h92wCaPjf4KvF5n9Js6Q":{"text":"Muriel's Jackson Square is, by far, one of the best restaurants I have eaten at. It's not ","useful":2,"cool":0},"CPw4FGs1byKqNpPipyHUrQ":{"text":"Amazing food, wonderful staff, had my birthday dinner there. Loved every single thing abou","useful":0,"cool":0},"4EcoW4B3JRiJxrih6CixSA":{"text":"My favorite restaurant in NO. Crawfish/goat cheese app and shrimp and grits are just ridic","useful":0,"cool":0},"AKFkNo8plv6NGEfdC-hCJw":{"text":"Beautiful location by Jackson Square and lovely building. Food was good and service was al","useful":0,"cool":0},"j4RuGk5lm9zx339E6ImvfQ":{"text":"We came for the Sunday jazz brunch, and it was OK. The physical restaurant is quite nice a","useful":1,"cool":0},"FAzqqdcLAdu6_Axo1QmZrg":{"text":"Delicious food, attentive wait staff. The drinks were delicious. Every room is decorated i","useful":0,"cool":0},"GOVJEP7Wiq4u0N8lSS_16w":{"text":"I have brought over 100 people into Muriel's this year alone and never meaningfully intera","useful":16,"cool":0},"Usl2R443tLkiHPKEPlbu2Q":{"text":"Excellent service, ambiance and history. Please has 5 dining areas and even a 6th secret o","useful":0,"cool":0},"sLCpRGC_r_cvf0oNPY3cbA":{"text":"My gosh... Muriel's is absolutely amazing! This was my first time that my once boyfriend a","useful":4,"cool":4},"y_qxRHRnfb2-iVg3MduNuA":{"text":"This restaurant was recommended by one of our ghost tour guides the night before.  We made","useful":0,"cool":0},"UXeqfJ7sSY0EWBfCZc8AQg":{"text":"Best value in New Orleans!  For $37.95 I had the prosciutto tart appetizer, pecan crusted ","useful":1,"cool":0},"auf2_2CXWQrjcCmMv98BzQ":{"text":"We live here and are familiar with all of the competition.  Our absolute all-around favori","useful":2,"cool":0},"wH5QZJ1Q3I98GwfdRaqkXg":{"text":"The food was decent.  Some of it was good, none of it was outstanding.\nService was also no","useful":0,"cool":0},"ZIgJezgPLm2KnhuvRvItuw":{"text":"Absolutely 0 stars. There have to be better places for brunch than this. I had a reservati","useful":0,"cool":0},"0brbskPx1LguauiuINhCKw":{"text":"Wow! We were looking for a Sunday jazz brunch to complete our celebratory New Orleans week","useful":0,"cool":0},"6lLXs0qr_YbX4qNUfuTIRw":{"text":"The food was amazing, except for the turtle soup (which was totally on me, I don't think I","useful":0,"cool":0},"yWOo8CZDox6D0FOt4VtaXw":{"text":"I'm a terrible Elite Yelper! I had the distinct pleasure of being in NOLA for not just a f","useful":1,"cool":1},"VIysonk5eKmqZ5kdSmomeQ":{"text":"Great bar!  Great food!  Great service, atmosphere, noise level and atmosphere!","useful":0,"cool":0},"1NLzocldrsbPnz2xsO8Tnw":{"text":"It wasn't bad. It didn't quite meet my expectations but I enjoyed my time there.\n\nSo it wa","useful":0,"cool":0},"V4NVohMiP3iFh8i-jMZMbg":{"text":"My husband and I spent the weekend in New Orleans to celebrate our 14th wedding Anniversar","useful":3,"cool":1},"twALlM9BhvaRHkh-k29-FQ":{"text":"I avoided Muriel's for so long because I'd heard stories about the place from a burned out","useful":5,"cool":1},"KK9qPHHhkU7fupkNFqE3jQ":{"text":"I went here today for lunch and had the best Cobb salad I've ever had in my entire life. I","useful":1,"cool":0},"1Om3XiSgNZMGk6weapf-1A":{"text":"Had brunch at Muriel's after reading all the fantastic reviews. Not worth it, you can find","useful":0,"cool":0},"JXHfMaTFU3-c1sIjLU9lzg":{"text":"I can still taste the stuffed mirliton that my husband had for lunch.  It was so good and ","useful":2,"cool":0},"Kg7mfCWrz37iEpaYxz0JjA":{"text":"I absolutely love Muriels. From the location, to the food, to the amazing staff they are b","useful":0,"cool":0},"I3f_OHbc6-g9jbeJVnGPQw":{"text":"We were sent to this restaurant by a friend who said it was a must!! And boy were they rig","useful":1,"cool":0},"6dRU4MjL7l46ALX2t60NJQ":{"text":"Fab brunch... especially the bloody marys!! This is a good place to try the local Ramos Gi","useful":1,"cool":0},"7_BvDJV3gimYdmVtue1TqQ":{"text":"As a recent NOLA transplant, Muriel's was high on my list of must try's! When my birthday ","useful":1,"cool":0},"_MNOngBSA9223yLcm5jNUw":{"text":"Best lunch all trip amazing po boys (the shrimp were delivered as we dined the flavor was ","useful":0,"cool":0},"tV5eEpZy3tZY_JNqZlXQgQ":{"text":"Although I didn't dine here as they said they weren't seating upstairs as they were going ","useful":0,"cool":0},"WUIlbBcihBbwy3OZWoeKhQ":{"text":"Excellent place.  Ambiance is fabulous.  There is a lounge upstairs that is rumored to hav","useful":0,"cool":0},"PH8xYNd6UYlZfmney6COXA":{"text":"Wow! This food tickled my soul! I ordered the turtle soup as an appetizer. I have never tr","useful":0,"cool":0},"RwIOGGr6yZ1kMSv9LgPO4w":{"text":"Double cut pork chop was truly excellent. Flavorful and extremely tender.\n\nWent during Res","useful":0,"cool":0},"p3y6SxAuE0UlurPU3Fredw":{"text":"...There were somethings about Muriel's that were great- beautiful setting and well execut","useful":1,"cool":0},"osanBJ2kBIEauOkJrembxg":{"text":"my boyfriend & I decided to have dinner here during our first night in New Orleans. we wer","useful":0,"cool":0},"xYyc2TCPft-iiICK5fpNoA":{"text":"The food is good. The drink and wine selection is limited. The waitstaff are courteous. Ho","useful":2,"cool":0},"3kieCTX8TmDeSQc9c990jA":{"text":"5 stars for the service and ambience, but 3 stars for the actual food, so I guess a 4 over","useful":1,"cool":1},"7sH4SmBSGWeRxHdT3Zdn7g":{"text":"Don't come here unless you want to spend a large amount of money because you will be snobb","useful":0,"cool":0},"NpKLSZorZFVkm-OY9A0AGQ":{"text":"August is like prix-fixe menu month at all of the restaurants in New Orleans. A lot of res","useful":0,"cool":0},"2LQ07LlQs16RsULlr3N6IQ":{"text":"Great ambiance with charm\nNice Variety on menu with good NOLA options\nDecent on flavor\nFas","useful":1,"cool":0},"uFeJlpO0Z4mtaSYlLErrKg":{"text":"AMAZING!!\n\nMy wife had the crawfish goat cheese crapes it was incredible!!  I had the turt","useful":0,"cool":0},"f8G-tThJObhAQONKvrI15A":{"text":"I've heard amazing things about this place so I decided to take my husband and two of our ","useful":0,"cool":0},"YPLU6ncXOKjPT5LETlwz6g":{"text":"I'm giving Muriel's 4 stars because I have only tried dessert, but it may well deserve 5 s","useful":1,"cool":0},"KSQWsQfilZTiy0bn8IIsWA":{"text":"We had dinner last night, July 4, to remember the anniversary of our engagement, here 3 ye","useful":0,"cool":0},"I9CTdBVNGIvvUEj9wtH2GA":{"text":"Fantastic dining experience! We had a party of 8 and everybody's dish was superb! Service ","useful":1,"cool":2},"0uyCz5F-zhIxYYFlAtqeIg":{"text":"I had a very nice lunch for 2 at Muriel's including gumbo, shrimp remoulade, spinach salad","useful":0,"cool":0},"HQYNF1p6vN9_DpFOrYxrug":{"text":"Definitely a celebrity spot.  I spotted Amy Smart and Blake Griffin eating here.  It's an ","useful":0,"cool":0},"az-iITJNl3Ss9bf6NcwZJg":{"text":"We looked this place up on Google for brunch places.\n\nCome here, definitely.\n\nIf you get R","useful":0,"cool":0},"WBlPGKy0dnmjegyK4eB7Yw":{"text":"Food was underwhelming, the crepes stuffed with goat cheese and shrimp was cold, the bread","useful":1,"cool":0},"JX3CZIAvzJLTeXQibXxOOw":{"text":"This restaurant has fantastic food! We stopped by for dinner on a Friday with a party of 6","useful":0,"cool":0},"ktuelosTEVC6hSgizA2XBg":{"text":"The jazz brunch here is to DIE FOR! We still bring up the food and drink served to us for ","useful":0,"cool":0},"YavsD5GsChpC1rtbaP9zdw":{"text":"Really just great NOLA Creole cooking with an upscale ambiance.\n\nSome work friends and I w","useful":2,"cool":2},"MOPglzTBp7U-b1UHPoeozQ":{"text":"This place is amazing. The atmosphere was very nice, the food was incredible. Right next t","useful":0,"cool":0},"iA2W1fzGoiqwF26l7Hif7w":{"text":"Very swanky spot that has upscale service and ambience without feeling like you can't come","useful":0,"cool":0},"WiieDqBZ06LDXc_V0ra1vA":{"text":"This restaurant has a great location in Jackson Square, great ambiance, very good service,","useful":1,"cool":1},"tUAocxYOK46D2MeU-EaYgA":{"text":"Me and my boyfriend went here not really knowing what to expect but the service and food w","useful":0,"cool":0},"LJTSgf8od4T55BLVfN1Obw":{"text":"What a wonderful find!! The goat cheese and crawfish crepes were some of the best things I","useful":1,"cool":0},"D8esK77gFhLjTqlbTGcj_Q":{"text":"Right when we walked in they did a temperature check . All staff had mask on . It made you","useful":0,"cool":0},"yq8gpc3SmDglO8EfygX8yg":{"text":"So in full disclosure, I'm kind of a fanboy of this place. Whenever I have friends from ou","useful":0,"cool":0},"JSn1whq2gdbadH6blRlwpA":{"text":"My friend and I came for breakfast. It was s little pricey for my taste. More of a tourist","useful":1,"cool":1},"e6I9zVNb6R5Y8jAQHp9eow":{"text":"Definitley order the milk punch, it was amazing! Sweet and heavy though, so it does fill y","useful":0,"cool":0},"_VVQJME6l9-V7D1YXnW1kA":{"text":"Sunday Jazz Brunch today at Muriels.   Muriel's Omelette was superb, as were the potatoes ","useful":0,"cool":0},"iJhine-D1cu_meyYoE2Q9w":{"text":"Matt is a great bartenders at Muriel's. And delicious $4 martinis! Can't be beat. Beautifu","useful":1,"cool":1},"aiXn_auAm58jyIPF0p1Tvw":{"text":"This place has a great feel and the decor was interesting (in a good way), however the mea","useful":1,"cool":0},"b-Q954Wi49tUKStXR-DnNw":{"text":"Possibly the best meal of our entire trip!\n\nWe were looking for something romantic with qu","useful":1,"cool":0},"k_9biOpm-PZuYnC48L1NdQ":{"text":"Dropped into Muriel's on a Saturday for brunch and we were pleasantly surprised! \n\nWe had ","useful":0,"cool":0},"8cC6MpscaKP3q4EJ1r5quw":{"text":"Muriel's is definitely one of the most underrated restaurants in New Orleans. I've been co","useful":1,"cool":0},"YinyiChiGPTPpRaVk68HgA":{"text":"This is my favorite spot in NOLA. The martinis a delicious. The shrimp and host cheese cra","useful":0,"cool":0},"bU60_Cj7EHGYoegNP5ktag":{"text":"Food was amazing. Crab cake was nothing but meat - sooo good!!  Butternut soup again - ama","useful":0,"cool":0},"cZDnqx8z-MCSlxPObz-VxQ":{"text":"I wanted something food and New Orleans unique. Muriel's Jackson Square was recommended fo","useful":0,"cool":0},"Ccel7xP1Se1M1cNZcZF9Hw":{"text":"My friend ordered the pork chop and the plate was cold by the time the food was served. We","useful":0,"cool":0},"eV-wqPDtYtdMvaXkN6hk_g":{"text":"The place is great.  The atmosphere is wonderful.  The food is very flavorful and some of ","useful":0,"cool":0},"cfLouZGbsNTFQUSGf0pajg":{"text":"Recommend. Great food and service. The blackened redfish and pork chops were delicious and","useful":1,"cool":0},"rfOYjZF_Gbr44FVwU2PWJA":{"text":"GLUTEN FREE Review \nMuriel's was fantastic! \nOnce we arrived and got seated, I asked for t","useful":0,"cool":0},"ssYkhqvGmQVhtFlgy7T5CA":{"text":"A very disappointed experience. Service was lacking and almost non-existent. For a restaur","useful":0,"cool":0},"OyZByppC3vtl_tAAp7WXGg":{"text":"This place was outstanding! The service, the food, and the ambiance were on point. This qu","useful":1,"cool":0},"D0pVLyzBTb5EIxlybsUz5A":{"text":"A great dinner in the French quarter. The ambience was quaint and historic.  I did the fix","useful":0,"cool":1},"OtLCBc7p64ndR32Dvs0LGQ":{"text":"This is such a gorgeous restaurant!  It's elegant and classy but not pretentious. We order","useful":1,"cool":0},"xlHbpXgjM9n8ELoaSCmrVA":{"text":"I have been wishing to dine at Muriel's for many years each time I visit NOLA but have nev","useful":0,"cool":0},"WQHMarhPTTWhIS1BljUyTQ":{"text":"If i could rate this restaurant 6/5, I would! We made reservations for New Year's Eve this","useful":2,"cool":2},"Ix0axNCc6BZ20mcjFKSO2w":{"text":"We went to Muriel's for Sunday Jazz brunch. The staff was amazing and made us feel very we","useful":0,"cool":0},"gjcCFydJCkQgtkrxlJTaJg":{"text":"What a disappointment after many good meals. We have spent numerous holidays, New Year's E","useful":1,"cool":0},"FzMcvDU0M7Sv2m8FnepexA":{"text":"Made reservations based on other yelp reviews. \n\nI was very impressed. Service was prompt.","useful":1,"cool":1},"ptXTS25sVEGlNyAPSU8Y-A":{"text":"One word....delicious! Fontana's West End Turtle Soup was awesome! And now I can say I've ","useful":0,"cool":1},"5vYGcMkqsUcyfU29suMpSQ":{"text":"Muriel's is a fine dining gem. I had been wanting to visit and finally, on my last night i","useful":8,"cool":3},"C3llDbJd9LNxEqia_aqMEw":{"text":"First of all this place is everything you want in an establishment. It is mysterious and h","useful":0,"cool":0},"j0cjbdI8_oE5xeXgOsTAcg":{"text":"We finally tried Muriel's after hearing raves in a local doctors' lounge.\n\nWent for late S","useful":6,"cool":2},"xP92vkwecEd2TVn105HQtQ":{"text":"Delicious!  I had the crabmeat appetizer and it left me wanting more.  I moved onto the re","useful":2,"cool":1},"1r4TuN9DhqKGV68PhD4UYg":{"text":"Serendipitously found this place when walking around Jackson Square. It was lunchtime, so ","useful":0,"cool":0},"DvoM-2miXbnI7qLINV700w":{"text":"Great restaurant. Excellent food and  service. \n\nRedfish is outstanding as is the history ","useful":0,"cool":0},"o4HjAQqCZma1Pue-vmSEhw":{"text":"I really wanted to like this place, made reservations a month in advance for Sunday, which","useful":0,"cool":0},"n851Lt7p3BBiTnTDN68FRw":{"text":"Went for dinner last night, and the food was outstanding! Make sure to read about the hist","useful":0,"cool":0},"z5ODcGRnJr6HtdSJO1Hd4g":{"text":"Best restaurant experience on our trip to New Orleans! The ambience is awesome. My first S","useful":0,"cool":0},"X-kAC7krqSi_GDfNCJs3-A":{"text":"Came for Sunday Jazz brunch during our stay in NO and it was our favorite meal during the ","useful":0,"cool":0},"xdtK271Bxj27kaiIngHPrQ":{"text":"Went for brunch and the experience was very disappointing. Service was slow.  Had to ask t","useful":0,"cool":0},"0h-I-JGfuZm1BiI6zkIxqg":{"text":"We made reservations here based on reviews and the proximity to Jackson Square. The ambian","useful":1,"cool":0},"f0iKA0GACsQ66I35v-Q6qA":{"text":"Exceptional meal! The food turtle soup snd grilled tuna dod not disappoint. The service wa","useful":0,"cool":0},"VEK_Y7-6DQWVoC6rkq38Xg":{"text":"6/16/13\nUp-date:  \n\nJust had another wonderful meal at Muriel's, with houseguests from Cor","useful":1,"cool":0},"cGDQ2TVdp4DMHckuw-_f4A":{"text":"I loved this place!  I wish I could give 4.5 stars, but alas, I will have to round down be","useful":4,"cool":2},"RuuipJPNId9WYrk3Q1weRg":{"text":"One of the best meals I ever had!  Great location, neat building with history, excellent c","useful":0,"cool":1},"Tpd_eKa1MGel9YAKLKUwUA":{"text":"This was my first time back at Muriel's since Covid hit. As usual, I made my way to the ba","useful":0,"cool":0},"bP5rHLle4_Dg_Td-97qKZQ":{"text":"The worst dinner I have ever had in New Orleans. First know it was New Year's Eve. We got ","useful":7,"cool":0},"1d90UeGCINVtzxJjAjHt0A":{"text":"We have been to Muriel's at least 20 time or more and this has always been our go to place","useful":0,"cool":0},"-KL1k3La6e7vLj0xFUHFnQ":{"text":"Muriel's was recommended by friends that visit NoLa yearly, and since they had not steered","useful":7,"cool":6},"qyNJU3_ktnsXhTR2BFbAdg":{"text":"I'm split when it comes to the rating for this restaurant. Came here for lunch on 12/26 an","useful":1,"cool":0},"_j3-Y18xvyKzYGuB-7_5qg":{"text":"Seemed to be a very authentic French Quarter old time New Orleans restaurant. The service ","useful":1,"cool":1},"M2NfP-wURCRJxF2HRZ0H5A":{"text":"We went on a slow night but the food was delicious from start to finish. The wait staff wa","useful":0,"cool":0},"n1xrHw8qJer8qvM8Rm2ODQ":{"text":"I was a bit underwhelmed. I ordered the menu with an alligator appetizer, seafood au grati","useful":2,"cool":0},"zZlPWxAsl-SdMNbXtf0gvA":{"text":"Had dinner here and it was not worth the money. Both of our meals were tremendously salty.","useful":0,"cool":0},"dsR81HyehNduMttTSgJjYQ":{"text":"Excellent service, great food and a unique history make this place a must stop when in the","useful":0,"cool":0},"Lud7CKMdU0XdL5ypyJqnqw":{"text":"Enjoyed a wonderful Sunday Jazz Brunch at Muriel's. The restaurant is beautiful with a cle","useful":3,"cool":1},"a-m-HRxdM4ZbAcLAOjFQKA":{"text":"My top restaurant in New Orleans!!\n\nWe made a dinner reservation and were early so of cour","useful":1,"cool":0},"Fx0ibL42bV8rkPHPz9X6hg":{"text":"I'm not a huge fan of fine dining restaurants because I don't like how attentive the waite","useful":0,"cool":1},"jmp4hcA2zDnkVHkgk1_brw":{"text":"I experienced a wonderful and delicious Sunday Jazz Brunch in New Orleans. We dined and fe","useful":0,"cool":0},"lZfdEVNvr2bNMaytDtVduQ":{"text":"The bf and I visited Muriel's for Vday's dinner from Houston. I was told that the place is","useful":1,"cool":1},"cXXcS_VuyNxovRUDNgCelw":{"text":"We came here to celebrate a birthday party and I must say it is one of the best restaurant","useful":0,"cool":2},"OkpX09h-VIxyerjtRKkofg":{"text":"The experience was great. Went on a date with my girlfriend here for our anniversary and b","useful":0,"cool":1},"mQl38goSAnyeb1zViiV9vA":{"text":"Loved all three courses.. Dont miss the goat cheese creps!!","useful":0,"cool":0},"_aAjfcJ4PYjdK46TgbC3cw":{"text":"My husband and I just spent 6 fabulous days in New Orleans and of all the places we dined ","useful":0,"cool":0},"pl9SsyDwISz1ghYPen-Y8w":{"text":"Great food, staff are courteous. Booked the ghost table and it was worth every penny. Mana","useful":0,"cool":0},"hxrPNRDa91vRvRfQrfAHbQ":{"text":"Great experience. Next door to our hotel Place D'Armes. The shrimp and grits are the best ","useful":0,"cool":0},"FoKYWRgzdeWxL2N24xDrPQ":{"text":"I'm torn between giving Muriel's Jackson a 3 stars and 4 stars and will explain below.\n\nBa","useful":0,"cool":0},"jTSFLYdPA1CRsvcjtrrLBQ":{"text":"Phenominal service and phenominal food. What more can we ask for?\nCrawfish and goat cheese","useful":0,"cool":0},"5Yxot1ox_qHawPz-0u9qhg":{"text":"As it turned out, this is NOT the place to go.  Really kind of sad that the experience was","useful":0,"cool":0},"MBh5LpzCI42oyweShimhJQ":{"text":"This is one of those restaurants everyone says you have to visit.  The story and history a","useful":0,"cool":0},"FNFOaTJYdwYk0MpngJQu8g":{"text":"I'd like to take a moment to thank Muriel's for facilitating a memorable birthday celebrat","useful":8,"cool":0},"g3q5OSj7iNXijMtE1ew-qg":{"text":"I went there for dinner with my family yesterday. The food was good but small portions and","useful":1,"cool":0},"kqZd9Arv02r8IM4bJ3sAPg":{"text":"The food and service was great! However we did not see the ghost. We finished the ghost to","useful":0,"cool":0},"xwHuPKsGrnUuI_-sRVvULQ":{"text":"One of my absolute favorite must visits when in town. Why the 1 star? On a trip to celebra","useful":0,"cool":0},"fl40IMALp7SjELcy-QEhQw":{"text":"Both my boyfriend's boss and I agreed that this place deserves a 3.5...I'm rounding down b","useful":3,"cool":2},"nM6LVycP64tOJIKEMCHv3A":{"text":"We stopped by for lunch on New Year's Day.  We got lucky and were able to get a table righ","useful":2,"cool":0},"GTMudTJ0s0XUpgpe0ZFfNA":{"text":"This was the worst meal we had in New Orleans but the bigger disappointment was how we wer","useful":3,"cool":0},"pUTxqjGCEtnoYIVnEKR2Cg":{"text":"As a person working in the service industry since I was 15 (I'm 23) and my mom also being ","useful":1,"cool":1},"uNug9sYH7NNw5iCvUFwW1g":{"text":"We had dinner at Muriel's on a Friday night and IT WAS AMAZING. The food was awesome, the ","useful":0,"cool":0},"1S3ik6cowwasr1_-nQynYg":{"text":"We are here on a Tuesday night with no reservation around 9:00pm. We popped in to see if t","useful":1,"cool":1},"6kmv_fTNOTiAd_IDsgQBBQ":{"text":"Excellent environment for the perfect meal!\nClass and style and great food.  Gumbo and a s","useful":0,"cool":0},"8RW6himdC0wSZPcLs-f2MQ":{"text":"We've heard about this restaurant a lot and decided to visit it at our trip to New Orleans","useful":1,"cool":0},"VaXRjtuIFHRw6pBCwGl6KA":{"text":"Visiting New Orleans over Easter weekend & we chose this establishment as we heard so much","useful":0,"cool":0},"m8aJ3FJla5652TzD0gbWpA":{"text":"I highly recommend booking a reservation here!  Everything we ordered was delicious and ex","useful":1,"cool":1},"eH9My087Udp2pVncs-HV0A":{"text":"Went here for coolinary month two years in a row. The double cut pork champ is amazing. Th","useful":1,"cool":0},"b2xf9xXgfdYkyi6hz8VERg":{"text":"Was amazing and our waiter Jakob was as well so sweet and attentive, I'll come back to thi","useful":0,"cool":0},"N19hLp80aaFYic6sHL5QHQ":{"text":"We came in here by chance. We came from a plantation tour and needed food. First place we ","useful":1,"cool":2},"-gjd3EPw62QwJA1s1Tk5TA":{"text":"Had lunch today at Muriel's Jackson Square and it was great.  The food was exquisite and t","useful":0,"cool":0},"ytGMT0O-pDZ1aW3sHT1EWg":{"text":"We loved it so much, we decided to have our wedding here! Food and waitstaff were both exc","useful":0,"cool":0},"GvIFyd606B3dJuGqmAa-LA":{"text":"Janice and I went back and forth on what would be our final restaurant destination during ","useful":1,"cool":0},"xViYDRNyw08yYZwTgE-tjA":{"text":"We wanted to experience a Sunday jazz brunch during our stay in NOLA and came across Murie","useful":0,"cool":0},"_ePtmEyVvQ3YP67ZMa-XWQ":{"text":"This was my favorite restaurant. They sat us and took our order quickly. The duck was simp","useful":0,"cool":0},"CG5Ft5rWBO1LPLtRl-XI-Q":{"text":"We just walked in on a Saturday morning, hungry after exploring, and were knocked out. Ver","useful":0,"cool":0},"72KkJxr12a5Z0WOHsmnKGg":{"text":"Mmmm!\n\nWhat more is there to say? Muriel's has a beautiful courtyard, a jazzy ambiance and","useful":2,"cool":2},"t2AZT0Qw_5meIKCQ8mrRzQ":{"text":"What a nightmare of a dinning experience. Started off by rude service at the bar \"what do ","useful":2,"cool":0},"R4_toyg0kRz4rBZVt-4FNg":{"text":"This place was recommended to us by our acquaintance Toast.  Overall it exceeded our expec","useful":0,"cool":0},"jtCSQMHEzcWlC0c-PaTHWg":{"text":"brunch was good. leek garlic soup was good but not so garlic or leeky.  tuna was near perf","useful":0,"cool":0},"wcsThHB3Ra4PSxrh_iw1yw":{"text":"Hadn't been to Muriel's i some 6 weeks.  Got a call from dear friends Roy & Rosie, of Corp","useful":3,"cool":1},"fjSL6_lZo3c4A7V3xlsCbQ":{"text":"I think our mistake was dining here the night after dining at Commander's Palace. There is","useful":3,"cool":0},"WsIIGxXv0RP3uT8SiQNGMQ":{"text":"Good time.  The atmosphere was fantastic.  The food was good.  The shrimp and grits were d","useful":0,"cool":0},"nvPxHeToYHP0BEMc32WOQw":{"text":"MY FAVORITE RESTAURANT IN ALL THE FRENCH QUARTER!!  Here's why;\n\n1.  First night in NOLA p","useful":0,"cool":1},"mi1CXLoWjtadlbyGuElvyQ":{"text":"Phenomenal! Goat cheese and shrimp crepes, scallops and risotto, gumbo, white fish called ","useful":0,"cool":0},"xcP4AjBZWBx_gLIcocAY7g":{"text":"Three words: GOAT, CHEESE, CREPES. So I first got acquainted with Muriel's through The Pro","useful":9,"cool":7},"vWWjBzQLc20skLNO-K9M-Q":{"text":"My friend and I had lunch here to celebrate her birthday. We ordered from the coolinary me","useful":0,"cool":0},"CpK1_Iv6Aa0nHa95navPwg":{"text":"Great place to eat in New Orleans, Lots of old school charm. One can only imagine what it ","useful":0,"cool":0},"Edx-R7y3K0tqDHFWQm_-2Q":{"text":"A meal to remember! Such a great experience from beginning to end. Very helpful, attentive","useful":0,"cool":0},"dN1FlVsSUJdRrfhasJCtOA":{"text":"Atmosphere is what this restaurant has, and you can't deny the perfect location. My husban","useful":0,"cool":0},"Mjys9ToR4dTKoZDLkdIHHA":{"text":"Seriously one of the best meals I've ever had. This started as our french quarter meeting ","useful":0,"cool":0},"vjrQ3ukxwvXIeuUZqskb7A":{"text":"The food and service was excellent! Walking distance to a lot of shops/attractions near Ja","useful":0,"cool":0},"VU0amil-299VIW1D-jqjYQ":{"text":"We had dinner here on our last night in NOLA based on a recommendation from a friend. We h","useful":0,"cool":1},"519acAv1PvMRkXC-0EZSkA":{"text":"I came here for a private event and took total advantage of sitting on the second floor ba","useful":1,"cool":0},"xA4JHL3TXqGojYVjV2ausw":{"text":"Excellent food! Beautiful Place! Wonderful ALMOST all around. \nThe only reason they didn't","useful":0,"cool":0},"YklYJW0RQvJgpNPV4Sn95Q":{"text":"We've been going to Muriel's multiple times throughout the years. I've always loved it. Ou","useful":0,"cool":0},"ldQirXUDSYVj5aFFrSYuDw":{"text":"Muriel's is worth a visit. I wish i would have seen some of the other areas. We went in a ","useful":0,"cool":0},"I3vbV19FjlbCh1qwwpNBBA":{"text":"Top notch service in an historic fine dining establishment.\nOne of the many places in the ","useful":0,"cool":0},"S2llqMNLd-MtoMNNC8fGlw":{"text":"Went here for lunch after hearing about the restaurant from our tour guide regarding haunt","useful":0,"cool":0},"TfId4TjN1pAZFkgs3tnALQ":{"text":"We were greeted and served by Travis & Susan. The turtle soup and caraway flavored table b","useful":0,"cool":0},"D5lKx6wRXf-o33bOzjRRpg":{"text":"Muriel's is one of my must visit places when I'm in NOLA. It's so charming. The staff are ","useful":2,"cool":0},"dudiwBPC-jEuI_B9s-BvTw":{"text":"Oh my word! The food is wonderful. I started with the fried green tomatoes sans the jelly ","useful":10,"cool":11},"INBK_mty6R7lsU3IwZYWPA":{"text":"The decor is great, the location is great and the staff is great.  The food was almost gre","useful":0,"cool":0},"2m0z7pYWcQUg_xyi0DCYsQ":{"text":"Always enjoyed going here. The turtle soup to begin with was a very runny and no substance","useful":0,"cool":0},"gbYLGk73dLOSlCKlLcl_aQ":{"text":"We stopped by Muriel's for a drink- they have a great happy hour and that day the special ","useful":1,"cool":1},"REzQJBxmvIa4kizUMzQWsQ":{"text":"I have traveled to New Orleans twice now and Muriels is always a stop. I ordered the shrim","useful":0,"cool":0},"q7z8qDtBbAR45vuOKmTnug":{"text":"These were by far the BEST Shrimp and Grits that I have had.  I could have licked the plat","useful":0,"cool":0},"GXhgtdDnkG4yMtMHSeY9hA":{"text":"WOW!!! If I had to pick a restaurant for my last meal, Muriel's Jackson Square, will be in","useful":2,"cool":1},"BxAVhVjiDmRt2T_R9WWTdA":{"text":"i stopped here to check out the table set for the deceased previous owner and had a amazin","useful":0,"cool":0},"Mcu4w2FkiFtd1UhDDQjQ7Q":{"text":"Always enjoyed going here. The turtle soup to begin with was a very runny and no substance","useful":1,"cool":0},"vLRKVeJbhO0qcn89G7rVBw":{"text":"The best meal we had during our recent visit to New Orleans. I had the Blackened Catfish a","useful":0,"cool":0},"BUw0EDTEjQwGWpC1RX4g4g":{"text":"Thank you Imani, Chalotte, and Josh! You manage to find us a table for 7 at 8:00pm on a Sa","useful":0,"cool":0},"AwZRLuqGlQ1oTmDuFIqPoQ":{"text":"The food was neither spectacular nor terrible. Overall, the 3-course prix fixe menu was li","useful":0,"cool":0},"e_zKalLuZm6mYZ00OPZR2Q":{"text":"Came here during covid- made a reservation but didn't really need to, on a Tuesday night w","useful":0,"cool":0},"wr8UOIVZisXcBLYGGddYYg":{"text":"This is the place to enjoy if you've never been to New Orleans and want to enjoy authentic","useful":0,"cool":0},"lsKpvAlB-FEeryZEo3zfPQ":{"text":"Came to Muriel's based on reviews for a work dinner. \n\nService:  you get two waiters - one","useful":0,"cool":0},"XFQ72QJlq08EGzpwAG6TjA":{"text":"This place is awesome. Loved everything we ordered. My partner got the duck hash and I got","useful":1,"cool":1},"Vu5dMZH5rlo1BNb7nzI2Tw":{"text":"Muriel's was just another one of the places that made my short list of five star rated exp","useful":4,"cool":1},"K543t9B5NGoNjVl6qeSH3w":{"text":"I've visited  NOLA classic restaurants in past trips, Galatoire, Arnaud, Emeril's (Delmoni","useful":13,"cool":15},"mOmQWDAYynUJRfJgiu53Ig":{"text":"Best restaurant in New Orleans, with the possible exception of Commander's Palace WAY upto","useful":0,"cool":0},"beJ7o3utQNcdQTN8TLyIXg":{"text":"This charming old mansion was just the start.  The service was personable and very good.  ","useful":0,"cool":0},"H6LYL6QNR0a6md9bwpThNw":{"text":"The best experience in NOLA! Came in here for just a drink during happy hour and stayed fo","useful":0,"cool":0},"ld_YKaQbOgUDiw5vuIUZwg":{"text":"Great food! Our favorite meal in Nola. Always good quality with reasonable price! \nAlways ","useful":0,"cool":0},"afOwt-o58S8F30I792lUbg":{"text":"We made reservations for this restaurant 2 weeks in advance. On the day of the reservation","useful":7,"cool":0},"NpRo-OaVhWR5y93PhhZffg":{"text":"Aug 18, 2019.. Sunday Jazz Brunch\nThis is a high quality restaurant in the heart of Jackso","useful":3,"cool":3},"I1LS5ya1UVQfNLDuldyuMA":{"text":"Very tasty food - very expensive price tag.  Service was on point!  Bloody mary's were a l","useful":1,"cool":0},"sUfQMWZ9XBHRbYeqxqHgyA":{"text":"I wish I could give this place more stars but I can't.The service was absolutely TERRIBLE.","useful":0,"cool":0},"qj264QT_IWzaE6cc3lGaYA":{"text":"One of the best restaurants i have been to in New Orleans. The drinks are amazing. I had t","useful":0,"cool":0},"hWn6tG9yOv-CuitA1G2uWA":{"text":"Just had New Year's day dinner at Muriel's as visitors from Chicago. Service was excellent","useful":0,"cool":0},"wDo8VW-J25nGxv3uXio0tg":{"text":"Phillip (our server) made my whole experience so unenjoyable. I came for my friends birthd","useful":0,"cool":0},"CMP3dbpMt0vUhZ30uQOiXQ":{"text":"Absolutely everything about our experience here was positive. We came for our 5-year weddi","useful":2,"cool":1},"dn0ELtB-EF_2_b91EZmpUA":{"text":"This is definitely one of my favorites. A few friends & I ate here on New Year's Eve. We h","useful":0,"cool":0},"KHaGl1ITbqYk6HKubJBo_A":{"text":"Food:  Best gumbo I've had maybe ever.  Great brunch spot.  Drinks are good as well.\n\nAtmo","useful":0,"cool":0},"bPfOEnZM9pZ_07CBDUnP6Q":{"text":"We came there for a fancy lunch , expecting a snobby staff, we where pleasantly surprised.","useful":0,"cool":0},"-sUzWzxUBonIBOiMsIatow":{"text":"Stopped in for dinner last minute while walking around the French quarter. It's such a bea","useful":0,"cool":0},"XafR6bvsK7NISwBdzY82jQ":{"text":"Crawfish and Goat cheese stuffed crepes.\n\nYou're welcome.","useful":1,"cool":1},"34UlDe6rUpOeYHanC1avTw":{"text":"While on vacation we went to Muriel's thinking we would have a nice meal in a beautiful re","useful":0,"cool":0},"IrsHWjGD5KEQb7LZTH9KmQ":{"text":"One of my favorites now for sure. So much history to this restaurant, with the gorgeous Se","useful":0,"cool":0},"fcQn7uMxn6s0YVqyiNLTOg":{"text":"a nice little spot with really attentive staff.\n\nPrior to our trip to New Orleans I caught","useful":0,"cool":0},"t-9VF5FDrCLWyvt9-nmi4A":{"text":"I'm a picky eater, so it took forever for me to choose a restaurant for a nice dinner duri","useful":0,"cool":0},"my5A33_ZUTmJZ9HWPwTYwg":{"text":"One of the best meals I've ever had, hands down! First: I was delayed getting to NOLA and ","useful":1,"cool":0},"How2aImlJ7QI3hugrLEmAw":{"text":"I made a reservation here for dinner because I was on a haunted ghost tour and one of the ","useful":0,"cool":0},"deVlvesLJvGF4kJ8urJ3RQ":{"text":"Went for the Jazz brunch with some friends. All 4 of us got different meals and all of us ","useful":0,"cool":0},"t9UaLMnTtGY3yNWrDYZMxw":{"text":"Came here during conference and was absolutely blown away by the food. Had a crab cake app","useful":2,"cool":0},"TRQ5OixkiuRfr4752lWYxQ":{"text":"Our visit began with a 20 minute wait for our table, despite a reservation and no apology.","useful":0,"cool":0},"KcANQ0mXTyXy6QXw0hlOcw":{"text":"We had to move to dinner at the bar because they couldn't move our reservation time, but I","useful":1,"cool":1},"HG8pBfJJGaDjBOukJKi-Qg":{"text":"My favorite meal in NOLA.\n\nCame with a group of 10 and had Gara as our server.  Gara was d","useful":10,"cool":8},"oe_4l7MEK5Cu75_6B_F-qg":{"text":"Arrived in New Orleans on a cold rainy day and stumbled across Muriel's Jackson Square.  F","useful":0,"cool":0},"PsNnyhkKBMzvpBvnyc6okw":{"text":"WOW. Came here for light apps and lunch while in New Orleans on vacation and it was superb","useful":2,"cool":1},"YlRbuzeAqEV-lRpWjClhbg":{"text":"So very, very disappointed! We brought relatives here and it is their first time in New Or","useful":1,"cool":0},"VEFZejCCtd9TjmkABCTJ8g":{"text":"Fantastic food! We ordered the crabmeat imperial as appetizer. lamb chops and the blackene","useful":1,"cool":0},"BNfZd63AO8kTxR051C1WhQ":{"text":"Beautiful spot, classy host and great location. Unfortunately our server made it clear he ","useful":2,"cool":0},"LUWnm8ZdNpc3aKngDYAglA":{"text":"We stumbled upon this place because of a \"Haunted New Orleans\" tour and this place is actu","useful":2,"cool":1},"lRQn7mJ3wLt73cPrxhA9QA":{"text":"Favorite place for Sunday Brunch.\n The goat cheese crepes are to die for!","useful":1,"cool":0},"5b3Ynwgi2FpNCActDhgGJA":{"text":"I came for a late lunch on a weekday. I had made reservations in advance but none were nee","useful":2,"cool":1},"ZfMFmKIBk4IeLHBO7x5HBw":{"text":"Had the Table D'Hote. Great value with awesome choices. Had the soup of the day (shrimp, a","useful":0,"cool":0},"9Z76mxStdNbPNvC1QrWvPQ":{"text":"Stopped in for cocktails and a small plate - we were not disappointed! Beautiful bar with ","useful":0,"cool":0},"o0BkHUOqKMVfF-fnKYD6FA":{"text":"New Orleans is amazing but I was not impressed with the food taste. I would say everything","useful":0,"cool":0},"Erxzlk-h0MS4NnPP0SXhew":{"text":"Pricey but worth it. (well, pricey by my definition) But seriously good food and great des","useful":0,"cool":0},"WQLJ_O_23oqbk0X-NxXwsg":{"text":"This place was awesome! Nice classical ambiance and friendly server. Do yourself a favor a","useful":0,"cool":0},"PNYEEb7taOML-WVKqRlqfA":{"text":"Outstanding food, service and atmosphere! On the higher end of the scale regarding cost bu","useful":0,"cool":0},"2v9ETbM98_hhpLKkJCr1dA":{"text":"The food was good, but the service was not good. For the price, I would expect good servic","useful":0,"cool":0},"97cQVTcVlhEnLVCrfSQmXA":{"text":"If you are visting with diners who have diferent tastes, want some local ambience, histori","useful":3,"cool":0},"_Rx4sCjrGCHde-XGcXtf8Q":{"text":"Had a group dinner here for the Coolinary special. I really like the atmosphere..nice hard","useful":1,"cool":2},"0fQ1w_9r8RUwiJNQuBLDAg":{"text":"Gumboo was plain and the chicken dish wash warm not hot. It was ok ,sage margarita was ver","useful":1,"cool":0},"_IGI76FdkFNSKdrRDVU-9Q":{"text":"The food was great and so was the company. We sat at the ghost table and it was fun times ","useful":0,"cool":0},"P3zRIw2E2gPkIMFQyv_Kuw":{"text":"LOVE LOVE LOVE THIS RESTAURANT!!\n\nCame in without any reservations on a Friday evening and","useful":1,"cool":1},"j8ls8fbAudbQHG-RvX70RA":{"text":"Wow.  10/10.  Amazing crawfish and goat cheese crepes, shrimp and grits and bayoubaisse.  ","useful":0,"cool":0},"JFrMqNBRl3RPhhJeOw4iTA":{"text":"Muriel's feels a bit like eating in the dining room of an Antebellum mansion. They have an","useful":1,"cool":0},"GGfPyTbd3wfAde7N6Laxqw":{"text":"I think the awful attitudes must start with the management. I won't spend another dime in ","useful":0,"cool":0},"nMwn7ghtITGaXKDE1hwDGA":{"text":"I live in New Orleans, I have eaten here several times over the decades. If you have veget","useful":0,"cool":0},"rwoeQTDTOIuTXxTGaUFqhQ":{"text":"We saved the best for last--had an amazing dinner at Muriel's our last night in New Orlean","useful":0,"cool":0},"dQ34cTnhbj2znfGqusiL8A":{"text":"Solid French Quarter restaurant.  Good food and great service!  My wife and I had lunch an","useful":0,"cool":0},"UsjbfM-3Oo_-qPLDsGBuJg":{"text":"The restaurant is in a great location, which was nice. My main complaint here is that thei","useful":0,"cool":0},"5snKPVMSkPzwS3Lu_XUTrw":{"text":"So we found Muriel's just by walking and looking at the menu. The restaurant is beautiful ","useful":0,"cool":0},"5ZwuqcQfq9_4d8sYiFVNWw":{"text":"We went for Saturday brunch and it was delicious! \nI definitely felt underdressed in jeans","useful":0,"cool":1},"ztq_L1fCO8CSq3puu3fbEw":{"text":"Absolutey gorgeous little restaurant on Jackson Square. Very picturesque, old-fashioned, c","useful":1,"cool":1},"Bnn-O0dKCCn-ITYVIkf5gA":{"text":"My hubby and I had dinner there last night. He got the scallops with mushroom risotto and ","useful":0,"cool":1},"_CVt-wePJ27LXIwwwcCEtg":{"text":"Delicious Sunday jazz brunch in a beautiful setting! Attire is business casual and service","useful":0,"cool":0},"znyVF3yS-aAxkGdjU58vVA":{"text":"Loved Muriel!!!\nLet's start with the ambience/decor: beautiful house that was restored to ","useful":0,"cool":0},"FrgbSXbbkwXF5KeYR4n5RA":{"text":"Muriel's offers delicious New Orleans dishes in a beautiful old building. Being right on J","useful":0,"cool":0},"_-yeO_TvFkXcZFboWAeG5A":{"text":"We went here for our big dinner the first night and it didn't disappoint. The old house is","useful":2,"cool":0},"3D8uLVwTLU8oozakTkQN9w":{"text":"Your friends and Yelp will name a dozen places you \"have to\" try during your stay in New O","useful":6,"cool":4},"3Q7XwHSyFOGSmiUWQEyPrg":{"text":"We had our rehearsal dinner there and it was absolutely wonderful! Lori did an outstanding","useful":0,"cool":0},"3riUX3l4XkK_IKP_279s-A":{"text":"Great food!!! Service was professional and classy but a little quick and rushed so I did n","useful":0,"cool":0},"nk-NKLJ7YmkozvK9NDitCg":{"text":"Sooooo delicious!\nA friend and I passed this place during a walking ghost tour and thought","useful":1,"cool":1},"4XE-7nm3kQKAKrfVv_PK-w":{"text":"It was the best meal I had in New Orleans . I had the lunch special with seafood gumbo and","useful":0,"cool":0},"zgogRCF221Zgx_dpFdCkuw":{"text":"I'll give this establishment five stars for food, atmosphere, brunch, service and the best","useful":0,"cool":0},"FX1MhWXRocw3KxnGxVfjsw":{"text":"Wonderful! We had a fantastic dinner there for the whole family. Can't say enough good thi","useful":0,"cool":0},"WXYiv6JvY9NDtnTNlIjdOg":{"text":"Disappointing, especially for price paid. Scallops were cooked nicely but unfortunately we","useful":0,"cool":0},"n0DO6XNxxqUyb1h_4w6AfA":{"text":"This is my first time visiting NOLA and am absolutely in love with the food and the servic","useful":0,"cool":0},"NbjaTV4U2uEMADY2Fox9nA":{"text":"Really delicious. Cool location right at Jackson Square and the Pontalba Apartments. Lovel","useful":0,"cool":0},"sVGb9MnpRJHNFgM7anx5-Q":{"text":"First off, the restaurant itself is exactly what I would hope for as far as wanting a beau","useful":0,"cool":0},"zrvHWm8MByXxGPLGbhQWXQ":{"text":"Great service from Derrick and the hostesses at the front door. Got a bloody mary (it was ","useful":0,"cool":0},"rMCZsY3NHLcrltwihDGK7w":{"text":"Stopped here for an afternoon drink because they had their balcony open for bar service. S","useful":0,"cool":0},"WbVui9QyFztCFPX25TOTDQ":{"text":"Best \"GUMBEAUX\" in NOLA.  \n\nUpon arrival on a Saturday morning, I was surprised a to how a","useful":0,"cool":0},"-FDQlM_7ndCGFgI_dn0X4Q":{"text":"Be prepared for a severe underestimation of wait time. We were warned by another hangry cu","useful":0,"cool":0},"QiUwndTZOLe3DN1V4a4IKw":{"text":"Great, great, great. I had a dinner for 60 plus nurses. The building has such NOLA history","useful":0,"cool":0},"YYfp3-tZXd4QijI-7UIC0Q":{"text":"Overall I was not impressed with Muriel's this time. I had dinner here in July and my meal","useful":1,"cool":0},"BtF9A2_wtvw-8z8Jg1lwCA":{"text":"Dined at Muriel's on our last night in New Orleans. It was meant to be a special dinner. H","useful":11,"cool":11},"pp6kBqbMJMoeKzeyTcrZBQ":{"text":"Got married here (a week after Beyoncé had a party in the same space for her mom's birthda","useful":0,"cool":0},"LFa7i56QrAvDjXDk5_qqBQ":{"text":"Went here at the assistance of a coworker.\nLovely place, good ambience a little loud. The ","useful":0,"cool":0},"ACVw2PAaBdzvj72QuRGAMQ":{"text":"I was a little apprehensive about my friend and I eating here because neither of us are bi","useful":3,"cool":1},"k6YlyzwAhwA6s9E_tk8PgQ":{"text":"Oh, how I loved my dinner here. I ate at the bar and experienced some of the very best ser","useful":13,"cool":12},"OB7vPnzUTFrIxJYl6e0_6w":{"text":"We came for my sister's wedding and everything was absolutely prefect! The food was delici","useful":0,"cool":0},"K6yxs5u8x-S8cyMqdcO7VA":{"text":"Perfect dinner spot! The turtle soup au sherry was great. Also tried the goat cheese and c","useful":0,"cool":0},"9zIxFSBpVIi_K3mC6ehuAQ":{"text":"So we came in for a friend's birthday, since they were visiting from out of state and had ","useful":0,"cool":0},"Q4Btx0qKV3rXoR_U0XKxUA":{"text":"What an incredible evening. Greeted by the owner, Rick, and the front of the house manager","useful":0,"cool":0},"nH8by3I4W7fIIxWhkjq33Q":{"text":"Our favorite date night dinner spot in Nola! We always make reservations in advance to ens","useful":1,"cool":0},"-6J9H5si_6F7gpmYhyRCsw":{"text":"This is an amazing place and a \"must do\" when visiting NOLA. On the corner of Jackson Squa","useful":0,"cool":0},"Uif3KvwdIWR5KRES4DTNSQ":{"text":"Mouth watering food. Excellent service. Classy place, but you don't need to be in fancy at","useful":1,"cool":1},"3DfrEd9ZqAV5bKxMNkHsMA":{"text":"Food and service was awesome! Great authentic Cajun dishes with excellent quality. We had ","useful":0,"cool":0},"bnaEPXcfSLkhluUX5AknDw":{"text":"Very nice place; had the four course special.\nPerfectly proportioned.\nWill be back. Heard ","useful":0,"cool":0},"xTf8daV6-NvdhnkfqYMXlQ":{"text":"Wonderful experience - we were 11 with kids and they seated us quickly without reservation","useful":0,"cool":0},"08ezLN0L5Aex7YMPN_oJqQ":{"text":"This place has an elegant and classic New Orleans decor to it.  It is known to be haunted ","useful":3,"cool":3},"JAcND7S0ei2hMKSZLcgiKA":{"text":"Muriel's was recommended to me by the manager of the Cornstalk Hotel, Louis. He suggested ","useful":3,"cool":1},"4wkYjHL4XmiVfQuynWTJYQ":{"text":"Stopped by for a beverage at bar & met Hannah.\nSuperb service, local knowledge, & wonderfu","useful":0,"cool":0},"cAo8CaoVUc739XhXKR7OFA":{"text":"Went here for the Sunday Jazz Brunch.  I have to second the review about the greeter at th","useful":0,"cool":0},"eRpja9XIxm-IEr-xb6ctEg":{"text":"Happy hour specials here! We would love to return here for dinner but we did make it to ha","useful":0,"cool":1},"uSoHgewsRqeLhKoD2U9GIA":{"text":"I can't say enough good things about Muriel's. Our food was fantastic, highly recommend th","useful":0,"cool":0},"-SA5bUFHIe8WADnmVMk_gA":{"text":"We ate here twice during our recent trip.   They feature a dedicated gluten free menu for ","useful":0,"cool":0},"0CX_46VMr9Cl6mzn64MUvg":{"text":"Everything from the service to the food at Muriel's is absolutely amazing! We took my mom ","useful":0,"cool":0},"1pzB01snX39sHYg6QUF5wg":{"text":"This was one of my favorite dinners on my last trip to New Orleans. Shrimp and goat cheese","useful":0,"cool":0},"rplsBvHlvE3DERrkiqHb2g":{"text":"Muriel's is fantastic , both stimulating to the eye as well as the palette...it's located ","useful":0,"cool":0},"G7I9ims3VUekiBZf32dtlA":{"text":"This was the best meal we had during our time in New Orleans! It was decorated beautifully","useful":0,"cool":0},"-Ph1CPpdgj6WZxHkdo1NZA":{"text":"Had a lovely meal here. Be sure to heas upstairs to check out the seance room! It is a sig","useful":0,"cool":0},"3t73_chA-Q-lTIqx0y3j6g":{"text":"THE BEST dining experience we had in New Orleans and one that was completely unplanned.\n\nI","useful":4,"cool":2},"4nMDm260FDTmmyuMKffGdg":{"text":"Live jazz band during brunch set the mood. Both of our meals were fantastic.\nShrimp and gr","useful":0,"cool":0},"AM7hdRcDrdNY7toQnP6F8w":{"text":"We didn't have enough positive things to say about Muriel's. I came with 12 of my friends ","useful":0,"cool":0},"nX34k2qbO8BWJjrlpaDOnQ":{"text":"Pandemic update:\nWhew... A friend talked me into actually eating in a restaurant. Yipes! B","useful":3,"cool":2},"Mw2McILW6LAOD_xzYH_rhQ":{"text":"Out of the two times we've been in New Orleans, our official favorite restaurant is now Mu","useful":4,"cool":3},"eY_JCwnOAh4uwbkUGjYEDA":{"text":"We made a brunch stop here on a recent trip to NOLA. Everything was pretty good, if covere","useful":3,"cool":0},"MHgIqA3B3rSphsFeiV6YOg":{"text":"I am a little upset that I can only give 5 stars! I did the three course meal for $44.95 a","useful":0,"cool":0},"IIgTwAJlsBV9BCtfzdQNQg":{"text":"We had a terrific meal here. The service was a little slow but it was the night before Fre","useful":0,"cool":0},"jGuYut6ChagjhPMXM8msVA":{"text":"A Monday night in New Orleans... where to dine? For some reason we never considered Muriel","useful":1,"cool":1},"r8F56pvudLAa-1SMdWqVjQ":{"text":"Muriel \n\nWas one of my favorite place in New Orleans \nThis restaurant was amazing for drin","useful":1,"cool":0},"nF39x6jV6H3cJdAdBWcGQQ":{"text":"Everything I hoped for on my first post-Covid venture out. Fantastic service while still b","useful":0,"cool":0},"YDajsG-F_c_-4A9XLgoZIQ":{"text":"Service was ok but the food and drink wasn't very impressive. The el Diablo drink tasted l","useful":0,"cool":0},"_pzAJQoNMWMI997YgZnhqA":{"text":"Our first morning in New Orleans was on a Sunday...so naturally, brunch was in order. Muri","useful":1,"cool":0},"OQKQHk98EKe-evle5FqT9Q":{"text":"Wish I could give negative stars for the service. The food was good (probably 3rd best din","useful":2,"cool":0},"cdmRFRvhGxI_N7wm-Dyqfg":{"text":"We came here for dinner and really enjoyed it! The food was delicious and the service was ","useful":0,"cool":0},"yjU-HlrPaZBTnfaUxuR6uw":{"text":"I'll preface this with the fact that I have very high expectations of food in New Orleans.","useful":1,"cool":1},"Vwd0Ee4N8P-V5aIa9fvB_Q":{"text":"Such a must visit if you're in New Orleans!   The service is 5 star and the food and atmos","useful":0,"cool":0},"nvHgdvRg1dhHeSDX4OHsSQ":{"text":"We had a great lunch at Muriel's. I recommend reservations because it is crowded (for a re","useful":2,"cool":0},"7S5gZJDv_2tQNrwl5xjbCg":{"text":"What a festive, eclectic restaurant. The decor is most decidedly a New Orleanian take off ","useful":1,"cool":0},"xbDyK9q5OdP-I8pJqhCr9Q":{"text":"Wow. All I can say is wow. We just had the most amazing experience at Muriels. We have bee","useful":1,"cool":1},"CVqll4lHhb78SeICJ3KD_g":{"text":"This was the BEST pork chop and meal I've ever had! Like an orgasm in your mouth! The half","useful":0,"cool":0},"dVlp8yCsb1zuQgU-GquvwA":{"text":"I've been to Muriel's probably half a dozen times over the past 10 years, and I've always ","useful":2,"cool":1},"renrvF6pfqjFQamqkcG2Ew":{"text":"Best shrimp and grits I've ever had. Great service. They were flexible with our reservatio","useful":0,"cool":0},"0FYEeEei3cG2U9xKcsMdiw":{"text":"Went for Mother's Day! By far the best food i had in a long time. Bar was amazing and bar ","useful":0,"cool":0},"kRNjCbv-GwNfwHJO-82ZQw":{"text":"Went for their in between meal of lunch and dinner and the food was amazing!!! Food is a l","useful":0,"cool":0},"5HM-ZAvdKJ6O00_63FfR6A":{"text":"I loved everything about this spot. The food was delicious, the service was impeccable and","useful":0,"cool":0},"hFNLiVouR3h6eQWSC22Y5w":{"text":"The classic NOLA dining experience.  First, a professional wait staff that cares.  All the","useful":0,"cool":0},"yPiP_o34mbJW2FGIoB7z0A":{"text":"If your looking for a place that you can finally dress up and pull out those heels, this i","useful":4,"cool":0},"lzsZPE6YeAT57a7PlGb8MA":{"text":"We came here for my husband's birthday. They only serve food down on the main floor and no","useful":0,"cool":0},"3Z4NUySsKkA9aBvtjXSg0A":{"text":"From service to decor to the food & drinks, you can't lose!\nLikes: efficient seating and e","useful":4,"cool":2},"7HWJ39XdD1WXv_zDPqSQKQ":{"text":"One of the best dining experiences in New Orleans! The bread was so good and I really enjo","useful":0,"cool":0},"ju_VlZzzYQVnirRIlUw12Q":{"text":"I had my surprise engagement dinner here and This is a really nice elegant place. My fianc","useful":0,"cool":0},"lGOJ5_UcxEW37CL_O8xSjA":{"text":"As a local I've been going to this place for many years and typically would give it a 4 to","useful":0,"cool":0},"fyg0vsMwYLE1GRFcsCEyCg":{"text":"Well, I was hoping for so much more.  Great location.  We sat on the balcony overlooking J","useful":0,"cool":0},"hV_I5uFRFOXcBlGu0pv5GQ":{"text":"Simply amazing. Great selection of local foods and flavors, in a lovely and likely haunted","useful":0,"cool":0},"znTS2eWInlDV33VvUGlMKQ":{"text":"This review is for the horrendous service of one particular individual. Unfortunately I wa","useful":0,"cool":0},"SgYcZp7jIl1ekSKUO3K4_A":{"text":"We went for the Jazz brunch with some friends I hadn't seen in years and were really excit","useful":0,"cool":0},"YB4axcZAIP8-aWxwKLdSyA":{"text":"The only reason Muriel's is getting 2 stars is because it is New Year's Eve and I am cutti","useful":0,"cool":1},"_2dzrVZNgu6rA-l9Z3QBjA":{"text":"So good! I said: \"Oh my gosh!\" At least four times after taking a bite of the crawfish cre","useful":0,"cool":0},"THGlXHN6_HKJEP4A1AT1Uw":{"text":"Went during the pandemic. They take reservations and check temperatures upon entering. Ser","useful":1,"cool":0},"lCbnCdLeODP1npA7kPJgig":{"text":"It's not all it's hyped up to be.  If you like mice running through the bathroom stall whi","useful":0,"cool":0},"DKuR5Ig0urGeQRM8utfPXg":{"text":"Awesome food. Blackened redfish was amazing and pecan pie spectacular.  Neat atmosphere in","useful":1,"cool":0},"hzcjaDvHsjohncxP5iZu6Q":{"text":"One of the most amazing meals I have had in New Orleans.  This is my 3rd year in a row, vi","useful":0,"cool":0},"rWSJLsLLtniA3A2qF3OGEw":{"text":"I am visiting NOLA for just a couple days and asked around for recs and was told Muriel's ","useful":0,"cool":0},"DVIAhKIafuB1G6KgfSdusA":{"text":"Food and service were both awesome. Plus, they take reservations. Great place, I'll be bac","useful":0,"cool":0},"0CupB10HmomXW8dANrtPXw":{"text":"I visited New Orleans for my birthday weekend and chose Muriel's for my birthday dinner wi","useful":3,"cool":1},"p316iFgBk2dWNWaSv-KQ2Q":{"text":"Honestly I've been here 2 or 3 times and it just doesn't disappoint.  Servers are excellen","useful":0,"cool":0},"GeRTPc-QZkeWUa_Wb2aISQ":{"text":"Was not impressed with the taste or quality of the food. The price was fair, I picked the ","useful":1,"cool":0},"YVwqV-Xa4dJs87CRuXf5iA":{"text":"A top-notch, fabulous dinner.  We ate here after the Rock n Roll Marathon in March.  It wa","useful":1,"cool":0},"y9eUNUUC5iKiIcJJLnzjMQ":{"text":"It's been almost 8 years since I last visited and reviewed Muriel's.\n\nI think I've resigne","useful":21,"cool":15},"zXdJ2gCiVOX6gF5TbOya3w":{"text":"Let me begin by saying this was the perfect last meal to end our NOLA trip. I had the shri","useful":0,"cool":0},"74R7pdbi56RCmk9nJDaH0Q":{"text":"We absolutely loved Muriel's (our favorite dinner in NOLA). We made a reservation so I can","useful":0,"cool":1},"fbvKDAIzkievReaFTqd5Ow":{"text":"We had a reservation for the ghost table and it was awesome! Our servers Jasón and Luis we","useful":0,"cool":0},"_OQwo1vmeDKP5zyqOwTWIQ":{"text":"Had the pleasure of spending New Years Eve here for dinner. My husband and I started with ","useful":3,"cool":1},"Oykk3kwA9E_yavq9_2ssXw":{"text":"Very lovely place. Beautiful building and location. The food is amazing, servers real resp","useful":0,"cool":0},"uvGzB3CYo3JDQJ9NxVE66A":{"text":"Muriel's is a New Orleans staple and definitely worth checking out when in town! I love th","useful":1,"cool":2},"AsQRQvE6KKF5S6J6WPK16Q":{"text":"Muriel's- you really let me down! After visiting a few years ago and enjoying the food, we","useful":0,"cool":0},"dY0pKHCxg7UHg61XIklG5g":{"text":"This was my first time dining here and it certainly won't be my last!  We celebrated my da","useful":3,"cool":0},"cplU5o1LTCbdEZzqdyFCxQ":{"text":"Great place for brunch!  Wonderful treat that hits on all aspects.  Very much a period pie","useful":1,"cool":1},"KavetAJRk4IKuu_9uHqNqw":{"text":"Went to Muriel's on New Years Day with my family. We wanted to go to a jazz brunch with my","useful":3,"cool":0},"Ud1OeiFznl7xWLRQYjPKYw":{"text":"Straight from Cali, 1st time in NOLA and we had my bday dinner here. Luis was our waiter a","useful":0,"cool":1},"ScH8Hgo71OWdon42RQqVYA":{"text":"We stopped in for dinner on a recent trip to NOLA. Our dinner was fantastic!! The waitstaf","useful":0,"cool":0},"d_PR0mRpe23n6ln7LKx3ew":{"text":"Superb food and ambiance. We wandered in and they sat us immediately. The food and present","useful":0,"cool":0},"iP7jA83wTN_8YNLyEygZ1w":{"text":"Great brunch, delicious authentic creole food, wonderful service and awesome jazz music! I","useful":3,"cool":0},"cbDWecvLK7FWJy5FvUBJ3w":{"text":"Everything was amazing....from the atmosphere to food! Can't wait to go back! If you visit","useful":0,"cool":0},"k9UyjbxCBSSrfFDIpzlIDQ":{"text":"I was walking through the French Quarter with my sister and we were hungry so we stopped i","useful":0,"cool":0},"IOgRSas7g1KsPbPD9tFPxA":{"text":"Came to Muriel's as part of a girl's weekend. The ambience is great but we were cold all t","useful":0,"cool":0},"SVTcvJ8866ObKhBLO9EhfQ":{"text":"I took out of town visitors to Muriel's for lunch. The waiter took our order and never gla","useful":0,"cool":0},"PLfg1SErvK21FfLoxIY-Eg":{"text":"Had a lovely time dining here last night. I'm definitely coming back here! Food and staff ","useful":0,"cool":0},"ZG4jE85xpqX5KstznMwsnA":{"text":"Great location and a neat story, but the food was subpar. We dined in for brunch. \n\nI woul","useful":0,"cool":0},"UXoakUIMCFbSik6BBtUuNQ":{"text":"Fabulous restaurant with great food and a wonderful ambience. The staff was attentive and ","useful":0,"cool":0},"7nFodIhsfXZy1snVUjqnBQ":{"text":"This place is awesome! I have always put off reviewing the place because it's hard to put ","useful":10,"cool":4},"QeMFR3am9__TBnFGZpdlgA":{"text":"Love this place and stumbled on this place without much reference. The bartender Mary has ","useful":0,"cool":0},"9t3NE1UQ3fRvPG1tOFFYLw":{"text":"We were a group of 3 couples and had dinner at Muriel's on our last night in New Orleans. ","useful":0,"cool":0},"3uCKGjZYx0EwN79oxNkx-Q":{"text":"This was our second time in New Orleans, and our second time at Muriels. The meal we had t","useful":2,"cool":0},"aIQFQVpMZz4c4WsPFk4Oog":{"text":"From the Food the kind staff and the awesome terrace .. just peek one.. the place is beaut","useful":0,"cool":0},"NI_d99IfJLBYP3smmd1TpA":{"text":"Absolutely a MUST GO place. We went there to celebrate my boyfriend's birthday. It was sim","useful":0,"cool":0},"Gy0NwhBOOyUWcVtdQr1YYg":{"text":"Wonderful food selection. Great staff. Every bit of the experience was pleasurable. We pla","useful":0,"cool":0},"i-A1lVVTvn9o4eqJHfyvcQ":{"text":"Staff is amazing! \n\nAmbiance/building restoration/architecture/historic value \n\nHighly rec","useful":0,"cool":0},"gHKoyC-AA-RuvVNCfHVLsg":{"text":"Had an AMAZING meal!!! Every single bite of every single item was well executed and perfec","useful":0,"cool":0},"YuB1cUyI3s-usBcrtTruGA":{"text":"The reason we tried this place for the Sunday jazz brunch was because of the great reviews","useful":1,"cool":0},"FdKaloGT8qeisv2Yzpp2Bw":{"text":"We came to Muriel's on a Monday night. We made a reservation and were seated right away. T","useful":0,"cool":0},"IQgwZ2hD7EhyYGiszGhb2w":{"text":"Let's begin with the service, excellent!\nLove the atmosphere...really very New Orleans!\nLo","useful":0,"cool":0},"T34I8qj9nTyGqY-tZnqpUQ":{"text":"The ambiance is amazing. The staff is quick, efficient and friendly. The vampire kiss is o","useful":0,"cool":0},"4IKMgVogWF9wDTV2bj0U8A":{"text":"Was very impressed with the depth of flavor across all the dishes we ordered. I live in NO","useful":0,"cool":0},"XxZ8GEpRbgg8_c4JPseeKw":{"text":"While I'm tempted to wax poetic about one of the most amazing meals I've ever had, I think","useful":3,"cool":1},"sLm-ye3pFkREbwcWQHLfAw":{"text":"You can't go wrong here! The hostess and service were excellent, the drinks unforgettable ","useful":0,"cool":0},"hbSzCTGIWW9dEOZKBq725w":{"text":"Can't decide if the scenery of the gallery seating or the food was better, both were amazi","useful":0,"cool":0},"9Mwt88pi8Qj5eR4lb-IMng":{"text":"Amazing atmosphere with fabulous staff. The food was flavorful and beautifully cooked. I w","useful":0,"cool":0},"JcGAvurZR80czaeNtqxGDA":{"text":"I've become a foodie after living in California's beautiful bay area.  Most of my income a","useful":4,"cool":2},"QzA5ENEisdNJmOptIISNLg":{"text":"Muriel's Update\n\nLast Saturday, we had the great pleasure of introducing a long-time frien","useful":7,"cool":3},"o9FWXOhV7O_tSQNsrwHUzA":{"text":"We started our search for a nice restaurant to enjoy our last evening in New Orleans and a","useful":0,"cool":0},"l5lYFfB8wbTdeFAeGd8Y2Q":{"text":"I tend to shy away from places that are centrally located. I find the more tourist-centere","useful":2,"cool":1},"QPsAsaV68zAfGHkhhQS9TA":{"text":"Too many other great places to dine.  We had terrible service today and will not return.","useful":1,"cool":0},"qEcs9kgXDLQCxXpgpGt7Ow":{"text":"Unfortunately my dining experience was humiliating; for my son. I am the Mother that dined","useful":19,"cool":1},"Y75J8ElGXtxIWiXchmKENw":{"text":"Delicious!  I had the pecan-crusted puppy drum (it's a local fish-- we totally had to ask!","useful":2,"cool":1},"D37Kx7oSkPLowkx_4v9HXw":{"text":"On our last night in NOLA, we chose Muriel's because they were close to our hotel and were","useful":2,"cool":1},"Jzqk5PlePzvk2jbUxBNkmg":{"text":"Some friends and I stopped by Muriel's for a late afternoon lunch. We were able to catch t","useful":7,"cool":4},"aJqtt_bjcULB6s0uFK0-xg":{"text":"I was disappointment not by the location and the surroundings but by the food and the staf","useful":2,"cool":0},"DMapp7e5HztWkehexznyrg":{"text":"Food & location 5*, but service can be improved. Felt rushed with servers clearing plates ","useful":0,"cool":0},"q28S9ZCjmlDsxG47_dwG8Q":{"text":"On a rainy New Year's Day, we got reservations for 4. I had never been here before, and I ","useful":2,"cool":0},"5QG3ZQ3kZjbc2QVHCp6Y8Q":{"text":"Amazing service! I was taken by how affordable the drinks were considering the location.  ","useful":0,"cool":0},"-EuE79m_Uca7jxOnEJ2ZNw":{"text":"Tourist trapish, felt rushed from the moment we walked in, sat right away, set menu which ","useful":0,"cool":0},"Gp56GztIfOxB5xKqjtQVWQ":{"text":"I spent a week in New Orleans celebrating 50 years with my two best friends from high scho","useful":0,"cool":0},"XMeEk1ePyK2VzuGLj78Vxg":{"text":"Muriel's is one of my must visit places when I'm in NOLA. It's so charming. The staff are ","useful":2,"cool":4},"jNMRBkr9MJIXPtMFRC9DtQ":{"text":"Wow! Definitely recommend Muriel's, I had the seafood gumbo and it was the best gumbo I ha","useful":0,"cool":0},"zkDkaBNl9klYuuobWXwp7w":{"text":"Great place to grab a cocktail and watch the happenings in the square from the balcony. We","useful":0,"cool":1},"83VPve6RLi_yjYtWkKv6OQ":{"text":"My family and I had brunch here this past Saturday - and it was AMAZING. We each had a dif","useful":0,"cool":0},"0lm9UilKJ9g2O-50Y_DCkw":{"text":"Over the years I've become wary of any unfamiliar restaurant in the French Quarter: is it ","useful":9,"cool":8},"eg-RwEOEopdm6GlWZ2vM3w":{"text":"I returned for not dinner or lunch, but dessert on Valentine's Day, and since we didn't ha","useful":4,"cool":3},"Jp0Q4DMn_1iPUCzAF9Nqeg":{"text":"We had brunch here. Everything we ordered was very good. Beautiful restaurant and lots of ","useful":0,"cool":0},"4J69Z3CtLVcOA5gWXo-aog":{"text":"Selected this beautiful restaurant to dine at for by birthday dinner! \n\nThe restaurant was","useful":2,"cool":2},"0O6WkV-EUFwRuJl0PdLalA":{"text":"Great service & great food. I've been here before but wanted to try some new items on the ","useful":0,"cool":0},"79F7I5JwGiXSyUnkNADsng":{"text":"Came over for dinner on a busy Saturday night after a stroll around Jackson Square. We wal","useful":4,"cool":4},"nUtt1s5iNrGaAW1uzTXgTA":{"text":"Muriel's is in a great building with a haunted history. The seance room and ghost table sh","useful":0,"cool":0},"ibY9Iyh2FsnevycMMq5qeg":{"text":"Birthday dinner at Muriel's? Yes, please!\n\nIt's so hard to settle on just one place for yo","useful":13,"cool":8},"CHbZFqOQrhLjx3yv08ikjQ":{"text":"We went back for a late weeknight dinner.\n\nMuriel's was even better. !  What a great place","useful":5,"cool":3},"iYAhrKQVgrqpiSyY5674fg":{"text":"Being from Baton Rouge I was skeptical of this Jackson square restaurant as possibly a gim","useful":0,"cool":0},"MklFYr_gYkc_GnAwsQEggQ":{"text":"The decor is absolutely beautiful.   The food is good but overpriced for what you get.  It","useful":0,"cool":0},"5mldmIMK6yWYNa1AlrQfkw":{"text":"It's been years since we ate here but so glad we came back.\n\n10 of us ate here during Mard","useful":1,"cool":0},"HgmWtGZYA8WWwJUCTmql4w":{"text":"This place has such a unique feel. I love how it incorporates so many different historic a","useful":0,"cool":0},"dSmpT_eZvVmOf7DHNjVh1Q":{"text":"Wife and I made reservations for our anniversary. I had the double cut pork chop and house","useful":0,"cool":0},"VYgaaVEZGVmYHRevzKOqfQ":{"text":"when i asked a friend where to eat in new orleans, he said the best meal he had whilst vis","useful":0,"cool":0},"tWxDVFUHt18IiMjTDpItcw":{"text":"Amazing experience all around!! We made a reservation while walking back to our hotel a ni","useful":1,"cool":1},"8HmB4SjGkcl3A5ZSE1eUfA":{"text":"This is my first time visiting NOLA, I'm in town, filming a movie and am absolutely in lov","useful":0,"cool":0},"RFLi_5inIvR5INS3nPHJJw":{"text":"Wow!! Private event upstairs. Greated as we arrived with champagne, and cocktails in the S","useful":0,"cool":0},"fIHbiwSdfw0vJQPQLpIaog":{"text":"We love the food and the ambiance here!! We had the 3 course meal.  For some reason I sele","useful":0,"cool":0},"4hQUE_34QOPLLr0QBsQ20g":{"text":"We thought the three-course dinner and the weekend brunch at Muriel were generous amounts ","useful":2,"cool":1},"D5Q42KBM2yM6CCagJYz6yQ":{"text":"Had a beautiful night at Muriel's last night. From entering to leaving the employees were ","useful":1,"cool":1},"mwLCgzKkWH6y443oaxWJaA":{"text":"Muriel's was a good place to grab a glass of wine and light snack mid afternoon... they we","useful":0,"cool":0},"JNQwcfmJdjY7pooXcrh2GQ":{"text":"Because we live here, we always thought this was overpriced tourist place. But we were soo","useful":0,"cool":0},"TNTgPoolLPAf1JKqu5jiBg":{"text":"Food was good, not great (the other dinners we had while in town were better). But the ser","useful":0,"cool":0},"jjg4cxwQ8hlC0HqrzG-2BA":{"text":"Good food and a decent priced prix fixe menu. Actually found that for the amount of food y","useful":4,"cool":3},"9eA5VTeYQ48zUFB-EshlLQ":{"text":"Although Muriel's has only been around since 2001, the location it has in Jackson Square h","useful":20,"cool":18},"OTp-AZRmIVfViw6jiQZSQw":{"text":"We ate here twice during our visit to NOLA! Amazing food, they have a gluten free menu and","useful":0,"cool":0},"gm8T8RfS65nUy9iwikwuiA":{"text":"outstanding ambience. Amazing pork chops. OUT OF THIS WORLD APPETIZERS. Go for it. this is","useful":0,"cool":0},"WNR7th0rVIXloaYPW8n5Yw":{"text":"A few people who once lived in New Orleans told me I had to have dinner at Muriel's.  I am","useful":5,"cool":4},"M9ZdT328Kddi-5hKLldNRA":{"text":"Of all the super nice restaurants I went to in 3 days, this place topped them all. The Bre","useful":0,"cool":0},"IwFi7MCtyMlwBCVQpIOnbg":{"text":"Went into Muriel's on a whim for lunch and it turned out to be their sunday jazz brunch. T","useful":1,"cool":0},"pS6nkMvh7DeAusIsiHGqYg":{"text":"While the restaurant has great ambience, we waited nearly 1.5 hrs for appetizers. We had t","useful":0,"cool":0},"LDpZFO9hkb9eroVITfiEuQ":{"text":"The food was delicious. I didn't give it 5 stars only because it is a \"fancy\" place and my","useful":0,"cool":0},"DGYUG--tIGrYjkoGWT1LrA":{"text":"The food was really good, the atmosphere was beautiful, and the drinks were tasty. However","useful":0,"cool":0},"ud-czhDJ18SkBeUtzAuy3w":{"text":"Loved this place! We came here with some friends for a post wedding dinner. \nSuch great vi","useful":0,"cool":0},"brO-glzYMX-Lk-sj1ME86Q":{"text":"Was excited to have dinner and Muriel's and the atmosphere was cool, but the food wasn't a","useful":1,"cool":0},"_bCKAGpVkCvjeoBc1i-SKg":{"text":"I dined here one evening during a business trip at the recommendation of the concierge at ","useful":1,"cool":1},"ARxMYKpPxqRxIK3INuL1cA":{"text":"Finally made my way to Muriel's! I usually don't think about it till I see it when I'm in ","useful":0,"cool":0},"9CLWo0KDHQ2cYK7DivUwQw":{"text":"We were the table that got lost in the crowd. We waited 30 minutes beyond our reservation.","useful":0,"cool":0},"ORKzPh9Gq9tatWIqvbub8Q":{"text":"If I could review the food and service separately, I would. The service deserves 4 stars b","useful":1,"cool":0},"iVCE_UQSo5x9V7BzlseJGg":{"text":"Third visit to New Orleans since April.Best meal so far.Table of 4.2 had seafood gumbo-bes","useful":0,"cool":0},"204s4p-svEmkTU5POCuhHw":{"text":"Muriel's is one of the places you should go, if you want to eat above average in New Orlea","useful":1,"cool":1},"UBANv7CaN0g9tywFiH0zpg":{"text":"Amazing dinner!  From the shrimp pesto crepe to the perfectly cooked filet.  Paired with e","useful":0,"cool":0},"XhVIg69W88eT0613WYCabw":{"text":"We decided to go to Muriel's for a friends Birthday dinner.. we were expecting to have a d","useful":1,"cool":1},"-LkxSOKP1JPQdqfx5XKhEg":{"text":"Beautiful inside, food was delicious, prices were reasonable! We did the house menu and it","useful":0,"cool":0},"6_j-3A7mpKBpmnvBfb9spw":{"text":"I've never in my life been served as well as I have at Muriel's. This place knows how to t","useful":3,"cool":4},"FWo_VqCLqLr5K6A2mcOshQ":{"text":"Garbage food for trashy folks who want to feel fancy.  Laughable \"service\". Avoid this tou","useful":0,"cool":0},"hUcHE3TzQ3n3E8Az8_MIZQ":{"text":"My husband and I had a wonderful experience at Muriel's for a special night out. The food ","useful":0,"cool":0},"2YqgTyY_tdJeTF2xUv-cXw":{"text":"Wonderful food, service and experience! Finally a business that knows how to deal with Cov","useful":0,"cool":0},"_BOwoZS0NwUSkHbcokzIQw":{"text":"We celebrated our wedding anniversary here and it was very nice, romantic and secluded. Th","useful":0,"cool":0},"bS0kBJ0NyrYIMUf2hzwQ8w":{"text":"Food was delicious, fresh and well prepared.  Service was exceptional.  Bar service was fa","useful":0,"cool":0},"s90UHVFEGeAlqWzM85e5Qw":{"text":"We ate at Muriel's on Monday March 16th just before the covid-19 shutdown. One of the reas","useful":0,"cool":1},"pm9RkxZFm1cao9N8hHpgVw":{"text":"Excellent food and good service. There are not a lot of vegetarian options but what they h","useful":0,"cool":0},"eSjBw4sq4As3Ml0cdBrQwA":{"text":"Overall the food was good. \n\nI went with a group of 4 and so I got to try alot of the dish","useful":5,"cool":5},"GMzsLAdb1CgoanWgyy3PxA":{"text":"The food was pretty tasty. Had a peach bellini, one of the vest I've ever had,  potato lee","useful":2,"cool":1},"mdtI41hPUM35zPdCc6KkoA":{"text":"This was my friend's fourth time in New Orleans and she suggested Muriel's in Jackson Squa","useful":3,"cool":3},"p6MKzXHJGMlFn4bRykeFoA":{"text":"Exceptional food, wonderful location, and great atmosphere!  Was not as impressed with the","useful":0,"cool":0},"doPPb4I3iCTTbUzlNXMyCQ":{"text":"Very good quality and service.\n\nCame as a group of four for supper on a Monday night so wa","useful":0,"cool":0},"nLs-IN9g2S0t3CGTU8kfxw":{"text":"We had planned to go to different restaurant that was closed on July 4th and stumbled into","useful":0,"cool":0},"i_Q6s-lle2qQJeq1BIhLjQ":{"text":"We went to Muriels for our last night in New Orleans. The restaurant was beautiful. The se","useful":0,"cool":0},"ayxakhsHDqhA3hSHmidP9A":{"text":"Went for brunch, great and affordable menu in a perfect location. It's right on the corner","useful":0,"cool":0},"q4c9zeE6NUg1yfASoWffwA":{"text":"Talk about amazing food and ghostly ambiance. This is a must stop in NOLA! You can sit on ","useful":0,"cool":2},"cgyjpZ2IGDI2i6MZA163EA":{"text":"So. Good. We went for Sunday jazz brunch. The service was wonderful. Aaron and Chelsea wer","useful":0,"cool":0},"MsTi--SEq6pjvX-2Zso0YA":{"text":"The best meal I have had Hands down,  Port chop was the best.  better than any steak I hav","useful":0,"cool":0},"057-2us_uXgLo6HLg9eFlQ":{"text":"Very good! I highly recommend the shrimp and goat cheese crepes and the bread pudding. The","useful":0,"cool":0},"9LQDAEOVwOrOQcoDZNKfCg":{"text":"Such a fun spot for dinner and drinks.  Large rooms for receptions and comes complete with","useful":0,"cool":0},"3q4EyVkyLtue0HhBdNBalw":{"text":"A very nice restaurant with white tablecloths on the table, excellent food, interesting hi","useful":0,"cool":0},"pYKieg86tMArYAV3JC4RQA":{"text":"Beautiful atmosphere, great service and very accommodating! Also, the best Shrimp & Grits ","useful":0,"cool":0},"b832NuuoEvT5NoQfnLcCMw":{"text":"We hit the jackpot coming here for Happy Hour wine ($4), a beautiful view of Jackson Squar","useful":1,"cool":1},"tuD8FjJaJv08Tk_PvZ0UJA":{"text":"Heard about this place while doing a ghost tour. We went in between lunch and dinner so or","useful":0,"cool":0},"5OWK3JYATI0RlpgGkTzmMQ":{"text":"Where to start! The restaurant has a haunted history and the food is delicious. It has bea","useful":0,"cool":0},"ymOeglyDVaVWeYG-58IaTQ":{"text":"I visited on a Friday night after a recommendation from a local.  I sat at the bar and was","useful":1,"cool":2},"DQYwI6Qoc2duY9U7KqIHOg":{"text":"It was ok, kind of stuffy and expensive. My shrimp were not fresh had a fishy taste. The r","useful":0,"cool":0},"eSAXL1ZtwPJgvhyoUkv-cA":{"text":"Excellent service, impeccable food, and an all-over fabulous dining experience. The house ","useful":0,"cool":0},"OHlkx68ZF-5t7Xt8qJiDeA":{"text":"Really good food for reasonable prices.  Probably in the top 2 meals I enjoyed while in Ne","useful":0,"cool":0},"Lgt_Rd1soiRnnV1w5hDfnQ":{"text":"My favorite hotel adjoins Muriel's on both sides so I have eaten here many times... Ain't ","useful":1,"cool":0},"3yCp7smUFXA5f4pUn6O23w":{"text":"Went for brunch on a Sunday. The place is a beautiful New Orleans building. The staff is a","useful":0,"cool":0},"Aye4qtfT2ej06r2hrKvf2w":{"text":"came here for dinner, steak was excellent and cooked properly, my date's fish was great...","useful":0,"cool":0},"cFM-hKR4KP-28aEEAFhSfQ":{"text":"We had brunch here on a Saturday morning. The food was delicious. I had filet & shrimp- th","useful":0,"cool":0},"cY7mczt_4wJUXdcrxZ12ZA":{"text":"First dinner at NOLA. This place was recommended by a local friend. Beautiful place, nice ","useful":0,"cool":0},"jscS1aj-LHM48CFQJDG2Sg":{"text":"I went here with a group of 8 for a bachelorette party. The venue offered a good vibe and ","useful":1,"cool":0},"cGqQ-jOaaQSq1fbDy76kDg":{"text":"The best spot on Jackson Square!  Somehow Muriel's neighboring restaurants always steal th","useful":1,"cool":1},"qJ8-5fogH8ofO_k3wbl7HA":{"text":"I felt like this was a hidden gem because it wasn't crowded at all, but I highly recommend","useful":0,"cool":0},"5WbRnQvcuzZONz_2JhKE3A":{"text":"There was good and there was bad with this restaurant. Firstly it's a beautiful building a","useful":1,"cool":0},"OzFp6WEKvpb_B6I2u0rsAA":{"text":"For whatever reason I've never been able to get to Muriels but thanks to an invite from a ","useful":5,"cool":3},"SIWI3fs8Hf5Umwr4HgI50A":{"text":"I was in search of the BEST bread pudding in New Orleans. I finally found it here at Murie","useful":0,"cool":0},"9IeunZdVC4sOT0MkoV2ZRw":{"text":"Made reservations for two and we were seated promptly when we checked in. We found the sta","useful":0,"cool":0},"MTxWKJf6lbHuHzrYNTqeeQ":{"text":"Crepes of seafood and goat cheese were delicious.  The seafood gumbo was good as was the B","useful":0,"cool":0},"swH8TCpcr3CUTZ-AGWCTqw":{"text":"Great food and atmosphere. Service was ok. We had two servers but neither ever took our dr","useful":0,"cool":0},"409BCAP34TQlM5Wc47wKAQ":{"text":"Katie was our server and gary handled drinks. Both were fantastic. Wr went for my girlfrie","useful":1,"cool":0},"zPn44Xj7fCIjD6a2p_Wh2A":{"text":"When I say I have never had a better experience with a waitress, Shannon is the best. We s","useful":0,"cool":0},"2j89C43KFvK5aAy_e4HKiw":{"text":"Absolutely delicious food for all courses.  Great wait staff.  Overall excellent experienc","useful":0,"cool":0},"6r2Nvv6kHEcA10NvNTduHQ":{"text":"This was my first dinner in New Orleans. I came here knowing I wanted to try the turtle so","useful":0,"cool":0},"YTWp3DLTFyapAZyIMEfBUg":{"text":"App\nSavory Gorgonzola Cheesecake \nShrimp Crepes\n\nBoth were amazing! \n\nEntree\nPorkchop\nShri","useful":0,"cool":0},"XWosCgLnX5ZcT2KsRQoa1w":{"text":"Always an OUTSTANDING experience! Never disappointed. Could not ask for a better dining ex","useful":2,"cool":1},"jw5qH38pqyVLmEE9Fj2IhA":{"text":"Not sure what the hype was all about. This is a beautiful restaurant on Jackson square wit","useful":0,"cool":0},"jXNUv88UHaf6EKQwhrdTpA":{"text":"Came for my birthday and took my parents here for a holiday dinner. Both times excellent! ","useful":0,"cool":0},"IGBGCuR5VlM-6NDrvoGHvA":{"text":"Definitely during my trip this was absolutely a fan fave. Such a favorite I dined here 2 n","useful":3,"cool":1},"hwGdER_Kptem8SAYuQ3-PQ":{"text":"Good food & great service! Loved the inside decor also! Very fitting for Old Style New Orl","useful":0,"cool":0},"PMybFLqoAJ-iwcRobvGtvA":{"text":"Muriel's is amazing! The food, the fabulous bar, the Seance Room!\nI've been here several t","useful":1,"cool":1},"ZeNDzKDvy0W-qI3I3dCdWA":{"text":"Blah.","useful":0,"cool":0},"92WN58Qb9Mrh6xAOTx8VAw":{"text":"We made reservations for After graduation brunch and sat on the balcony. The shrimp and gr","useful":0,"cool":0},"O8Lu0kyIFVox1Uq4PJ-u4A":{"text":"Visited Muriel's for Sunday Jazz Brunch on a recent trip to NOLA and enjoyed it very much.","useful":0,"cool":0},"JPHYmTJPQa59U-32e9j0gQ":{"text":"Great place located right on Jackson Square.  The 3-course creole menu was fantastic.  I h","useful":0,"cool":0},"c4lMT5is3JJPT012TZg2Bg":{"text":"The best meal I had in New Orleans, and it wasn't even close!\n\nWe came into Muriel's for b","useful":1,"cool":0},"mpRxsH2s0FLF8sm2OMRANw":{"text":"One of the better choices in New Orleans. Can be hit or miss but overall I had a wonderful","useful":0,"cool":0},"on2itgVjCUTTyg_XB0RGVg":{"text":"Visiting NOLA on business and dined here for brunch.  The food was absolutely delicious an","useful":0,"cool":0},"v8ne84eCkaXnL9G9QGfDDQ":{"text":"Really overpriced and not very good. Small portions for the price. Pretty limited menu. Gr","useful":0,"cool":0},"v0cR_hJPNi7eE7TI6G-RqQ":{"text":"Such a fun atmosphere! We had one of Our leading ladies leaque lunches here. Theme was old","useful":0,"cool":0},"dHWvbDsogLFCatt89TI9SQ":{"text":"Had Sunday brunch here with the family.  Great food and service.  This place has a lot of ","useful":0,"cool":1},"PlyDuzhYrIIPKKMDUznRZg":{"text":"If you ever want to experience the ultimate southern hospitality, you need to come to Muri","useful":0,"cool":0},"iB9O5uCcNSTy799gaO4n3A":{"text":"Loved this place!! Adorable atmosphere. Wonderful staff, we really enjoyed ourself.  The b","useful":0,"cool":0},"SgHrAUQOSqqTG3Gpeid1UA":{"text":"Crawfish and goat cheese crepes!","useful":0,"cool":0},"edioKTJRuB2mnSfgVDmCag":{"text":"The concierge at our hotel recommended Muriel's and we tried it on our first night.  The r","useful":0,"cool":0},"rSTdOx-JkwJU-WDS3FCFZw":{"text":"One of my favorite restaurants in New Orleans. The salads, the entrées everything is amazi","useful":1,"cool":1},"wB9gwOM8fLF1XoZRVMGoAA":{"text":"My friend and I decided to eat at this restaurant after going on a haunted house tour and ","useful":0,"cool":0},"XiXgYkY1UPA0KHELGu8Jkg":{"text":"This is usually one of my go to favorite places in Jackson Square...but I went yesterday a","useful":0,"cool":0},"fCoRNQrjGvJ1jHr_MVtEvg":{"text":"The best food I've had in New Orleans so far! The soup of the day was shrimp bisque and it","useful":0,"cool":0},"55ZHsTbfO96LfnMP-XGH8g":{"text":"Dinner here last night. Had the price fix menu. Outstanding! The atmosphere was great afte","useful":3,"cool":1},"U3J7NRirbI8RhRfZXpN4iA":{"text":"Having been either on-call or out-of-town, in Texas or Florida; we needed a Muriel's \"fix\"","useful":0,"cool":0},"KWguN0Ch1NK3TEmwUmMOVw":{"text":"Visiting from California Muriel's was recommended to us by a local! So glad we checked it ","useful":0,"cool":0},"EjN1QdQHW35JY8sGfseSQw":{"text":"Excelente pedida! Escolhemos o lugar para o jantar, muito agradável! Boa comida! Pessoas a","useful":0,"cool":0},"MGGoi_UK2_eZlrPtXfMPZA":{"text":"My husband and I walked in to escape the 100 degree weather and left very satisfied, betwe","useful":0,"cool":0},"ojbkxcjMotDnU1rFVmv0iA":{"text":"At least once in their life, everyone should partake in the pleasure that is a jazz brunch","useful":11,"cool":5},"rqUQPG8LbOignzOIOIDrTA":{"text":"My boyfriend and I decided to drop in to grab a quick drink and are so pleased we did! Nic","useful":0,"cool":0},"FhjaN6gFz4qaKqUQqBNhXg":{"text":"My best dining experience in New Orleans overall, and that's saying quite a lot since I at","useful":0,"cool":0},"UmnOjL0TJLeW-AoJFDzFRw":{"text":"This is one of those places when you never know what you might want but no matter what it ","useful":0,"cool":0},"eiTfUpQbUt56bu92JMYlRA":{"text":"My first thought when approaching the restaurant is that this will be another tourist trap","useful":0,"cool":0},"9crZa07as8otESuCDWlUxQ":{"text":"We enjoyed our dinner at Muriel's and glad we went. A lot of history in this establishment","useful":1,"cool":0},"bxrVX_IaRwprUAY9CigDIg":{"text":"Loved this place! Went for their Sunday brunch... omelet was fantastic! Pair that with sev","useful":0,"cool":0},"M2y0QNcfN-hjpQK5vNg1zw":{"text":"Enjoyed our dinner- delicious appetizers and entrees. Great service. Took our temps before","useful":0,"cool":0},"ieMFUCYceQS1ARGF5z4gXg":{"text":"Would highly recommend if you are looking for a nice dinner in the French quarter. With al","useful":0,"cool":1},"wrSUEDVhAOF3XxWoX_Incw":{"text":"This historic restaurant serves classic New Orleans dishes.  Each room is so diverse.  The","useful":4,"cool":1},"ww2a2rPuTtdtuHVjJ43FpA":{"text":"I really enjoyed my meal at Muriel's. I had the Blackened Mississippi Catfish and it was a","useful":0,"cool":0},"i5X9T62R1ISVn6XVJjazgg":{"text":"Every time I go to New Orleans, I must come here. I think i have tried everything on their","useful":0,"cool":0},"k55Fp3XsfjTEGBGic-WiOw":{"text":"Attended a wedding reception in the space upstairs. Food and service were top notch, as wa","useful":0,"cool":0},"gS-uy3kW-E1N-lcG-y-xZQ":{"text":"Sorry, Muriel. I'm knocking you down a notch. We visited you for lunch, dinner, and a few ","useful":1,"cool":1},"QtleQVRTnb_b3H8zFxRHtQ":{"text":"Best lunch menu in the quarter. Reservations can be made on OpenTable. There's a fixed men","useful":2,"cool":3},"e3fKMfU22ITNt7MadNSQSw":{"text":"We went for their Thanksgiving prix-fixed menu. We were seated promptly in the big main di","useful":1,"cool":1},"T8CrRIOkUwHMhhaCvvY10w":{"text":"The soup of the day, cauliflower and Shrimp bisque ,was very hearty.  The shrimp & goat cr","useful":1,"cool":0},"7OwiRPGrI90h1_CzW7Zbgw":{"text":"Ok so this place is a great find. Let's start with how amazing the staff is. Easly the bes","useful":0,"cool":1},"tM8IAW7R6GFteQ99QZGCTA":{"text":"Exceptional food and service. We were in town from Florida for the Bills / Saints game, as","useful":0,"cool":0},"4AdJLWveojsCvKS53SihLQ":{"text":"I had a bunch of ladies come in town for a bachelorette party and we wanted to have a nice","useful":1,"cool":0},"5E5M3Yl7neNbj6ZrEDS4Iw":{"text":"Second time here and I have to say, this place is magnificent! Ask for Alek and Jason, gre","useful":0,"cool":0},"XrxA_7zExJR1rIoUgXH_WQ":{"text":"UMM, this was hands-down my best meal in the quarter, and I probably went to about 10 diff","useful":0,"cool":0},"UZp0_VcYXqOllRJT3KgqDg":{"text":"Elegant and historic, Muriel's epitomizes the French Quarter fine dining experience, yet m","useful":4,"cool":5},"41LS1Vop7L8qmBncJ_zmOg":{"text":"I really wanted to like this better than anticipated.  First and foremost, our service was","useful":20,"cool":12},"ExTC4kIp0ZErCRZ2_QrS3g":{"text":"Adorable place with live music for brunch! The shrimp and grits is to die for and we left ","useful":1,"cool":1},"EHA6AukBLOS_rVEN66R9jw":{"text":"I've been to New Orleans many times and can't believe I've missed this jewel!  Exceptional","useful":0,"cool":0},"yougDN2W1OHTY6FTopdcjg":{"text":"Heart of the French Quarter\n\nIf you are looking for a truly satisfying classic New Orleans","useful":3,"cool":3},"SFwyJbBxDGu5L3jIdhOmCQ":{"text":"Passing through Nola, we know we needed to stop here for another great meal.  They did not","useful":1,"cool":0},"5cnBorrtNAjI86xh8mBodw":{"text":"Sooo yummy! Salmon was perfectly cooked. Bread pudding was our waiter's suggestion, and it","useful":0,"cool":0},"z2dAbFRXusIZdVrK_TMraw":{"text":"The bananas foster was amazing! Had the blackened drum special, which was good but the fis","useful":0,"cool":0},"QrnKSgFC-DDy7OllYMeEvA":{"text":"Muriel's was a recommendation from our hotel.  I had called them a week earlier to make re","useful":0,"cool":0},"qHdZcEgGPK4ChJ-8XAzEQg":{"text":"During the trip to Mardi Gras, I made up a list of places for me and my friends to eat at,","useful":4,"cool":2},"iHVfhXdEfP7fLgprfQpxcw":{"text":"Happy Birthday to MEEEEEEEEEEE!\n\nOn my 29th (omg I'm how old?!) birthday the sweetest man ","useful":4,"cool":2},"wQ4bkXpVVHu6-JqaMg78GQ":{"text":"Mother's Day preset menu was ok. There were 5 choices. One was trout with crabmeat on top.","useful":0,"cool":0},"fPt_AeG39P3z-P1lJpKtoQ":{"text":"Came to Muriel's with a reason to celebrate...left stuffed and feeling content. \n\nMuriel's","useful":2,"cool":2},"17ZGh7dP0puogZXy2lOZUQ":{"text":"We had the best drinks at the bar in Muriels! Our bartender, Mary, (turns out was the bar ","useful":0,"cool":0},"tK0iKiGe1fq4j4pY8JbCUA":{"text":"I vaguely remember Muriel's back in the day and thought it was meh.  Well, I stand correct","useful":7,"cool":4},"rqSpI00dyooQhcrBKn7vZw":{"text":"The food was good. Nothing to rave about, but I have no complaints about it. The host was ","useful":0,"cool":0},"R1bXDpY4KjD2vULF1o3QIg":{"text":"Amazing Thanksgiving lunch! Wait staff was superb! Very nice welcome from Randy and the fo","useful":0,"cool":0},"dmSSPgYXVMX8fFLEEzxpPw":{"text":"This might be my favorite spot during my extended weekend in NoLa!\n\nI came here with my pa","useful":1,"cool":1},"m9MkqChXwnFSURCDj5GcDQ":{"text":"Si vous cherchez un excellent restaurant à la Nouvelle Orléans, Muriel's est l'endroit où ","useful":0,"cool":0},"o8n2soTXNRDdxrmQMpmQ5w":{"text":"I had never been to Muriel's before. We came in for a lunch with no reservation on our las","useful":1,"cool":1},"qehsfnAXcb-t0oVgha-tCw":{"text":"an easy pick for a first taste of Nola. creole food in a classic cast-iron balconied townh","useful":2,"cool":2},"7aK-P86FGUSNUdpRC8srgw":{"text":"We went to Muriel's for Thanksgiving dinner.  The two stars are not for not being able to ","useful":0,"cool":0},"ABUAMsQ2RXYDHgv6PnUmXQ":{"text":"Just wow! Tried this place during the Coolinary and it did not disappoint!! \n\nThe ambiance","useful":3,"cool":5},"cI5XTWT5gyfdc_g9kxXkHw":{"text":"This place was highly recommended by several friends because of the food and they were rig","useful":1,"cool":0},"ZaQ5iCyC8b_jPqHY7NkcOQ":{"text":"Oh man, my friend recommended the place to me, and I am so glad we went.  Made a reservati","useful":1,"cool":1},"LsBMjVnXRw_GSPaMHRPU5Q":{"text":"This place was not good. Overpriced tourist place. \nThey didn't have a lot of the food in ","useful":1,"cool":0},"YSax_4Ew9ePC60u14qRvOw":{"text":"Fantastic food in a gorgeous historic setting. I was there with a fairly large student gro","useful":0,"cool":0},"JCUo7R28_vkDwtbiwG1hBg":{"text":"Hands down best meal I've ever had. The restaurant has a an amazing story. I was in awe of","useful":1,"cool":1},"cLLIQyxBE0Ap2RL3HI2wAQ":{"text":"The catfish was delectable, and so was the shrimp/cauliflower bisque. Service was friendly","useful":1,"cool":0},"2b43rmmiEmgjzTHDARcSzg":{"text":"I've eaten here many times and had many private events here.  I have always had a great ti","useful":10,"cool":4},"tFsut_5u4IZBsV5S_FP9PQ":{"text":"Muriels should be the choice for either brunch dinner regardless what you feel like eating","useful":3,"cool":2},"NlDDpWz5Oyw9k_CHnvPL-w":{"text":"I have been to Muriel's many times, and I always thought it was just average... but this l","useful":5,"cool":0},"KUKmtvp8WyW4mHDQUdx-Kw":{"text":"Want to experience a 10/10 NOLA food experience, this is the go to spot. It was a short wa","useful":0,"cool":0},"6jZRim0w2HUjyZXtXTLocw":{"text":"We had the double bone in and smoked pork chop, settled on a bed of smoked cream corn with","useful":0,"cool":0},"W-7ik2y89FbysS3e7AEung":{"text":"Don't try and go without a reservation. The place was full but well staffed. The ambiance ","useful":0,"cool":0},"pLi4KfiNFJpDXuOsklpn1Q":{"text":"Muriel's is delicious! A cute upscale restaurant that serves fresh, authentic New Orleans ","useful":1,"cool":1},"i5BsdrCuxn9R7jPTzmbYDA":{"text":"One dish...I'm rating a restaurant on a single dish; and an appetizer/ festival food at th","useful":1,"cool":0},"32RF5SelQZllyjrBdtBGXQ":{"text":"A+ plus A+ drink A+service Beautiful restaurant  My always come back to place","useful":0,"cool":0},"6Mk2vNkJrrjeElF7HVSd4Q":{"text":"Only came in for apps and wine.  Wasn't blown away but everything was decent.  The favorit","useful":2,"cool":0},"rXP85UyiyTZyYJ-c_hrx9A":{"text":"We recently had a terrific lunch at this excellent restaurant. It has fabulous food, great","useful":0,"cool":0},"PFebZNi1qSMo7vJucYY1AQ":{"text":"I've dined here for both dinner and brunch, and both were very good. The food is tradition","useful":4,"cool":2},"TOsftHVLFisupyX2FCYSLA":{"text":"Want a dining experience that'll blow you away? Go visit Muriel's Jackson Square! We went ","useful":0,"cool":0},"30UL-wqVCoLLJA6NgOGe8A":{"text":"I enjoyed my salad. The fish was OK, but nothing special. The service was good.\nWe would n","useful":1,"cool":1},"cvfQzC1IrSd0YOES-1182w":{"text":"Came here with my sisters and friends to celebrate my sisters 30th birthday. First things ","useful":3,"cool":3},"uGskWihB8LV2Bk--nnblGA":{"text":"A pretty classy looking place but most people came in dressed casual. You can tell there's","useful":3,"cool":1},"MC9lTKK_ksLREEnU1WHrYQ":{"text":"Amazing service food and drinks. The 45.00 menu was amazing and worth way more. Mary at th","useful":0,"cool":0},"Gp9TeA0whXxc6y9xHkr77A":{"text":"This place was fantastic. A large group of us came down from Buffalo for Thanksgiving, and","useful":1,"cool":0},"7vByt4_EboN_8p-QrPJUOA":{"text":"This is a review of a wedding reception that I attended here.\n\nI had never eaten at Muriel","useful":11,"cool":5},"F4q60n5LRwbnd_jz5t2-pA":{"text":"Delicious milk punch.  Bad wine.  Bad sazerac.  Good service.  Freezing inside. Really lum","useful":0,"cool":0},"yt7oXJ314nKLBJhrmj6rYg":{"text":"After reading some Yelp reviews, I made reservations for Sunday brunch at Muriel's online ","useful":3,"cool":2},"_HDdpFGokvaz6cp9oh_8Tg":{"text":"Stopped here for Sunday brunch February 21, it was easy to find, and a great location. Ser","useful":1,"cool":1},"Xr3anG2NMZGJkyn9G8-AXQ":{"text":"One of the most elegant, classy and traditional restaurants in New Orleans. I have been ea","useful":0,"cool":0},"oeguDKs3mf_ilwZLLwJGbA":{"text":"Truly amazing! The service was fantastic and the food truly amazing! If you like eggs Bene","useful":2,"cool":0},"zvhm3FBR_na8wLXHlsEnBg":{"text":"This place was absolutely wonderful there wasnt one thing that i did not love! The view on","useful":3,"cool":3},"rPOOMEfdXDmGl5rV3zI6qA":{"text":"Well it's been 2 years since our last visit to New Orleans.  One of our must visit restaur","useful":2,"cool":1},"d0FvE5nqr7jewiIUdODseg":{"text":"Love this place!!  Wonderful small rooms with lots of character. Beautiful long bar, neat ","useful":1,"cool":2},"4bCmHVjwB7s29-pdaYTQ-Q":{"text":"Muriel's was an amazing spot to eat at while visiting NOLA. 1) easy to make a reservation,","useful":0,"cool":0},"_EavfOvf-854ZnUqLAJACA":{"text":"The food was fine by New Orleans standards (I'm a native, so, yes I have spent my 10,000 h","useful":0,"cool":0},"RluMFP0WE2YDOZGPI3U6AQ":{"text":"Yum!\n\nMy friend and I were visiting for the weekend and had planned on attending Sunday Ja","useful":1,"cool":0},"OdRf2VcOY-R8tYjou0HOFw":{"text":"This is the best restaurant in all of New Orleans, without a doubt. If you can only eat at","useful":0,"cool":0},"0nYW5bE2I-cYPUNdzkGNZA":{"text":"Came here with my girlfriend and we enjoyed ourselves. \n\nThe ambiance is nice and the food","useful":0,"cool":1},"lzGyAC7T1j_c0pQ4iH52pQ":{"text":"I have an adult daughter and she has a particular food allergy and is particular about how","useful":0,"cool":0},"B0KOroMIuT6Xm-NXEQD0Qw":{"text":"The wait was short, the food good and the crowd boisterous. \n\nIt's a nice restaurant to go","useful":1,"cool":1},"Prw7k9gn5No4wNxngfv27A":{"text":"Great appetizers! Crab cake deliciousness as well as the crawfish and goat cheese crepes. ","useful":1,"cool":1},"hRayuJIy3EceKhnrsel59w":{"text":"5 plus stars for the food...in fact I'd give 8. Service was a tad bit cold. \n\nLet me start","useful":1,"cool":1},"4e0g-ZE1pBn3znObYs6IVQ":{"text":"Ok. Here's the deal- love this place. For SO many reasons. The building is gorgeous (make ","useful":0,"cool":1},"cdezR2ZyuYrBZaTFkOwaPg":{"text":"Pretty good dinner I had here recently. This place is pretty nice! I went here for a frien","useful":5,"cool":8},"T78vT9kBmys5L7TWY_d9qw":{"text":"Muriel's was a surprise for me, because of it's uber touristy location right on Jackson sq","useful":2,"cool":2},"rOpkWBVt1dlsyBYgsoIZKA":{"text":"Highly recommend everyone go to Murial's for Happy Hour! We only had drinks, no food. But ","useful":1,"cool":1},"iNcgInBMjjK1PmSm8tKcsw":{"text":"Definitely go here for brunch. Be sure to make a reservation. Vegetarian friendly. Muriel'","useful":3,"cool":1},"4RR3lMqTiXjY5Yz6Uhd9QA":{"text":"Absolutely loved this restaurant. Great location, unique interior decor, friendly staff an","useful":0,"cool":0},"1JlsuMd97_5weSPWUEw5ew":{"text":"Came for the bread pudding reviews , after having a terrible dinner experience at another ","useful":0,"cool":0},"NJfy5bdKGJLXIYGPUAwHfg":{"text":"Awesome food and service. We all had Prix-Fixe meals for $29 and they were great. Excellen","useful":3,"cool":1},"mbwy1GZNG41_oF6s21WL7w":{"text":"Great place to eat. The Vibe is very Victorian.  No hats can be worn while eating which wa","useful":0,"cool":0},"K_MbdFbMwNXtTFsIaa6YtQ":{"text":"Great restaurant with AMAZING service! Highly recommend stopping by if you're in New Orlea","useful":0,"cool":0},"ZFAclDvb91ilJST_ID_V4A":{"text":"We came for a Sunday girls brunch. It's so fun to have live jazz during brunch!\n\nEverythin","useful":0,"cool":0},"4hzl_1npG-F1MSYbUREVog":{"text":"Had light brunch at Muriel's this AM with Granddaughter Caroline, of Dallas.  didn't reali","useful":2,"cool":1},"3Emjr3Hj41e4vo2hJDeAaA":{"text":"Maybe I'm being a bit generous due to the fact that we were able to get a late-lunch table","useful":1,"cool":1},"gcfRAC1B3VL6i-qixocCtQ":{"text":"The food was amazing! Especially the shrimp and grits. Wait staff was fantastic. Fun stuff","useful":0,"cool":0},"b1Ipv5clEuN86V7nkWhfcg":{"text":"Celebrated our 31st anniversary here 7/14/21. This was one of the best meals we have ever ","useful":0,"cool":0},"LVQXhkEJiiDQpL8_39Yksg":{"text":"Brought the in-laws here last night for a wonderfully special, very New Orleans-y dinner-t","useful":1,"cool":0},"kBi5bT5eESQBNnoQceegeQ":{"text":"We have been to Muriel's twice before and had a really great time! Cocktails were on point","useful":0,"cool":0},"spmKv0XdSSElqfnC40BPGQ":{"text":"There for brunch.  Food was incredible, service not so much.  However the manager came ove","useful":1,"cool":1},"eXUj8Qwe4e7gM3-qM-onuA":{"text":"Wow let me start by saying this was hands down the best meal we had. All around amazing se","useful":1,"cool":1},"XXqDFhQo6Vi_8BZreLahqg":{"text":"Wow! Fine dinning done right. Awesome location and the best pork chops I have ever had. We","useful":0,"cool":0},"KGyq1SKitQGg2uaKM6ORPg":{"text":"For my 1100th review, I review the iconic Muriel's Jackson Square, one of the loveliest re","useful":18,"cool":14},"tmCBYG0NRjS4TOidEnHP8g":{"text":"Muriel's never disappoints. Our most recent visit was the first night of Coolinary 2021. I","useful":0,"cool":0},"pBOYNW374VqgJqOWGElnEA":{"text":"I went here for a bachelorette party and it was exceptional! My party was running late so ","useful":0,"cool":0},"VanFLxi2oRu5ReSXZb-UuQ":{"text":"Came for my 70th birthday, it was just wonderful...Loved the overall ambiance of this plac","useful":0,"cool":0},"nAbd4pYo8ssezLSYAGobog":{"text":"Great food, great service the turtle soup was to die for even my wife enjoyed it, The file","useful":0,"cool":1},"baQF9Mi9ZjeSdyAElgIrBw":{"text":"Exceptional meal! The turtle soup and grilled tuna did not disappoint. The service was imp","useful":0,"cool":0},"E5dqcrZ1915BhageTebkWw":{"text":"My best friend and I were wandering around Jackson Square and stumbled upon Muriels. This ","useful":0,"cool":0},"4_Rp54RVj8ZryAopFtVVAA":{"text":"It was Sunday evening in NOLA, which means a visit to Muriel's was necessary. A. to see th","useful":12,"cool":12},"YQ5y1g2y4z2VA8wGDv8EUA":{"text":"Beautiful restaurant at an iconic location. App was Duck Brioche and Escargot. Both were h","useful":0,"cool":0},"mPeJK0Sa6ECcajT5Xh_-gw":{"text":"This place is so cool, where do I start, this will be a long review. First of all, it's fr","useful":1,"cool":0},"hVvqDJGoONI-f0R8fvxUzQ":{"text":"Love this place, everything was excellent. I've been twice now and will be back again. The","useful":2,"cool":0},"U3zqakv9mqy5DncAmKNehQ":{"text":"Had a delicious Restaurant Week dinner. Pre-gamed at the bar; the bartenders were great! H","useful":1,"cool":0},"4Zdr3jjui5BCSKtVjAd6Ig":{"text":"So unfortunately it's been a few months since I posted after eating here but if you're eve","useful":1,"cool":1},"UE4T9K4ne8A57GeqIDGlSw":{"text":"I never come to New Orleans without stopping here!  Everything on the menu is great.  This","useful":0,"cool":0},"G0EW6dGD_aN8BR-rAQE5-g":{"text":"Very beautiful, historical, likely haunted restaurant right in Jackson Square. We loved ta","useful":1,"cool":1},"eHJEmKfYTK5MSDB8-SSHPQ":{"text":"Without a doubt, one of the best...Everything was just delicious..\nloved the atmosphere, w","useful":0,"cool":0},"cPaJytk6G-TlEPfy2aGzzQ":{"text":"Went to Muriel's Jackson Square for dinner last week in New Orleans it was safe clean and ","useful":0,"cool":0},"aI0ELKXJSQCCIYCqwK_aFw":{"text":"My friend and I made a reservation for Muriel's after reading about the Sunday brunch. Now","useful":3,"cool":1},"DwS_rqN9Df3Wv1AioSBeRg":{"text":"Muriel's has been the best meal on this trip, hands down..  This is my second time in NOLA","useful":0,"cool":1},"d1rO1HxZRqLjbzOnMFyzqA":{"text":"I feel like our experience might be an outlier, as this is a nice restaurant (very beautif","useful":0,"cool":0},"ma1oTwZPVRgUmT8hajNXyw":{"text":"I have no idea how this place has such good reviews, the salmon was 1000% raw in the middl","useful":0,"cool":0},"jPangiqRLRM8SQOswpTQwQ":{"text":"Can't believe the pork chop.  Perfectly equalized bass mids and treble.  Excellent service","useful":0,"cool":0},"7x-4eIALx_Jykwd28aagPw":{"text":"I was a bit disappointed with the lack of customer service. I had a 9pm reservation yester","useful":1,"cool":0},"DKG0Keo49xfIvfZzRX6qXQ":{"text":"Ordered pork chops and they were AMAZING as were the goat cheese crepes.. everything else ","useful":1,"cool":1},"_LsDboSZ4ltEncDSM9OxkQ":{"text":"The atmosphere is beautiful, the location is key. They are close to bourbon street.  The s","useful":0,"cool":0},"fokE7QwCZJb1C4xNx-Epww":{"text":"First time I had heard of this restaurant was on a ghost tour over three years ago, they s","useful":0,"cool":0},"_KQDwhRcfy0UeyH_w60GEw":{"text":"The food was fine, although pricey. Our service was bizarre.  Really? The food waiter won'","useful":2,"cool":1},"bAYfhEN-nPr038I1BeHArw":{"text":"Excellent food .. we had the seafood gumbo and salad .. both were great \n\nWe also tried th","useful":0,"cool":0},"5PqKI84_V9KiIFFYbWXf4g":{"text":"Nice ambience! Went for a birthday dinner. You can do a La carte or 3 course menus for $40","useful":0,"cool":0},"JReGYwuMpujPFQkV2IJRsw":{"text":"YANKEE CREOLE: watered-down \"Michiganized\" dishes, without spice or heat. In 10 or so year","useful":7,"cool":3},"VHsPGAgs79560eEjVNhzOA":{"text":"They refused to honor my reservation because I have a service dog (not an emotional suppor","useful":1,"cool":0},"qiH8aGOgKbM1Ik7WFt59Cg":{"text":"Had brunch on Sunday morning! Live jazz music was being played by a band inside.  We had m","useful":0,"cool":0},"JQBzBRsSnBTc-8Q0hMvSRQ":{"text":"My family had dinner at Muriel's Jackson Square on Saturday, June 8, 2019.  Both my wife a","useful":1,"cool":0},"lKL6cNRdMXKMseBN8KD7Lw":{"text":"Great meal for New Year's Eve. Staff was very friendly, wine list was very appetizing. Wis","useful":0,"cool":0},"582LFY1jcHQH7-XxuSJxRQ":{"text":"This place is awesome! Delicious food, great service, nice decor, and good prices. They ha","useful":0,"cool":0},"9igNxYiCwSGd_B8YEDTiWA":{"text":"This is one of our favorite restaurants in the French Quarter. It's very classy, perfectly","useful":2,"cool":0},"5DWEojMJwG_iM_KS9-p89A":{"text":"Food was real tasty .... service was \"ok\" but what turned this into a  3 star was the one ","useful":0,"cool":0},"UglKdiW4CMM_yNiO98L9FA":{"text":"We loved everything about this place. Gorgeous decor and amazing service. The waiters were","useful":1,"cool":0},"5kvECtNkMeRdtNfDj9vmVw":{"text":"Muriel's was well worth the 1.5 hour wait.  We were unable to get a reservation earlier in","useful":0,"cool":0},"3Zg6yeGnq_wv0OEqPimA6Q":{"text":"Discovered this gem on a Saturday night. Glad we could get a table without reservations. \n","useful":0,"cool":0},"8tHsAAf2TW4hzJ7KKq2WMQ":{"text":"Had a wonderful Sunday Jazz Brunch experience during our recent trip to New Orleans.  Deli","useful":1,"cool":1},"1yuflxYCU9gsP-xUp8M_sQ":{"text":"Of all the places I ate in New Orleans this was by far my favorite!!! The drink we chose w","useful":1,"cool":3},"ZXJnQMbD-Ajv0oV-vVYB_Q":{"text":"My group of friends and I planned on grabbing brunch/lunch at Stanley, but the wait for 6 ","useful":0,"cool":0},"Vo5mufep_RgyGyu9GhtFKg":{"text":"Haunted yumminess! We were doing small bites around the city and had three items here, eac","useful":1,"cool":0},"rZfepk_mj86G0_CAhGIpLA":{"text":"A historical 'haunted' restaurant. The ambiance was very nice. They set a table for the bu","useful":0,"cool":1},"fVmmJcKaSl0wNQe0xKCMuQ":{"text":"The cocktail drinks, the food abs the service was scrumptious! So absolutely delicious and","useful":0,"cool":0},"aL3sy6bG_QGQrk0eBngaCw":{"text":"This place is raves about by so many- I was a little disappointed. Service was slow - prob","useful":0,"cool":0},"vnGOfZUEBHCLj38VXoMWPQ":{"text":"We were looking for a special night out on a Sister's trip and this certainly fit the bill","useful":0,"cool":0},"-NiC2iMPb6jDbE9p5CQgWA":{"text":"Went for a celebratory dinner the first weekend of August.  Very glad we went!  Every dish","useful":0,"cool":0},"fTytLqjA0TP6M3vV-ZkZhw":{"text":"We heard about this restaurant from multiple locals.  After hearing it was haunted we real","useful":0,"cool":0},"zL7Ts417HWGqYRpJj-F95g":{"text":"The best meal I have had in a long time!!! The goat cheese crawfish crepe appetizer was th","useful":1,"cool":0},"G4aHx96Ucj6yKDvf5_WrnQ":{"text":"We had an odd dinner up the street and came in for a few cocktails in order to unwind. Mat","useful":1,"cool":1},"DjX_uqTpxWyy8ISSCzwo8A":{"text":"Not often you get to eat at a haunted restaurant. Muriel's was cute spot to have dinner an","useful":0,"cool":0},"rpcNwVL7xCOq-YAv2NYRUQ":{"text":"The BEST!   The food is amazing and the service is perfection.   We had a party of six and","useful":0,"cool":0},"s3HbPQ9UMG2_1StA7ivlKw":{"text":"Phisticated Elegance...\nAfter showing proof of \"The Stab\", we were escorted to our awaitin","useful":1,"cool":1},"1rBA978fA6RsA3AVG6pczA":{"text":"I brought someone new this time, and he loved it as well as my last companion.  The roaste","useful":0,"cool":1},"vNVf2Z-lhE_fqoyYRzixJg":{"text":"This was probably the best meal that I have ever eaten and the service was excellent too. ","useful":0,"cool":0},"XQzu1UdXX99E8qvTTgRwNw":{"text":"Amazing food. Very rich and tasty meal. Wait staff were sweet and funny. Definite gem of t","useful":0,"cool":0},"tZvPepzOWj7A6AxWtXiAHw":{"text":"I made a reservation to eat here for my birthday which fell on New Years Eve. The restaura","useful":1,"cool":0},"9moMAmZp2pX3HiYlQgKuGw":{"text":"My friends and I flew to New Orleans last weekend from New York. We had the most pleasant ","useful":0,"cool":0},"oYxOxNIbtrVgcnXDIXeX7A":{"text":"Very Good restaurant overall.\nAttentive service.\nPleasant atmosphere.\nWould go back...\n\nJi","useful":0,"cool":0},"yMCsjO6HjISlBXzkEinYPA":{"text":"We did this restaurant on our last night in New Orleans, and it was the best food of the t","useful":0,"cool":0},"XPbvHXAZHn9Kb_9Rp2tnIg":{"text":"When I visited New Orleans, Muriel's Jackson Square was my first stop (well, after my hote","useful":5,"cool":3},"jk7MxwjKIvICjZtTufcO9w":{"text":"I had looked at reviews for several places, because while we were in NOLA on our very shor","useful":0,"cool":0},"Mn7CkXl3U9aVuY3cIZ48XQ":{"text":"Took some people here for a business lunch on a Thursday.  Although I made a reservation, ","useful":2,"cool":0},"YrS2aWn3_tRCxJIJ4ITOGg":{"text":"Ordered a Sazerac, shrimp & gnocchi, and grilled tuna. Food and service were both great. N","useful":0,"cool":0},"O05s4pu7EbH-eRn_IXudmA":{"text":"My husband and I came here during our trip to NOLA upon a recommendation from a coworker. ","useful":0,"cool":0},"5vvt8N1tzMFZGoML77Od8w":{"text":"Go Early and Enjoy the Balcony Overlooking Jackson Square!\n\nYou will definitely want to ma","useful":1,"cool":0},"g5SEQzRV9cHuRv9i6cRCrA":{"text":"Absolutely amazing food.. I had turtle soup, peanut butter chocolate dome, steak, and I th","useful":0,"cool":0},"3qhNnR_gstUlOxZO2Z4JWw":{"text":"This place is just lovely! Very quintessential upscale New Orleans with the exposed brick,","useful":12,"cool":8},"qlcAvN3iaUcdpCLRs-_C_g":{"text":"My girlfriend and I came here for a drink and some dessert. The dessert was good but nothi","useful":0,"cool":0},"KchjVcdAIpLIWlyYVt4jNA":{"text":"Lali, Hannah, Alexandra, Lee, & I dined at Muriel's last evening; to mark closure of mourn","useful":1,"cool":0},"ussQLT_VPrTjWkMI2vdaKw":{"text":"Early dinner (5:30pm) for four.  Walked in without a reservation and were seated promptly.","useful":0,"cool":0},"h96rZLzibchMNZhmAKAHyA":{"text":"The food here is hit and miss. The kitchen had an issue with its timeliness of courses, wa","useful":0,"cool":0},"DheYUN4PkdO1Nu07KmC5yQ":{"text":"Setting the scene:  Walking up the candle lit stairs to chanting music with a glass of red","useful":3,"cool":1},"8NLb7F9es2mEMkM8ovESOA":{"text":"We always indulge in Muriel's for Sunday Jazz brunch when we are in NOLA. It's a bit touri","useful":0,"cool":0},"mjDybVkoMQprghVvRpqA7A":{"text":"Location was great and food was even better. This was by far my favorite restaurant in New","useful":0,"cool":0},"7aYC6EzgKHl9JyHOQJpgrQ":{"text":"Solid fare. Ordered the duck gumbo and shrimp And grits. Both dishes had layers of flavors","useful":0,"cool":0},"GAhUGzIYnfFPrZXqawri6A":{"text":"A HUGE DISAPPOINTMENT! I took my girlfriend and her brother here for my girlfriend's birth","useful":0,"cool":0},"wIq2-o-I827TOUwZ7faPGw":{"text":"Was there for coolinary. Had the wedge salad, fish and life changing bread pudding. This w","useful":0,"cool":0},"FwlIjkftC66J6mBpZuYd_A":{"text":"Epic Sit on the balcony order the onion tart and the shrimp and grits sit back and soak in","useful":0,"cool":0},"-Mr7V4QzI2BMRRhJAJsOdg":{"text":"I'm so glad we decided to reserve this place for brunch on our trip to new orleans. Beauti","useful":0,"cool":0},"5u9UJRsfhXPuSOz2E0xY4Q":{"text":"Ricky and Mike are amazing!!!!!! Such amazing hospitality and personality! Come visit them","useful":0,"cool":0},"fScNY76MxYUGzdasac3gEw":{"text":"Hands down my FAVORITE meal of New Orleans and the competition was stiff!\n\nFrom beginning ","useful":4,"cool":1},"StBa9Ria_1ZnhSqPENSzMw":{"text":"Had made reservations for a slightly more expensive restaurant the night before so honestl","useful":0,"cool":0},"Du5_62mUlRrdpWuYZnlZQw":{"text":"Wonderful restaurant with world-class food. My favorite place to eat when I visit the Big ","useful":0,"cool":0},"sCw_OD-BQBLg_bFLMwgipQ":{"text":"We came here for dinner and decided on their prefixed menu. The dishes were phenomenal! Th","useful":0,"cool":0},"QLM02QpOrrEH-2ekFxQl4Q":{"text":"They have good drinks and the crepes were amazing. Definitely not what I was expecting. Th","useful":0,"cool":0},"gBgAGQ2qkIytTDmAUF1mRg":{"text":"Incredible meal!  Shrimp and grits was fabulous, spouse has chop and loved it.  Service wa","useful":0,"cool":1},"VWSQR2GpHiH9N2WyVcI-4w":{"text":"The food was ok. I had the BBQ grits which had a nice sauce but the grit cake was a bland ","useful":0,"cool":0}}