{"qSk1yA8II1q_bneJjJVH6Q":{"text":"Amazing!!. They had a egg nog daiquiri around Christmas that was out of this world. We jus","useful":0,"cool":0},"AIUFJDECD8je-OkOMVcxSQ":{"text":"It's the wings. It's gotta be the wings! I'm not sure if anyone else who returns to Queeni","useful":0,"cool":0},"TrVVg71Ru_UtqH83zhqpCA":{"text":"Hey y'all do yourself a favor and check out the food the kitchen has been taken over by th","useful":0,"cool":0},"BPZVFMfVtoyuC1R3BefTDQ":{"text":"The best $5 fish fry Friday, delicious batter and fresh fish. Also amazing daiquiris, awes","useful":0,"cool":0},"7ELT3HeKrIA-hz2w2Ah07g":{"text":"There is a new place for daiquiris in town, and that place is Queenies on St. Claude. I ki","useful":5,"cool":4},"j_KKsR7iH6PqhLJsAj6Y-g":{"text":"GREAT CUSTOMER SERVICE!!! I purchase the Blue Chill daiquiri along with the chargrilled oy","useful":4,"cool":1},"qYC5b9DNPO6kTfLg5nQUJQ":{"text":"Queenies is legit my new favorite daiquiri spot. It doesn't hurt that it's right around th","useful":1,"cool":1},"8vQuVxvTdSIPIH8CtEs0WQ":{"text":"Probably the best damn frozen daiquiri I have ever had!! The Mango was to die for and the ","useful":1,"cool":0},"CC6r-Fi8Vk8e3bA3g_5eWA":{"text":"Words cannot describe my beloved Queenie's. Masterpieces in go cups.   Top 5 tacos on the ","useful":0,"cool":0},"J3EyzJrtAh9WPEfjbKtFyA":{"text":"My new fave daq spot.  Watermelon Rita off the hook and the mango flavored one.  tried a p","useful":0,"cool":0},"BX56Uj0aW7XTYqQWalu1zg":{"text":"By far the best daiquiris in New Orleans. Made with all natural produce and locally made b","useful":15,"cool":11},"srVj9_O5rTX5nttHquiMgg":{"text":"\"A place for those who aren't craving something new, fresh, or bespoked. A grill and daiqu","useful":11,"cool":2},"7Tz8bypTglC1d7zrYpg1wg":{"text":"Delicious and so refreshing after a long hot day out in the sun! Owner was very friendly a","useful":1,"cool":1},"W8Rl-cU-D29A-hoVCJGB_A":{"text":"Finally stopped in here after a year of\n'We need to stop'.... BEST daiquiris I've ever had","useful":0,"cool":0},"Xi9COr2OPonnQFjtjZXCmQ":{"text":"Everything we ate was excellent and fresh. They even gave us some cake! Great customer ser","useful":0,"cool":0},"5FGH4QYQO6XSQB9-3Vv4iw":{"text":"Yummy daiquiris and food. The staff is so friendly. Was visiting from out of town and Tara","useful":0,"cool":0},"F50HyCOdClP5eLn7IickBQ":{"text":"Had my first daiquiri here! Great service and even better slushies. Would return the next ","useful":0,"cool":0},"PguFUzWLS5vztXOlLtrNkg":{"text":"I enjoyed this place a lot. Maybe even too much!! There are natural daiquiris. I know you ","useful":5,"cool":2},"bSbtkfzKkyxfmX70j9Vr1g":{"text":"Loved it! The man that took our order was down to earth and friendly as can be. He told us","useful":0,"cool":0},"U7mdn2wcbDwOLkUujHdT1g":{"text":"Delicious and so refreshing after a long hot day out in the sun! Owner was very friendly a","useful":0,"cool":0},"Q5JZcu7Qx9grZRQ-gSrwoQ":{"text":"Really awesome daquiries- not too sweet, and just \"adult\" enough. The food I have tried so","useful":1,"cool":0},"nyVfUaruySnQIR7tPkDU7A":{"text":"Best daiquiris in town! Try the St. Claude Slammer. The owner is lovely and funny. Great m","useful":0,"cool":0},"NfZzq4n2q6AD22W4DTMOZw":{"text":"OMG! These daquiris are like no other! SMOOTH AND CLEAN delicious favors! So happy for the","useful":0,"cool":0},"R1MOEFLlxCklueKahac-MQ":{"text":"Impressed to say the least. Stumbled upon this...wait for it... HAND CRAFTED DAIQUIRIS SHO","useful":9,"cool":4},"rJpVQsUsjXvWSUlt8EM_yA":{"text":"I really like this shop! And judging by the hordes of people that came in and out during m","useful":1,"cool":0},"b9tEMpAPKsc7nqiFKC0OlA":{"text":"Queenie's is the best! Their daiquiris aren't too sweet and the flavors are all nice and d","useful":1,"cool":1},"ErKl7IFhFdbkUZpBkTvsqg":{"text":"OUTSTANDING DAIQUIRIS\nThe flavors are so damn clean, like when you make homemade popsicles","useful":7,"cool":5}}