{"G4omGa3wRb_ymVqVbujLLg":{"text":"I had high hopes for the Sheraton New Orleans.  I was staying here for a convention and go","useful":0,"cool":0},"04J2BjY48gIf7BzLDoSi9g":{"text":"First of all, I must disagree with some of the other reviewers about this hotel. We found ","useful":1,"cool":0},"01iiNwhv3nynoBeQhBtuJA":{"text":"Solid Hotel. Fantastic location and friendly service.  Its walkable to everything.  Seriou","useful":0,"cool":0},"SrG2cy4A33gYbsBVULkUtQ":{"text":"This place is in a great location and outstanding customer service. Aaliyah and Cierra at ","useful":0,"cool":0},"7hkHweQYilD2KPXEQgoKwg":{"text":"Stayed for buisness.\nAmazing view in the river side rooms.\nGood location for tourist activ","useful":0,"cool":0},"LQxqIW-hVe5i-qIRdvrDYg":{"text":"Check was great - they were super busy and I was early, but the clerk came out to the huge","useful":0,"cool":0},"D7V3uKa-czXY7FhcYwMtEA":{"text":"Nice open lobby, nice beds and updated rooms, friendly service, awesome views from the top","useful":0,"cool":0},"MkbW-diYemaZJs121hRw6Q":{"text":"I travel a bit and this has been one of the better experiences in this price range. The lo","useful":0,"cool":0},"f21p_beX3269PIi7-ARWpQ":{"text":"Wow!  For a recently renovated hotel, there's still a lot of renovations going on.  I was ","useful":3,"cool":1},"KhjUsoitvl3iGL5ja2Ko8A":{"text":"3.5 stars\n\nThis hotel can be found ridiculously cheap on hotwire. I'm talking less than $1","useful":0,"cool":0},"JkpudkOUDT0zliBcXC2wtQ":{"text":"At 5:45pm there were no rooms available despite a reservation. Not well equipped for large","useful":0,"cool":0},"FNB9H1pAiTNgO0JVw3KAqQ":{"text":"The lobby is beautiful!! The check in staff we're speedy and efficient.... our rooms we're","useful":3,"cool":0},"Yhf-VIfdU44yfBu1cxy52w":{"text":"I give this hotel kudo's for staying calm under pressure. I stayed here for the first time","useful":0,"cool":0},"k-mXMUWynHwlqwLEW4mygQ":{"text":"The hotel is very modern and has been updated recently.   The staff has been friendly  . T","useful":0,"cool":0},"clqpyyAAVx2lcAHL0_3szA":{"text":"My girlfriend and I stayed at the Sheraton Hotel during our stay in New Orleans. Its prett","useful":0,"cool":0},"3o0qK5pdRBFULh7rQHFH8w":{"text":"Very busy place but all the staff takes time with each customer so waits are minimal. Elev","useful":0,"cool":0},"NAr_OIvEEkv9sCvA52vb7A":{"text":"One half star for free starbucks coffee in the lobby.\n\nOne half star for pretty good room ","useful":0,"cool":0},"m1WFj3DrV0vX0KhLwmszYQ":{"text":"Incredible hotel! Amazing service, comfortable and clean rooms with great views. Excellent","useful":0,"cool":0},"v2cGCmkIKQyg2Wkzd4p5tA":{"text":"This is my go to hotel in downtown New Orleans.  It is the only downtown departure/return ","useful":1,"cool":1},"EWl1Fns81S5xQHm7iVBx4Q":{"text":"Awesome amenities, atmosphere and people! Loved my stay! Thank you so much! From check in ","useful":0,"cool":0},"_6814NV8moo11lza3Bb-pQ":{"text":"We were there feb 7-14, the hotel itself was ok.\nThe cleaning service was terrible. We had","useful":1,"cool":0},"EkJ10XM4MYeAF8rhQ8EhFg":{"text":"For nearly 300.00 dollars a night, this is a great location!  The bar/restaurant staff wer","useful":0,"cool":0},"QsKV6DaoNeFM85I9KOeRMg":{"text":"I don't usually give such a high rating to a chain hotel, but I really feel this one deser","useful":0,"cool":0},"9fzJ56oYD0tWjy3xCSYSvQ":{"text":"\"Outstanding Stay\"\nI thought our stay at the Sheraton was going to be ruined because of so","useful":0,"cool":0},"NTcurrF8ABbJsKcQlVGhmw":{"text":"Horrible service. Will not stay here again. Overpriced and overrated in my opinion. There ","useful":0,"cool":0},"EMKwFb4xkK-0uaMkE1Dr_g":{"text":"The Good.\n\n-A dirt cheap room when booked with Hotwire. \n-The pool on the 8th Floor that s","useful":15,"cool":5},"XwSa4HqF3l5voMvvyv5xSQ":{"text":"The hotel is okay, not great but also the the worst.  The advertise improvements coming in","useful":0,"cool":0},"eE_A8qfF3A9SYSQqSeNSbQ":{"text":"I had a conference here, and got the \"Club Level\" room/service.  I did not get a room on t","useful":0,"cool":1},"Z94xqd-5qIqKw3CzDd2duA":{"text":"Check in was a breeze. I requested a high floor, close to the elevator room and got one on","useful":0,"cool":0},"6nHoo0Tsfc9aYMrIONLC4w":{"text":"I basically lived at this hotel for about a month when I was in town for a long term job s","useful":2,"cool":0},"EFt-zs6MmesAMjRQL47ZuQ":{"text":"Stayed here with friends for the Essence Music Festival 2012 and the hotel was crawling wi","useful":0,"cool":1},"nJnNJkH2O8NnbeJcXDy5QQ":{"text":"I've stayed here a few times..... I find that they have some great rates... sometimes in t","useful":0,"cool":0},"CbFr6lCYwRdMdOh4vhiWCA":{"text":"Yelp has been nagging me to review the Sheraton for ages so I guess I ought!\n\nTo be honest","useful":5,"cool":5},"p5PfalInYA8FRHmdA95siQ":{"text":"Seriously, Sheraton, seriously?  $3 bananas?  $10 for your own guests to use the gym per v","useful":1,"cool":0},"8LNVweY71qe6sGzGhF-ITQ":{"text":"I definitely stayed at the Sheraton New Orleans for far too long, because in eight days I ","useful":3,"cool":2},"HIAObdKoiKcDgeynJJmuKQ":{"text":"Excellent front desk and lobby staff. Housekeeping is a bit undependable. Lobby bar is hor","useful":0,"cool":0},"fTNROOo74ilu7v6nqVpHDg":{"text":"room option: 2 QUEEN BEDS W/ CLUBHOUSE UPGRADE (scroll down to skip to clubhouse review)\n\n","useful":0,"cool":0},"kgVooiOsC0pzPXFtGXTksg":{"text":"I don't think I have a complaint about this place. We walked to everything in the French q","useful":0,"cool":0},"HnJCiF0kR4w8bGYWF4yvwA":{"text":"I was going to give this hotel 4/5 stars but had to do 3/5.\n\nThe good:\nLocation is central","useful":1,"cool":0},"Rf6g_MDd6tbk8TMW4dK-GA":{"text":"Nice hotel in the heart of New Orleans. It's on the street car line as well. It's a little","useful":0,"cool":0},"woF9NT7XMK8SK30fqex9Vw":{"text":"Desk services - courteous and honest. My bro left his credit card and they called our room","useful":0,"cool":0},"Bh8b1HDdnDnoeC0kvPn-SA":{"text":"First time in New Orleans, but my trip didn't start off too well because of this hotel. Do","useful":0,"cool":0},"2xg-guAV07Tt2AGxttvPbg":{"text":"Thank goodness I didn't have to pay for my stay at this hotel. I would be furious that I h","useful":0,"cool":0},"e0vzPNv9fbBv63qjY_XGwA":{"text":"As a flight attendant, I stay in hotels nearly half my life. I fly international and domes","useful":0,"cool":0},"kyXX1qb0kWdLMQsV0saTIA":{"text":"+Close to Bourbon Street\n+Great views\n\n-No free wifi \n-Cell service wasn't the best\n-Our r","useful":0,"cool":0},"erHCPulE4bdmf4NRhipaQg":{"text":"Now we happened to come to NOLA for New Years. Besides some personal experiences this  hot","useful":1,"cool":0},"ij4-NfCQf_CWczsvpRSOwg":{"text":"500 Canal St. in New Orleans. My friend and I stayed here for 3 days and 4 nights the week","useful":2,"cool":0},"dq6SIdffVukSD9u35w0OjA":{"text":"My girlfriends and I stayed at this hotel during the Essence Festival.  This was my first ","useful":0,"cool":0},"Lzn1RVRNG2L4HFM7YanOCg":{"text":"I stayed here in March for an American Bar Association conference and just hated the hotel","useful":1,"cool":0},"6BYEvPWyTzr-8T9UpsH13g":{"text":"There are two words that sum up the Sheraton New Orleans and that is \"total incompetence.\"","useful":1,"cool":0},"NPzpfDSA8fID_Bq-o4fXQw":{"text":"The Sheraton is a nice hotel and a great place to stay if you are in New Orleans. It's not","useful":0,"cool":0},"BbjBybY2K9hafs5WvQvdHw":{"text":"I agree with the others on the location. My problems with this hotel are: 1. it is not a f","useful":1,"cool":0},"eWJXe6V7cXYeRI4OSq464Q":{"text":"Great place and location. Rooms and service were on point and quick access to all things i","useful":1,"cool":1},"kM8ifIuTxf8TXcXsdaLCgw":{"text":"I will start this review with positives first. The hotel is within walking distance of a l","useful":0,"cool":0},"GsLMmAqjILFnrh2FkGZR5g":{"text":"Absolutely awful service and completely incompetent staff. Took me over an hour to check i","useful":0,"cool":0},"pC1u6VA7gMvCG8noe1hnSw":{"text":"Run don't walk away from this place.  Hotel was overbooked on our arrival. We had made a r","useful":0,"cool":0},"geXvY8WgP9AzkQhsUD2dkg":{"text":"Its official--hotels are officially scared of the Internets. Sites like TripAdvisor (and y","useful":4,"cool":4},"hCxHgJBLd5rAbe3b3VNmPg":{"text":"Nice room. Comfy bed. Staff so far very accommodating and pleasant. Coffee maker was next ","useful":0,"cool":0},"pbEKilW-TetkOvdTM64Feg":{"text":"I was here for Mardi Gras and a conference. The room had an awesome view of the Mississipp","useful":1,"cool":0},"Ld7HW_IdZ-xKfyE-KFcUdw":{"text":"Fantastic location. Lovely (though a bit small) rooms with amazing views of downtown NOLA,","useful":0,"cool":0},"snZA7E_y8nULMFx1Q9bJ0Q":{"text":"I think this is one of the best hotel locations for visiting New Orleans.  It's is located","useful":0,"cool":0},"RZ6p5niubElx6EMKAha7OA":{"text":"Good location. Crazy fast elevators for such a tall building. Nicely renovated rooms. Star","useful":0,"cool":0},"Ouy99ZP9JkRXEIja36zhNw":{"text":"The staff was super friendly. Especially the guy who helped bring our luggage down. We lov","useful":0,"cool":0},"za0PToU5LPyi-ISvoaonrQ":{"text":"I have stayed at this hotel for 8 work weeks through early 2018. I have SPG platinum statu","useful":0,"cool":0},"g_v81gYoSa1k2GKeLill4A":{"text":"Thank you! \n\nOur first choice of hotels was horrible so we moved across the street for onl","useful":6,"cool":3},"ZE3XemEXMfTs-g4Bi71HyA":{"text":"the first Mardi Gras (2010) my wife and I spent together, we stayed at this hotel.  It was","useful":0,"cool":0},"h0d3bN3AL6a3UDZ5a3nnAw":{"text":"Lucked into a good deal here after plans fell through.  The front desk people were very un","useful":0,"cool":0},"sLRdjeAovS804tH3CVnkVQ":{"text":"Nice rooms, nice people, weird elevator system. Prime location. Probably the highest-end s","useful":0,"cool":1},"Tcge3y36QgxQxkU6KXHxLA":{"text":"Rooms are a nice size,\nService is great. I did not like the $5 added to all room service o","useful":0,"cool":0},"rXLtG018KVuVEUnJQh9EFA":{"text":"Rooms are dated. Water pressure in shower is horrible. AC works mediocre and when you get ","useful":0,"cool":0},"TsPr3IMt7KsWFLRnAlxgIw":{"text":"Nice place. Right on Canal St and just a couple blocks from Bourbon Street and the French ","useful":0,"cool":0},"pzGdrui9juyfkP4RKMeO8g":{"text":"Really its midnight 7/15/14 and they are doing construction in the hotel. The noise is vib","useful":0,"cool":0},"CpI3VSccTz310zdY91WLHg":{"text":"Great location on Canal Street & Decatur Street, on the edge of the French Quarter & Downt","useful":4,"cool":0},"bBWVFinaD6t63md2sDivvA":{"text":"Centrally located in the city if New Orleans, this towering hotel offers more than a place","useful":0,"cool":0},"wCRVwKXKEB2zpTMPuCpZMg":{"text":"The hotel is conveniently located to the action of New Orleans and touristy areas. The tro","useful":0,"cool":0},"HVGA4Zd-CkJdS-mayUQ1Fw":{"text":"Not bad at all, especially for our $115 group rate.\n\nWas in town for the Mardi Gras Marath","useful":0,"cool":0},"qujoOo1KpoEd4U57gURLfQ":{"text":"this is a nice, clean hotel with quite a few pluses, but it's basically convention city.  ","useful":0,"cool":0},"xzCNWnhd4KZuuzfUtuaDHA":{"text":"This is a wonderful hotel and I would highly recommend it. I was worried at first, since t","useful":0,"cool":0},"MRM2FIdWNYxVTDnLG88W6w":{"text":"Stayed here for a weekend, it's a good location. Guest services were good, fast, and they ","useful":0,"cool":0},"DXg5S57oB3kvjGgu3O7cjg":{"text":"Nice clean modern centrally located in the French quarter of New Orleans. Very short walk ","useful":0,"cool":0},"bBysaOlmRpmkEdKdtxsR1Q":{"text":"I'll say this is a very nice, modern motel.  The Lobby and bar area are very well decorate","useful":0,"cool":0},"fxEEBIEN9Y1UgiMharGoqw":{"text":"Clean rooms with tall windows for great views. Only a few blocks away from Bourbon. Valet ","useful":1,"cool":0},"K7uVCFoi7lWTgETsabv3ng":{"text":"Nice hotel, good sized rooms and not too far from Bourbon street. My main complaint is wha","useful":0,"cool":0},"xGl-zr-5QPD2oRaFBRlthQ":{"text":"The hotel was nice and clean. Service was good. The beds comfy. Close to Bourbon street. W","useful":0,"cool":0},"_uEmkuC4XmLfu9-ipmwZHA":{"text":"Relatively nice lobby bar, where they serve Gardetto's. Yum! However... The glassware is n","useful":2,"cool":0},"AdO17NUAA5IOSMirzIq0tw":{"text":"I had a girls trip arranged for 11 ladies to stay at the Sheraton for Mardi Gras weekend. ","useful":0,"cool":0},"SWPmx8rqK6OVJxKL3MFb4Q":{"text":"Great resolution by Manager Patrick Smith.  My room key did not work due to a front desk m","useful":0,"cool":0},"U38y-BpVHpremqDWEdokOQ":{"text":"ok first i'm going to give the GOOD because what i appreciated about this property highly ","useful":1,"cool":0},"pAaCl9Tx0tXxcr7Zvyii2g":{"text":"Located near everything in NOLA.  The best part of the hotel is the exercise room that is ","useful":0,"cool":0},"zQ8kP41GSRuA0CT7zO7DNQ":{"text":"Mediocre hotel for the high price. The furniture is old, the carpets are worn, the ice mac","useful":1,"cool":0},"DbulleunGTnHs-ojoX0kuQ":{"text":"We came to New Orleans for the French Quarter Fest and wanted a nice hotel in the middle o","useful":1,"cool":1},"Bhcw7urc189WuPzmM5bagg":{"text":"i was looking for a hotel downtown and ended up booking my reservations through priceline ","useful":0,"cool":0},"G9E4jhPznh6BPC4euFpTWg":{"text":"I can only review the Sheraton based on their events. I've been here the past three years ","useful":1,"cool":1},"hOPXifVALmw1leVTdac4FA":{"text":"there were nice things about the sheraton... nice hallways, nice views, courteous service.","useful":0,"cool":0},"AJXrEEaUHH2prcNwRisELg":{"text":"Man, whatever minor flaws the Sheraton has, you simply can't ask for a better location tha","useful":1,"cool":0},"yS18CCnUxjR4HiPopk3fsw":{"text":"I wish I could rate individual aspects of this hotel, my score would be very different.\n\nL","useful":0,"cool":0},"qOygtvirgrncYnzaG4_8nQ":{"text":"From the moment we walked in, the staff has been very pleasant. The rooms and bathroom are","useful":0,"cool":0},"suJvgJCloPdzOQO9EbdidQ":{"text":"Stayed here in June 2014 for conference. Worst experience due to major construction, eleva","useful":0,"cool":0},"XPAjpCFl_Af3OGDU2-EKKw":{"text":"Several people across this poorly run staff have made my stay here completely horrible. Fi","useful":0,"cool":0},"gpJDsrh4nWWe80d6AnOgmw":{"text":"TL;DR - Decent hotel convenient to all the touristy spots\n\nHad an uneventful stay - used m","useful":2,"cool":0},"oz-o6I5I8G5Q32Oxsrl3oQ":{"text":"Skip this hotel for a while- unless you don't mind paying $200+ a night for a room with LO","useful":0,"cool":0},"69RYRvu5n1TfCXwNA4fVDw":{"text":"Not the best with group reservations and some of our folks had issues with the maid servic","useful":0,"cool":0},"MdSNS9_16xTlci9KY7kWUw":{"text":"Solid hotel in an excellent spot.\n\nRoom was clean, a bit on the smaller side, but the floo","useful":0,"cool":0},"4lfh1djQ6z6ZGDGRaVgchg":{"text":"Attended my 3rd Essence Festival. Went with girlfriends, 8 of us. Loved this hotel, very l","useful":0,"cool":0},"DfRJMyYsUhGfiNH51LiWtQ":{"text":"Pelican Lounge is the hotel restaurant and has a promising menu, however I only had the op","useful":1,"cool":1},"m_t28NyH-ngTTYdONV7feA":{"text":"My wife and I stayed at this hotel while in town for the Jazz Fest. This hotel is absolute","useful":0,"cool":0},"E--8bqUqBO26ItJdSVIMUw":{"text":"PROS:  Close to French Quarter and can walk anywhere\nFitness area (didn't use but was exte","useful":0,"cool":0},"thj7dkaYhs_8T7efQmKCOw":{"text":"My stay at the Sheraton was fairly decent with some set backs. In general, this location i","useful":0,"cool":0},"5y3HyJlvyjO4xG8ktx8gNA":{"text":"I was here for a conference and found the hotel to be a pleasant surprise for the most par","useful":0,"cool":0},"kRbghZSXJuPJCAZcqleqaQ":{"text":"I get why people are down on this hotel.  It tends to be crowded, the decor (apart from th","useful":0,"cool":0},"j46qHDWlb0hkwlUoGzJmiA":{"text":"L'hotel è bello ma non puoi fare pagare $ 41 per ogni giorno di parcheggio e nemmeno puoi ","useful":0,"cool":0},"mpHVkiNEPnHjUGASX-T5nQ":{"text":"I stayed here for Mardi Gras 2018, so I imagine my experience would be different if it wer","useful":0,"cool":0},"WirClSBvbVqCkJ1vz_VLog":{"text":"I absolutely love staying here. The rooms are awesome and the service is impeccable. They ","useful":2,"cool":1},"pUEAU49buRv-yi4CJj85UA":{"text":"Hotel security alarm went off last night due to malfunctions. Were told to evacuate, then ","useful":1,"cool":0},"ayCVw71HYwdnY9ALy1vj-g":{"text":"Really nice hotel in a fantastic location in the FQ.  Walking distance to Bourbon St, the ","useful":1,"cool":2},"bBwjnVw4nft6VjqDBBu0Bw":{"text":"Really, really cheap amenities for a hotel with a theoretically stellar reputation. The so","useful":0,"cool":0},"VvSaRFg-DfOLAtHBV4UCuA":{"text":"Okay, this is supposed to be a Sheraton hotel, so you would expect descent service right? ","useful":0,"cool":0},"UAf1RXaGM5BafxquiSp_Hw":{"text":"We stayed at the Sheraton on Canal Street for 3 nights and everything was amazing!  Check ","useful":0,"cool":0},"TZ7GPoNpMckmNIatQM7erA":{"text":"A nice overall place.  Clean,  comfortable beds.  Knowledgeable staff, very friendly. \n\nGr","useful":1,"cool":0},"QlwfSHLwoGFFeDu-8kW6hQ":{"text":"I like this hotel -- its location in New Orleans positions you for all kinds of restaurant","useful":3,"cool":2},"LomOnDtkXf3J_PWiEwIgfg":{"text":"Firstly, I was charged for three rooms when I only asked for one. I had a $2800 charge to ","useful":0,"cool":0},"6gMxf4NKWlt3mnkUKvgJog":{"text":"The lobby is pretty and inviting. The front desk representative Terrell C was very profess","useful":0,"cool":0},"sGHFR7TfHfvcgaxSK3jKug":{"text":"Pros:\nGreat location!\nFriendly staff\nHotel itself very nice\n\nCons\nAir conditioner in our r","useful":1,"cool":0},"0kjuPOYUN7DDAC3Ak1dEKA":{"text":"Highlight of the stay, if I recall correctly this was the hotel that we bumped into Larry ","useful":0,"cool":1},"84gK4xDV4HR2Nc8yrMRBaQ":{"text":"Stayed here the weekend of the Rock N Roll Marathon (2/22 - 2/26). Got a great rate via Ho","useful":0,"cool":0},"WbRVkOAWh8k44LxWyhkikw":{"text":"The hotel is sufficient but the service is very slow. And the kicker is they don't seem to","useful":0,"cool":0},"tTmf2P9uC9B55cDsC6aI9Q":{"text":"Some friends and I stayed here for during the Essence Music Festival during the first week","useful":1,"cool":0},"W52dHIOmMOfkW_9ZLhPD1A":{"text":"Ok hotel.  Like others said, the draw here is that its close enough to the debauchery of N","useful":0,"cool":0},"NdEz8wAAfjbaKGurpTVotQ":{"text":"This hotel was actually the best price I could find in the area, so I had low expectations","useful":0,"cool":0},"XpTb0tyZSBNIRMCHB5EtXg":{"text":"Booked this hotel on Hotwire and got a really nice deal. It was very clean and smelled nic","useful":0,"cool":0},"p6jQdoGcb9FIoN7C1FDD2g":{"text":"We chose this hotel because it was \"dog friendly\". They did in fact allow dogs... nice sta","useful":2,"cool":0},"ndEZKsZ5MTW5TTNPCzCIMg":{"text":"I had my wedding there a few months ago. Events team are so slow with getting back with yo","useful":0,"cool":0},"p1RiD1AYzM3CCWDyz9jlyg":{"text":"This hotel was more than we expected. Great location steps to the waterfront and French Qu","useful":0,"cool":0},"9cc6U7O3W7LC-Qmx8GQW1w":{"text":"They allow dogs in the hotel...even dogs who bark throughout the night. That's ridiculous.","useful":0,"cool":0},"kLV5maAY9rAxbXrlCpf0cQ":{"text":"Great location right on canal street! Valet only and you have to let them bring up your ba","useful":0,"cool":0},"4RkYOV8u9oYIfUAc7IGwZw":{"text":"There really isn't anything bad about this hotel but I'm giving it 3 stars based on the fa","useful":0,"cool":0},"mzf_ZIida-Hp76OQO86ZRg":{"text":"I'm tempted to give the Sheraton 2 stars, but I got a great deal on a weekend stay and I c","useful":0,"cool":0},"wARHLF2v3o_rICRvbOOFkQ":{"text":"The 70's furniture is very worn and this is in the upgraded room they gave me because the ","useful":1,"cool":0},"qWwFapazG1o_KcDpJo-RhQ":{"text":"Edit(Brandi) to the rescue. Finally, received some consideration from Brandi and found the","useful":1,"cool":0},"SoiEeVAN1najPhxq8-Jz4A":{"text":"My husband took me for a nice getaway for my birthday 2/2 and I had the greatest time at t","useful":0,"cool":0},"r3cFcHsfN1cZPjJW8GyQQQ":{"text":"We Priceline'd this hotel and got a great rate.  They never treated us like we were differ","useful":0,"cool":0},"LhtzU7Wn9SvAD7geQZevCg":{"text":"We were caught in traffic going to New Orleans , didnt get there till almost 11pm, so we d","useful":0,"cool":0},"J1GSfHdtem9IoRyPCwJjZQ":{"text":"I was here for a conference back in 2013, it was one of the nicest hotels I've ever been t","useful":0,"cool":0},"oTesTkYKbuobrlO4aAzGRw":{"text":"Arrive and leave during peak hours. We arrived into New Orleans around 7PM on Saturday nig","useful":1,"cool":1},"dMMn2isab8TwXKXRtGxdag":{"text":"I am very pleased with our stay. I got the room fairly cheap through hotwire for 100 dolla","useful":0,"cool":0},"Z3mWMC3Vgkn5hlWRNgR87A":{"text":"Great location. Great bed.  Service is ok and the rooms are a little dated and worn. But w","useful":0,"cool":0},"EeeBO2tmVALiBoBcrvvNfg":{"text":"You can only judge a hotel by the value and in my opinion this is way over rated, for 250 ","useful":0,"cool":0},"ZYjQUvSzhXyrLFMuN3m8JQ":{"text":"The room is nice minus the fact that there was no hot water for 2 days. Free Internet and ","useful":0,"cool":1},"Mx2fCqeb2rgzsqNA1EsjmA":{"text":"I stayed at the Sheraton as part of a conference in the hotel. The conference was well don","useful":0,"cool":0},"uMBkadFsrgS9eSe9BT2Bjg":{"text":"Horrible experience! The reservation was under my sister's name and I tried to check in. T","useful":0,"cool":0},"bsnEr5AqOy7eVhjfuFeoBQ":{"text":"I loved everything about this hotel.\n\nI think the beds are what did it. The beds... oh my.","useful":2,"cool":1},"yeJlVgDeOCuPHGZn-sPVwQ":{"text":"Two words:  Nightmare Experience.\n\nI stayed at this hotel previously with a decent experie","useful":4,"cool":0},"SvIMtlTT5fTsnzaEQbZEfA":{"text":"Stayed here for 3 nights 2 weeks ago. The hotel was in a good location and the valet/bell ","useful":1,"cool":0},"VEj5jpgNxybBFbNqpEpIvg":{"text":"The only thing that was convenient about this hotel was it's location to the all the main ","useful":0,"cool":0},"4f_fWcLwa3t2-5p8QdX-TA":{"text":"Great location. Great staff. The Club lounge was not that great. Breakfast and evening sna","useful":0,"cool":0},"PRjmwgZ2EdcPjKvGRuASzg":{"text":"I travel to New Orleans frequently on business, so I have stayed at almost all the hotels ","useful":7,"cool":0},"sXmQuYTxPniJ1Mb8Z-0A-A":{"text":"Great staff, nice suites, and great location! Wish I had more time in the my room to watch","useful":6,"cool":4},"8i4MlCv5SWGYatOVyn670A":{"text":"We stayed there 5 nights on the 47th club floor. View from the room was amazing, room was ","useful":0,"cool":0},"hByF_StWKG1P6LLENBa48g":{"text":"Service at the front desk was very good considering I arrived at 1pm and was able to check","useful":0,"cool":0},"GYNhhI3m6Px-I1quJrit1A":{"text":"The Sheraton New Orleans on Canal St. is simply awesome. It is a very nice hotel and very ","useful":0,"cool":0},"KT0KsX96PD-X76XIwTK-Mg":{"text":"This place is such a headache. Rooms were nice and the location is great. \n\nI came here fo","useful":1,"cool":0},"Qln2TJftkhTDVCVTPiTtCw":{"text":"Centrally located and easy to get to the French Quarter.  Good meeting rooms.  The rooms a","useful":0,"cool":0},"WnArb1C8pkbYGR2doVaINA":{"text":"Something is wrong with the staff and service in this hotel.  They are, almost all of them","useful":0,"cool":0},"vd8s_2JK77msHzAjYZ5Asw":{"text":"I had a great experience with Clark S. when I came across a complex issue with my own frie","useful":0,"cool":0},"1CTn8KH44qaZLNZXOYzEsA":{"text":"A wonderful place to stay. The staff were all amazing. They gave us great recommendations ","useful":0,"cool":0},"50eUSsn46lRRm8JQPCeQ8w":{"text":"The location of the hotel was prime but, the rest of the experience was extremely disappoi","useful":1,"cool":0},"o_b-8soKFeIFzk2TBXaUEw":{"text":"This could be the worst hotel that I have ever stayed at in New Orleans...and I have staye","useful":1,"cool":0},"q7IRAJhCTnIkwK6meMmf3Q":{"text":"I stayed here during a conference.  The room and location were fine although there was con","useful":0,"cool":0},"K0hzgBVy-_uF7Jnex2wVsw":{"text":"I seldom write reviews. .but i had particularly crappy service so decided to share. .\n\nThe","useful":3,"cool":0},"Vn4BwynRhMVSyaaGwtTBXg":{"text":"Meh. Room service was terribly slow. For the price it should be a little faster.... Took a","useful":0,"cool":0},"Lc4OZoJzITdONtL9hXQE5w":{"text":"The hotel was nice in the lobby and their automatic check in and out machines are great! T","useful":0,"cool":0},"qHwvRJM_JYpHgxmy-w45Cw":{"text":"Several people across this poorly run staff have made my stay here completely horrible. \n\n","useful":1,"cool":0},"xLzaWWW6xk8ukZext7rMBA":{"text":"Told is there was no parking and gave us a map to a garage over a mile away---and it was w","useful":0,"cool":0},"ZDbeA2eUnKmkAmx7hYSJfg":{"text":"This is a clean, friendly hotel. The room was a good size. I was on the 20th floor and had","useful":1,"cool":1},"WcRmp2vxGTZLeECsk5kxzA":{"text":"When we came, thank goodness the construction that has been going on has ended. It's in a ","useful":1,"cool":0},"v2eIpWetmrCPg4EKtgwwBg":{"text":"Not good Sheraton. \nWe booked our room , 6 months ago!!!! \nAnd we come in from Washington ","useful":2,"cool":0},"IUHhvEafjW9MpgAN3NM9jQ":{"text":"Comfortable stay. Room was really nice. Bar and service was better than good. Highlight of","useful":0,"cool":0},"0AxlhN2rEh_DRcVBUNbOVA":{"text":"Sheraton you continue to keep our hearts because of your generous pet policy.  We love the","useful":1,"cool":2},"goXCuoY4cI8xPnJ_7M3wkQ":{"text":"Pelican Bar review:\nOverall - typical hotel bar experience, slow dull service (not one of ","useful":0,"cool":0},"0vypv8E7yeAz9zhGd4nnBA":{"text":"Clean hotel. We had a great stay. We checked in at the beginning of a conference and it wa","useful":0,"cool":0},"MBv_QoGnCs0VjX_5IcV75w":{"text":"Stayed at the hotel for 4 nights for a conference with family.  We got to the hotel really","useful":0,"cool":0},"Y3Xl4VuQpNm4TV6uD1VntQ":{"text":"Really enjoyed our stay here. Only used for a place to lay our heads. One of the most comf","useful":0,"cool":0},"x9T_gGmBUCKJ-dt6lXa35w":{"text":"Great location right on Canal St. within walking distance to everything you'd probably com","useful":0,"cool":0},"iwFWyCFH9jAFf_UTv9HLPg":{"text":"Ok so we stayed one night here up on the club level and I have to say I dont think we got ","useful":2,"cool":0},"4-vu4SK_p_C8-dweJrSTEQ":{"text":"Terrific place! \nI make each hotel jump through 3 hurdles before I give a review: Food, At","useful":0,"cool":0},"4C82dQvKLie6YGOG-91Y_Q":{"text":"Stayed here for conference. Good location to walk to must see tourist spots. All the emplo","useful":0,"cool":0},"Hy7E9ryi5iZt2P_tH2EA8A":{"text":"It gets 1 star for its amazing location.\n\nWorst part- Don't plan on sleeping. The walls ar","useful":2,"cool":1},"g49rjijlHYMukKjryTr2nA":{"text":"Great view from the 39th floor overlooking the river and bridge in New Orleans.  Its a sho","useful":1,"cool":0},"DZ5TZw3Z-M29zKYQ-UzzIg":{"text":"The Sheraton on Canal street was a good place to stay in a great location. It's located a ","useful":0,"cool":0},"v2_ISKmw3u3EejlnW6ApGA":{"text":"I am a SPG reward member and I stayed here for the weekend. I received quite a deal on Pri","useful":0,"cool":0},"9Gne7f1mRngYGxd4xkSdbA":{"text":"Stayed there for 3 nights last week for a wedding.  Very convenient location, friendly sta","useful":1,"cool":0},"ys2ukUheL-avP2OjbfFIOQ":{"text":"AWESOME!! This hotel was great. We didn't have a reservation upon arriving, but quickly go","useful":0,"cool":0},"24xalY5WWJlV0HMKxwjezg":{"text":"Second stay at this hotel!!! I absolutely love this hotel. Beautiful lobby and bar and all","useful":0,"cool":0},"Lq8Mes1QP4pje55VPmQnkQ":{"text":"I must say that after staying at the renaissance, this was perfect. \nView over looking the","useful":0,"cool":0},"8qracHcn7hAjvzCVoIV4Tg":{"text":"This is only a review for service at the pelican lobby bar- our server was Keisha; she was","useful":0,"cool":0},"JoZbsZaF_vODDJ9hp-NJCA":{"text":"I've been to a better Sheraton. \nEverything was very slow here: check-in took forever, get","useful":0,"cool":0},"DOkqMwcM5tRFMiDI8Q0-dg":{"text":"Fantastic location, clean property, great value for location. I love the bar in the lobby,","useful":1,"cool":0},"9vuTe_hXbxayX_nTHd5dNA":{"text":"They really need to get it together! I stayed here for 2 day before my cruise and it was v","useful":0,"cool":0},"ih8MucnehMeMLvN4ltuRvw":{"text":"Good location, friendly staff, clean room, pretty comfy beds, and a great view.\n\nThe t.v. ","useful":0,"cool":0},"iywmVkCZgfpx36FyVp9HOA":{"text":"This hotel was dirty and disfunctional.  The lock on my door did not work correctly - I ha","useful":1,"cool":0},"Tr2KsQ98F2Rlb8BWfBle5g":{"text":"Hotel is fine, but beware the drunk guests who like to bring the party back on weekend nig","useful":0,"cool":0},"A5EHmetOco3JMxfBO4fVgA":{"text":"Just driving through the city to experience New Orleans for a night and this spot was wond","useful":0,"cool":0},"uC2nX1qPcjocPQAeQW2y2Q":{"text":"This is my second trip to the \"Big Easy\" I stayed at the other \"downtown\" Starwood propert","useful":1,"cool":0},"um9FOiLesYQR3_EQX9HNfg":{"text":"for the price this hotel needs to step it up.  the rooms are average. the amenities are la","useful":0,"cool":0},"ZSlZznRci9OQkALTQwZ31A":{"text":"We had an executive suite for four nights. While this is a beautiful hotel with an excelle","useful":0,"cool":0},"lHlihAkjmUb66-u__Au4UA":{"text":"Clean, very helpful and friendly staff. Comfortable beds and modern furnishings. Close to ","useful":0,"cool":0},"npFxb-Ax730-aYjxuCrvug":{"text":"Great location I love staying on Canal.\n\nNice hotel inside for the money\n\nElevator has som","useful":0,"cool":0},"S-5gZE73pJ-hhAiBxQmxIA":{"text":"I must beg to differ about the reviews for this hotel that are negative. This Sheraton is ","useful":0,"cool":0},"QE0o2BCq5txSflRGzI_wYA":{"text":"Located on the far end of the French Quarter.  They charge $43 for parking per night.  The","useful":0,"cool":0},"_a-yy8rqoRG1sQxKquE2Mg":{"text":"Convenient location. Decent hotel. People trying to figure out the elevators can be a humo","useful":0,"cool":0},"1nezsSQQqvzrINybaFr5_Q":{"text":"I stayed on the upper floors and the rooms were nice. The Club that they had was nice exce","useful":0,"cool":0},"MZc9S1A25zb37AMSFTayAA":{"text":"The worst Sheraton I have experienced to date. Staff was no very accommodating  compared t","useful":0,"cool":0},"P3s1IyUrZKwy6oGs5QNatw":{"text":"The room is nice. The bathtub isn't that clean and the sink doesn't look like it's been wi","useful":0,"cool":0},"mUbSDfncLMN2bqhBjX3pGw":{"text":"I booked this hotel via Priceline's Name Your Own Price ($130/night) for a long weekend st","useful":1,"cool":0},"bXyn0XFhaRo5Pawa4PEAJA":{"text":"In the last 3 years, I've stayed at the JW Marriot, the Omni Royal, Harrahs and Royal Sone","useful":1,"cool":0},"3_6zsxVDGKG9IO9RSQzmxA":{"text":"Huge sky rise hotel in the middle of everything New Orleans. Steps away from the French Qu","useful":0,"cool":0},"m14gvZ03qOdeIBwcZ53rvg":{"text":"This Sheraton like others I have stayed at recently is very nice. There are fancier hotels","useful":0,"cool":0},"0sG65dQNdWsI9QMGr6Jbkg":{"text":"You have to pay for parking which is about $30/day. I'd recommend parking in the Harrah's ","useful":1,"cool":0},"PSplMUvlvDUkgRGCWlcM6g":{"text":"We just did our first NOLA trip...stayed here at the Sheraton 5 days...loved it. Starbucks","useful":0,"cool":0},"fbhW1Mc7w5vAsok_VxyB9A":{"text":"This hotel is centrally located to all the main attractions and means of transportation. T","useful":0,"cool":0},"XHrljhWOMZEfpS__BqLs6Q":{"text":"We purchased the cheapest room possible and it was what we paid for. The room had an inch ","useful":0,"cool":0},"fY1ZJM0Xx82qU7oNyrPLtA":{"text":"I honestly have very little to complain about regarding my stay at Sheraton New Orleans. C","useful":0,"cool":0},"pMUjbvHQY4BNekylNd80bA":{"text":"I recently hosted a party with 175 people at the Sheraton.  The party was a success but th","useful":1,"cool":0},"y3s0b_clBW5vCxVbHlI00Q":{"text":"Stayed here for three nights. The parking is absolutely unnecessarily overpriced. It seems","useful":1,"cool":0},"S22T_G-JIw10K_-PRJwaAQ":{"text":"Have always stayed at Marriotts in the past, but due to our trade show we were attending w","useful":0,"cool":0},"W4WlCR0pj90e9yho-AAjHQ":{"text":"Just got done spending 5 nights here for a conference, I'll break it down like some others","useful":0,"cool":0},"qpBwK2yavdTGUUQFFtNOaA":{"text":"unprofessional and rude staff. they don't want to help you and they're incompetent. zero h","useful":0,"cool":0},"rBhZASycxVlfi6tn5_NdeQ":{"text":"Stayed here for work last week.  I paid steep prices for a hotel in New Orleans.  The staf","useful":0,"cool":0},"Nz1bx9oN89l-jb9eXlSfRg":{"text":"My husband and I always come to NOLA the weekend before Thanksgiving.  Its usually not as ","useful":0,"cool":0},"FlmPntKH7eSNUygpTMPFAQ":{"text":"I'm confused by the negative reviews of this hotel.  We are kind of snobs when it comes to","useful":0,"cool":0},"kPPWk8bUmB41gGabu9ZnWw":{"text":"Stayed with my kids in July for 2 nights.  Hotel was great for a quick family stay. \n\nChec","useful":0,"cool":0},"2u4PONVMsj9NMImuEn7KxQ":{"text":"The Sheraton Hotel on canal in New Orleans is our favorite. I come here several times a ye","useful":0,"cool":0},"DAfHLeT_qgIFNqgg74otEw":{"text":"Great location walking distance from Bourbon but there were two negatives: \n(1) the air co","useful":1,"cool":1},"7TA7aes6VudrGC76XCtvow":{"text":"This hotel is beautiful and comfortable, the staff is really nice and polite BUT we had to","useful":0,"cool":0},"I6TWyOeozZtEHDy_bauZZA":{"text":"I just checked in 40 minutes ago, but I think I know enough to render a review.\n\nUpon arri","useful":3,"cool":1},"Mv1fbBrGfNIU5tJlpN_KfA":{"text":"Was there 10/12 - 10/16. Great location, everything is within walking distance.  The bad, ","useful":0,"cool":0},"hE51vwmiuJg4jI6OQEXKKg":{"text":"This place was a mixed bag for me. On one hand, the bed was huge and soft and the televisi","useful":3,"cool":0},"SFfmv_fWEanX2TB0qaAI_w":{"text":"Great Value! I stayed here with a buddy for 4 days during Mardi Gras for only $180.\n\nWell ","useful":0,"cool":0},"kbmMnelbyt88p8vB0gK1Gw":{"text":"I'm puzzled by the not-so-great reviews.  True, it's not a Four Seasons but I'm pretty sur","useful":3,"cool":1},"BuK11EcuWM8n8AXWdTK7-Q":{"text":"Below is an email correspondence and it explains my review.  I want to note that I did spe","useful":0,"cool":0},"Gz1RUFQmDO3L7ZehQCOoCA":{"text":"Paper thin walls mean you hear the movement of elevators at all hours, even in rooms that ","useful":0,"cool":0},"bjCuYHJCj8xbJVR43USz6g":{"text":"Fantastic room w river view. Staff was wonderful  - I left my tote in the lobby with my co","useful":0,"cool":0},"ilkIfYC3XRZUITS6Y4CAfw":{"text":"The location of this hotel is perfect. We were able to walk to so many of the nearby attra","useful":0,"cool":1},"4JCygI6As0sLhXor9U6vQQ":{"text":"5 Stars just for the amazing service I just received from the supervisor of the restaurant","useful":0,"cool":0},"k2VWmn9LofngTet9wWtlNg":{"text":"Bypass this place at all cost! !! If I could rate 0 stars I would! ! Firstly the security ","useful":0,"cool":0},"RZcx7mrpFYACyjmtogGwgA":{"text":"We got a room for a conference across the street and were given a room on the 9th floor fa","useful":0,"cool":0},"5ARSG8j7Am0RHU9upQkxfA":{"text":"The hotel's only redeeming quality is its location. Everything else was subpar. The front ","useful":0,"cool":0},"3yrYVYdu80HOTcIQI-QYgg":{"text":"Really enjoyed my stay. I stayed in the club level room and had access to their lounge. Be","useful":0,"cool":0},"WEgCMHmgZBYpcOH0kuPs7A":{"text":"Any road warrior could understand checking in a hotel close to 2am after a long day and se","useful":7,"cool":2},"d9BrWX8D3mizaYghC1fvyA":{"text":"Used Hotwire to seize a hotel near the Mardi Gras festivities. Got a river facing room for","useful":0,"cool":1},"TVSU5Q-VMh_o7-1QZkHYPg":{"text":"Had a decent experience staying here while in New Orleans for a conference.  The location ","useful":0,"cool":0},"wcTnXMPGPZVprGKelMeRNA":{"text":"This is my second stay at the Sheraton in 4 years. I stayed for 7 days. While the staff is","useful":0,"cool":0},"6u7bKsN8c3TOWealQ65pLQ":{"text":"Location, location, location.... \n\nThis place has a great location. It's on Canal Street, ","useful":1,"cool":0},"o17khAEfbnaAcQ9avDQ_VQ":{"text":"Cockroaches, low water pressure, smoke detector issues, unaccommodating staff, dirty hallw","useful":0,"cool":0},"6pAOjNpZqc5u1goaI0fRLQ":{"text":"This was probably the worst experience I ever had with a hotel and would never stay here a","useful":0,"cool":0},"QoZRg5sBd24wu58d0X2i7A":{"text":"Please note that my review is of the reception facilities; I have never stayed the night i","useful":1,"cool":0},"YDyXXWpf4qPAuNRab4sbAg":{"text":"Great location, clean, away from the stench of Bourbon.","useful":0,"cool":0},"XXQCIEEfOLhuCwoTjnECZg":{"text":"I stayed here for NYE 2012 for two nights.\n\nPROS:\n- Location: The number one selling point","useful":1,"cool":0},"IlOhiRNgWmr-K0jJkoAW8w":{"text":"This is a huge hotel (it's one of the tall ones--about 48 stories tall).  As you walk into","useful":2,"cool":0},"Xw5YHiB7xfdz2bBSJmQtsA":{"text":"This hotel is clean overall.  The room cleaning service is a bit slow, our floor was worke","useful":0,"cool":0},"csz_XikDRhe1uZn02A-ZDw":{"text":"Spun the wheel of hotels on priceline on name your own price and landed here.  Got a very ","useful":2,"cool":0},"44yuF8Op1Ejxwc2lyikolA":{"text":"I first stayed here a year ago, and have now been back this year.  Both times it was for a","useful":0,"cool":0},"2lXnIOco4DkUtpQbW89J-A":{"text":"This hotel is alright. Not the best place I've ever stayed, and certainly not the worst by","useful":1,"cool":0},"SV0rKZox6NWlrfK3Ymd92A":{"text":"My room was dirty, so I requested a room change. After a long discussion with the hotel st","useful":2,"cool":0},"ARF4S1ffrMAC5_dc-Ff7Ew":{"text":"Horrible service! Seriously, where is the Southern Hospitality? Every employee here just s","useful":0,"cool":0},"tkLtf5eVxRIkNIm8k955IA":{"text":"\"Here are the towels you requested. They may have stains on them, but they're clean. At le","useful":1,"cool":0},"CwFW-wG0zdJ2yLeexKDiSA":{"text":"Pro: Smooth check-in. Beautiful room with king sized bed right bedside very quiet elevator","useful":0,"cool":0},"pNqmUgoVa-GObpC6mDcelA":{"text":"Wonderful hotel service, bar, and room service.\n\nThis place rocks, so close to the strip a","useful":0,"cool":0},"ESiSEP6laEh2xfImawC_2w":{"text":"At $180.00 per night PLUS $50.00 for parking I expect much, much more. \nPROS: \n1) On the e","useful":1,"cool":0},"_AtqOzZ28GqNA7YIrqhJBQ":{"text":"Rooms were a bit beaten up. There was no chain lock on the door as it looked like it had b","useful":0,"cool":0},"rJh8tUG-2GZigbR1ZGjTYg":{"text":"Five times in New Orleans, second time at the Sheraton hotel on canal street. As we arrive","useful":3,"cool":0},"ESOdXLjD_pCsSBwr2dGZ9g":{"text":"The pros:\n- Location is excellent, 3 blocks to Bourbon St. \n- Booked on Priceline for $75/","useful":0,"cool":1},"JrnisH__ELNL8uydcrSV5A":{"text":"This is a very well located hotel! You can easily walk not only to the Quarter and CBD, bu","useful":0,"cool":0},"J1fgmqPmKSUN0_T2ksh4FA":{"text":"We only stayed a night (cruise next morning).  It was your standard chain hotel.  Nice cle","useful":0,"cool":0},"DYlXSwGUpg4daWCGvL1pBw":{"text":"This is quite the perk. Somehow our reservation had access to the club and it was really c","useful":0,"cool":0},"gyIo8F_Rc0NW8bIyhAlWFA":{"text":"Did the buy before you know where you're going thing on Hotwire and wound up here. Staff w","useful":0,"cool":0},"hA66wtUdl6z-dDpULfJ73g":{"text":"My room is very clean the hotel is nice a portion is currently under construction but has ","useful":0,"cool":0},"thc2nFPRUSyqZH6OFG8k5g":{"text":"Stayed here for two nights. Location is great and the rooms are clean. We didn't have any ","useful":0,"cool":0},"xz1PJ_JhR_V5gP4HmPHO_g":{"text":"I love New Orleans, it's my favorite city I've ever been in. I understand that in a city l","useful":0,"cool":0},"ufdXjx0XBL4bL3_TbmvbFg":{"text":"I did not stay here, but attended a soiree in their Roux Bistro and loved the staff, welco","useful":0,"cool":0},"CpM8KS8ZKM9U_ER5Wk9Clg":{"text":"Pros \nArrived to a clean hotel room and what a view from the 38th floor. \n\nCons\n Did not k","useful":0,"cool":0},"eUKA3YBa1eOUAL2DEF9hRw":{"text":"I can only describe my stay at Sheraton New Orleans as overwhelmingly underwhelming. The h","useful":0,"cool":0},"71BINoI3fibYKSwLlzGB0w":{"text":"Best of both worlds as its walking distance to the action of Bourbon Street but far enough","useful":1,"cool":0},"eAhHPARELu76-Wmk2RYfcw":{"text":"I'm going to keep this simple, as this review has been sitting in my drafts for two months","useful":0,"cool":0},"XAk2vgDtF6rOryzjD2rv_g":{"text":"This place sucks!  We came at 3:30 to check in. They said our room was not ready but they ","useful":0,"cool":0},"cvD49UhHxXPHzGSqNH3TNA":{"text":"Pretty standard stay!  We stayed on the 40th floor - our view was great and the room was c","useful":0,"cool":0},"mmUXYF8FqmKPE9q2EuohPQ":{"text":"Great location poor execution.  Was there for a convention and the location is fantastic. ","useful":1,"cool":0},"nJwZ5iGhZBBDpQbp7D4KTg":{"text":"The location is great and the rooms are lovely.  However, I am here for a conference and i","useful":4,"cool":0},"i2dtHk50oN6nbhPC2abtbQ":{"text":"I stayed here two weeks ago and was flabbergasted that this hotel was so mediocre. \n\nWe st","useful":0,"cool":0},"PXcsdMJqt_cKHN56uQEYGw":{"text":"This hotel is huge, nice, clean and lively with over 40some floors with a Starbucks, bar, ","useful":0,"cool":0},"gX6YiEninX73NNsLu6SoLA":{"text":"$33.64 per night for parking...seriously come on. The second day I stopped getting my room","useful":1,"cool":0},"dUFAPpiEKsF8WwLoxJyHGA":{"text":"Decent hotel. I'd give it higher marks except my room could have been cleaner. There was h","useful":0,"cool":0},"hBBfRy_Huu2l7lnKLUkUjQ":{"text":"Great location and in walking distance from most attractions. The bathrooms in the rooms d","useful":0,"cool":0},"nXOptehtr9nSYGK8riIyhg":{"text":"$12.95 per day for internet? Mmhm.\n\nIt's slow and limited to three devices. God forbid bot","useful":0,"cool":0},"jLG61iDZEZiB-F6DM08Bhg":{"text":"I recently stayed here for a 3+ week stay as a platinum member, so your experience will pr","useful":1,"cool":0},"rficGuRKob32Rfkx5RsXaw":{"text":"Worst experience checking in to the hotel.  Took several trips to the front desk to get th","useful":0,"cool":1},"MSTt15LEaGIcgXYLiDIJMQ":{"text":"Sheraton has been my refuge. Arrived and got very ill (sadly, cancelled rezzies at Link's ","useful":7,"cool":5},"gAgoVrwUT-RLpIV33QlpPA":{"text":"This was one of the best things about our trip to New Orleans! The location was great, rig","useful":0,"cool":0},"pipM_410yWBD6Jownly3dw":{"text":"Great stay! We are club members and our room was on the 45th floor with an amazing view of","useful":0,"cool":0},"xNqDNzOrhqK7aSJo_VrgmQ":{"text":"I was in town for the National Youth Gathering. Right when we walked in the hotel, I knew ","useful":0,"cool":0},"-k6cljjgFwjAoUgzaoJgPw":{"text":"Pretty nice hotel, seems like a good location as well.  The gym had a lot of cardio equipm","useful":0,"cool":0},"nh76jTh5E1tOQ9zKhWD-4Q":{"text":"Nice location right on Canal, you're within an easy stroll to French Quarter, Superdome, e","useful":0,"cool":0},"_jBWjVIb6e02lB25rOGNMg":{"text":"This is probably the best Sheraton I've stayed in. I mean it's  outdated, but what Sherato","useful":0,"cool":0},"lMuyt2W5l9rIgxDpeRVUMw":{"text":"I chose this hotel because of the location and the belief that it would be a \" known quali","useful":0,"cool":0},"g7JdDB37Sfsmey0Bpg9Iyw":{"text":"Extremely disappointing. Our two orders did not come out at the same time (almost 10 minut","useful":0,"cool":0},"WGVIvbScIfD_OwofOdZyXw":{"text":"Stayed here for 4 days while in NO for my 1st time.  Good location.  The hotel was decent.","useful":0,"cool":0},"v0dh9kSoEzGRiQak-MOnSQ":{"text":"I stayed here this past weekend and I was appalled by the service. They made hotel guests ","useful":0,"cool":1},"uoQPsif3O_ZZ9rVszYBIAQ":{"text":"We stayed here over Halloween weekend. Loved it all.  Staff very helpful. Great view of th","useful":0,"cool":0},"7PsVsEzU4HvIxo5ReLqy3w":{"text":"I was really impressed with our stay at the Sheraton. It was our first time in New Orleans","useful":0,"cool":0},"7VgarksehISPIp7ClW5Now":{"text":"My newlywed wife and I stayed here for two nights after our wedding. Everyone here was so ","useful":0,"cool":0},"yRS3vhqrdMLvwfjMLavxmw":{"text":"I haven't stayed in a Sheraton in quite some time due to my perception and experience from","useful":2,"cool":0},"Ob-wafL_ZgVuXXOOCafRUA":{"text":"Very convenience to everything. Walking distance to the French quarter and bourbon street.","useful":0,"cool":0},"TNpp-GFiDIYMaL3uLzDVLw":{"text":"Really happy with the hotel. Reasonable prices for fri and Sat night. Help staff printed o","useful":0,"cool":0},"-Q1lhNg9kaMItBb4U4CfVA":{"text":"Hotels in New Orleans vary widely in quality but this one was pretty ok. The lobby is comf","useful":1,"cool":0},"0wPw0EpChpYxMpJ9W4uQgw":{"text":"This by far was the best Sheraton that I've stayed in yet!! The rooms are spacious and ver","useful":2,"cool":0},"5EYgTPcQvCU53TZFxpmKuA":{"text":"I stayed here for a convention at the end of June and I must say I was not overly impresse","useful":0,"cool":0},"MfIc9zpPZK6gJVH4mUB4uw":{"text":"A perfect fine example of a SPG hotel that is functional.  Rooms have good views of the wa","useful":0,"cool":0},"NGvfJq3DDnphMeTSMKuGQQ":{"text":"Spent three nights here. Rooms were clean and comfortable, staff was accommodating and ple","useful":0,"cool":0},"F2_ArmIpVnY93VytGdLSpA":{"text":"I'll NEVER stay here again!  We were here for 5 days total (4 work 1 play).  The front des","useful":3,"cool":0},"EiDeiM9OKzTv4qD1nvaKAA":{"text":"4 stars for the bar area.  It's got a unique, somewhat intimate feel, which is remarkable ","useful":0,"cool":0},"dVWyckX02Xo-QVB1s-Mn0Q":{"text":"Convenient location to all the various things to see. Surprised by the quality of the room","useful":0,"cool":0},"euLkImm33LTg2-av3TpVNg":{"text":"This a good choice for new Orleans. The location is great! Right on canal street, and walk","useful":0,"cool":0},"dg27XpP42giBdpIxBr-j6g":{"text":"This is the place where you catch the shuttle to JazzFest.\nPurchase in a dvance for $18 ro","useful":0,"cool":1},"btgmafy4R8gMG-31NfKJCQ":{"text":"I had a great stay here. I think this was mainly due to the women's basketball team, Louis","useful":0,"cool":0},"V3K7kUyNk1In_7ZA6l_xqA":{"text":"Pros - Location, great views from higher levels and really comfortable, relatively spaciou","useful":0,"cool":0},"qgsXufyWrt4SR5RDe8FW2w":{"text":"Ive stayed here twice and both times were very nice. The beds are very comfortable, the pi","useful":0,"cool":0},"qlqcyqhOHrWV8Gf7JsKqkA":{"text":"I got shacked up here for a week. \n\nIt's not bad, actually nice, just a few things that di","useful":0,"cool":0},"xzQYPYehd7tfn6EU75UR6Q":{"text":"The Hotel is located walking distance to everything including Bourbon Street. The fact tha","useful":0,"cool":0},"VQhwfYts_uAORqtQCeuncw":{"text":"The room itself was clean and large, with fairly comfortable beds. If I was rating just on","useful":1,"cool":0},"Q8XSA3kn8Ht4rpETBAQeiw":{"text":"I'll make this short. I was here for a conference. The wifi was horrible. I couldn't get t","useful":0,"cool":0},"MGDSiozQ1pc0Hk29S1HIFQ":{"text":"We were thrilled with this hotel. We booked via Hotwire, so we didn't know what we'd be ge","useful":2,"cool":0},"8y7f4X8r0Rs-lavcj7neqw":{"text":"I was in New Orleans for The Essence Festival and had a grrrrreat time. Sheraton  check in","useful":0,"cool":0},"lhjubFH5WEQQsTaUh7jfBw":{"text":"Very few amenities.  For such an expensive hotel,  I would at least expect a mini fridge i","useful":0,"cool":1},"2HHPDb48xjXrCvQhq4ooFA":{"text":"I was not sure what to expect...as I admit I haven't been in a Sheraton in a million years","useful":0,"cool":0},"jJvX64QggreGeHPlPfWxww":{"text":"Whatever you do, get a room without a connecting door.  You will hear everything on the ot","useful":1,"cool":0},"rgR6l7GUCHlL2F1T-58xLQ":{"text":"Stayed here for several weeks for work.  Very friendly staff, outstanding gym.  Avoid the ","useful":0,"cool":0},"Tt1JhNeQzYrrWnIBmLDqLg":{"text":"Staying in a hotel upwards of 175-200 nights a year, I would consider myself an expert whe","useful":1,"cool":0},"jB3-Wp5l2IOjcdxMRk-5GQ":{"text":"Nice hotel!\nVery convenient and location is perfect.  Right on canal and a couple of block","useful":2,"cool":1},"YjYoVBSKj0Ko7AaDtvlv8w":{"text":"Very good Sheraton.  It's huge, but it's pretty good.  You can tell it is newer or has bee","useful":0,"cool":0},"02LUoFuOpo4sAGvNikbKOQ":{"text":"I stayed at the Sheraton for 5 days during a conference in November 2015. I was completely","useful":1,"cool":1},"cNz_cOXYsu_l1tGClMjguw":{"text":"Hotel is pretty nice , great location . Just a heads up parking is $38.00 a night for vale","useful":0,"cool":0},"ir8afNoO3tvdCYulrrZZ0w":{"text":"We stayed at the Sheraton for 4 nights in March. We had a Deluxe King Room on the 44th flo","useful":0,"cool":0},"ljGOnN8qPEOh8jj1fRB1Zg":{"text":"David our server was awesome. The food was great too\n  We came back a second time and Davi","useful":0,"cool":0},"hZJDEPc8IE1MS370eK9ALw":{"text":"I just returned from a 5 day/4 night trip to New Orleans staying at the Sheraton New Orlea","useful":0,"cool":0},"TGSoff2wqcoEIK_qmQP4zQ":{"text":"Short Story: would stay here again if I return to NOLA. it's conveniently located on a mai","useful":0,"cool":0},"DDTGnDlilf43t_M04XbOww":{"text":"IT was wonderful- great location to bourbon street and jackson brewery and jackson square.","useful":0,"cool":0},"cbRmajr8dY2HmeTr5KgQ1w":{"text":"Not sure how this hotel got such high ratings, as I was not satisfied with the service at ","useful":1,"cool":0},"e3c6SY_85AXkHC-vZjJDBA":{"text":"Two night stay was great. \n\nMy mother was staying here as part of Tulane-run program, and ","useful":1,"cool":0},"ZBwY-EXbDI_71VpiC_i1RQ":{"text":"We stayed at the Sheraton for a week of October. The hotel was beautiful and there were ma","useful":0,"cool":0},"oufcwyeYZsLD9JSmH8Ouag":{"text":"This hotel was very recently re-done - so the rooms are very clean and modern along with t","useful":0,"cool":0},"h2yT-SzVmf72is3zo6Ac5g":{"text":"Pretty bare bones hotel that has adequate rooms, convenient location to FQ and very uninsp","useful":0,"cool":0},"hSO5lX2ojxufYWR_levFog":{"text":"Great hotel, fantastic location, very friendly staff, clean. Valet is $44/night which is a","useful":0,"cool":0},"KdizTJmDruDVv3TPryboBg":{"text":"Meh-it's fine. Good location, a nice staff, and decent accommodations. However, it's alway","useful":0,"cool":0},"sA7p0Z-NszkJt16JDNib-Q":{"text":"Four diamond resort... but with water damaged ceilings in my room and a broken mirror.   B","useful":0,"cool":0},"al2K9I2lGKnamJUvD0cuMQ":{"text":"Very nice hotel that is very clean. \nNice program where you can select not to have maids f","useful":0,"cool":0},"6Q9nTBYsHV_OyPPjxPSquQ":{"text":"The check in process was easy. The front desk staff was very friendly and accommodating. I","useful":0,"cool":0},"Mp3SG9-rS375yTP3b3zGfA":{"text":"This hotel is in a great location, really close to Bourbon Street. It is probably nicer th","useful":0,"cool":0},"IXFxlSvNNs36EjVG6UKAtg":{"text":"After we packed we realized my fiance's custom-made Reebok Nanos were missing from our roo","useful":1,"cool":0},"MguE-RWB-mOClEe9_gzO4Q":{"text":"I love this place.  The people that work here are what really make this place special. The","useful":1,"cool":0},"8ta-tHflRhUB6mxcdyxf7g":{"text":"So...Apparently back in 2009, I said I loved this hotel. Can I change my mind, ya'll? \n\nI.","useful":1,"cool":2},"M--s0sQJATSiZzOyi4w7Sw":{"text":"First thing I have to say is $500 for two nights. That's a steep price to pay for someone ","useful":0,"cool":0},"BqWGaIikhGwfZgAi9TPkVA":{"text":"I thought I was a special case but I see I am one of many. \nTHe BAD\nWaited 1 hour for the ","useful":1,"cool":0},"4RMZV1M7algcAqjWoAVrXw":{"text":"Great location to bourbon street. Walking distance. Big hotel. Clean and nice inside. Has ","useful":1,"cool":0},"34dP1OCpxT4EaQymo95EdQ":{"text":"This was such a great experience. \n\nGreat location - adjacent to the Quarter, but far enou","useful":0,"cool":0},"DQqUGRRhPPw01BPFegJp0A":{"text":"We stayed a week and were very happy with the hotel and location. Even though we booked at","useful":0,"cool":0},"hnl3Sdt71_8XpgS-VENFFg":{"text":"Nothing but praise for this hotel!  Nice size room with amazing views and location.  Custo","useful":0,"cool":0},"sxbQugUf8wrGHlXal50Opw":{"text":"Had something gross happen to me! Dirty dried saliva pillows...crumbs on the bed. Just nas","useful":0,"cool":0},"gb74-yRT3Mf0v4F_cosDbQ":{"text":"Been stuck here for meetings the past three days.   They keep the meeting rooms so cold it","useful":0,"cool":0},"QZhsm0LsBZmaQrY0C6KZFg":{"text":"Wish I would be able to give this place a 5 star review but there were a couple of discrep","useful":0,"cool":0},"4CvsubgVStZ6xH4Pvd0j_w":{"text":"I LOOOOOOOOOOOOOOOOOOOVE IT HERE!  The rooms are nice.  It's centrally located, a stone's ","useful":4,"cool":3},"qIU_Zz0O-QHaNfDx18OYgA":{"text":"Decent hotel. \n\nPros-- price and location (only because it's not in the thick of the frenc","useful":1,"cool":0},"I3c6msGdCH9x0HlaYXCNNA":{"text":"My wife and I stayed at the Sheraton in January 2015.  She had a conference there so I am ","useful":1,"cool":0},"L9YJo4_cDpbOuzSpCsJn6w":{"text":"So nice here! Goodness! \nThe lobby is air conditioned and on a hot day it feels like heave","useful":1,"cool":0},"R8PVxnUWitedB0kc92CK6Q":{"text":"I stayed three nights here for a recent conference.  First the good.  The hotel is nicely ","useful":0,"cool":0},"XH6d-TssApgUMyz3e7PJrw":{"text":"I have never been so happy to leave a hotel in my life. My friend booked it on one of thos","useful":0,"cool":0},"6lBQl1WaW7StokZTbyKCAg":{"text":"Tired, mediocre hotel that was likely 4 star 20 years ago. \n\nThe lobby has a strange punge","useful":1,"cool":0},"MAm6mLoYGZx2fjMmvfCdQg":{"text":"review for stay during mardi gras\n\nthe city is MADNESS during mardi gras. in order to comb","useful":1,"cool":0},"jXp-n7-GUCjjk1bYzhGRhQ":{"text":"Excellent location. Rooms were clean, big, fairly modernized. Lobby was big. They allowed ","useful":0,"cool":0},"hSnCrtFNR1W6GA5pqDj22w":{"text":"Not the regular place I stay when I visit New Orleans, but this hotel is really good for b","useful":0,"cool":0},"HTFjECwP0fjYGav4HhXL_Q":{"text":"We received a good deal on this hotel through expedia.com. Standard looking hotel room. Li","useful":2,"cool":0},"nXCNNdw9kUHCXJxGC8ZLjA":{"text":"Here for national conference. Tv didn't work, hot water didn't work, no fridge or microwav","useful":0,"cool":0},"Aa1zhB7Zim4q62PrRbvG5w":{"text":"great view from the room.  the bed was comfortable and room clean but the rest of the hote","useful":1,"cool":0},"Y_VjCL_OpYv0KVJk1MKQ0Q":{"text":"Excellent hotel near to Bourbon Street. The hotel was a bit full during the carnival but w","useful":0,"cool":0},"uk3lLRCp8-NBUSsK3VFZFA":{"text":"Stayed here June 17-21st, 2014 for a conference, the staff were very friendly and accomoda","useful":0,"cool":0},"9rlye9d5odGu-AsN-sYZpA":{"text":"We just arrived back home from a great stay at this hotel!  The staff, especially Denina a","useful":0,"cool":0},"s5cAKH2dtJQwte2O5DznFQ":{"text":"The good-- Friendly staff, big clean rooms,comfy bed and pillows, \n \nThe bad--- When you f","useful":0,"cool":0},"0nnuWidAI61D4xaHPIuAOw":{"text":"Seemed crazy expensive to me, but hey, I wasn't paying for it. My work had a big conferenc","useful":2,"cool":0},"wG05A88t4IccCIGWtEAhzA":{"text":"We stayed her for new years. The rooms are clean, the staff downstairs seemed friendly eno","useful":2,"cool":1},"Q9_zWhTQ-cuOxpDACy5EuA":{"text":"There are some things to love, and other things to hate about this Sheraton.  Considering ","useful":0,"cool":0},"dy3o5kaTBz2ru7UnxsA_fg":{"text":"Location and rooms were great. I like the option of not having the room cleaned and gettin","useful":0,"cool":0},"Z4h0FI7rl7aMlSzHPvHrPg":{"text":"Frankly I'm surprised this place has 3 stars overall. I thought the location was perfect. ","useful":0,"cool":0},"vt_F5eyU_49y8fC3DkoYZw":{"text":"4 stars for the low price and location with a canal street view.  \nStayed there for three ","useful":1,"cool":1},"uj_2zlPAfP3KQtKVbpS3og":{"text":"This was the worst stay ever!  Our room was located next to the elevators and for $300 plu","useful":0,"cool":0},"k6EdmKTgi2l-Dea_HLa-jA":{"text":"This hotel would have gotten 4 stars from me, however, I have stayed at Motel 6's that wer","useful":0,"cool":0},"5BSEkb-zBLCUKlG1nxnlzQ":{"text":"I stayed here for a work conference last year. I have to say this was a super classy place","useful":0,"cool":0},"8D6Q21r68zhLQFTJDjSq6A":{"text":"Absolutely horrible valet service we've been waiting in line for over 40 mins waiting to p","useful":0,"cool":0},"JYpXCOOk6MTgPfphlzmOuQ":{"text":"I stayed here the weekend before Christmas 2012 for the Cosmic Convergence Festival.  Ther","useful":2,"cool":1},"klkLWS4n-EwJx5zUnW8x7w":{"text":"I was really nervous after booking this as a mystery deal on hotwire and seeing only three","useful":0,"cool":0},"USnhObPDPyuJktXd04E1Ow":{"text":"I was here as part of a large convention and have to say this hotel handled the traffic gr","useful":0,"cool":0},"CV7Y_5Ec9RRUvu063OB0MQ":{"text":"Hot water went out at and was sucking air at 8 am. \n\nDrinks in the bar\nI had to go up and ","useful":0,"cool":0},"yywjcTEqrlBeSv3ChBJ80A":{"text":"Place is real nice. Stayed there for one night and customer service was excellent. They ha","useful":0,"cool":0},"IMrENViaRdd976tNA9JvjA":{"text":"Great location. Close to French Quarters and only blocks from Bourbon street. Close to tro","useful":0,"cool":0},"iUEZwB2ZVWF5deCHi-WSpg":{"text":"There service here is so amazing. My flight got cancelled due to hurricane Harvey and they","useful":1,"cool":1},"RgQxksCmmRkA7OjujNqSLg":{"text":"Very disappointed. I have used many SPG hotels and this Sheraton fails to deliver.\n\nGoing ","useful":2,"cool":1},"OurTatnLsCs5R-4TZtOc1A":{"text":"I was toggling between a 3 and 4 star rating . First off the hotel is beautiful and the ro","useful":0,"cool":0},"zKW15VYL6olhOz_-MBmvCg":{"text":"I stayed at your hotel on 2/9-2/10 in Metairie.  When I very first arrived at the hotel, I","useful":2,"cool":2},"t8xmhks0a0u8FM6BIMebMg":{"text":"I stayed at the Sheraton hotel for two nights during my recent trip to New Orleans. The ho","useful":2,"cool":2},"Y0zOE3r_J0BvwfzYgYA33g":{"text":"Hotel is right on Canal street where alot of the​action is. You can walk to many sights wi","useful":1,"cool":1},"fS2HUzrOek5ZPS96P_krbQ":{"text":"Great hotel, great location, in a great city. We stayed here for a long weekend in early M","useful":0,"cool":0},"ELuGOOPeYVdL2e5AdNRxrQ":{"text":"I thoroughly enjoyed my stay at the Sheraton New Orleans! Upon arrival at check in, I was ","useful":1,"cool":1},"Tkbu43taWu3txjkyQgq0Ow":{"text":"Stayed for three day Easter weekend. We got a decent price on Priceline and hotel is walki","useful":0,"cool":0},"z2r3sAhL70mDQRU2HdiKXg":{"text":"This is a standard Sheraton with at least some of the rooms being newly updated consistent","useful":0,"cool":0},"AuU1ca7iJ5qcgQ3wduF5Xw":{"text":"My experience of three night stand is mixed with good and, well, less than good.\n\n0. The d","useful":2,"cool":0},"-3nCzOAL-uCVcBW4ze5EhA":{"text":"Great hotel for the business traveller. Nice, well-equipped gym, rooftop pool with lounge ","useful":0,"cool":0},"piR5aI_unu2XwVmxyMqd0g":{"text":"This doesn't feel like a Sheraton in terms of service and cleanliness. It's a beautiful ho","useful":1,"cool":0},"vMN1GPIyo38ztigiJ3Hx2g":{"text":"Attended a conference here that overlapped with the first weekend of the Jazz and Heritage","useful":1,"cool":1},"tpaanXodzJrWEx_hunavHA":{"text":"This private Club lounge on the 42nd floor has great views of the city. Depending on your ","useful":3,"cool":2},"L8jRVg9g_UnJjaYrRQ7GkQ":{"text":"Great location on Canal Street, c'mon, where do you want to be on the very noisy Bourbon S","useful":22,"cool":22},"t99RiTVP4fSqqEJ1vqzIKw":{"text":"I really enjoyed this hotel and the location doesn't get any better. You're on Canal with ","useful":0,"cool":0},"6CVIf7HuRFmF8QxdkLwztg":{"text":"I stayed at the Sheraton New Orleans hotel on Canal St March 4-7 my original stay was book","useful":4,"cool":1},"gio1K-1_C6-Us87CQdQ1Ig":{"text":"As a previous platinum and now gold member, this is by far the worst Sheraton I have staye","useful":2,"cool":1},"unMOdOZUOCttCS1V9lShXw":{"text":"Not really a huge fan of this place.  Arrived here with a group for a conference, and the ","useful":2,"cool":0},"G4uZoWziDHMfKqHwcEeiIQ":{"text":"My experience at the Sheraton New Orleans Hotel was underwhelming, to say the least. The c","useful":7,"cool":2},"aJIt1eIL_F_OwpfTrDNccQ":{"text":"If I could give a negative I would. My party had to come in early for the essence festival","useful":1,"cool":1},"wQlwb7llSGRItPQZ7rasfQ":{"text":"Arrived last sat and left Tuesday...clean, great smelling, Starbucks, accommoding, easy to","useful":0,"cool":0},"FHo_9kAKHjIj6qfsRl1_7A":{"text":"So...we've talked about \"big box\" generic hotels. This is another one. Nothing to distingu","useful":6,"cool":4},"muwoA8f9Hu_hfE1TdySXcQ":{"text":"This is my second time staying at the Sheraton in New Orleans.  My most recent visit was a","useful":0,"cool":0},"SNwT4WlcRwEqvb9guPsmOw":{"text":"I have stayed at this hotel on all of my New Orleans trips. I wanted to try a different ho","useful":1,"cool":0},"ydr39PO9F835BQ_lRd6iqg":{"text":"We stayed here when we came to a friend's wedding in New Orleans.  She had a room block th","useful":1,"cool":1},"EXZu09UgNIch-ZUFZBL4lg":{"text":"The most worst rudest greediest hotel I've ever been to. They want to charge for parking, ","useful":3,"cool":1},"7MSBW0rOq0p4pX9MQoYqHg":{"text":"Overall: 3 stars. Would only recommend staying at this location if you plan to spend most ","useful":0,"cool":0},"NTTp9xczmzkQMNgqxHww3w":{"text":"I know it was wrong, but I crashed my school's Halloween party here one year.  But let's n","useful":0,"cool":0},"CFB9Dx7sNwKAICoZk3sFNA":{"text":"It looms large and the location's pretty spot on, but it's sort of hard to fathom in a cit","useful":1,"cool":1},"T4sLrNW5mUpBd4xgc07HiA":{"text":"Good hotel, not quite great.  \n\nPros: location- (Bourbon Street, restaurants, bars, conven","useful":0,"cool":0},"0rchdNeTZERiu1wi3Z11bQ":{"text":"Everything about this hotel stay was top notch.  We arrived and were quickly checked in, t","useful":0,"cool":0},"ZvizG_d7L-qYxZqJ2y817w":{"text":"The worse experience I've gotten ever. I've had better experience at a motel. \n\nWhen I fir","useful":3,"cool":1},"QhDpnBKwhMCtsnyaRDAhNQ":{"text":"Went to NOLA for the first time this July and stayed here. We were vacationing for my pare","useful":0,"cool":0},"cYkrQSFcGl2MMsdpTy5ZKQ":{"text":"Honestly this hotel was nothing special with the exception that it was in a great location","useful":1,"cool":1},"paowcgl1PHX5-44cHfOASg":{"text":"ALL of the staff were so friendly, accommodating, knowledgeable and helpful! The rooms wer","useful":0,"cool":0},"0_SVlDGVjPTdnEdDwhPfXQ":{"text":"Bir kongre sırasında kaldım. İyi bir otel, çok merkezi, Fransız Mahallesinin hemen bitişiğ","useful":1,"cool":0},"M8fPDmTihdpRAFLZ1ZwjQQ":{"text":"The place was really nice, which explains why the rooms are so pricey. We stayed there bec","useful":5,"cool":0},"mUnJlFp4cA3EyfssKJy4hg":{"text":"Check in experience was a nightmare.\n\nStaff was Dismissive, uninformed, and woefully unhel","useful":1,"cool":1},"PZB2IbKHBKzCXJNyw4LFxA":{"text":"Facilities are fine.  Food is fine.  Respect and deference (as accorded to guests) is awfu","useful":3,"cool":0},"sgclQt9-Fv6-KZPp5ehtQA":{"text":"It was a bit dirty.  We had to be moved 3 times to get a room that was clean. It's in a go","useful":1,"cool":0},"2I_4WasnBGVQtP8FzOiyhg":{"text":"Worst experience in a hotel ever.  After 3+ hours of asking hotel staff for help with obno","useful":3,"cool":1},"H2mY3J5A5f0zH5pYVlsAcw":{"text":"Not gay friendly. Come here for Mardi Gras and spend $1000+ dollars and they are going to ","useful":3,"cool":1},"k28WOf-n990mrtkcJVubrw":{"text":"This hotel was impressive. The rooms were clean and we had a great view of the river.  I d","useful":1,"cool":0},"xAw_l_MUsCQXu8pwOAx60A":{"text":"Had to make a quick business trip to New Orleans and this was one of the few Starwood hote","useful":1,"cool":0},"4SXNVfifQybRq1_uyB2dfw":{"text":"$300 night to stay in filth with cracked ceilings that look as thought they are going to c","useful":0,"cool":0},"6McD454Tvw6AK5taUG6iTw":{"text":"Change your plans if this is where your planning on staying.  We had been here several yea","useful":1,"cool":1},"EWXKTVO-A5KoZVo-hZxyzA":{"text":"Ever since we arrived in New Orleans, our reservations for our group was a mess. The accom","useful":1,"cool":0},"Lnftb2EXKWy6trj55P9IFQ":{"text":"Very disappointed in the this hotel and specifically the front desk. Knowing I late flight","useful":0,"cool":0},"C_yS9JRGPxcoGjXHjiH8GA":{"text":"Update: There must be more people in the hotel as the water is a lovely boiling hot, and t","useful":0,"cool":0},"FTqLKI7n1vaP_Q3Bz63ptQ":{"text":"This was the worst stay in any major hotel I have ever had.  It started with a bag of liqu","useful":0,"cool":0},"_--gpydbBwhJBsrCQEcWVQ":{"text":"I had a staycation here for labor day. The lobby is absolutely gorgeous! the swimming pool","useful":3,"cool":0},"yx5KGtWUWRgIRaH1STnhtw":{"text":"nothing exciting about this hotel...the staff was freindly, but the room was OK. There was","useful":0,"cool":0},"O64lJCw41G5aLCXEZY_tHQ":{"text":"Amazingggggg beds & pillows.  I literally never had a better rest than I did before I visi","useful":1,"cool":1},"V5Bz32M3W3U3zs6j8gWe3A":{"text":"My room was roomy and the view of the city was amazing. \nFood was ok and drink was great. ","useful":5,"cool":3},"JkWHPfM1oEhTrMtD-tDocA":{"text":"Hotel is well appointed and the rooms are a pretty good size. Floor to ceiling windows on ","useful":1,"cool":0},"jkEuKaUaVFiQNEK4LnI2Nw":{"text":"I booked this hotel within a package deal through Priceline. The hotel is perfectly locate","useful":1,"cool":1},"8dswIUElEAwnPue7gQwuqQ":{"text":"I came here for my 21st birthday and Tayla at the front desk was AMAZING help. She not onl","useful":3,"cool":3},"fbCYYqERK-XS6TuXROWWyA":{"text":"Huge hotel with a very happening lobby. The Elite check in for Marriott is quite slow and ","useful":0,"cool":1},"JFi8MYBxlFj1FW0qL3zPiQ":{"text":"So, we had a large group checking into this hotel, which I completely understand is a huge","useful":0,"cool":0},"jLWLvt-4Y3L406RU2tBjMA":{"text":"My strongest recommendation for choosing a hotel in New Orleans is DON'T STAY IN THE FRENC","useful":0,"cool":0},"xCctCJx4HckZ3XS7XOMaWQ":{"text":"We came here for a work conference for 4 days. On day 1 my coworker found a bed bug in her","useful":3,"cool":1},"ct9hVoWiH7zG5Re7STHhzA":{"text":"Great hotel to stay at if you're in New Orleans and want to be in the French quarter.  The","useful":0,"cool":0},"98IL8KE0xgx0ZrLmtAg-IQ":{"text":"An enormous hotel right off of canal street making the location excellent for almost anyth","useful":1,"cool":0},"gC5YPo0qOf5FeCmFhw98rw":{"text":"The location of this hotel was great, and that's about all. I came here for a conference. ","useful":3,"cool":1},"jHpfSLPD04rgi7BLJjt5cA":{"text":"Primarily a business / convention hotel but perfect for vacation and pleasure. Close to al","useful":0,"cool":0},"QVG5jrCDnr1VihXPLsLNyQ":{"text":"Absolute worst hotel I've ever stayed at. Ever. And that's saying something considering I'","useful":2,"cool":1},"3G1xiVOg4ZUbbks-2pM_bQ":{"text":"Great hotel with some outrageous prices on common amenities.  Great hotel worthy of the Sh","useful":2,"cool":0},"JPxmrcy7SNTXnMfPkEMzeQ":{"text":"I was able to find a travel package deal online for a stay at this Sheraton, and staying a","useful":1,"cool":0},"zqdO_IwjPLAsF7iYH480yg":{"text":"For those rated this as 5 stars: are you joking or you haven't stayed in any decent hotel?","useful":0,"cool":0},"m9dad0R88BoO9GOaMOiMag":{"text":"My human stayed there and it was a nightmare... There was no hot water... then the cold wa","useful":1,"cool":1},"D-9lF7Fia320BVwcjJrsCA":{"text":"I don't stay any where else when I come to New Orleans. I love the entire staff especially","useful":0,"cool":0},"HOW8D9W4pmjpjYoLesG3tg":{"text":"There was no one staffing this hotel on the day after Christmas. Unable to get there due t","useful":1,"cool":0},"_I3pDNTtk8ZafYWPnc1QaQ":{"text":"Great hotel!   Very nice, clean and great staff so fa.  Excellent rate too!  The bar in th","useful":0,"cool":0},"-EkHwKT6o-GPlRR2ZVyQRQ":{"text":"Gorgeous Hotel right in the center of New Orleans!\n\nIt's located just a couple of blocks f","useful":17,"cool":10},"MkHZNk3XL1JULXY3sIpjmA":{"text":"We Pricelined a hotel room and got the Sheraton New Orleans. \n\nIt was going through a reno","useful":1,"cool":1},"ZwbnyQCDKLtmqlzUqKGygw":{"text":"The Sheraton is located very centrally on one of the main thoroughfares of New Orleans - C","useful":0,"cool":0},"EKE9Q1kQamCBjOOsirjcmA":{"text":"The Sheraton sucks for not giving us a room with a king-sized bed. Two doubles aren't suit","useful":0,"cool":0},"JKBB9KE8hR2qqEa7Pfgvxw":{"text":"We have been trying to check in at the Sheraton New Orleans Hotel on Canal street for hour","useful":1,"cool":0},"ljFCrQyhRv4RjXePb2QGbQ":{"text":"I went to New Orleans and had the opportunity to stay in this Sheraton Hotel. This Sherato","useful":1,"cool":1},"PMFev7Isak9v0mXG7vyBhg":{"text":"Recently, I made my first visit to New Orleans with my company for a conference and we sta","useful":1,"cool":0},"q1ESeopDCh8BaKt19Um_ZA":{"text":"A beautiful Hotel breakfast here is wonderful fresh and next to everything, casino , flea ","useful":0,"cool":0},"dK1PdM_wUviRHg2q3uP9oA":{"text":"Honestly my expectations were not high going in. I have had friends stay here in past year","useful":1,"cool":0},"Z7sB14Jdrj42goYAmsk0IA":{"text":"This review is based entirely from the perspective of my job as a meeting planner.  My com","useful":2,"cool":2},"GdsQRSj03FL_uj3wKxMV6g":{"text":"Nice Hotel, Great Location \n\nThe Sheraton New Orleans is a nice place to stay while visiti","useful":3,"cool":2},"mF_NNz9HQJsQ0zIlj1st-A":{"text":"Dog friendly sans outrageous pet fees. Fantastic location convenient to all the action. Ni","useful":0,"cool":0},"NlPXjnd_6Su-vpfgG8RMkQ":{"text":"I'm really surprised to see that this hotel on has three stars on here... but I'm not sure","useful":0,"cool":0},"nUnKst735eNhs3E2hNj6tA":{"text":"I really hate to give this hotel a one star rating. In fact, I rarely write negative revie","useful":17,"cool":2},"JSgoSSxyYez1uiZlygR2ug":{"text":"Pleasant surprise - solid hotel!\n\nWe stayed here for Essence Fest 2019 and the service and","useful":0,"cool":0},"NJ7FMKfYRMGOkajiFjzMvw":{"text":"I have been to many hotels as I travel to many cities around the world. I'm surprised by t","useful":2,"cool":0},"0TorQJaiFkTJ9ZhEEyEuUw":{"text":"This is my second time staying at this hotel, and I must admit its starting to become my h","useful":1,"cool":0},"WKyu-UpRDUATBQ3Rx5et2A":{"text":"Very busy hotel. Checked in and my room was not very clean. Had popcorn kernels on the flo","useful":0,"cool":0},"4Y9U00Fx2uGAbl7K8hc9_A":{"text":"I loved this hotel! After a long day of walking the quarter, it was amazing to come back t","useful":0,"cool":0},"7dt5FNnup1uPY4qzJyQ-Og":{"text":"Sheraton, you get me. \n\nThe Sheraton on Canal is a sense of calm in the sometimes crazines","useful":1,"cool":0},"UJ6AF9lZ1tEKBWtzkl82rQ":{"text":"Terrible! The service is awful, don't expect help from a bellman or to get your car from v","useful":1,"cool":1},"ISN9-Tzrq2n4J9L_Y9V7bA":{"text":"Overall our stay here was great.  Big comfy bed, clean room daily and a fantastic view.  B","useful":3,"cool":0},"THCAN4Mo7n_N2ZY9A68jxg":{"text":"Location was great and room was nice. Took over an hour to get checked in although we didn","useful":0,"cool":0},"1V1lO5k0RC21AgcZo0GbMQ":{"text":"This was a nice hotel! The Starbucks and the bar downstairs was a big plus.\n\nWe were here ","useful":1,"cool":0},"OIvoS10T6vt5xLOlLwNBfg":{"text":"I stayed at this hotel for a conference I attended for work.  I was very pleased with the ","useful":0,"cool":0},"OirOpvrMQH4Ln23olgQzzQ":{"text":"This is the worst customer Service experience ever!!! Their phone system sucks and makes i","useful":0,"cool":0},"YHeKlDRVrOevN9XtkiAWHA":{"text":"This hotel was a last minute book at the airport on the way to New Orleans. It was definit","useful":0,"cool":0},"O5KEQIZG4QGVnRa2w1JH-g":{"text":"This hotel was great... I'm giving it 3 stars because it really sucks when you book this h","useful":0,"cool":0},"ClW80-6XJogjiUjaE3Dlgw":{"text":"Not the most amazing hotel I've ever stayed in, but got a great deal on Priceline and the ","useful":0,"cool":0},"FiKhb1jHkD0fT83N7WHrRg":{"text":"I am so happy we stayed here! The location of this hotel plus the luxury of modern ameniti","useful":0,"cool":0},"WlJwupmM9c7YNGcprctqjA":{"text":"This place has a lot of potential. I would say the location is perfect. It's close enough ","useful":0,"cool":0},"kd6JzpLKW3nXmwkgtvJV1A":{"text":"Where do I begin........5/28/16. Our morning started by heading to the club lounge for bre","useful":0,"cool":0},"oaaYJmY1Zm0MUFHPHbf09Q":{"text":"If you love physical and VERBAL abuse this is the hotel for you.  If you have an issue and","useful":1,"cool":0},"PVw7q3ok2DOaOpf1tpw3Pg":{"text":"Am staying here for a large conference and it is very well organized. My room is handicapp","useful":2,"cool":0},"jGtBurwt9D97g3AwuiOwpg":{"text":"I have been a guest at Sheraton on Canal many times over the last 20 years.  On my most re","useful":1,"cool":1},"HwtmCvzvgK-LdhTGqGHj4Q":{"text":"Normally when I go to New Orleans I like to stay in the heart of the French Quarter, but s","useful":1,"cool":0},"TNfYJc6Z5ZR_rfNIVrYESw":{"text":"We visited the Sheraton during Mardi Gras, and I must say there are not many hotels around","useful":0,"cool":0},"SFbfx4lRqq15hKHOCsU3tA":{"text":"Stayed for business in late March 2019. Location of the hotel is great, right near the Fre","useful":1,"cool":1},"0l0e5FFZtHuRowCRDWMUyA":{"text":"The hotel rooms were very comfortable in my recent stay in New Orleans in November 2010, b","useful":0,"cool":0},"-s7L1wp0eSxU7_A0NKOhng":{"text":"I came here for a conference and besides the attractive lobby, this hotel is nothing it cl","useful":0,"cool":0},"zm-2FSaHfWzFMvXA4qVgtQ":{"text":"If you plan to use wifi at this hotel, look elsewhere.  Their wifi is horrible, meaning yo","useful":0,"cool":0},"SxMvpRfXoYveHfmOC60MLQ":{"text":"OMG, those deathly escalators! \nI was here for a convention, and that weekend there were a","useful":1,"cool":1},"R6VPgz7O4qWle0W54inomw":{"text":"The last time I gave one star to a hotel, it was for many reasons - one of which was havin","useful":0,"cool":0},"7foDey_5-QM4c4cHvbVw-Q":{"text":"STOLEN PROPERTY- AVOID THIS HOTEL\n\nI'm a gold member with Marriott, and I have never had a","useful":1,"cool":0},"OgrpJbWi8ROdBBYEBx7EYg":{"text":"I would have expected more from a Sheraton. When we first got there, the valet and bellman","useful":0,"cool":0},"Lz596-eiSWoRBJvZKjl8gA":{"text":"Great location near the French Quarter, but over-priced parking, panhandlers in the lobby,","useful":0,"cool":0},"9JJsV9PjC1uO2xHzVIHP6Q":{"text":"This review is for the bar at the Sheraton only. Stopped in for a quick lunch and drink wh","useful":0,"cool":0},"mKc5YMWThxpeCT6-IbLIMA":{"text":"Sorry, but can't give this Sheraton a decent rating. I left over $100 worth of workout gea","useful":0,"cool":0},"uHoid1fE91Z_5W0E9MpI5A":{"text":"I visited NOLA for a work conference held at the Sheraton in October 2017. The price is a ","useful":0,"cool":0},"yh_3ilov9Am1aUGf4oYeqQ":{"text":"Most disorganized and unprepared hotel.  Check in is supposed to be at 3pm.  80 minutes la","useful":0,"cool":0},"HJC53OFBDY80JUorirnJPQ":{"text":"My husband and I stayed here for 5 nights while we were at a conference that was also held","useful":0,"cool":0},"q_JPeWaqcHGz-ULxWeIsdg":{"text":"Can't believe we got this place for $100/night.  The service was great, the hotel is very ","useful":1,"cool":1},"Ar306z3ovEqkAMvuAOzhZw":{"text":"Nice hotel. Room was nice too.. Service was not bad either.  My room had a great view so I","useful":1,"cool":1},"PCCjfAGEMjKI3e5RfFZnYg":{"text":"I highly recommend this hotel if you want to be close to the French Quarter and also want ","useful":0,"cool":0},"hXRBcMViXxSw8JkFd6xFQw":{"text":"I stayed at the Sheraton New Orleans just last week (12/5 to 12/8) and I must say it was a","useful":2,"cool":0},"jgiUd9i5pN1PNx1tJOpMqA":{"text":"The hotel is nice and the beds are very comfortable. The only down side we had was that th","useful":0,"cool":0},"wp1KPd045CyrvMAED2qFmg":{"text":"Sheraton is my favorite place to stay in New Orleans when we're partying down in the quart","useful":2,"cool":0},"I5tPp38gZuCBb-RX5KzW5g":{"text":"great location\nmodern, clean rooms\nfriendly staff.","useful":1,"cool":1},"bKDeNPpkC4kyipp1sn1YuQ":{"text":"Although the lobby and bar area are gorgeous, the walls of this hotel are paper-thin.  I c","useful":1,"cool":0},"xTh6XbNIFK1vsHh2diWuGg":{"text":"We won't stay here again. Ever. There are much better options in New Orleans. There  is al","useful":1,"cool":0},"t2KIfTTN7iSXn4tJOSVfBA":{"text":"Check in was chaotic, our room wasnt available till after 5pm. The walls are thin and the ","useful":0,"cool":0},"mHYMdXw3jHTdZpQsu9w85w":{"text":"Dogs stay free!!!\nOn top of that, the place is clean*, in good shape*, and safe*.\n\nLocatio","useful":0,"cool":0},"ZnMmLSEG1CQEUWpI4C_RrQ":{"text":"didn't stay at this hotel, so i don't know about the overnight experience. but we visited ","useful":0,"cool":0},"Wjha0QP68TjB634GXOBuAw":{"text":"Great location, and comfortable room. Perfect for walking to everything in NOLA.","useful":0,"cool":0},"ieuApvVmvVjWK7HKAYrYkA":{"text":"From the front desk at check-in to check-out my experience here has been atrocious. I'm no","useful":0,"cool":0},"Xsm_G0wehgH-3xsJtbwegQ":{"text":"This is a 3-star hotel at best. The girls at the front desk were very nice and the service","useful":0,"cool":0},"0x2DRq08AEc85aWjJvW0Qg":{"text":"The location is probably the best part of the hotel. I would not stay at this location due","useful":2,"cool":1},"O4lilXo9z5W9GFrGvq8L5Q":{"text":"What a pig sty this place is. Bad, uninterested service. Huge hotel. Dirty carpets, dirty ","useful":1,"cool":0},"E3s9Y3Uh17RaRiNOcP3SSw":{"text":"Did not have free WiFi. It drove us insane because it was expensive! The lobby had cool ar","useful":0,"cool":0},"DkY1zgQILjcwWmL0vgG7RQ":{"text":"Where do I start,  they tell you nothing during the check in process. I had to ask them wh","useful":1,"cool":0},"Z6k2dLQ34ugiXtATrZETCA":{"text":"I stayed at the Sheraton New Orleans in September 2018.\nThere were feces from a previous o","useful":2,"cool":1},"Yibt8KqKD-ATojnKoxHXIg":{"text":"I have to say after spending a week at the Ritz Carlton and moving here before we leave...","useful":0,"cool":0},"ob4r8u6zRwouiUMFmbZOiQ":{"text":"Prime location.  Walking distance to Bourbon Street and all the good eats! A couple of blo","useful":2,"cool":1},"-q9fHoyC9r9yZNijL3zP8Q":{"text":"Couple friends and I stayed here for Mardi Gras. Getting to the physical hotel took us alm","useful":0,"cool":0},"Edky_fj0fOrCXvtiqyUfgw":{"text":"a zero star would be most appropriate. the elevators take 1/2 hour to get up and down. roo","useful":2,"cool":0},"_Y8T62AcgFdT5d48ag9xAQ":{"text":"Saturday Jan 2, 2010: On our return trip to Texas(from Georgia) we were unable to stay at ","useful":2,"cool":1},"vK05UY6ljD3I98r_zEQNqQ":{"text":"Room was nice, lobby was large. The service was good for the things we used. The snacks an","useful":0,"cool":0},"BRx_aXTGVM24L_o4kpkXUQ":{"text":"I LIKE this hotel!  A nice oasis near the heart of the French Quarter, this is a fantastic","useful":3,"cool":0},"_CLd1BR2Mf5OXeiryL0tcQ":{"text":"The location was decent, a nice and easy 5 minute walk to Bourbon street (10 minutes) if y","useful":0,"cool":0},"VxVEKxBmHHf6P_XusIUGCQ":{"text":"Horrible, horrible, horrible stay. On our first night at the hotel we woke up to roaches i","useful":1,"cool":1},"hszmcTMkPEKm073x5p23Lg":{"text":"This is about the rudest staffed hotel I ever been too. The all day dining menu in your ro","useful":0,"cool":0},"Ul_jvC3qRfdTN_hzaF-OcQ":{"text":"Desk clerk didn't direct me to my room. Got lost. Had to 3 people tell me how to get to my","useful":2,"cool":1},"pFvmiejLY0dk9cFgRHyWuw":{"text":"Great location if you are going to frequent Bourbon street. Close to all shops and everyth","useful":1,"cool":0},"17FCwNfggYesUb8L1mk5mQ":{"text":"***Beware***  if you have to cancel for an emergency or any other reason, they will charge","useful":2,"cool":1},"dMVna2vUOafSsnBnvfXMOw":{"text":"Well nice hotel and location but $51 a night for parking is ridiculous (not to mention you","useful":0,"cool":0},"TgOGeBb1DJC3RLhMBllcJQ":{"text":"A-OK in my book. Clean rooms, great location, descent service, free cocktail hour on Wedne","useful":0,"cool":0},"xlFP5RHihjqv9wTV342sbA":{"text":"My first trip to New Orleans and this was the conference hotel. Check in was easy. WiFi wa","useful":1,"cool":1},"44567l_rtncIDCJ0OUmlKw":{"text":"Check in was smooth being that we arrived after 8:00 pm on a Saturday night. Of course, no","useful":0,"cool":0},"rnxCIeWvvkbPG6RwLZKR5g":{"text":"Won't stay here again. We stayed at a holiday inn express for a week ON the beach before w","useful":2,"cool":1},"CeNGHtNiB2nj5j0d14BLWg":{"text":"Not what I would have expected for a sheraton. Stayed here only because of a conference; p","useful":2,"cool":0},"qeOBhli6BbMhF8G3UgHgnA":{"text":"This place charges for everything down to the internet. This place even charged to park! A","useful":0,"cool":0},"Qn3iuRHOmde7O1Waq9Iaaw":{"text":"We booked a king room to celebrate a part of our honeymoon here this weekend (we are here ","useful":0,"cool":0},"k9u1pWr6Lv5JaLh4L9ikBA":{"text":"**CUSTOMER SERVICE IS A JOKE**I wasn't going to write a review until I was lied to by the ","useful":2,"cool":1},"csd84LLc7LqgPQm4Ago6Zg":{"text":"Very fancy hotel when you walk in. Room was clean and spacious. No fridge. No microwave. N","useful":0,"cool":0},"Xp_80JhFD01ZcGZ7y0l1-A":{"text":"This is a terrible hotel. I was in New Orleans for a convention and they were so poorly eq","useful":0,"cool":0},"Xy2-Q99TxSr2AkSXcTccdg":{"text":"Hotel was nice the beds were comfy and the rooms were pretty nice too. The only one compla","useful":0,"cool":1},"-wUMSDYk6ga9U-glbDJazA":{"text":"As titanium elite for 4 years now, I have stayed in more than a few Marriott properties an","useful":0,"cool":0},"2XudHhEjarHi4ca3vIjh3A":{"text":"Don't stay here!!! The towels are dirty and NASTY!! The comforter has stains!!!! The manag","useful":0,"cool":0},"e1MTeNPkDwGf9cTDXAUe4w":{"text":"Great location.\nAmenities need to be updated.  No robe or luggage rack.  Old tub in shower","useful":1,"cool":0},"zx0lT8J1JOHr5qwmsWvKJQ":{"text":"For those booking in the future. I tried getting a hold of them, due to the fact some doct","useful":1,"cool":1},"MFsdZuaNOGvr5uqMPx383Q":{"text":"I came here for the first time on a business trip. Entering the hotel is beautiful but the","useful":0,"cool":0},"Q-tMlPMGt7T-grAylplwFA":{"text":"Unprofessional front desk staff. Extremely rude and unhelpful. His name was Morgan. When I","useful":0,"cool":0},"LLdCjtnZxw8YfHGkIxv9vw":{"text":"Hotel is conveniently located to all action spots. it's clean and up to date but the servi","useful":0,"cool":0},"qeO77_-nOmiZ64KJ9AEKGQ":{"text":"The Sheraton New Orleans hotel is conveniently located on Canal Street right in the French","useful":44,"cool":41},"-_MI_HlaXa4HBhqkh9swOA":{"text":"I'm not sure how to explain my terrible experience from beginning to end. I simply gave up","useful":2,"cool":0},"pRdBN5eSxVZ18baHmBxJYw":{"text":"Horrific upkeep in room and poorly maintained. Staff was efficient and friendly.\n\n- Torn a","useful":2,"cool":0},"z1hZfAE8p557TeXRTOe3OA":{"text":"Love this hotel, great location!  The check in process was so easy. Even when a large grou","useful":2,"cool":2},"-cfBAut4YdK0BFQYJg5ebQ":{"text":"We were staying at the Hilton our first 2 nights and changed hotels to here. The Hilton wa","useful":0,"cool":0},"duPQGPE2YVK__ZA43XzVjw":{"text":"The staff members are wonderful but the up keep is not so good and the first day here they","useful":0,"cool":0},"KOVrt76TGaGwzE4JF_R1RA":{"text":"In the first thirty minutes of being here I received a room that looked out at the top of ","useful":4,"cool":2},"-5P2RSyl7v4g85t_ioXoRA":{"text":"When we arrived they had servers with cups of soda and water! The Lobby area over all was ","useful":0,"cool":0},"3UEg1MAADkFXJSj12Q0sMA":{"text":"i haven't even got there yet and they can't simply tell me what the incidental / deposit i","useful":0,"cool":0},"dVpZXAn3K1GzZd6x9RV4cQ":{"text":"Unfortunately I did not love my stay at the Sheraton this past week. My A/C would make a n","useful":1,"cool":0},"7NJEBSAifHaeOccYu2GHkA":{"text":"I did not stay at the Sheraton but met friends for drinks/dinner who were. The bar was mob","useful":0,"cool":0},"D6qcyX0He4eK6LcUt-plkg":{"text":"I have never stayed at a hotel with such monumentally poor service before in all my life. ","useful":3,"cool":0},"br8KFljDhCNTE7B302xVug":{"text":"Very dated hotel- paint came off the wall, bed frame was super old. Dirty elevator. Breakf","useful":0,"cool":0},"crpWhdtmw1_HYgW_KIm_Nw":{"text":"I've stayed here a few times and each time I had an ok time. The rooms on but a little out","useful":2,"cool":1},"yUhTAOUTYlgYS_27xDdNYA":{"text":"Is the hotel near the tourist part of New Orleans, yes. Is it clean, yes. But after that, ","useful":2,"cool":0},"VBjwfxOEwaqM2p0xtbgVTQ":{"text":"This hotel was decent.  Great location to Bourbon/Decatur/French Qtr and other hot spots, ","useful":1,"cool":0},"tj07liNxF9vFcNz7smc5Ng":{"text":"In retrospect I was too harsh in my previous review. It is a fantastic hotel/great locatio","useful":1,"cool":0},"nDahXh_8PgCjjLhUKU3HuQ":{"text":"The hotel is nice and massive.  Lots of conventions, but not overly crowded. The rooms are","useful":0,"cool":0},"76fmZpNPsaIRbOabqDokOQ":{"text":"For the most part, we were satisfied with our stay. No refrigerators. Sensitive fuse box. ","useful":0,"cool":0},"WCLp5iMgmHVfeuzHi1zIOQ":{"text":"Loved the hotel! Valet guys were very nice along with all the staff! King room was great &","useful":0,"cool":0},"Cd2aEaUQPqBkUT8SiJEeWA":{"text":"I am a Marriott fan but was extremely disappointed in this hotel. The staff was the most r","useful":0,"cool":0},"8lvevEqVuG-F8UG2on-GCQ":{"text":"Nice hotel for a large convention group. Bar and lobby spacious and comfortable. Enjoyed l","useful":0,"cool":0},"rjWw04E3zzzv4mrBm_soSw":{"text":"The hotel was great. I loved the staff, and the people will spark up a conversation immedi","useful":0,"cool":0},"v6T7a9MAIwvOBiTmxC6nUg":{"text":"Out of all the Reviews I do as a Elite member with Yelp I am hardest on Restaurants and Ho","useful":0,"cool":0},"_ppKR7WSL1PHcATL7nkDLg":{"text":"When I first walked in, it was quite pleasing-definitely exceeded my expectations. But loo","useful":0,"cool":0},"sJIdJJ3RnnTLAruD0v2Hng":{"text":"The service and location of this hotel excelled it to 5 stars.  This trip I was in town fo","useful":1,"cool":1},"_fNcvicy-_6h5uU1NwzlVw":{"text":"Great location! Close to all of the French Quarter/Bourbon street action. However, it is n","useful":1,"cool":0},"Fx3VMAIVPdyGAfvnW9tFuA":{"text":"If i could give a negative 10 i would. I was there on business durring NBA all Star weeken","useful":3,"cool":0},"w7pNIkvsrZtrw7I_ar12cw":{"text":"Do not stay here, parking deck is terrible and the management is just as bad. They threw a","useful":0,"cool":0},"jJ4dZKa7W-VxFzQNz-AkvQ":{"text":"The hotel is nice but concierge and housekeeping  is ridiculous.  We had to ask for towels","useful":0,"cool":0},"aEgaDzj3Dt_NeEaG9gt9sg":{"text":"Check in was awesome . River view . Hotel needs updating for the tech savvy people . Clean","useful":1,"cool":0},"LOzeaMmSBbTORu31gySS4Q":{"text":"Very slow food service at \"restaurant \". At one point we weren't sure it WAS a Restaurant.","useful":0,"cool":0},"ODbPt3wUEexO33nJqi4aZw":{"text":"What a BEAUTIFUL Hotel!!!  From the moment we walked in to the way we were greeted by Aali","useful":0,"cool":0},"oyZIZbHUxs4ESps7IvGbsw":{"text":"IF YOU LIKE  BUGS THIS IS THE PLACE TO STAY. They have roaches. I saw 2 in the bathroom cr","useful":1,"cool":0},"7KKo2rkF63_N4wvBQk2p9g":{"text":"Be very careful to check your bill.  We went as part of a group and the number of people w","useful":0,"cool":0},"Qz27Wj3PbgYy0KaX8vNFSA":{"text":"If I could give zero stars, I would. Really unprofessional. Booked 2 rooms and the front d","useful":0,"cool":0},"G6zJ46zHJeZA5Qidk1Ruwg":{"text":"Everything about our stay was just a little off. \n\nIt started when we arrived to check in ","useful":0,"cool":0},"omdlgtxjHEpRDhDEU2xwxw":{"text":"Get the club level.  Very nice.  Good gym as well.  Good location.","useful":0,"cool":0},"DmvMIuIj6Og7CCWgIPlzig":{"text":"This is actually my first Yelp review, but I thought it was important to warn visitors and","useful":0,"cool":0},"CT5FqTfK0mhiV55qIi_AGw":{"text":"Room was dirty parking was complicated no toilet paper in room water damage through out po","useful":0,"cool":0},"_Bh-mRtizjCyeeSNgkEtbA":{"text":"Too often I think consumers speak out only when they have a negative experience and it is ","useful":2,"cool":0},"3WjnrhzmZ7tmdPFzQ_KgUA":{"text":"Based on lobby restaurant only. Hotel rooms are fine. I know still opening from covid but ","useful":0,"cool":0},"85T-ax39TCy2gN0NiYib0g":{"text":"U should not have been so harsh regarding the Corporations policy regarding not cleaning t","useful":1,"cool":1},"Be8azrk1kwHgXsFHt3bpOw":{"text":"I am so happy we stayed here! The location of this hotel plus the luxury of modern ameniti","useful":0,"cool":1},"MIj9Q2IezCtShMzLOJFsfg":{"text":"Let me run a couple scenarios by you:\n\nYou come to a new city late in the night after a lo","useful":95,"cool":44},"tDvIpcLTq9rd0AGSuavg2w":{"text":"We stayed here on our last trip to New Orleans pre Covid. This was a celebratory trip so I","useful":27,"cool":25},"wDEWMtydZQ6sZTPZRRafpg":{"text":"Bottom Line - This hotel is a good pick if you're primarily concerned with walk-ability, e","useful":2,"cool":1},"tjRhxir5wJAXlGxiQvIn_w":{"text":"This is a great hotel in the heart of where you want to be for New Orleans and Bourbon Str","useful":14,"cool":12},"BMU3Od5_q2g0L8cKxmVDPA":{"text":"This is a pretty big hotel/conference center right on the edge of the French Quarter on Ca","useful":1,"cool":0},"mR03sTJclEcRL0o7VpNa-w":{"text":"We ordered drinks and food and they just somehow forgot to give us both then looked at us ","useful":0,"cool":0},"VlbMc0hVj5smdgyxrUU1rw":{"text":"Fur coat and no knickers!\nFor all it's proud name branding and swanky lobby, what lays bey","useful":1,"cool":0},"q5ER0lNmJn6i9MTfdsdpCg":{"text":"Great location and easily accessible to all of French Quarter. Hotel pool and restaurant w","useful":1,"cool":0},"k2pKlo0W_GAIQk5dzQBbgA":{"text":"A really nice property. The location is great for being close to e French quarter  without","useful":1,"cool":0},"7Jv82ED6sBMGGbnz6RmDsw":{"text":"People asked me whether I heard back from the Sheraton in response to my review of my horr","useful":92,"cool":47},"7AxV1YFmNZFb9bckGsvpkw":{"text":"We love this town and we've pretty much made our tour of the various Starwood properties t","useful":3,"cool":0},"oJSBGXjqQA0YjnHMhcmTMw":{"text":"I had a pleasant experience here so far. When I arrived I was checked in by Amber she was ","useful":0,"cool":0},"A-jcpy8vxP8pVcQrNSD90w":{"text":"I'm a long time SPG member and only stay at SPG hotels. This was the first time I've ever ","useful":2,"cool":2},"-JqFzzIx8fN8GGsQ7uOAfQ":{"text":"Stayed 4 nights in December 2019 for a standard king size room without any upgrades.\n\nPro'","useful":0,"cool":0},"ebty9HtXZFaEu0bwq5tFrA":{"text":"No one informed there's no housekeeping available due to COVID. King size bed is very old ","useful":0,"cool":0},"_LFImUAUUVeXpFbl5hYppg":{"text":"Overall the hotel was good.... everyone we came in contact with in the hotel was good.  Ho","useful":0,"cool":0},"G3z0xCj37KUwcXATcDhuXQ":{"text":"We had a nice stay here at the Sheraton on Canel St.  Our room was on the 36th floor which","useful":0,"cool":0},"O2ldLPAYiPtOMLcUIPcelQ":{"text":"We booked this hotel as part of a wedding block and stayed here a few weeks ago. Upon ente","useful":0,"cool":0},"uNr0pirH0wbPRRAXQ33bJA":{"text":"If you are going to charge me $36 dollars to park my car then quite frankly you have no ch","useful":1,"cool":0},"diHidGVxs4MtlU-KC1a4UQ":{"text":"Staff was friendly and helpful! Great customer service! Rooms are clean and spacious. Mana","useful":0,"cool":0},"83gV2sbS5JC1o6GKH7JUXA":{"text":"I'd say this Sheraton overall is a 3.5 or 4 star. You can't beat location! I somehow found","useful":1,"cool":2},"i_bH5OjBn6Gl-D5fiv4W3A":{"text":"The two stars are for the maid service who keep the rooms impeccably clean. The gym which ","useful":0,"cool":0},"HzDiOvsbFNzoQ6ouM1Qd6Q":{"text":"Worst Marriott property I've ever been to.  When we checked in, the hotel room was burning","useful":4,"cool":2},"5KTSayc5AZjcAcYAkzxMIw":{"text":"The People/Staff are worth 5 Stars. The location is worth 5 Stars, but The Sheraton BS is ","useful":3,"cool":1},"Hk8zVbYhH__pq7ML1uSWCw":{"text":"It's ok if you like cockroaches and loud guests at 2am. To be fair, they offered to spray ","useful":0,"cool":0},"eK2neCA4zCkedS8eO4sEyA":{"text":"We arrived VERY early..like around 6 am, and they took care of us, got us in our room righ","useful":1,"cool":2},"-kyWInhIZLDRlAT68V21TQ":{"text":"The amount of stress that came with trying to block off rooms for my wedding was horrible.","useful":0,"cool":0},"xKwISsibkNZgf0zMb5k_zQ":{"text":"Came to NOLA with a friend for a convention being held in this hotel, and I was impressed ","useful":10,"cool":4},"5O0bjSuLlRy6iZsDgzqeBQ":{"text":"I planned a bachelor party in late August and chose the Sheraton because I had stayed ther","useful":0,"cool":0},"4w8HdmIz6d_kKeuDDPcw6w":{"text":"While on a Motor Coach tour, I stayed here for four nights.\nAlthough the location was grea","useful":0,"cool":0},"SksPJS7gMTxPfYiR8isqfg":{"text":"I've stayed here twice, once about 5.5 years ago for work and again last week via booking ","useful":13,"cool":7},"aem2PS4JgxWM-TPnKkhTkw":{"text":"I have stayed at this establishment before and it's now subpar.   For a comparable price y","useful":0,"cool":0},"803hProAY0yZbXnGbxAzrg":{"text":"The Sheraton is my go to spot whenever I come to stay and play in New Orleans.\n\nHere's why","useful":4,"cool":2},"GM9a-VmbxYY1AjwClBFw2A":{"text":"I checked in on the evening of 1/9 and the heat in my room didn't work. I was too tired to","useful":0,"cool":0},"kgEEkYTVqQ863o24KWCJaA":{"text":"The room was clean, air-conditioning adequate & view of the river great. The room telephon","useful":0,"cool":0},"6v2g2yJgzmF91KylEaxSDw":{"text":"The location is perfect, the staff very professional,  the rooms clean.\nOur visit, a total","useful":1,"cool":0},"7nV_gPi_KkVpOXgBwVzNDA":{"text":"I've stayed here twice, in 2012 and 2015 and was very happy with my visit both times.  It'","useful":2,"cool":1},"_rHsFCLwuObdAhlEmnG5HA":{"text":"This hotel gets at least one star because the beds were comfortable. \nBut that's it. \nThe ","useful":2,"cool":0},"ZQganO1hE8lBXLIOyvYa_w":{"text":"Hotel was located on Canal street and it was walking distance to (mostly) everything we wa","useful":7,"cool":8},"T3NU733w4xH3N10B2UBewg":{"text":"Booked the club level package on their website that includes breakfast and parking. My fam","useful":0,"cool":1},"bRJ0xXAbAyh9W4ebS8pw2A":{"text":"phoenician and crystal at the front desk lack the ability to function at a corporate level","useful":0,"cool":0},"FGPzRFzWzHZWCN5AtLlduA":{"text":"Went here because a friend was in town. Nice room, but living with high ceilings, the low ","useful":1,"cool":1},"atKuLZU0zKm8dMb-JLUj5g":{"text":"I was here for a conference in May for 3 days. I thought the hotel was in a great location","useful":2,"cool":1},"SRhcNb2qS7Pfj1djyzCODg":{"text":"I stayed here in July for a convention. Starting with the check in the women at the regist","useful":5,"cool":5},"50MUlnt4xbDu0zD2dNt2WQ":{"text":"For a chain Sheraton hotel, I was pleasantly surprised how much I enjoyed my stay here. St","useful":3,"cool":1},"8MyQwjz6XKydRhdUvlsXcw":{"text":"Hotel is located in the heart of all the main places near Bourbon St, everything is walkin","useful":7,"cool":8},"02h4oT7GIb2TcrFx5qt0uA":{"text":"This was my 3rd stay here at the Sheraton. Past experiences have been great. The location ","useful":0,"cool":0},"LplLu8go1t_K2QUlDASdRA":{"text":"Soulless though the Sheraton may be, I think they are becoming my preferred Starwood brand","useful":2,"cool":0},"0OFTT0R20QfD05e3NZC5jQ":{"text":"Love it here! Really beautiful room! Spacious! Nice! Best of all, the view! \n\nStarbucks co","useful":3,"cool":3},"FpydWs74wVPTkbIaKCIDgg":{"text":"If you want to feel like your in a reality show designed to test your disbelief in what ho","useful":10,"cool":6},"8aLqnPG3Uca2Cpwi0dP7xA":{"text":"If you want to feel like your in a reality show designed to test your disbelief in what ho","useful":6,"cool":5},"xdzVQLj6toIksCORs74cZg":{"text":"It was a good location. Now the bad side. You press your room floor outside of the elevato","useful":0,"cool":0},"FLug-7XFX0mtpZwjjcES_g":{"text":"I am currently staying at the Sheraton Hotel on Canal.  I am changing my review from 3 sta","useful":0,"cool":0},"You1kn4jm6zw8ZSWBsX77w":{"text":"This will be short and sweet.  We didn't go to NOLA to stay in the room and we sure didn't","useful":12,"cool":8},"8dfy3nLwrF4mRjVLaPSrSg":{"text":"Stayed at the Sheraton which is situated perfectly from everything. The elevators are pret","useful":2,"cool":1},"LMZ5v7-OBD5zLPcPsnT7tQ":{"text":"Our second one at the Sheraton for the Endymion Ball. The hotel staff are all friendly and","useful":2,"cool":1},"cQoJsI4NARICNVMRcN1M4A":{"text":"The positives for this hotel would be primarily the location and the view.  Ask for a high","useful":0,"cool":0},"sW4iIfyBwbO2tnPrn70uIg":{"text":"Great hotel and very clean. You get some good views from the higher rooms, and they have a","useful":1,"cool":2},"xawkO8U4b9kGPYvI4aT8fg":{"text":"I loved this hotel. Honestly I could have stayed in the hotel the entire time and would ha","useful":1,"cool":0},"sTYWvSs_tCCJeWR1hfLPdA":{"text":"The people working in this hotel (and really everywhere in   Nola) were incredible!!! They","useful":0,"cool":0},"-p_OXQLlEx3JF9e4RlaIqg":{"text":"Very busy when we came but the staff did an excellent job at providing the best service po","useful":1,"cool":1},"Ncb097kpoE1E8UAtbTh0bQ":{"text":"Dated hotel in need of remodelling, but great location.\n\nWe all know that the heart of New","useful":0,"cool":0},"czY_gLA4N-yPE36jCm3z_Q":{"text":"Great location and nice amenities made for a comfortable stay. This is a pretty standard, ","useful":2,"cool":1},"KnG7fTcjqRhemYN8OKNQ1g":{"text":"If you want to feel like your in a reality show designed to test your disbelief in what ho","useful":8,"cool":6}}