{"D3U5Fu_9B86QvhJy5LvesA":{"text":"Live jazz band and free ice water that was the highlight of the experience. The gator was ","useful":1,"cool":1},"dQfS1d3Sun7OcX-pC-TYZQ":{"text":"I enjoyed the Market Cafe, but I thought the place next door was a bit better to the degre","useful":0,"cool":0},"P38NODAmIso0JV-9zH9rrA":{"text":"This was a restaurant which was so easy to get to. The outside area was pretty packed so w","useful":0,"cool":0},"yKqi8VLcMafxGgc_lVi8BA":{"text":"Popped in to escape the suffocating heat and have a mid-afternoon espresso. We stayed by t","useful":0,"cool":0},"qCaIqWxx_V6p0xetjvTiEg":{"text":"Awesome! Wonderful music, the fried alligator was amazing. Crawfish Beignets were pretty g","useful":0,"cool":0},"OpAer8uKjWJVxlBSQXPrIQ":{"text":"stumbled upon place in late afternoon.  music lured me in.  ended up having several CL out","useful":0,"cool":0},"Gh6YK8jXMD_uOV2gV-3D2Q":{"text":"Great ambience and location.    Yes it is a little grimy and there are pigeons, but we've ","useful":0,"cool":0},"zRXO46CIHYEcN87MILP3VQ":{"text":"Slow service; blah food.  Too many other places in town to waste a meal here!","useful":0,"cool":0},"5rrvuRN4m6rrBSoa9iBA9g":{"text":"Today we have taken tables 59 & 60. There aren't many folks in here. Service has been horr","useful":0,"cool":0},"DLXJBu20s-T0QJIxGSkjAQ":{"text":"Great atmosphere with live music. The true New Orleans experience! Great service! Nice for","useful":0,"cool":0},"bGejAsvBxfUoTmsSqQngBw":{"text":"My wife and I went here for dinner on our last night in NOLA, great surf and turf, gumbo w","useful":0,"cool":1},"2Rc2LpI_JG4JaK138FE3ng":{"text":"The best service by far!!! Food was great... Prices were great!!! Our server danced for us","useful":0,"cool":0},"rZhuKrvrDjr2p10XQkuv-g":{"text":"We walked to this restaurant and the sounds and smells were very enticing. Outside seating","useful":0,"cool":0},"pJGAU2MGic9yyDRXkc81pA":{"text":"Crawfish Étouffée is very good. It is touristy but the band was great and delicious food. ","useful":0,"cool":0},"oMhI082hzbo75BlTYpreZw":{"text":"It was an afternoon and our hostess seated us immediately. She was ridiculously sweet and ","useful":0,"cool":0},"0eSHxTb6pjbBtQcW1Z32NQ":{"text":"We stopped by for lunch while walking down Decatur and checking out Jackson Square and the","useful":0,"cool":0},"YCzWqKMfSFFO2d3JdgojZg":{"text":"For what it is, touristy spot it was fine. Coulda been a bit cheaper for a better experien","useful":0,"cool":0},"a-Gvnv1XJG7Wni27lkIhaQ":{"text":"Where do I even begin with this place?   At the beginning, I guess.   \n\nWe joined a bunch ","useful":1,"cool":0},"G3GhXufT0zU-FGoFg2u_8A":{"text":"After planning to go the The Market Cafe one night while in New Orleans, I never even got ","useful":0,"cool":0},"0kJ8q-Qib-B9DqBHaT4WQQ":{"text":"We walked all the way to Cafe Du Monde for the experience only to find it closed due to eq","useful":0,"cool":1},"nm36o5muJ7KRJvPGF6BIQA":{"text":"The food and the service probably only deserves a 4 star review.  But add the live Dixie j","useful":0,"cool":0},"o1mmp336kH6bofrYzgXDwA":{"text":"My crawfish pie was lovely and the live music a blast. A Little pricey though and our wait","useful":0,"cool":0},"cjN08SotP1q12WP6L2fqLg":{"text":"Average touristy spot for \"local fare.\" I had the greek salad with grilled chicken when in","useful":0,"cool":0},"ZvadVsGkWDZJBXBZVjvJcg":{"text":"Just not good. The music was good, the food not so much. The breakfast was over cooked and","useful":0,"cool":0},"A5IMuhYUODJqrD1JRYvT-w":{"text":"Food was good; tried the Alligator and the Muffalatta (it was gigantic). Patio was nice wi","useful":0,"cool":0},"ScSjWJifq_7x63iJF7uHGA":{"text":"We re doing the \"stop and sample\"up the French Market. We came in here for the great price","useful":0,"cool":0},"jSWvaFagqKVSE2nuP83APw":{"text":"We really enjoyed the Market Cafe! We went there twice in the 3 days we were visiting. Try","useful":0,"cool":0},"twbD4avpRluSvlHnXHcasQ":{"text":"Despite the place was half empty on a Thursday afternoon the service was exxxtremely slow.","useful":0,"cool":0},"4sUAsN9LxdxnzQaGBza1YA":{"text":"The muffuletta was great and way too big for 1 person. Bread pudding with rum sauce was ju","useful":0,"cool":0},"i03ktPntFEzWMvYNaVcICg":{"text":"Excellent location for a visit to the French Market. Enjoyed breakfast with excellent serv","useful":0,"cool":0},"RO1uMtty_d7YrpPDObclzw":{"text":"My friends and I were walking up and down Decatur Street taking in the sights and stopped ","useful":0,"cool":0},"6gS-tYeP_krPDr76FMjLBg":{"text":"We were seated quickly which was a plus on this busy Friday. While I've been trying to get","useful":0,"cool":0},"NCNqy82wBavwrUVSHgdrnQ":{"text":"#NOLAtoursim #Foodtourism #chitownfoodie  This highest rating is for the location, the dri","useful":1,"cool":0},"iEJbFr5ju8w4Nl4rYiBuKQ":{"text":"I would like to say that my crawfish étouffée is the best, but I had the crawfish étouffée","useful":0,"cool":0},"sMhg8lAE_Ib4kQ5XA8J8ow":{"text":"Came here last night And the meal was very satisfying. The read beans and rice were very g","useful":0,"cool":0},"98iQ8N1z8-yNuzn47Dx65w":{"text":"A place for a quick break, to have some drinks or snacks/sandwiches while enjoying the liv","useful":1,"cool":0},"wT-_yrLTOaeowFckePQX1w":{"text":"Stopped here for a quick bite. Tried the shrimp and Oyster po boy. It came with potato chi","useful":0,"cool":0},"NqqoxohxzAmLAhJNx1bNmw":{"text":"Great drinks- we had a fabulous Bloody Mary and I had a yummy pina colada- for breakfast ;","useful":0,"cool":0},"ZTQ2hEelt5AW45_9rtRGlg":{"text":"Stopped in for drinks, to cool off and to enjoy the music. The waitress was a bitch. The p","useful":2,"cool":0},"0O1OXHdzsmnBC09u7YXRxg":{"text":"My wife had the Muffaletta and I ordered the Red Beans & Rice.  Both were excellent howeve","useful":0,"cool":0},"N3gbZGperyh2QrtnSCk5Zw":{"text":"Heading into the French Quarter, it might be wise to know that everyone attending will und","useful":1,"cool":0},"PXwMRYp6bu1eb_EjZwDDfA":{"text":"Today I was in the city early so I made my way here and was pleasantly pleased to find The","useful":0,"cool":0},"Y3a1DWsT-OVql6YvWMtzuw":{"text":"Four of us had a lunch here on a Sunday.  Fully understanding that it is New Orleans and t","useful":0,"cool":0},"H-ibhS2w32aQfLCx9kJjnA":{"text":"My waiter was super friendly and the jazz band entertaining, but the food was sub average.","useful":0,"cool":0},"5ilyBKdnOyUANQCdKR8YmA":{"text":"Good food at 11:30. \n\nWe opted for lunch, gator bites as an app.and we both had the crawfi","useful":0,"cool":0},"of7VemMIerjEL56e9MJAXg":{"text":"I'm basing my review off of one appetizer that we got to-go. I wanted to try some alligato","useful":0,"cool":0},"_9OMdGcJuQCdnyn0ZIqJjQ":{"text":"came here for dinner at around 8pm because it was one of the few places in the french quar","useful":0,"cool":1},"pEhgTemee0udF9WeTxPE3w":{"text":"Had the oyster poboy it was delicious and my friends split a lot of different food and by ","useful":0,"cool":0},"W5-_JEKyKWDzTkrFIazFOA":{"text":"We had planned to do the tourist thing and go to Cafe Du Monde, but the line was ridiculou","useful":0,"cool":0},"y-sdzEYK9QRMk9OulHlEsg":{"text":"Don't order the Poboy, a Subway would be better, cheaper, and with cheese included. The en","useful":0,"cool":0},"Y-UnwbjyVIsRN8JzyrpyzA":{"text":"Went there for lunch. Prompt seating and wait staff was very nice. Kids menu not listed bu","useful":0,"cool":0},"OJkiukYGHMRrjuV7uVK1eg":{"text":"This review is about a single item they serve. Continue reading.\n\nYou know the NOLA August","useful":2,"cool":0},"9lMHNUWu_9loLvuwZ18wCg":{"text":"My family ate here on Christmas Day because it was one of the only places that was open in","useful":0,"cool":0},"WM3TjtNiiVFsQPVHl991gg":{"text":"Loved the Southern Fly drink. The live music is great and the menu looks good but we only ","useful":0,"cool":0},"00YflrZQHNXorW_iYz_jtw":{"text":"I love New Orleans so much that there is very little I am not willing to forgive when I vi","useful":0,"cool":0},"bnP5ABHwdA8tlGJZOoterg":{"text":"We ate here for lunch right around 12:30 and got right in without waiting.  We love to eat","useful":0,"cool":0},"wMMhrZj3OcGqGdBd8TPBfA":{"text":"A lady was outside trying to get customers in and we asked if they were still serving brea","useful":1,"cool":0},"tWkG4xyCpK4i1Db-Ebr1kg":{"text":"The Muffaletta sandwich was great!  The gumbo was good too.  Add in the great music and it","useful":0,"cool":0},"sb960K6u6B0zbhOPqeJb8Q":{"text":"My husband and I ate here 3 nights in a row. We loved the outdoor seating. The bands they ","useful":0,"cool":0},"6bkgthCntnWgCdbehsYy1g":{"text":"Gross! The gumbo was straight out of a can and to top it off it was cold. Gross! The bbq s","useful":0,"cool":0},"YTZ8AdCJD-gw4yHcQGqiAQ":{"text":"Stay away, tourists! Not only is the food truly awful, but they are super shady. If they t","useful":0,"cool":0},"2rtfh_CmcsSFyvnWVf95ng":{"text":"Super friendly staff!\nMy wife & I were wandering around looking for something to eat. A re","useful":0,"cool":0},"YmIM7ziVtmc2bzjOR9A9UQ":{"text":"The food is probably only about 3 stars, but the experience earns it an extra one.  When y","useful":0,"cool":0},"CZeCYCJ4bM3xTUW5cVYksw":{"text":"Breakfast buffet has all the essentials on it and priced reasonably for the French Quarter","useful":0,"cool":0},"jslDF7fI9PXFn22wE3KOkw":{"text":"Taste of new orleans dish was good, gyro was good. This service however was pretty awful. ","useful":0,"cool":0},"SGnhSkRJdRNiQDjg0svcTQ":{"text":"Crawfish beignets weren't what I expected but were delicious. Live music and outdoor seati","useful":0,"cool":0},"kgPnEgUjjf7k31XH2CGjpw":{"text":"Great location by the river. Live music all day, good bands, decent drinks. The service is","useful":0,"cool":0},"pp92Wy06hiuVxjtgxVymYg":{"text":"Overpriced food with average service. Walk a little further to the french market where you","useful":0,"cool":0},"RCpBvPm2yyg3ld1WaBxm9w":{"text":"I ordered my first ever Muffaleta and it was really good! It was a little salty for my tas","useful":0,"cool":0},"Ey0Ph0xkpJztbDDDGYy4gQ":{"text":"Key lime is amazing!! :) made by Martino, he is such a fun guy and embodies the spirit of ","useful":0,"cool":0},"2Rss4c7dnzyvjm09knLSNQ":{"text":"The catfish po-boy and gator bites were great!  Service was slow. Live music was fun!","useful":0,"cool":0},"nWA0txX-32Hinry1jSaCWg":{"text":"We did not get to the food.  We were roped in to sitting down for a breakfast buffet. We a","useful":0,"cool":1},"joTaLg3W2c6SkvkjJ14ztw":{"text":"The catfish poyboy was really good. The reason I gave 4 stars is because of the price- the","useful":0,"cool":0},"SjJChb_DWRX2yMhIx3n98g":{"text":"So we're walking around the French Market trying to meet up with some friends before headi","useful":1,"cool":1},"ovk6-9GqsSZNWoHkre7Mow":{"text":"Terry and josh helped me and my boyssssss get super twisted at noon on Friday. We washed d","useful":1,"cool":0},"4NrwVpQrCjznUYyvkN6-cA":{"text":"We had lunch here and we enjoyed it.  My husband and I both had 1/2 Muffaletta. they were ","useful":0,"cool":0},"LMtTWSY_O0yHeOdvHIdQnQ":{"text":"Boooooo!  Came all the way from Florida for their muffuletta & they closed early!! We expr","useful":0,"cool":0},"0cyGMcj6N5Zg54OfiVoWDQ":{"text":"Well I was walking around the French Qtr and wanted to try some authentic gumbo, sadly my ","useful":0,"cool":0},"UTyKVZSwy0LMqb-deXYPcQ":{"text":"I like this place.   Music.  In the heart.  A bit touristy. But good muffaleta and good be","useful":2,"cool":0},"E2ef5L2Zca2-leJJnjhz4w":{"text":"Ordered the shrimp creole and it had 4 pieces of shrimp, rice and stewed tomatoes, and not","useful":0,"cool":0},"wOgx8Zb_QEit9GgSi2qxnw":{"text":"We walked passed by several times during lunch and dinner hours and were attracted by thei","useful":0,"cool":0},"viFRAaSQ3pdYA7gFgjrPFQ":{"text":"I didn't eat here, but the Bloody Mary's were delicious and the service was good; Getting ","useful":0,"cool":0},"J380qf0of4R7-aV5QmYHGQ":{"text":"YUM is all I can say about the crawfish pie and the muffaletta.  And it's always fun to ea","useful":1,"cool":1},"e91-Ddjukfh-mUPggM59eQ":{"text":"A decent place to eat and listen to live jazz. I had the muffleta and my husband the sampl","useful":0,"cool":0},"70zAGNmuaX8KjUI04a6wdQ":{"text":"The live music was lovely.  The service was friendly.  The food was pretty awful.  I had a","useful":0,"cool":0},"VkWXWhcFnGUnfH_iMChVDA":{"text":"first stop in the city was starving and wanted some real New Orleans food. we got great se","useful":0,"cool":0},"VTfPc5IsYb3qVqyYFEBhlw":{"text":"Ricole has been by far my favorite waitress in NOLA!! Her smile is so bright, super humble","useful":0,"cool":0},"PsiI6j2pJeKZovrUlGtllw":{"text":"We ended up here after initially trying for the legendary Beignets at Cafe Du Monde... yah","useful":0,"cool":0},"4w-KtDWR77YnLOBVVMC8UQ":{"text":"Stopped cause it was so hot and we needed a break. Very nice place. Frozen mango daiquiri ","useful":0,"cool":0},"tHXLz3nTnYVI0v9bq2Sprg":{"text":"Was walking past this place after leaving Cafe Du Monde and a nice lady named Ruth informe","useful":1,"cool":1},"2CKpOCqA9wRu5Vofo9Oc8A":{"text":"Normally I avoid anything that's touched a deep fryer, but I was on vacation, darn it, and","useful":1,"cool":0},"fSSWBt_4dNCaAWvHjQiXwA":{"text":"A group of five of us were seated but after 10 min. of waiting for a server to come by to ","useful":0,"cool":0},"25u2cvpzBUA3StO820KRcg":{"text":"Walking around Decatur, my friend noticed that I was dawdling a little bit trying to liste","useful":2,"cool":3},"Zo_mMedfHoxsi76cNglw0A":{"text":"Do not go here if you want to enjoy New Orleans as a tourist. \n\nTheir food is, to put it i","useful":0,"cool":0},"eh6HvG0UlW4vLkOhSSQLCA":{"text":"Horrible experience.  15 minutes to get sodas...and another 15 minutes after that to get a","useful":0,"cool":0},"GaS1VmzLBo2eByCSDDp1Rw":{"text":"Amazing!! Food is delicious, live jazz music, very friendly staff! There is a large group ","useful":0,"cool":0},"6iFWWLMszvWSC7vfeim7Dw":{"text":"The location is great! The food is horrible.  There are so many other places in New Orlean","useful":0,"cool":0},"BUmVaZZ-sVQAloXlCDsfsQ":{"text":"My husband enjoyed the alligator. I didn't really care for the muffaletta. To be honest, I","useful":0,"cool":0},"k4XztZSoO-BXDFahHI8g5A":{"text":"Awesome spot to escape the heat and listen to some great jazz. My wife and I came here as ","useful":0,"cool":1},"D4mwlwJ_h-LUJQGjLV2Tcg":{"text":"We ordered the gumbo and half a muffletah. Blah food, but the service was the worst part. ","useful":0,"cool":0},"u2OCBMA-BVoSMBHklRK_FQ":{"text":"It was on the way to the french market. I stopped by to grab something really quick. I had","useful":0,"cool":0},"-OWFf-D43hWOSbWvcwt2sA":{"text":"Food was great. The portions are a good size, but the food is a bit over priced. The serve","useful":0,"cool":0},"Lip5BgmiN52XwARBuCNE0w":{"text":"Shrimp creole is to die for. Service is great. My friends got the gyro and muffelatta. Bot","useful":0,"cool":0},"ayhCfR84UZWCdyykpojHHw":{"text":"My brother, sister-in-law, and I all split the different kinds of po boys here. Catfish wa","useful":0,"cool":0},"Ofy0iEBAyb14d5keyFJF8A":{"text":"I'm only putting an extra star because the bartender was super sweet. Went here Sunday aft","useful":0,"cool":0},"bfdFzJ264QGhK_WdzcOjww":{"text":"I had dinner with a few people here one night to mixed reviews. To be fair, the food that ","useful":1,"cool":1},"aa2x7AlxCoRNGb7I8mbPCA":{"text":"We rolled in here just before closing, hoping to get our hands on some crawdads and left c","useful":0,"cool":0},"FmHiUH_wqLbgIOLD-QLc_A":{"text":"Killer Nawlins cuisine.  Had the crawfish etouffee, as well as the red beans & rice with s","useful":0,"cool":0},"pWiiOp4YT0PXBQ_XEeKr6g":{"text":"Went for a late brunch. They served a small breakfast buffet and Cajun style foods. We had","useful":0,"cool":0},"d2VyZKsPLenbvVCYi104ug":{"text":"We like eating here when we are in New Orleans. My son likes the outdoor seating, casual a","useful":0,"cool":0},"FHUcmbRpOc5UiokKl96s9A":{"text":"After exploring the French Market area we decided we wanted a little rest along with some ","useful":0,"cool":0},"Cf0GWz4eopO7diZ8OANNbQ":{"text":"Service, food and drinks all good. Kinda pricey but everything in NOLA is and compared to ","useful":0,"cool":0},"7cPROdUPeZhLWyxabheo9A":{"text":"Stop here after wandering the French Quarter. For my first meal in the city I had the jamb","useful":0,"cool":0},"2S5qTL7QYOPmPMvAKiS0Zw":{"text":"The Market Cafe is conveniently located within the French market and had a live band playi","useful":0,"cool":0},"hgOi4opnP8wnWtz7Pkk1HA":{"text":"My brother had to have gator when he visited NOLA in September.  So, this is where I took ","useful":2,"cool":0},"DhPPEuOFP3z1N7LRtnmRoA":{"text":"Awesome lunch spot! our waitress was so sweet and very attentive. The live jazz music set ","useful":0,"cool":0},"gHhTS458vs3sl9EFsXECtw":{"text":"I had the  jambalaya it was over priced and a small portion. The live music was nice. That","useful":0,"cool":0},"wUQukicrQWd30t2A_Mjzag":{"text":"Upon leaving the city day before yesterday my roommate and I decided to grab lunch and thi","useful":1,"cool":0},"ZqbfKr2iM--tl1_296c8BQ":{"text":"What is everyone complaining about.  We had a nice lunch for 3.  The service was fast enou","useful":0,"cool":0},"EbrSElH4DeHX_wcvyThBfQ":{"text":"Had a late lunch there on a Sunday.  The waitress, Raginae, was very friendly.\n\nThe fried ","useful":0,"cool":0},"6xHqssh2AtHginPSJrUesg":{"text":"Wonderful experience with girlfriends for two 30th birthdays. Great service, live music ou","useful":0,"cool":0},"Tgm3eKXt7sgywPkjPEyZKg":{"text":"We were just cruising along looking for breakfast and decided to stop here. The service wa","useful":0,"cool":0},"RLOPMcAdtYSRY4-cRajUxg":{"text":"We had the breakfast buffet. Not bad for meat eaters. But otherwise all carbs.\nThe jazz wa","useful":0,"cool":0},"2abjDa6VjlKYxP_cnbne1w":{"text":"Tourist trap. The food is basic NOLA food, but you can get better tasting elsewhere. Only ","useful":2,"cool":0},"NSeekdyofCT4OGzliRSSqg":{"text":"The Greek salad was wonderful. The fried alligator was the best out of 4 that I tried.. Th","useful":0,"cool":0},"Nl0akSyzGeTLKvwco2z7bQ":{"text":"Disgusting. Terrible food, drinks and service. Only place in NOLA I never want to see agai","useful":1,"cool":0},"bPCUx-VtNrB5WF2XxtUbhw":{"text":"The atmosphere is great! The bartender Marty was amazing, we would come back again just to","useful":0,"cool":0},"gTPhg-7Hrc3jgznittqh6g":{"text":"The red beans and rice with sausage was pretty good - I would recommend it. The best part ","useful":0,"cool":0},"mWVU0MndN3TPo4Ot7C3WSg":{"text":"This place has great ambiance but honestly that's all it has going for it. The food is bla","useful":0,"cool":0},"h6ImzWyYaRwYBBNzwZtr0A":{"text":"Just don't do it. There are so many better places to eat in this area than here. It's way ","useful":0,"cool":0},"YIekC2r5kZSlZhOGImKaGA":{"text":"Market café is definitely not the best of new Orleans and frankly it is quite touristy. Bu","useful":1,"cool":1},"k8AUoufWdTLUiAmPT0sqTA":{"text":"Horrible service if you get the waitress Melissa! Ordered fried alligator, she brought all","useful":0,"cool":0},"O49neNnvJvVSCV7UhfUoBw":{"text":"The hubby and I have been here a few times when we stop through New Orleans. I absolutely ","useful":0,"cool":0},"iICNqDRiba6JTcCil0GN8w":{"text":"If I could give this place zero stars, I would. We ordered the blackened chicken salad wit","useful":2,"cool":0},"G5ir8toldLNIoJqLYRWM3g":{"text":"We had the muffaleta it was so good . We ordered another one ! Outside seating was cool ja","useful":0,"cool":0},"WBUU8O9NXB8yC1GhKvYfcA":{"text":"Had been walking around and saw this place so came back to eat.  I liked how it was outsid","useful":2,"cool":0},"NXUIkrLcVjvIB3XJbr8sXA":{"text":"To be fair, maybe i just don't like New Orleans cuisine but for $50 we got popcorn shrimp ","useful":0,"cool":0},"5ol8JJLgb7S5l3SwY5KMnQ":{"text":"I enjoyed the sausages and eggs with grits; my first real Southern breakfast in this town.","useful":0,"cool":0},"Rc_2So9QXuY88ehVHWTS4A":{"text":"The staff and live band were nice but the breakfast buffet definitely left something to be","useful":0,"cool":0},"GoslmET56ofEdfK9x2ubRQ":{"text":"On my 5 day trip to NOLA, I ate here 3 times. The atmosphere was just amazing, the outside","useful":0,"cool":0},"8e4QL_BbHiheDlFp-Vdydg":{"text":"Fun place to people watch.  The breakfast buffet was, well, a breakfast buffet.  My biscui","useful":0,"cool":0},"Wczt4mwIz_JgMdYHud6U7Q":{"text":"The live music was fantastic!  The outdoor atmosphere was superb.  The authentic New Orlea","useful":0,"cool":0},"esE3P3xF3WNvn7FZfDKF-A":{"text":"Fun outdoorsy place right next to the French Market! Live music and a busy place to eat an","useful":0,"cool":0},"UUa_RKmIuKGAJx6KJa99gw":{"text":"3 stars is about right, its an interesting location to people watch but its somewhat expen","useful":0,"cool":0},"OOp6PUIAaMRKELHaTXiQcw":{"text":"I am being generous in my rating only because of the waitresses, they are great!\nWe eat he","useful":0,"cool":0},"WMH43vPM2dfxORQmhYYdWA":{"text":"Had a very lovely lunch date here on my last day in New Orleans, so because everything on ","useful":1,"cool":0},"QC5nBAMeHD9T3FZyP88tKA":{"text":"Guess we should of not went to a big place where it's a bunch of tourists. Music was fun b","useful":0,"cool":0},"WTIqOq-Mk754TCNqQ4dZPw":{"text":"Great food! Awesome people and the waiter Ron was spectacular. He attended us so well. He ","useful":0,"cool":0},"DtdFN0r-5M5BLdeCTsYkRw":{"text":"The Live jazz trio was great and the outdoor seating was good, although I am not sure the ","useful":1,"cool":0},"FVhL6PDahKH8o_dfkzu5Jw":{"text":"The service was friendly and attentive. The food was a solid 3.5. The music was fabulous. ","useful":1,"cool":1},"p5YQ8_9smgp3BsDcPNlIXA":{"text":"The four of us had lunch here today after attempting lunch at MRB, where the patio was in ","useful":7,"cool":9},"H4iapk8hRVXpH8gPSzdmLQ":{"text":"Went to grab a quick bite right after the 4th of July fireworks ended. Was seated immediat","useful":0,"cool":0},"9LTWaihuoP5KZeMwQ6v8wg":{"text":"We had a drink and listened to the live band in the afternoon so I cannot rate the food. T","useful":0,"cool":0},"NqA4bOVvPN4ZFhsJpwpMAw":{"text":"This was one of the few cafes open early Christmas afternoon, so it was very busy.  The fo","useful":2,"cool":1},"ZnTMYBjnLKPI2BzuBOSaVg":{"text":"Good food- good prices. Keisha the waitress is AWESOME , i was in NOLA with a friend for t","useful":0,"cool":0},"MeV5bUnlw7UYupBvJi8FJw":{"text":"Tourists beware. This is an abomination of creole and all that's holy about this venerated","useful":0,"cool":0},"JAzA8804YIW3zCF7BMhLxw":{"text":"Bf had a crawfish mission and we tried it here while walking around and seeing a sign.\nWhi","useful":1,"cool":0},"_ai2rxQ1YJGJntzx9NcNOQ":{"text":"This is a nice place for a quick bite to hold you over, but like other reviews have said, ","useful":0,"cool":0},"wPjZetD_tiV0NXUxZZkKdw":{"text":"Stopped in for lunch and then returned for dinner on Christmas Day. Wonderful service. The","useful":0,"cool":0},"MESRFf8H3slUIa1hWf8cVw":{"text":"We stopped here for drinks and they were good and reasonably priced. Some of the staff see","useful":0,"cool":0},"AKYRI_xTMFWPeCPYMlWrOA":{"text":"Michael was an excellent server. Helped my mother and I to find a nice table inside away f","useful":0,"cool":0},"Jc_7ilpKxcQwTt2_jlqP6Q":{"text":"We wandered over to the Market Café for a Muffaletta sandwich when we found the Central Gr","useful":0,"cool":0},"ie81_cmLpU6iJ1kqHaRNRA":{"text":"Went here and was waited on by Emily A. She was an amazing server! Quick, bright and atten","useful":1,"cool":0},"KVl0zoRm2LY9GzDxWhmO6w":{"text":"Stopped by with a few friends right after we arrived in NoLa for Mardi Gras.  No, it's not","useful":0,"cool":0},"xN1eqKEgbMEaB0BFhcf4rA":{"text":"A huge thanks to the New Orleans local sitting at the table next to us who taught us how t","useful":2,"cool":2},"suMiKhCmnPIxQMSQ3WafhQ":{"text":"I give this place 5 star just because I end up here evertime I take a trip to New Orleans.","useful":1,"cool":0},"EZsdzskPNq0ygA6HPU4q7A":{"text":"Nice open atmosphere with live music. Gumbo was best in the \"Taste of New Orleans\" dish, a","useful":0,"cool":0},"8X0QDJh5sQLoheoa6W54Qg":{"text":"The music drew us in and was the best part of the meal. We sent the silverware back twice ","useful":1,"cool":0},"m75Iedp5feWxYPhYRDJg-g":{"text":"Stopped here with a couple of friends on a trip to New Orleans. Was fairly disappointed an","useful":0,"cool":0},"mmmZf9-kP8T-_BPfAplvgg":{"text":"Love this place! We enjoyed the cocktails and the staff.  The atmosphere was pleasant and ","useful":0,"cool":0},"etf_MynXVXSefygmY_mh4w":{"text":"Stopped by to grab a quick sandwich to go before my swamp tour, and was happy to see this ","useful":4,"cool":2},"UkfP5gYKrs6tYreMvvXHpg":{"text":"Not a bad stop during shopping in the market. Food is cheap and quick. The alligator bites","useful":0,"cool":0},"4Tpk_2sYnsklDodxOVk7tw":{"text":"What I liked about this place was that there was a band out on the patio and they allowed ","useful":0,"cool":0},"JiqzYdhNiCrRxo0iP5IYAQ":{"text":"Very good service- very good music.  We stopped in here for a late light lunch after walki","useful":1,"cool":1},"7haY7_ZiSkXc8RRJ78zXbg":{"text":"As in most places in New Orleans, service was bad. Waitress was slow and asked for us to p","useful":0,"cool":0},"A-WKkIxHndSfcNmX04jpfw":{"text":"Terrible service. Good music and good food. I didn't like the fact that there was a 18% gr","useful":1,"cool":0},"9qmBT08Bu2TnSamV2X_lEA":{"text":"This was the absolute worst experience of my life. We saw our server only TWICE in an hour","useful":0,"cool":0},"0pKfk-Ca-fEHQpdaANXe_A":{"text":"Sat down to rest our feet and wanted to sit outside. \n\nPositives: A large patio, live musi","useful":0,"cool":0},"CZyMshf5abucD5tfMnpvCg":{"text":"Unimpressed. I got the taste of new orleans to-go and everything literally fit in in 8oz c","useful":0,"cool":0},"I2yZqxFFA4kJcYC-FRKmzg":{"text":"This place is a tourist trap, and they really don't care if you go back again. We went for","useful":1,"cool":0},"eAngPDYywLQDIHlDeoHAoQ":{"text":"I'm a first time visitor to the great city of New Orleans and I ordered the New Orleans Sa","useful":0,"cool":0},"_Mf3bpTYqe0_6ydmMmxalg":{"text":"The food was delicious and the waitresses was very pleasant. I had a bowl of gumbo for lun","useful":0,"cool":0},"280XcDZdeGmdVFxKhvXLGA":{"text":"The food wasn't bad.  Decent service and the food was tasty.\n\nI think I had better gumbo a","useful":0,"cool":0},"V3w6XTGEhs-cMa6a9AKmzA":{"text":"4 stars due to the Great service and good, reasonably priced breakfast buffet. Buffet is o","useful":2,"cool":0},"-MhyoFhMa8a_rYaKooYP3g":{"text":"Being a New Orleans native, I tend to write off all places in the Quarter, save for a spec","useful":1,"cool":0},"COGHjX76XdUqrSrwSk0mEQ":{"text":"My husband and I stopped in here Wednesday 3/11 for breakfast.  We sat outside on a lovely","useful":0,"cool":0},"ijGMjXyvC43FPjMnsvivSg":{"text":"This place is OK. This was our first stop after driving from FL and we were really hungry ","useful":1,"cool":0},"Nftv_bE5QKXgeWI4dFuBWg":{"text":"We had a party of 5 & the decision was unanimous...the food stinks!!  The po boy was slopp","useful":0,"cool":0},"KBphOIrGQjCW8lYWRlyA2w":{"text":"AMAZING service, especially considering the horrendous service from a competing establishm","useful":1,"cool":0},"FkEon77f4XGtg9oGpkL8EA":{"text":"Sunday morning breakfast, at 9:30, we walked right in and got a seat...and quickly we're g","useful":0,"cool":0},"qelGj6rQLo3V0zJe4yq3IQ":{"text":"I don't like to give negative reviews, but this occasion warrants one. My extended family ","useful":2,"cool":0},"KTDKlwLXBiV5KosiObp36Q":{"text":"Great atmosphere and people watching. We got attentive & friendly service from Anna as wel","useful":1,"cool":0},"Hq-QhMLPkp264UnrHq8ftw":{"text":"Nice place to people watch and grab a bite to eat and a cocktail! We had gumbo, jambalaya,","useful":0,"cool":0},"i6Jfh5xdcxkfmpnxv-j9BQ":{"text":"Even my dog thought that the food was average. \n\nLong wait times, bland and ununique food,","useful":1,"cool":0},"eUJANBvVgPSapeiX6XMT9Q":{"text":"Great mixed drinks...try the Hurricane or the Peach Daquiri. Food is so/so...the highlight","useful":0,"cool":0},"F60Md7LLGhlJL6egca8wxQ":{"text":"Food Road Trip: New Orleans, LA Day 10\n\nExploring the French Quarter, looking for places t","useful":1,"cool":1},"dwZQMJJWfEdc5Hf67L4Jqw":{"text":"I really was prepared to give this place a 5-Star rating. The food was SO GOOD! My husband","useful":0,"cool":0},"ey6YCJgSPf0AVl4gXhzEWg":{"text":"How to rate this place......um location is a plus\nThe waitress was pleasant but she asked ","useful":0,"cool":0},"tWIatC83LjPUR5iMBP4KrA":{"text":"Ate their for breakfast religiously on my trip. Great coffee. I didn't do the all you can ","useful":0,"cool":0},"9qwZhSqrJNDluGmDf20eMA":{"text":"Situato nel mezzo del mercato nel quartiere francese, offre la possibilità di gustare un p","useful":0,"cool":0},"D16QHeJoe0bmUPrNCJptgw":{"text":"This was a perfect place to listen to live jazz, eat outside in the shade, enjoy an Abita ","useful":0,"cool":0},"kQ7ElbQLZ3scBzc7iv6nQw":{"text":"Friday lunchtime...slow, surly service eventually delivered the worst ribs I have ever tas","useful":0,"cool":1},"kea6f1Uv8rucCT-dxeDusQ":{"text":"Yes, it's touristy.....I wouldn't bother having lunch or dinner here. But.....breakfast! T","useful":0,"cool":0},"WlnqPjgjq9zZe5_tL8lWhw":{"text":"Stopped here for lunch.  The gator was pretty good.  They had live music but it was a tad ","useful":1,"cool":1},"AJpW4RZYJwoVaA8s766IEA":{"text":"Do not waste your time going here. While the allure of glass windows in a central location","useful":0,"cool":0},"MbiYJjQoqeyogyUiDf8GPA":{"text":"One of my favorite spots in the quarter. This family owned restaurant serves fresh seafood","useful":0,"cool":0},"US978OoLqGEtJ7UvWCFEVg":{"text":"Today is Christmas day and the options for restaurants are pretty slim...so we decided to ","useful":0,"cool":0},"8n8m4TYdnJhV_XzuRHuZag":{"text":"The reason to visit The Market Cafe is the location and the atmosphere. The atmosphere her","useful":0,"cool":1},"8EcHmSVqNDMG8mA4CmIChA":{"text":"My party and I was touring around New Orleans, looking for some great New Orleans Style Br","useful":0,"cool":0},"DKpi-7kojqXsIYRhPGYwnQ":{"text":"i passed by this place several times during my visit and i thought it looked nice. i was c","useful":0,"cool":0},"4zVZlc0uv7wn0-p7SglMWw":{"text":"When exploring around Frenchman Street we decided to wander back to our hotel and came acr","useful":0,"cool":0},"1ql0Rg-5E0LJTFltp5q9wQ":{"text":"Forced tip. Not cool. Food acceptable, little high. Can't abide by forced tips, too many g","useful":0,"cool":0},"7R8zZDCi4n_Eibo4XDbeGw":{"text":"Live music, decent selection of beer in bottles, and a house speciality Muffaletta that wa","useful":0,"cool":0},"EFICuMLqdVl5oJABF67wOg":{"text":"My friend and I split a half order of the muffaletta.  We tried to go to Central Grocery f","useful":0,"cool":0},"bgV_SkGpzU7QloyH1y9RxQ":{"text":"Great place for Po 'boys in NOLA! Fresh food and Friendly staff! Loved the fresh shrimp an","useful":0,"cool":0},"wsaNRwietj_3NzsLOK92Tg":{"text":"Just gross. \nOld crawfish\nChewy gator bites\nTerrible chicken sandwich. \n\nAvoid at all cost","useful":0,"cool":0},"szSWTTFmYt2wg_2E9vvBMg":{"text":"Great location. Customer service is lacking. The breakfast buffet was nothing to write hom","useful":0,"cool":0},"7NSjVCKvw2zeYejR2ginqQ":{"text":"I had low expectations because there was a buffet involved and was glad to be wrong. I did","useful":2,"cool":2},"5RUwOQSOQZYX81VaAAr1Yg":{"text":"It's been a while since I've been there last, but every time I'm in New Orleans I like to ","useful":0,"cool":0},"DKaWqKFKnoHAYzE2ayxMzg":{"text":"First of all: get the Redfish Pontchartrain. This might be the best fish dish (ha!) that I","useful":0,"cool":0},"JrBpGBIUNLZKFYdLp2sMfQ":{"text":"Our hotel front desk associate recommended this place. We really enjoyed the food and serv","useful":0,"cool":0},"iw9yI0D7CoiIfNMhcSZoww":{"text":"We were here with several kids the adults were ordering coffee. The kids needed to use the","useful":0,"cool":0},"EO8RNHMAUHqf_SRf_SnEtw":{"text":"Live jazz with breakfast!! Market Cafe was a spontaneous decision on our morning walk and ","useful":0,"cool":0},"OOPBqVD5gWXt6LY_8HWtLw":{"text":"Went to Market Cafe for breakfast and were very pleased with our meals.  Had traditional b","useful":0,"cool":0},"wd3f4eyM6SLBHII1kJd9OQ":{"text":"We were looking for a lighter place to eat after multiple huge meals, this was a fun place","useful":0,"cool":0},"eyHmMOSOSNPwb5Do0HSJtA":{"text":"Ok - skip the Po Boys. If you want a sandwich, to just fill you up - fine. But, if it's yo","useful":1,"cool":0},"DkWAFZLIUJyi6RFXP1VHFg":{"text":"Ricole was amazing and provided the best customer service I experienced in New Orleans! I'","useful":0,"cool":0},"sPIEtxsUxPYuLQzanOhQuw":{"text":"Melissa A has it right!  These guys have the BEST muffaletta in town.  I tried Central and","useful":1,"cool":0},"IEcHqQ5F6JXFslK7u26duw":{"text":"Of the 3 restaurants we ate at while in NOLA, this was my favorite!  I had the Fried Oyste","useful":2,"cool":0},"cEZ2iEa9pAtf8HRTK3UUmw":{"text":"This is not a place you rate on here, really.  It transcends the modern technology of rati","useful":2,"cool":1},"aeJyWPJVo2JqG4iLPRYqKA":{"text":"I'd call this a tourist trap.\n\nThe food is expensive, and the jambalaya? Not spicy, not fl","useful":3,"cool":2},"BTg0Azka_gr5SB5lhnrelA":{"text":"We had breakfast at Market Cafe after checking out other options in the French Quarter.  T","useful":0,"cool":0},"X9He5FNe0axK19tbDrOP2Q":{"text":"we stopped here because it was a hot day and we wanted a place to relax and get a cold dri","useful":0,"cool":0},"G69-idCq1U1HTwEU3uN1nw":{"text":"It was our last day in New Orleans, so we wanted to end it on a good note. We walked aroun","useful":1,"cool":0},"tMNo54Oo0_gruZwo6ZRwtA":{"text":"They do have live music. Po-Boy and gumbo was marginal. Staff was friendly....","useful":0,"cool":0},"u4xCp23OAoD-sUaHHe44Xg":{"text":"Good for a quick bite and drink. Not your gourmet spot but will do the job. There was live","useful":0,"cool":0},"0Pry_p5Yy3Z2DK3MdWV8qg":{"text":"so before we made our trip over to New Orleans last August, of course i had to scope out t","useful":0,"cool":0},"OrajDu3WVDeCAHpCLSzc3Q":{"text":"Food is great and the music is really fun and nice to listen to. Jeff is a great guy. You ","useful":0,"cool":0},"c3Z8G1fnANzPD2OfM3IsYQ":{"text":"We would have had a great dinning experience but there was a waiter there that was cleanin","useful":0,"cool":0},"ltVfE3kKtcDI7yg8f9uoyQ":{"text":"Their Bloody Mary's are tastier than their food, the appetizers got to our table in a spee","useful":1,"cool":0},"Y2zoRttLOZ-l0V3Jw_d4tg":{"text":"We ate breakfast here this morning and they had a small selection for their menu but their","useful":0,"cool":0},"vLaZRJBx3iuezP_t9ioJzg":{"text":"Great breakfast buffet.  Wife said they really know how to make grits! Breakfast potatoes ","useful":0,"cool":0},"1kW17GmPj7wdZ7f4IcBDow":{"text":"Came here for a quick lunch, as I heard that the jambalaya was on point. The space is real","useful":0,"cool":0},"Z0QNduDBjhce5ZjQPvxmIA":{"text":"Stopped here on way back to hotel from Market. If you are lucky enough to catch the band, ","useful":1,"cool":0},"gsA1BnYyOAXdRvw38wuOMQ":{"text":"This could potentially have been my favorite place. The location is great. Right in the mi","useful":0,"cool":0},"P0IZhnTDTAL6WIllH65O-w":{"text":"After getting off the fabulous city sightseeing tour bus we stopped here! ( tour guide ran","useful":0,"cool":0},"BlUQLTAR_Kb7UWB57NXhoA":{"text":"Had a beer listening to a really good jazz band at 11am on a sunny friday morning. Can't r","useful":0,"cool":0},"tMRBndA1kvXvqSP6pYT0bg":{"text":"In an attempt to have a multi course meal, waitress Paige M promptly delivered the check a","useful":0,"cool":0},"74Q8NNPhCuYH1C8mKHhcLw":{"text":"I would love to give this place even less than one star. They have the perfect location bu","useful":0,"cool":0},"RnnuoJ64zDuszSTA08rteQ":{"text":"Had to get the crawfish etouffee, and was not disappointed.  My wife got the fried seafood","useful":1,"cool":1},"I77CgHDPbGiwbGrK9uYGGg":{"text":"3.5 stars\n\nThis place earns five stars for location, but only three stars for service and ","useful":0,"cool":0},"4aHbwTRNAbtcGZ6nUl5Amg":{"text":"All you can eat breakfast buffet that's actually good?\n\nOn this day, the gf and I decided ","useful":0,"cool":0},"OSKZfICXQB_lJV0PSaYKcw":{"text":"We ate at The Commanders Palace earlier in the week and honestly The Market Cafe had bette","useful":0,"cool":0},"8XwI8aNKn35OPrzIczrXUQ":{"text":"Really wonderful oysters.  The crabcakes were also a winner.  Service was excellent.  Mayb","useful":0,"cool":0},"G35-dicSC4s2yhY0XRc2LQ":{"text":"Food is amazing! Best red beans and rice in town... get the taste of new orleans! Includes","useful":0,"cool":0},"62U-XLXgQbCzESAvonADQQ":{"text":"Nice environment but I was really disappointed at how flavorless and average the gumbo, ja","useful":1,"cool":0},"rtuAlc47hqywXO4TvKJXBA":{"text":"We got the breakfast buffet because it was only $10.95. The biscuits were hard as a rock. ","useful":0,"cool":0},"sMgj0groqm_6p3oEgiW7rQ":{"text":"Had a great time here!  Live music was terrific.  Had a fantastic Muffuletta and discovere","useful":0,"cool":0},"AG6vIfInEipV2bzKyFWdSA":{"text":"We ate here for breakfast and it is okay price is reasonable. If you are really hungry you","useful":0,"cool":0},"1Nxis7YAaYrpGVxdO-fxJw":{"text":"4 stars for the atmosphere for late breakfast. Live background jazz, and people watch whil","useful":1,"cool":1},"gJyB5ilVwKJbtWRw8-0B4w":{"text":"Very disappointed here. I ordered a salad and it was entirely iceberg lettuce...my fiance ","useful":0,"cool":0},"gjvdNBs-ZAORsxZQn69dZQ":{"text":"We went to the Market Cafe on recommendation of a local. Good choice! Most of the seating ","useful":0,"cool":0},"p3RH92FnsyaC17-P_O8LLw":{"text":"The food came out cold. We sent it back. It came back cold again. There's not really a goo","useful":0,"cool":0},"VS0TZ3-xjgfoP-u4iDmedw":{"text":"DON'T EVER GO HERE...I went back today because I loved the place the first time. Not today","useful":0,"cool":0},"g7RXuuE4lIB51sCC6h9bVg":{"text":"I have wandered past here so many times and always avoid it because i always assumed it wa","useful":1,"cool":2},"msjzE67yxyvJcNLR1Xs4kA":{"text":"Breakfast was awesome. Buffet style, didn't slack on the food, it was all hot n ready to g","useful":0,"cool":0},"u-fli2IITo0i4a7o6g3pCQ":{"text":"Excellent food. Red Beans and rice is to die for. Excellent Jambalaya and Étouffée. Pretty","useful":0,"cool":0},"FpYdFrxz9XUY3Ycvz5dRAA":{"text":"The only thing worse than the live band was, well everything...  outdoor eating was never ","useful":0,"cool":0},"pXSJKkAoInlnD7UNRok3rQ":{"text":"Delicious cuisine and helpful service. Jazz is live you cant beat that. Also I'm super coo","useful":0,"cool":0},"pGv9aMGeAlycoYStxiBSxA":{"text":"We decided to grab \"quick\" bite to eat before hitting the market etc. Well we were sat, we","useful":0,"cool":0},"Nt5ZS-Z4yef10W1LWylIFA":{"text":"Lovely music, nice patio, super unwelcoming of my blind self and my guide dog. Server init","useful":0,"cool":0},"XzLc8PQD53XRaBrPvVeDjQ":{"text":"Ain't no such thing as cheap breakfast near the French Market.  At first, we stopped at Ca","useful":1,"cool":0},"K4gZD2NKE5keD8isxvnZdQ":{"text":"Stopped in for a quick meal and was pleasantly surprised. Not the best stuff in NOLA and a","useful":0,"cool":0},"2GWWyjvVMpOc17rawpKHwA":{"text":"Super touristy. We were here for lunch as our last meal in NoLa.\n\nThe good:\n- Located in a","useful":0,"cool":0},"IDhMPHNQd8hgbtHtkjRolQ":{"text":"Food took forever to arrive and was so so.  Manager or owner got mad at my dog for sitting","useful":0,"cool":0},"S0Qu7pBc8Bak7VA6F0OANg":{"text":"Ordered the Shrimp Creole to go and went back to my hotel room to discover how small the t","useful":0,"cool":0},"Ic9bgMZ17vLxQRUOlMFHhw":{"text":"We were hungry andt every restaurant was closed on Christmas Day, so we had to have dinner","useful":0,"cool":0},"l1bsDVqKwFAtTmoixUi_vQ":{"text":"Not even done with my dish and here I am leaving a review. GREAT TASTING FOOD! way better ","useful":0,"cool":0},"Gv-3IStQCqQsMqnoxuMbJw":{"text":"First thing we noticed was an abundance of friendly and attentive staff who let us choose ","useful":0,"cool":0},"5_j7hmI1MOY-jvoss8RIpw":{"text":"The food was good but not great... the alligator and redfish were decent, but the vegetabl","useful":0,"cool":0},"tQPi_-ZzHeRKcTzEv7ooGA":{"text":"Great food, the shrimp creole is amazing! The staff was so nice. Our waitress was a sweet ","useful":0,"cool":0},"wpAXtFN6e2Vgto_98uTIdA":{"text":"It was mid-afternoon, the kids and I were starving, and the Market Cafe had lots of availa","useful":0,"cool":0},"ckhyUiWfZxw9wEBteHeiew":{"text":"Horrible experience.  15 minutes to get sodas...and another 15 minutes after that to get a","useful":0,"cool":0},"7T-luFJoBZerAq8tcinCyg":{"text":"We always come here for our muffulettas. Staff is always great and usually live music with","useful":0,"cool":0},"Nh6WpztDJ4CZBpV7eMgk7w":{"text":"Attracted by the live jazz and the fragrant spring sunshine, we made an unscheduled stop a","useful":0,"cool":0},"38QSrLqyPvmiKso92CtiZQ":{"text":"my boyfriend and I are visiting New Orleans together, and stopped for lunch at this small ","useful":0,"cool":0},"KKK8B9FKGqGiZeZVBT82Ow":{"text":"I have eaten here at least 6 times and really like this place. Had the fried shrimp and it","useful":0,"cool":0},"YWwu7kjBBUCvn-ckqXrgIQ":{"text":"Walked down from bourbon st. Looking for a place for a quick bite that didn't have that pe","useful":0,"cool":0},"QFp1rxe8vzTrlkoGFOyzRw":{"text":"With the location where this place is, you would think this will be a typical tourist trap","useful":3,"cool":0},"z_zvPVnEa7U4unEVazyT1Q":{"text":"I like everything about this place: the live jazz band always playing, the open-air dining","useful":0,"cool":0},"6PpuWkQYwo4IS_aAKMaJKw":{"text":"C'mon, what's not to like? Good food, decent prices, and live music while sitting in the q","useful":0,"cool":0},"5uEPY9xte4Psmb3Bqxur-A":{"text":"Stopped here on a Wimb, and so happy I did. Loved the atmosphere, great service, and good ","useful":0,"cool":0},"S2kypdXhktxk1QgTXWr3Ew":{"text":"This a great location to sit and people watch whether you sit inside or out. You can reall","useful":0,"cool":0},"XOqEfeLCET3mpT4WeG0dng":{"text":"Great lunch food!! Sarah, our waitress, was super helpful! I got popcorn shrimp and Louisi","useful":0,"cool":0},"DGYB7VJgg7vl99X6HcWR1Q":{"text":"Only bought coffee and desert as an excuse to listen to the outdoor live music - really pl","useful":0,"cool":2},"W8q8BG5fojsOV3NW55l63g":{"text":"We were here for breakfast the first day of our visit to NOLA. It was a decent breakfast f","useful":0,"cool":0},"07ztUfHP9AEgc7ewMNacBA":{"text":"Nice place to sit and listen to a great jazz band outside. The service was good and the fo","useful":0,"cool":0},"1CxdBEPCOzLsTvwYZiSWWQ":{"text":"My husband and I decided to go with the buffet. At first, it was ok. You could taste that ","useful":0,"cool":0},"KjN6u594Our1gQRzpkkqBw":{"text":"Came for dessert and had some lovely bread pudding! Cute place to rest for a few and liste","useful":0,"cool":0},"Wm9Cv4o8by2UCwuKC_UUDg":{"text":"The only redeeming quality  for this restaurant is the location. Don't make the same mista","useful":0,"cool":0},"IqHYCME00UA8_t27F3fzDg":{"text":"Love the live music and people watching.\n\nMuffuletta was really good and big enough for 2 ","useful":1,"cool":0},"HUWzh0qVpMOL4J69lK2y-A":{"text":"Our family of four was in New Orleans for three days in March 2015  and I wanted my wife w","useful":1,"cool":1},"JjFZe3c5oaQFByVV8MorrQ":{"text":"I would give this 4 stars, but the service was just that bad.  Once sat, we were forgotten","useful":1,"cool":0},"5lJWObDbtBSrzm0IQh2-ww":{"text":"Oh no. Oh no, no, no. The only reason this place deserves good ratings is because of the l","useful":0,"cool":0},"c3HEvfY4lt5mASSQ7PCpdA":{"text":"I was sent by a local For  the Muffaletta- DELICOUS.\nEXCELLENT service too!  I sat at the ","useful":0,"cool":0},"SY_u6kwIGuAVk23yc-5_Ng":{"text":"I agree with other reviews that this feels pretty \"tourist-y.\"  We stopped in because we w","useful":1,"cool":0},"sOLZE5BGH7vkXxCtG1qeTg":{"text":"Delicious Gumbo !!!!!!! Quick Fast service. All the food ordered by my party was so good. ","useful":0,"cool":0},"7LT9YdBvz9kTaaRWbBseZg":{"text":"What a great location. Can't miss this place. Not the best food in the world but the music","useful":0,"cool":0},"QfoeIQy69DoSoQC5ulct0w":{"text":"So this is the first restaurant we visited in New Orleans we were starving and just wanted","useful":0,"cool":0},"nAZbBgPDs94-KGUjyST82g":{"text":"We love the location, always busy but live group. It is why we are coming ! Kids menu was ","useful":0,"cool":0},"oY4T_ZDyAWLqFjP5pFfzvg":{"text":"sitting outside was nice and having the band there was also pretty cool, but something abo","useful":1,"cool":0},"YNXrCvkIXpCpadIu4oxIWw":{"text":"Being an out of towner, the location and the live  performance was a great experience. Oth","useful":0,"cool":1},"Iv9hkOcX4tp3IRj_y1FSGg":{"text":"Low marks for food.  I had a combo po-boy - shrimp and oyster.  Their menu says they are o","useful":0,"cool":0},"XkcoYS5JDVXd15HQ41iNZw":{"text":"Muffaletta is a great sandwich; the flavors all marry together wonderfully. A whole sandwi","useful":0,"cool":0},"vB2Hy1qEX-M8dLdJCyGjxA":{"text":"It was really cool place and grown atmosphere.  Ana was our server and she was awesome and","useful":1,"cool":0},"7EurwaRTMLdnIH0Yp6k5Dw":{"text":"I wish I read reviews before deciding to eat here. Good bloody Mary though. Po'boy sandwic","useful":0,"cool":0},"7XTx0UbjHR8MiDJjrwdltA":{"text":"Food was good , slightly greasy, as well as waitress was attentive. Problem is the musicia","useful":0,"cool":0},"-IXl9COshzs6voF0MS0PDw":{"text":"Quick, simple, a lil expensive for what u get but a good spot to get in and out quick.","useful":0,"cool":0},"cnYeUXOqFn3OPFGdQFIwqw":{"text":"Tried the Fried Shrimp Po-Boy. It was ok. A whole lot of bread and some little fried shrim","useful":0,"cool":0},"zXBwONAQ4NtU4-PcJacC_w":{"text":"Stopped in for breakfast Christmas morning. They were very busy, but everyone still kind a","useful":0,"cool":0},"5yAAb2A8ctVUnay8Aifj7Q":{"text":"Shared the crawfish poboy with the husband. This was my first food stop in NOLA and I have","useful":0,"cool":0},"XKnI2pe0AgIY5VLzG4Sv6g":{"text":"The breakfast buffet was the first place my boyfriend and I went to after a long bus ride ","useful":0,"cool":0},"gLE7Sv219y2ihx5900eEog":{"text":"Went twice and was twice bitten by the long waits in both getting service, and in getting ","useful":0,"cool":0},"JJ22tz0jVs3b-VHLo6atkg":{"text":"good: This was a nice cafe simply for the location, a great place for people watching and ","useful":1,"cool":0},"DvIrD9WZXXAkx5bkTyxKLw":{"text":"Good food nice atmosphere really just all around good food i had the jambalaya rice and my","useful":1,"cool":1},"3zixpbGrPZi4h4GWQZAIvQ":{"text":"The music was great. The food was ok. I had a debris sandwich but it was a tad bit salty. ","useful":0,"cool":0},"ct8l5zHck7j1vnxZQzwSxQ":{"text":"This non-descript market cafe definitely was a UPOD (Under Promise, and Over Delivered) fo","useful":0,"cool":0},"at76RLiQr1f132wc6uT-7A":{"text":"Ok, so you know that breakfast special here that's 3.95 for an egg, grits, a biscuit, and ","useful":1,"cool":1},"uwIqEADRT33bH4kG6iva5w":{"text":"Three and a half stars. Efficient service, single stall bathroom, popular outdoor seating,","useful":7,"cool":5},"lKQQnlzMRoc2plbdLR-cRw":{"text":"Inevitably we always end up here when visiting the quarter.  I think that's because there'","useful":0,"cool":0},"kIfLqjEAUUmsJfSgJuamHA":{"text":"Service was good but food terrible, cold and overpriced.\n\nFirst time in NOLA/French Quarte","useful":0,"cool":0},"22Mp7WtQrViPSNcIUA62rA":{"text":"Great drinks & great music!  A perfect spot for lounging and soaking up the local atmosphe","useful":0,"cool":0},"eeZE5f0ywLR8Uh4wuAWhGA":{"text":"it's okay to try this place...nothing special but for the fact that it is facing the stree","useful":0,"cool":0},"uv5IiUfHs0epHorOQ7dUOg":{"text":"This place is a joke. They need to be on Bar Rescue its horrible!!. I would have never eat","useful":0,"cool":0},"GWgk-rm29UCA29TqUFiqrQ":{"text":"Tried this place because we were hungry and there were tables open. I was not that impress","useful":1,"cool":0},"UtatUIrKFAL8q7lhJSc1IA":{"text":"Yelp.....you can thank the Market Cafe for me creating Yelp...I had the best experience he","useful":0,"cool":0},"BkUbr4nwEzw1_kOh7-I3Xw":{"text":"The breakfast buffet is fabulous & the gumbo is great! Highly recommend stopping by & grab","useful":0,"cool":0},"2aBeZCjI4Nrz2N_6nRQbHg":{"text":"Great location for lunch before shopping at The French Market. The only thing about this p","useful":0,"cool":0},"L1Yy_KgFGUsUmIURejtmhg":{"text":"This is our favorite place in the quarter for a full breakfast.  When a high priced sugar ","useful":1,"cool":1},"zfIY17ernCKUIuY4DKRGcw":{"text":"Coachella Music Festival can sure find an inconvenient time to release their ticket sales,","useful":5,"cool":2},"pnPUOnxizlbYeudeQIlPDw":{"text":"Tried the muffuletta and gator bites . Both were really good especially the gator bites in","useful":0,"cool":0},"cbbyDUjpUojACei22jeZbw":{"text":"Hm, well, they're pet friendly but there are only a few tables dedicated to this along the","useful":2,"cool":0},"xB_5n1biURLPfFrZRsDr8A":{"text":"Convenient place with nice terrace and music. Service was nice. The food was very very bas","useful":0,"cool":0},"hnqn-I6x5_Ljog-lOgsJNg":{"text":"Marty is the best! Cold drinks on a hot day! Great conversation, that previous yelper must","useful":0,"cool":0},"pYl1ao5B2l6YMzqHVEF8Wg":{"text":"I was there with a friend and we went inside to get a table. The host informed us that if ","useful":0,"cool":0},"HlOGOFyykCSuYq29TJSS_g":{"text":"Ramona was fantastic. Not only did she make great food recommendations, she helped us plan","useful":0,"cool":0},"VtASp7Jjc7r5bT4G2fzWQA":{"text":"Great food and fantastic service.  While looking for some NOLA food we found The Market Ca","useful":1,"cool":0},"JjILPdPbkr5oApPS38P48g":{"text":"Great live band playing while we ate. The gumbo is excellent and the latte was solid. Of c","useful":0,"cool":0},"do8XIgUlUHq94f_WzTde2A":{"text":"Convenient is the game here. Closest sit down to the French Market. Sandwiches were averag","useful":0,"cool":0},"hSY70iL6ylu7pAQdvTuLug":{"text":"I'm a local and was pleasantly surprised.  The food was good, the service attentive and at","useful":0,"cool":0},"3qJyaKlhTa8r0S5bO_08Fw":{"text":"The food was good but the customer service is VERY poor from the Manager Demetra down to t","useful":0,"cool":0},"9UfA-LCpCwPRYM6pxU6V5g":{"text":"I loved this restaurant. They had excellent service, delicious food, and a great live jazz","useful":0,"cool":0},"1Eu9EKr_Jaa5tFqd9SKRZg":{"text":"Spotted this place on our way to the French Market from Cafe Du Monde and it looked pretty","useful":0,"cool":0},"noEKyH19LDRYIn38IBaLow":{"text":"Last night to grub in NoLa.  Our friends are locals and they decided to take us here.  Gre","useful":1,"cool":2},"n3P-8PsUvtafPsyjiGckzQ":{"text":"Food was okay. I had the popcorn shrimp. Service was awful. I think she forgot about me. I","useful":1,"cool":0},"JfgQYoeKpMcuI0r4sKlb0w":{"text":"Great chicken Ceasars salad and hurricanes :) Music almost every night and always an upbea","useful":0,"cool":1},"D5TuTP_3GD9XhTl4lwOb7w":{"text":"Decent po-boy and gumbo! Perfect spot to have lunch outside and then walk around the city ","useful":0,"cool":0},"82pfiKsKZofVtjAT05wSHw":{"text":"Terrible.   Portion sizes were so small I thought I had mistakely ordered an appetizer.  A","useful":0,"cool":0},"tinOulqFCcGssO9D3EZ9vg":{"text":"I come here every time I come to New Orleans. It's become sort of a tradition dragging who","useful":1,"cool":0},"EsIRDDZE4uTiApKM7TTbyw":{"text":"Great touristy place with love jazz music. Naturally, as a first timer in New Orleans I ha","useful":0,"cool":0},"5Oc9kdPQXpexsbDlfDE6Rw":{"text":"3.5 stars rounded up to 4 stars...\n\nWoke up late on the last day in N.O. and wanted to try","useful":0,"cool":0},"dgAYCXpjN4MOEazdrH4dig":{"text":"On a recent mission with friends to find them some tasty fried gator last minute before th","useful":1,"cool":2},"uyTCmR3vnZxs028DY4StWw":{"text":"Love this place... The music , food , location and delightful staff provide the quintessen","useful":0,"cool":0},"01HAhIcaEQnl0OvYsw08Bw":{"text":"Good place for quick bite. Po-boy was alright. Service was amazing which made experience s","useful":0,"cool":0},"9JxRnQ4HiYJDPFg535HY2Q":{"text":"The food was good. They were very busy when we were there and it took awhile to get refill","useful":0,"cool":0},"d0FOm2hH2K2801uXjF8xSA":{"text":"We got there around 6:30 on a Sunday night because a band was playing and they had availab","useful":0,"cool":0},"NwH1F4d7W8ll34fWJ23zGw":{"text":"Cheap, great breakfast buffet.  Good food and coffee.  In the heart of the French Quarter ","useful":0,"cool":0},"DEmpYbHVgVdKjiKY1jfAbw":{"text":"I was not a fan of this restaurant, and it's rare that I feel this way.  It's definitely f","useful":2,"cool":0},"2HUGtp0czVXW7OIyu-LCyw":{"text":"Great band.  Good atmosphere.  Service was good.  The food we ordered was 2 star but band ","useful":0,"cool":0},"q9wSXRAai5ywJkvxso_-5A":{"text":"Great place to sit outside and hear local music. Crawfish were good, gumbo was solid. Our ","useful":0,"cool":0},"qBb63oC7uv3yCwLi2Tf1ig":{"text":"Worst service. No napkins. Famous gumbo served cold. Stale po boy. Soggy shrimp. Wanted a ","useful":0,"cool":0},"HdptRPaU7kohwvBo7Q8uWw":{"text":"Amazing crawfish boil and bread pudding. Open seating. The waiter was great and very atten","useful":0,"cool":0},"xIdMNjKude8-Dul7jwm64g":{"text":"The Market Cafe has a great location, but in a city of fantastic food is just eh. The gumb","useful":0,"cool":0},"MnmZuNKfyDW7BBeGNfcklw":{"text":"Terrible service - We left ...\nOur family of fives came in and was sat down a a table in t","useful":0,"cool":0},"4emCKblydyocN40nKTKPLA":{"text":"the quality of this place seems to have gone down since my last visit.  i brought my group","useful":1,"cool":0},"DlQF74UIpnnCmZeWZBn_gQ":{"text":"The music was the best part of the meal - very talented singers and musicians. The cat fis","useful":0,"cool":0},"hfjIKfRuLcgNsCb-m01Dmw":{"text":"Service is great. PO Boy just average until they suggested what seemed like a special oliv","useful":0,"cool":0},"qnREbMPCgIEXH1Ops8kzTg":{"text":"Love it :) and great drinks here but no smoking inside at the bar. Music is good too","useful":0,"cool":0},"K1iILJuT14AnLcFtyYPxQA":{"text":"I had the red beans and rice. Very good.  My wife had the gumbo.  It was ok. My daughter h","useful":0,"cool":0},"m6yV87wqSnuP4fFWOJgMLQ":{"text":"BooBoo On the Bayou!\nCame to N'Awlans from Las Vegas, Nevada to eat your Po Boy only to ge","useful":0,"cool":0},"0v4Qf00nDct5ZAlD47LTcQ":{"text":"Great location. Outdoor seating. Convenient. OK food. There are better places to eat in te","useful":0,"cool":0},"bWQEennelqnY7qpUvY6JvQ":{"text":"I didn't like it. They served me shrimp with no seasoning. It was like having a piece of c","useful":0,"cool":0},"U0QfQyWCqAPS0be0uWxR6w":{"text":"The Pasta Marina is so good that we had to go back for more. now mind you we live in Calif","useful":0,"cool":0},"ZJsnboXsMnkkrJTtwqMZcA":{"text":"Ok... so. Typically my reviews are based on the food and drink of an establishment. Also, ","useful":2,"cool":0},"rPSXMb51JWmhyrtExhas-g":{"text":"Got the New Orleans sampler, all was good except shrimp creole. Cristina our server was gr","useful":0,"cool":0},"yAqgXgsQORG3m1uYKQhZaQ":{"text":"We came here 2 times during our trip because we loved it so much! We had Ashley and Martin","useful":0,"cool":0},"nS5vcuoP-EM_2XlBm0_JwQ":{"text":"First we were sat immediately, yassss!!! The food was very good, alligator sausage was awe","useful":0,"cool":1},"X1FmfffcDyhnS1jlkJBy0g":{"text":"After a long night of Drinking, my friend and I woke up with one thing in mind.  Breakfast","useful":0,"cool":0},"dtF6Q0ryYbuAXGxJnDDczQ":{"text":"Good food, gigantic portions.  Local beers on tap.  The band that was playing was pretty d","useful":1,"cool":0},"SySIYy5f9UzRItMJvvC4SQ":{"text":"Nice place to rest and drink after walking thru the FQ. \n\nThe Crawfish Pie menu descriptio","useful":0,"cool":0},"m14I1m4c2xA0NSGpGad_MQ":{"text":"Roast beef po boy meh\nLoud music but cool\nNice staff\nPricey! \nBreakfast buffet \n$45\n\nWe st","useful":1,"cool":1},"5ELsYqqOtgDNGDp0vqz-6Q":{"text":"So we stopped by here earlier for the first time.  They had a small menu selection.  I got","useful":1,"cool":0},"xqurJlbG6mF6OlMp7SsZZw":{"text":"I had a bunch of fried stuff, so I made out ok on the food. The beers were great! Dark Ale","useful":1,"cool":0},"SHUnNfJWbALqQwrYTMDLLA":{"text":"Its in a great location and has a live jazz band. \n\nService is cheerful but food is so-so.","useful":3,"cool":3},"2ObSbDgKSIW9WMveFipZ7Q":{"text":"Paige was an excellent server and the food is amazing. Live music makes it an enjoyable st","useful":0,"cool":0},"8gSqmmnqK__DVWST-jKc0Q":{"text":"We had a late dinner here after a long day in conference meetings.  We knew this was not a","useful":0,"cool":0},"xrpG4h00nQvgfnFZBV8S3g":{"text":"Decent muffaletta sandwich.  Not the most inspiring interior, but the service was okay and","useful":0,"cool":0},"r-3dWv6dg3vf3POG2asZmg":{"text":"Live music and the fact that it's in the heart of French quarter is really cool! Service w","useful":1,"cool":1},"hgS4mG4QevAEhPWXjpxslQ":{"text":"On a Saturday, since all of the other breakfast places in the French Quarter were busy, my","useful":2,"cool":0},"IUDx-wHm_SnFBAeff8Juyw":{"text":"Pleasant. It's situated in a pretty busy area. We had a little trouble getting service at ","useful":0,"cool":0},"8pgQdcK9DdqGjXtrrZtIbw":{"text":"The food wasn't too memorable, but the location and live music was the reason we stopped h","useful":0,"cool":0},"Z33PkJzRxuMJG3g9tdldxw":{"text":"I LOVE the Market Cafe! There's almost always some good live music and a table outdoors.  ","useful":0,"cool":0},"u2SK_nBTrjOalOyAzLyN9A":{"text":"This is a lovely place to visit near Bourbon Street. We were walking around when we heard ","useful":0,"cool":0},"1ii1H6SY-dEoAcze24XyxQ":{"text":"Split the muffaletta sandwich and the red beans and rice, catfish etouffee, and jambalaya ","useful":0,"cool":0},"3gT6lsGs7U-1ytN-FYEqsA":{"text":"Cafe au lait was terrible and bread pudding was way too sweet. Music and service was good ","useful":0,"cool":0},"sy-W2QBQTQtIJwHggcftMw":{"text":"Just drinks for us. Two strawberry daiquiri's on a cold rainy day isn't smart, but we did ","useful":0,"cool":0},"ZUp2BxLneaEoxG5RStwpAA":{"text":"I was dying of heat exhaustion so I stopped in here for a adult drink and ice cream. (Yes ","useful":1,"cool":1},"OEF9sWDkjX2r9fHftxBVwQ":{"text":"Nice place to stop for live music and great service! We stopped by for a quick bite while ","useful":0,"cool":0},"hXgcGVG0n277ty2e78ftUg":{"text":"Great food, went for breakfast and found out it was a buffet for like $9 no joke. Biscuits","useful":0,"cool":0},"CI25UcZmmCRuN-cFNHCH4Q":{"text":"Authentic New Orleans dishes, great service, great recipes and high-quality ingredients!","useful":0,"cool":0},"0p5Z-aq0Bf3wRzfFczcNIQ":{"text":"The food was amazing. The people were absolutely friendly and the music was incredible. Co","useful":0,"cool":0},"bF2WDWENIaO2jjqqVre_WA":{"text":"Very slow service. From the time we were seated to the time anyone acknowledged us was ove","useful":0,"cool":0},"jd1Cq8dP4vcG5RYEPVGhMg":{"text":"I got the New Orleans sampler. The jambalaya was great! The red beans and rice was good.","useful":0,"cool":0},"S2zinEb4GwTZNjL9HwDlHA":{"text":"This place wasn't my first choice for us to stop and grab a bite to eat. But it was a plea","useful":2,"cool":2},"1FIh6oZAFq-mGjOjvzsv6g":{"text":"um we went her for breakfast, its a cheap stuffy, restaurant. There was something really d","useful":3,"cool":0},"crDnh5zXPnvQQ4Ch_LtfLA":{"text":"This was my second trip to NOLA, and my second trip to this restaurant.  They serve a buff","useful":0,"cool":0},"ybl5uq5vcu4DFfzVDB-kVA":{"text":"Wings here were the best I've had in my life! Breakfast buffet is decent not fab tho. Grea","useful":2,"cool":0},"0BRQSFTvgHNy6uunB8Y-eQ":{"text":"Awesome atmosphere, right in the heart of the French quarter market area. Live music, outd","useful":0,"cool":0},"MDrwiYdnaFYTyKcWwz1kiw":{"text":"Great place to sit and have a drink, listen to some live jazz and relax. Fun, friendly sta","useful":0,"cool":0},"pQcaPB-ShFScaDwDU-bMpw":{"text":"Eh. The atmosphere is fantastic. Open air dining with live music - can't go wrong there! O","useful":0,"cool":0},"AesiTO5kx5w2AvEkensKPg":{"text":"Went on a Saturday and experienced live music. A great place to people watch and enjoy you","useful":0,"cool":0},"azbE8TK2_QyE7YgG58Y7WQ":{"text":"Ok place if you're hangry. Food needed to be sent back as it was almost cold. Jambalaya co","useful":0,"cool":0},"YdjJRPteNyVXqPrxoZKw9w":{"text":"Objective 1 upon reaching shore again:  Take more pictures of New Orleans.\nObjective 2 upo","useful":6,"cool":3},"bsiMerx0dYKlOJxisarJbg":{"text":"+ live band playing outside on lundi gras\n+ good location near all the french quarter attr","useful":0,"cool":0},"gC8k_9gB-VM6_j0f9cWo0g":{"text":"We got about 1/2 a pound of crawfish as an appetizer. There were quite a few of the crawfi","useful":0,"cool":0},"_vjFIIJ_oqO92CbXJsnB0Q":{"text":"Food was hit or miss. The gumbo was off, the jambalaya was pretty good. Should have passed","useful":0,"cool":0},"KF_4yFfGQKbq2nY5c6-Lcg":{"text":"It's New Orleans, many better places for food and drinks. \nDrinks are kind of weak and foo","useful":0,"cool":0},"QjeDbXJUBFnMI6E3Jofu0Q":{"text":"Not good. Service was lack luster, and the quality of the food is ghastly. We ordered the ","useful":0,"cool":0},"y2REMJ1JKhEHtqIfDwx1zg":{"text":"Here's what I think: if you dislike your job or hate your life so much that you can't be p","useful":0,"cool":0},"MG5IMbjpEi0Zp6yGqNex7A":{"text":"This is my favorite place in all of New Orleans and I'm not ashamed to admit it! Sit outsi","useful":0,"cool":0},"p9O_CggGo_zPkECX5ZbHPg":{"text":"Make no mistake this is a tourist spot. I've been here on several occasions and the servic","useful":2,"cool":0},"TpKJVvV_yIP8DneB21jPYw":{"text":"Had a great meal here late in the evening.  Alligator po boy was awesome. Gumbo,  pasta, r","useful":0,"cool":0},"YwrbHD5adj9i_ftxZ_bBBw":{"text":"Great food! Great service! Great prices! Great live music all day! Full buffet breakfast e","useful":0,"cool":0},"SdHh5xj04tlPy6clvv7yWA":{"text":"Loved this place, we had the fried alligator.  The wait staff was outstanding and it was t","useful":0,"cool":0},"V_75YVUWy9A85aIielWByw":{"text":"The service was great, but the crawfish was awful. Extremely over cooked- it was super mus","useful":1,"cool":0},"_HUEKu7KqkiWIzBRV0-vKw":{"text":"Service was a bit slow, Our waiter later apologized he forgot he sat us done! Uh- thanks?!","useful":0,"cool":0},"Kj5z-c3kn5LUqsnCXKRBpw":{"text":"Good vibe place in the French quarter. Not open late. Does have live jazz music playing wh","useful":0,"cool":0},"c_9DtNaz8wNXLUqEz31Eaw":{"text":"The food is good and the live music is great, but the customer service is questionable.\n\nI","useful":2,"cool":0},"FiZzvbywUUPFFnr3L1YVWQ":{"text":"Amazing!! Great friendly fast service. Had the fried fish combo which was awesome.  But th","useful":0,"cool":0},"YmUbHjcGTpTPGTkzwAs8kw":{"text":"Ok lunch for a busy Friday afternoon.  Good finish the a French Market visit. Muffelata wa","useful":0,"cool":0},"fZs7iC65XEyqZ_kJBp3fCg":{"text":"Since this is my first time in New Orleans, I had to try the top typical New Orleans dishe","useful":0,"cool":0},"kbq7hX5CdesJomzt0TSzcA":{"text":"I love everything about New Orleans except this \"restaurant.\"  Be on the lookout for this ","useful":0,"cool":0},"q1KugAeZzdeE1ISrZk1tvQ":{"text":"We stopped in for quick bite. I had the seafood gumbo which was very tasty with a little k","useful":0,"cool":0},"u-wC58DfHpcv4rhJV3vaPg":{"text":"It is my first time in LA so my family and I decided to visit this restaurant. All I have ","useful":0,"cool":0},"E893NQKItXycLxjliD_ldg":{"text":"Had their Oyster/Shrimp PoBoy here and it was ok. Thought the seafood was a little to over","useful":0,"cool":0},"SLLxFYO44pdZ-BjYv35SVA":{"text":"The best place on earth.  We loved it,  and the service is the best of the besthe music is","useful":0,"cool":0},"iupgtXRAk8W6fcw8DLgQRQ":{"text":"My cousin Tammy and I stopped in to get out of an unexpected rain to listen to live music ","useful":0,"cool":0},"PsA8mUX1KVKf2j6glzBg-w":{"text":"This place is a must visit. Food was delicious ( warm and tasty and freshly prepared), dri","useful":0,"cool":0},"f-docdO77sCvlfBwrQd0yQ":{"text":"Had a great experience at The Market Cafe. I love almost any place that has outside seatin","useful":8,"cool":8},"xuGzosPQFs2JnUepWUfucA":{"text":"Great breakfast, friendly staff. Waiter michael did a great job. Delicious house bloody ma","useful":0,"cool":0},"MBwocQXy9V0zCYmZujwO3w":{"text":"This used to be my all-time favorite restaurant. Every time we came to new Orleans for my ","useful":0,"cool":0},"dI_uML_mUYmQgN2rVxZQYA":{"text":"They have live music and a nice patio. We had a few pounds of crawfish and a few sides of ","useful":0,"cool":0},"Rg0vc4yzBBGd_2MDymJ1Lg":{"text":"Live jazz in an open air seating area makes this a good place.  We ordered a whole muffule","useful":0,"cool":0},"VD8IEND0jQYFTZdgDrYZFw":{"text":"We actually didn't eat here; we only drank here a couple of times, but each time it was a ","useful":1,"cool":0},"lFD6ff1Zd_JseLC87GEtbA":{"text":"Epic long wait times. Even with the place half full, with half the people having the break","useful":1,"cool":0},"V5Hfj6zi6truxaWWmP1CVg":{"text":"Okay the food is, eh! The drinks were reasonable priced but the outdoor coming yours jazz ","useful":0,"cool":0},"kuF7VK7kvxyslDicaV0MIg":{"text":"We had to try a real New Orleans Po Boy sandwich before we left.  What better place than T","useful":0,"cool":0},"Swt2SlluOYH-0ZV7JY45Pw":{"text":"We had the breakfast buffet and it was good! Nothing spectacular but did the job! It was 1","useful":0,"cool":0},"xbZ-if0GSbdSwYIfmkMDhw":{"text":"Great breakfast buffet!!! So good we went back twice during our visit. It was a great way ","useful":0,"cool":0},"Ub2BGk9qhM0K6N4TQuCq9A":{"text":"Well, that was horrible. This is definitely a tourist trap.\n\nWe ordered muffalata and wait","useful":0,"cool":0},"MJ1-NmKmnGlvmpC8ifXLeQ":{"text":"I was extremely disappointed by this experience. I saw many reviews online about the Marke","useful":0,"cool":0},"zlPnKOZw2irW1wrLXt569g":{"text":"This was the first time I have been here. The service was fast and the food was good. Peop","useful":1,"cool":1},"Gv6DWZKm-YRIQ3ygL-P4nA":{"text":"The service was terrible and they tried to rip us off. They first overcharged us for a sid","useful":0,"cool":1},"SiigOeXBWeDDzlQBL3X_kA":{"text":"Solid but nothing special.  Jazz during lunch is nice touch be sure to tip the band.  Good","useful":1,"cool":0},"PX-52m53K4B1iiQsx56ibA":{"text":"Great service and a nice breakfast.  Nounds like the bloodtly narys are good too.  Great l","useful":0,"cool":0},"4FeIlX-yxV-nGUi93CzEfw":{"text":"This was a great little place to stop for breakfast, there was a little bit of a wait but ","useful":0,"cool":0},"494mxIUOIzBDblJZ2zKB1w":{"text":"Perfect place to grab a delicious breakfast! We came down from the river walk and had a de","useful":0,"cool":0},"IIcb8xHRxFhzRAuKJs9GNQ":{"text":"Great ambiance.  Bring your own good friends!!!  Can't go wrong with the buffet.  Service ","useful":0,"cool":0},"xOBbhRrn753Q-eQLP-aEvA":{"text":"Love their jambalaya, red beans & rice and pina colada. Live music, outdoor and indoor sea","useful":0,"cool":0},"GJp-exU1M8oSqe855FUIxg":{"text":"Ate lunch here on 3/21/14 and was pleasantly surprised! Service was excellent and the food","useful":0,"cool":0},"bWIPODaZxy4_JVMPhsAN-A":{"text":"Rode my bike down to the French Market and was walking around when I hear the band. Stuck ","useful":2,"cool":0},"87dup_qLVsCUdIpHhus9LQ":{"text":"I can't vouch for the whole menu, but the crawfish boil was off the hook here.  The broth ","useful":2,"cool":1},"5PeHkL6YGL42W-dKfDnLUA":{"text":"The best bloody mary you'll find! Great food as well (i ordered the oyster po boy and gumb","useful":0,"cool":0},"SbvP40Y1NDxYtK2p3d7rZw":{"text":"Terrible.   Portion sizes were so small I thought I had mistakely ordered an appetizer.  A","useful":0,"cool":0},"1B2DyPtBz9oTSnRfUe-opw":{"text":"We ordered a dish with Shrimp, they gave us rice with total 4 shrimps and some canned ketc","useful":0,"cool":0},"ulVuHdLRl9rdJuewdrevaQ":{"text":"Roaches, roaches and more roaches crawling on our food!!! First restaurant we stopped at o","useful":0,"cool":0},"CJDRhbS7NQ-d_aeQdOkK0g":{"text":"I tried a bowl of jambalaya and a Greek salad. The food was delicious! It came to the tabl","useful":0,"cool":1},"sgmfeuXU4eMWAJw8jFXzgA":{"text":"My 12 yo and I thought we should really try this muffaletta, which originated in the Frenc","useful":0,"cool":0},"8FJFkpHyjOmavtf2wccJhg":{"text":"Brought my mom down to NOLA to celebrate her 50th. Of course we had to try a po boy and mu","useful":0,"cool":0},"A_9wBSOBgMquRY--KbagcQ":{"text":"The waitress was really nice and so was the environment but the food was OK. This was one ","useful":0,"cool":0},"ARcM2QHfZ_K8ODWwACI7jg":{"text":"If I could leave 0 stars I would. The only bad restaurant in New Orleans. I paid $20 dolla","useful":0,"cool":0},"PZApxn_HoGQ0vFpwJPCv4Q":{"text":"While wondering around the French Quarter, we smelled something delicious and followed our","useful":2,"cool":1},"TWCUgLHQwxCJQ3uu_qPHzg":{"text":"We had such a great experience at this restaurant! A group of us went to New Orleans this ","useful":0,"cool":1},"4mlGJhUFjvOcmLr6HvywnA":{"text":"If you like to people watch, sit outside and enjoy some local cuisine - this is a must!  E","useful":1,"cool":1},"tK1IC4ODAlWQAcuu3-3h4Q":{"text":"Placed in the center! This place is so easy to find! Ordered their sandwich here. Oh it's ","useful":11,"cool":13},"pRMUzPxQQpwMEUTpJDX4Gg":{"text":"Very disappointing. I got a hot ham and cheese po' boy and it came out cold and soggy, and","useful":0,"cool":0},"fVPUnZOJmIyIQ1lI9tI7VA":{"text":"Mufallettas are to die for!!!\nFried shrimp was delicious, and the wait staff are very atte","useful":0,"cool":0},"clnZgDEjAZ2oiFyAxIi1JA":{"text":"We enjoyed a quiet evening at The Market Cafe.  We ordered bread pudding and glasses of re","useful":0,"cool":0},"zO_UFyViJcI3eqzhBCI4yg":{"text":"Market Cafe \nAsk for Martino.  Tell him we sent you from the Bawtha or Not Bawtha page. \n\n","useful":0,"cool":0},"grPVk1VqQkp-J8v2TeJ9Ag":{"text":"We got a sampling of food to share and it was all very good. \n\nHad to try a crawfish boil,","useful":1,"cool":0},"xYIbGkVVPnBYmepTGcnmcg":{"text":"Honestly, my food didn't taste like anything to me. It was most likely due to the fact tha","useful":0,"cool":0},"ZoabVeOACPncjQpLy2nuzw":{"text":"Umm, I really didn't like this place.  I mean, New Orleans is chock-full-o' delicious food","useful":1,"cool":2},"0zsKeKySAEdB1FYP5Skm6Q":{"text":"This was our last meal before catching the plane back to Bid D.  The only thing I'd not tr","useful":1,"cool":0},"0hDNzChrI1WoGBWrATaRTw":{"text":"This place is the shizznit! Gumbo and Po boy is where it's at! Service was quick and great","useful":0,"cool":0},"jr5g4Kf-lWyHoug-Y-6yNg":{"text":"Awful food! Seriously, not even worth eating! The service wasn't very good either. As I sa","useful":0,"cool":0},"gNfNPeUScWVWfmU_wVeP0w":{"text":"I do not remember this place right now - I will have to return to this review after checki","useful":0,"cool":0},"VG_LblekuoARwe5NE9bIdA":{"text":"Real disappointment. Ate dinner there on December 30th. It was busy but they obviously los","useful":0,"cool":0},"JBU0gDbU0w9cps6zadzAMw":{"text":"disgusting customer service. cristina is the worst person ive ever dealt with in my life s","useful":0,"cool":0},"NMieo-4NdLlDGqz5wB5CYA":{"text":"This place was really good my boyfriend ended up getting some gator bites which she's neve","useful":1,"cool":1},"6SAynI7UJ36CLc8J_q7lbw":{"text":"Went here on the recommendation of the hotel. Fairly good walk but we wanted something goo","useful":0,"cool":0},"YFh12U4iOQvKWlKlbNUjgQ":{"text":"The food was very good, tasty and descent portions. The live music was great an even bette","useful":0,"cool":0},"cniLUMBQB1sjqQcyoP1IPA":{"text":"We had been walking for hours and, with all the choices, were overwhelmed. We decided to e","useful":0,"cool":1},"9NpiGUYZn0SQzcry759TEA":{"text":"I want to thank Gerald our server. For reminding me not to take good food and good service","useful":0,"cool":0},"4bTs9nNDjzkpheHwSSQzSQ":{"text":"Worst place we have had in New Orleans so far. The wings were good but that's about it. Fr","useful":0,"cool":0},"eDbqZzqJxAojiw4CFP349g":{"text":"Honestly, my brothers and I had a pretty bad experience here. To start it was Christmas Da","useful":0,"cool":0},"fMd3VIn1_-U3MldDj4utVw":{"text":"Stopped by to grab something light to eat. My husband and I tried the taste of New Orleans","useful":0,"cool":0},"nNJkhlql20zFA3EnJu3h1Q":{"text":"Great breakfast jazz, but lame cold buffet.\n\nOpen air but covered, maybe abbreviated menu ","useful":0,"cool":0},"pv1aVKqxk9RLnvN843GlUw":{"text":"Ordered the Sea food platter ($25) which comes with Fried Shrimp,Cat fish, Oysters , Frenc","useful":6,"cool":6},"W2kCOSlnlSIV1pseLZyeog":{"text":"The food and drink were amazing, the crawfish and oyster were just how I remember them. Th","useful":0,"cool":0},"J-eQL066l4yExolDzzmGKw":{"text":"Terrible.   Portion sizes were so small I thought I had mistakely ordered an appetizer.  A","useful":0,"cool":0},"7oq4EC7Hmk-8xJoRDJmQSw":{"text":"Five star location and setting with 2 star food. They had live music during our visit whic","useful":0,"cool":0},"YtUMiiZHhD27TX1cPhOafg":{"text":"This was the only place where we didn't really enjoy our meals during our entire trip. We ","useful":0,"cool":0},"R3A69FOe5sAjY_yHX3DUKw":{"text":"Worst place to eat in new Orleans.  Rude manager, bad food seems impatient staff.  The wai","useful":0,"cool":0},"h2WTHW0abXrh1vyhCxZmJA":{"text":"We wanted some crawfish boil and this place won us over.  The place across the street had ","useful":0,"cool":0},"idiuThQWJjDBufGNVizWig":{"text":"Great food, great service. It was packed and the food came out quickly the world famous gu","useful":0,"cool":0},"o05LjHxxqfeACOs_twrsVQ":{"text":"The service is very friendly and the food is good if you wanted something to eat quick. \nI","useful":0,"cool":0},"5q3wFSeOek_izYNFo4vWlg":{"text":"Such a perfect location! It's at a Y in the road on the bottom of the French Quarter not f","useful":1,"cool":0},"T0Ro86eGJLkxIwQV53kBuw":{"text":"Food was cold. That's my only complain about this place. I had okra gumbo and my husband h","useful":0,"cool":0},"CG9nIx3I87kI5HbnvltCKg":{"text":"After walking around the French quarter the air-conditioned Market Cafe was a welcoming sp","useful":0,"cool":0},"xL7dkYWpbTA0gybvtn7row":{"text":"Service was good and there is outdoor searing and live music the Food okay. Had the Gyro a","useful":0,"cool":0},"ut7QQbRHEMTQE5qptIr7TQ":{"text":"Stopped for lunch here and got the jambalaya and alligator bites.  Both were excellent.  T","useful":0,"cool":0},"l3v6ggu76AuvdCEwUZZG5Q":{"text":"This venue is conveniently located near the market and the Café du Monde.  We had a buffet","useful":2,"cool":0},"CXHgKvHZacTrzCsMmPxsXw":{"text":"2nd time visiting The Market Cafe due to having one of the best Bloody Mary I have ever ha","useful":8,"cool":5},"FLf6InI02C1HXgpizIpBJg":{"text":"Great simple breakfast.  It was like eating from Grandma's house. We stopped in on our mor","useful":0,"cool":0},"vOvzF2z7uJbsFIMltVd9Dg":{"text":"Cool little spot. They have a nice menu. Wanted to try the crawfish broil but didn't get a","useful":0,"cool":0},"yzSMzbKYcSmB2mNIc7HBBg":{"text":"We were looking for a place that had boiled crawfish and live music which they did. It was","useful":0,"cool":0},"RFwx7k7Ou519rZEWdYcwWw":{"text":"My second visit here. This time was around 7pm and they were all out of crawfish. First ti","useful":0,"cool":0},"a3gDca4s-wEqwiZVJIEkbQ":{"text":"Great lunch spot! Excellent live music! We enjoyed the outdoor seating. Alligator po'boy a","useful":0,"cool":0},"ubTCNP_G27mBCdEzRDKa4Q":{"text":"Two favorite things here: \n\n- outdoor seating with live music, all day\n\n- the super secret","useful":0,"cool":1},"XMcbfnsypQRDcwg2U-Vtkg":{"text":"Best hummus of my life. Great for vegetarians. AMAZING atmosphere and live music. Love thi","useful":0,"cool":0},"ogFtp0vfpU4JsWhjYIL2BQ":{"text":"We ended up stopping here because we liked the band that was playing. Between the three is","useful":0,"cool":0},"OxEfRnpnLF7ng7n0g5KupA":{"text":"Congratulations Market Cafe for serving me the only bad meal I have had in New Orleans. Th","useful":0,"cool":0},"i0sYIOd8OlFniFtrLmcX2g":{"text":"Try the fried gator  oh yea!  I wasn't really feeling the taste of the Bloody Mary but I w","useful":0,"cool":0},"NVxz1GgO73r-TXYS8RsTkw":{"text":"Waited for over an hour for freezing, un-flavorful food. The muffuletta was terrible. The ","useful":1,"cool":0},"Yo3hBJxlpfPhzhfFfrIEDw":{"text":"Food, service and music was excellent! I love Keisha!! \nOrdered the shrimp poboy and it di","useful":0,"cool":0},"AfkNUAKgg_nVPB_RdFKM6A":{"text":"We stopped by after dinner for some dessert and coffee. While the staff seated us right aw","useful":2,"cool":0},"tg7_6iHCTTmq572CnSV4Ag":{"text":"Food was undercooked. I sent it back and it came back with half the portion of the origina","useful":0,"cool":0},"RVXx714AA_5EhqKadK9tDA":{"text":"Now please don't get me wrong this place is so much fun. The wait staff is amazing and fun","useful":0,"cool":0},"WX1ojlqJ6FxfWvbCttEkfw":{"text":"Three whole stars for location.  good for people watching & resting your feet when you've ","useful":9,"cool":8},"r3FDFIZkQBEro_DOXzOtvA":{"text":"This is the first place I had Gumbo and PO Boy and it was Amazing!!\nThe servers are friend","useful":0,"cool":0},"bpyfTj50CHURrAuqInZsJQ":{"text":"This was my second time visiting the restaurant - I had previously been here on a trip my ","useful":0,"cool":1},"zzDJ_su-iYpueMQDpaux7A":{"text":"We stopped here a couple of times while in New Orleans to have a drink and listen to the l","useful":4,"cool":3},"hgpWhGZswzIBoRErT2oLjw":{"text":"Came to The Market Cafe for some brunch. The weather was perfect to sit outside and with s","useful":0,"cool":0},"LpMyIGh7MNZBMt-GD2wFFQ":{"text":"Walking through the French Quarters and my large group of friends were hungry and we stopp","useful":3,"cool":0},"MiHR8SIKulx70Q32Zo_i2g":{"text":"Bland and tasteless excuse for a po boy. A few slices of store-bought sliced turkey, a few","useful":2,"cool":2},"Upm6lLwN9gEmXYXHVLoWNg":{"text":"Came here to eat and was handed a breakfast menu when I wanted lunch food but made due and","useful":0,"cool":0},"nX31F40YEqfguPjhiPaADA":{"text":"I must call you out, Market Cafe. Your extremely mediocre food has no right to charge thos","useful":2,"cool":0},"0gF7dWzj8NAbg1rjOxm9yQ":{"text":"They had a breakfast buffet that looked ok, if you wanted eggs, biscuits, gravy and fruit.","useful":1,"cool":0},"jJ_IRlEpZiJBxSEU1LK-SQ":{"text":"We come here each time we are in New Orleans, just a few blocks from Bourbon Street it's i","useful":1,"cool":2},"Zxntxj7O9ySG-sOlIELmdg":{"text":"Food was amazing! Service was great! Came here while on vacay and reallly enjoyed the food","useful":0,"cool":0},"16HmJP1xDXFH3MaJmUa_bg":{"text":"We chose to sit outside to people watch and enjoy the live band. Our server was super nice","useful":0,"cool":0},"nFAkk0eg3ir_jDxoYlhebg":{"text":"The atmosphere is delightful; sitting outside watching the people come and go and listenin","useful":0,"cool":0},"MkJucyZRQ5FDhur6hhPtjw":{"text":"Great spot to drink with live music and enjoy the square. I can't compare the prices but t","useful":0,"cool":0},"Iug0UvD6eYrY38-XLTlhzA":{"text":"Let me preface this with the fact that we only went here because Central Grocery was close","useful":0,"cool":0},"T7uTlThHuJPTxgNFxIXGvg":{"text":"Absolutely disgusting! We literally waited an hour for the food, and it was awful. The wai","useful":0,"cool":0},"iw_zAmGlo4PCRRUePMoj7A":{"text":"Had breakfast here today. Our server was kind!  The food took a while to come out.  We ope","useful":0,"cool":0},"ZegmG0EEWZaIEGDAQLWX1w":{"text":"Waiter not good food not good service  not good waiter reference us as \"\"YOU PEOPLE\"\"","useful":1,"cool":0},"F-qrqj9-p7N-Qy_LeECEfA":{"text":"Loves the outdoor seating. Food was great and prices were really affordable. Service was w","useful":0,"cool":0},"XL6x1sFWxyZTa93_dPhn2A":{"text":"This place was incredible. I haven't been this excited over food in a long time. Amazing m","useful":0,"cool":0},"TWerX8ACOClTOH2geOxpQA":{"text":"On a cross country trip we had to stop in New Orleans. Unfortunately, Covid closed down to","useful":0,"cool":0},"l_YmvkwI68YwOSB7PyDMWQ":{"text":"I found this gorgeous restaurant while exploring the French Quarter. \nI enjoyed the jazz m","useful":3,"cool":1},"ocFsvQkEzTrx-a5VH_XDzg":{"text":"My wife and I came in to sit for a bit, and hopefully have some great NOLA food. The servi","useful":0,"cool":0},"th4R1IYxIruWkbawWf83NA":{"text":"We were some of the last patrons in the building that night. The restaurant looks like Bou","useful":4,"cool":1},"3nWM4w5QOvlIEpw2D12c9Q":{"text":"I ordered the Tastes of New Orleans.  It's very disappointing.  The crawfish estoufee was ","useful":1,"cool":1},"4IWBJua6sLln0OxITFWY4g":{"text":"Found this while looking for somewhere to eat and cool off. Servers bring water as soon as","useful":0,"cool":0},"r6hLMEap1vUIlH9PbT8MoQ":{"text":"I had lunch here.  Very busy and the music was wonderful.  I loved sitting outside and enj","useful":0,"cool":0},"iPOB_vow04HQs7CN7-ScMQ":{"text":"After a crazy night on the town with drinks, trannies, drunk servicemen, live sex shows, b","useful":3,"cool":0},"p2GVcpE78-9REy8-LZLSFg":{"text":"Terrible.  Ordered the alligator sausage po'boy.  Sausage was tasty but the bread was stal","useful":0,"cool":0},"tNfE8dONGeMaVI-yYceaKw":{"text":"Stopped here for a quick breakfast when we first got to New Orleans. Ordered the French to","useful":0,"cool":0},"XnGRi4gv1XaRSRskTJLHGA":{"text":"Never want to eat here again, service is slow. Took us 30 minutes to get water. Under staf","useful":0,"cool":0},"KzXTbUvg2qNuwKndt2dtGw":{"text":"Love, love, love this little spot! The shrimp and grits is awesome as is their crawfish et","useful":0,"cool":0},"g6_XKOmQW-MBxw--OLX84A":{"text":"The LA lemonade was so sweet it was nauseating. The cup of Dixie beer came 3/4 full. We wa","useful":0,"cool":0},"iL2nRTm0ZcKN8eFPS0UPTg":{"text":"Location is great. Setup was cool considering location. However it gets a 3 for the shrimp","useful":0,"cool":0},"IXASvu_Y1FT3PbpfHuSEuw":{"text":"Terrible service. Don't pay in cash. You will be short changed. Go somewhere else. The goo","useful":0,"cool":0},"VbRzCeLRZGWKuJju94AQIw":{"text":"Great breakfast for cheap. 3.99 for 3 bacon, a biscuit, 2 eggs, and some grits. Pretty goo","useful":0,"cool":0},"MRSqxv4fvXTY-KVSdfU3ug":{"text":"We stopped here for lunch just because it was right on front of us and the menu looked pre","useful":2,"cool":0},"0LhIPnoaiWQXCp3KA89QLw":{"text":"I'm giving this a 10/10. The food is very incredible, New Orleans is definitely known for ","useful":0,"cool":0},"_izdnnKRjNrf3M8RoD3DCQ":{"text":"Live music band\nStop by for lunch I got the mufallettta \nAnd a blody mary\nWas pretty good ","useful":0,"cool":0},"n_3s_6yV7h4ufV87TgzRnQ":{"text":"It is the perfect mix of fun and good food I would recommend the oyster po-boy to everyone","useful":0,"cool":0},"F8VQeo9KPoSnpdCBMUL58A":{"text":"Terrible service- host skipped us and brought guests standing in line behind us to a table","useful":0,"cool":0},"ZH7-C0Y6SiSbvBJKmPfLfQ":{"text":"Sat in-between the two halves of Decatur street and right by the French Market this is a g","useful":0,"cool":0},"ltwFxqIYnmzTbKid6UPQyA":{"text":"The service was terrible. We waited over an hour for luke warm food that wasn't very great","useful":0,"cool":0},"JokbrdyB1jxD64BW_P7Dmg":{"text":"An awesome atmosphere. While sitting outdoors and listening to the live music we enjoyed o","useful":0,"cool":0},"vEXWHNzLVg8cMIja_0WFeQ":{"text":"This is a review of two visits that encountered on the same day.\n\nMy first ever visit was ","useful":2,"cool":0},"ozAIXk32PTE0tg_igJp2KQ":{"text":"We had the best luck with this place this morning. I was flying out of town and still hadn","useful":0,"cool":0},"uR23rYdo_XatCZlBCbwJkg":{"text":"A great spot in the French Market for lunch, some great music and a bowl of gumbo or a Po ","useful":1,"cool":1},"8WjTLpYikdPnNpZSyHqWQg":{"text":"AVOID!!!!! I work in the quarter and thought this would a nice convenient breakfast option","useful":0,"cool":0},"_K0qjzclXek20nXwZjmS2A":{"text":"Absolutely awful service. After being given water cups upon being seated, our waiter disap","useful":0,"cool":0},"3bpikxgy5m4tJF0whtL1gg":{"text":"Food was decent but not my favorite. I feel bad that they're so understaffed right now. De","useful":0,"cool":0},"h9Wm25o6rqi7RA9DdhNq5A":{"text":"Very busy restaurant.  My girlfriend and I walked in and sat at the bar. We had Crawfish B","useful":0,"cool":0},"a5MMsdp54dyWMCW0aVm5FA":{"text":"Food was subpar, the music was good and lively with the live band. However, their jambalay","useful":0,"cool":0},"PGf3S9xnbUR__NW9mBO5bg":{"text":"First off the service was very good, but the breakfast menus was very limited, but they we","useful":0,"cool":0},"WSLfAW4KgQtsFpoUisFgVg":{"text":"Not a huge fan of this restaurant.  We sat outside where the band was playing. After sitti","useful":2,"cool":2},"tOGhvkAym_eFzkszPsnDAw":{"text":"This little restaurant at the entrance to the French Market has one of the best gumbos in ","useful":0,"cool":0},"bgJ1iZu2OXvx7kUQNkHC9w":{"text":"Certainly of the overpriced touristy eateries in the French Market area, but it's not bad.","useful":5,"cool":3},"8xxjAWeoGcOqz3ldPiH8aA":{"text":"If I were to go back to New Orleans, I would not come back here. The only thing keeping th","useful":1,"cool":0},"2Hcf438gxszw_R6Gxw5wGw":{"text":"W received the absolute WORST service I've ever experienced. Our waitress served my dad a ","useful":0,"cool":0},"tQPOZn9N8UR95h6poiiJ8g":{"text":"No idea why this place only has 3 stars. We we here after having a fancy dinner across the","useful":0,"cool":0},"DCV3ACO4xBQp84MIsYsQXQ":{"text":"Our first time here while visiting the area. The atmosphere was cozy, even during the rain","useful":0,"cool":0},"0n0a-GuRbokN2N1-it6FWA":{"text":"Crawfish beignets are a must. Alligator is a good appetizer that is similar to any other r","useful":0,"cool":0},"LXQt7djw98jxpbU2vKlUhQ":{"text":"This is a good outdoor option in this area, complete with jazz bands on a Sunday afternoon","useful":1,"cool":0},"KtWjVF8UEHO0VLe4-FqZJw":{"text":"As part of our food tour with DK tours the first stop was Market Cafe where we had some de","useful":0,"cool":0},"aVg3CVr-yOiFieTX-3jJYA":{"text":"4 stars for location and outdoor seatings.  \nGumbo was not bad.  Cafe au lait was water do","useful":2,"cool":1},"lL0MjZci5LWyTNvDvDJfSw":{"text":"While shopping in the French Market BF and I stopped here to grab food. We were seated rig","useful":2,"cool":1},"K6AnDtEu2e4yQmMQ4QXqAg":{"text":"This place wasn't bad! We came on a Sunday and ordered off the menu. The gumbo was good an","useful":0,"cool":0},"-PbV2gQtOpUIGorUwzRdMw":{"text":"Walking down from Jackson Square and hearing the live jazz playing, we were drawn in to th","useful":0,"cool":0},"u5suIV-PrrWRFF2YKSvwDw":{"text":"Nothing could have made our experience here better--prompt  and friendly service, great, c","useful":1,"cool":1},"UlNz5TJAf7-LgdP1P4y0dg":{"text":"Sooooo amazing! If you want a classic taste of all of the great New Orleans food then the ","useful":0,"cool":0},"PTtYhQz3OEJlFiULAKaq_g":{"text":"Didn't eat here but the place was packed. Outdoor seating was to hot.","useful":0,"cool":0},"LK5kVQLsgmXuGJAwP5_tew":{"text":"Sat at the bar just to take a break and have a couple of drinks. The bartender was very ru","useful":0,"cool":0},"_KGojKi-4WyJg__ecfhlfQ":{"text":"Really disgusting. BBQ shrimp was nothing like BBQ shrimp is supposed to be. All you could","useful":0,"cool":0},"D2aKpdqRYmbQTmFeXrq-Nw":{"text":"Two good things about this restaurant; there was a live band playing that was thoroughly e","useful":0,"cool":0},"PDz922N9l0YpvI5L2RH0TA":{"text":"Good food and great music to start a long weekend in the Big Easy. Great location in the F","useful":0,"cool":0},"P6NS1G2NZU2Ybzdp6VPv5Q":{"text":"Came here on part of a food tour with my boyfriend. \n\nWe were given a piece of a shrimp bo","useful":6,"cool":5},"kzoKbYBcR8etyzGZEV2kzQ":{"text":"This place was ok, not the whole in the wall to die for place that you think about when yo","useful":2,"cool":1},"V3SDxjExjvTFdkc3naNZPg":{"text":"We got off a tour bus and were dumped into the French Quarter on a Sunday afternoon. Our b","useful":2,"cool":2},"nqX8fP8csfkf5o0codVxTw":{"text":"When visiting the French Quarter in New Orleans, my boyfriend and I decided to go to The M","useful":2,"cool":1},"77q48HgTRUVCLt-rBLtjnA":{"text":"My husband and I had a tour at 9am and had an hour to kill and needed somewhere to eat.  T","useful":0,"cool":0},"IFVjXLurPpH0RBt092QbHw":{"text":"Lunch was an excellent crawfish etoufee' and very good popcorn shrimp.  No sweet tea avail","useful":0,"cool":0},"be1J2D0kHxzVykdP4aI7gg":{"text":"It doesn't look like much when you walk by it, but when you get your food... you're right.","useful":0,"cool":0},"9842dN_huX90im8j-Cln1w":{"text":"Love this place. So much going on around the place, yet the bartender and manager made us ","useful":2,"cool":3},"GXu__FQ7VJpiuH0_4fqnfQ":{"text":"Great music for the (tourists mostly) customers and passers by, decent food and great drin","useful":1,"cool":1}}