{"-QyMp2zPRgSRVNdVYu5BNA":{"text":"Service was great, food was delicious. We had a party of 5 and got the boudin ball and gat","useful":0,"cool":0},"EXndWVgHrQr0EmC42c4mSg":{"text":"We went here for the first time today and sat at the bar. The bar tender was super friendl","useful":1,"cool":1},"FW7b26UzPRonq0EnfSxVMQ":{"text":"It is rare as hell for me to have such a strange experience at a restaurant that I don't l","useful":3,"cool":0},"pTpUw3ef8SN03dvGJoLMMg":{"text":"Nice and laid back place; kids enjoy looking at the boats. Food was pretty good, I had the","useful":0,"cool":0},"IDO2TOp40EX0lZsVJsuQGg":{"text":"We are staying at the RV Park here and love the convenience of having a restaurant right o","useful":1,"cool":0},"ebNSw3aAzlFE6ykIxzLT_w":{"text":"We stayed in one of the houses at Pontchartrain Landing and were pleasantly surprised by t","useful":1,"cool":0},"MCXPuqCuIKPvyiYjygqqeg":{"text":"This place is pretty nice. Great view, good food, good service. Slightly pricey but is in ","useful":0,"cool":0},"fB5URE3eIRN1FQMga8bhZQ":{"text":"Stayed 500 feet from this place for a few nights.  We were excited to have a go-to place f","useful":1,"cool":1},"GApiV33BlPSawLzEopZKtA":{"text":"The live Cajun band was Fantastic!  Stick with the sandwiches, the pulled pork was great a","useful":0,"cool":0},"-zZtSYs8qaV723-g6Al8MQ":{"text":"This place is a late night super star! They have amazing desserts and great local food","useful":0,"cool":0},"tbvytiTW09L4wKDvlA10VQ":{"text":"Nice watering hole and restaurant right at the RV Park.  Drink specials were priced right ","useful":3,"cool":0},"-7r0OJgPOJp-FcUnoVNyNA":{"text":"Not terribly impressed. Food was good, but our waitress/bartender was pretty rude. When we","useful":0,"cool":0},"oPxloIBKVsxOgk3Xt78VYw":{"text":"Good atmosphere. Great service.  Food was tasty.  Servers really nice.  Tonight a good ban","useful":0,"cool":0},"e4TMv898GBDxsGzzBLK_hQ":{"text":"This place is a little hidden but very worthwhile. Has traditional New Orleans food and va","useful":0,"cool":0},"AlZF8v2jgeBNSMpDNug0rA":{"text":"Ordered delivery through Uber Eats.  Rib platter with roasted potatoes - ribs were tender ","useful":0,"cool":0},"taaUGo_W7ISPnHtJgqfdhA":{"text":"Right in the RVpark great salty pig sandwich   And Abita beer. Wednesday is ribeye night. ","useful":0,"cool":0},"T8jxvN4EpfD2VftxZMZgGQ":{"text":"Outstanding.  Friendly, charming staff, upbeat atmosphere, surrounded by water, cold bear ","useful":0,"cool":0},"zvFYyQ6PZwfNR7qzODZseA":{"text":"I love this setting. It is on a marina, there was a band playing. It was SO nice to have a","useful":0,"cool":0},"hU1CFLkgozBwr0KK9x7wNg":{"text":"A real surprise. The Sunday drink special was a Bloody Mary. Honestly the best Bloody Mary","useful":4,"cool":3},"29AcPYNObmH6Nt_RmOc8Mg":{"text":"With bad weather looming in New Orleans we decided to stay in camp and have dinner mistake","useful":0,"cool":0},"VVz5KbPMQVGnGIk6IvcRIQ":{"text":"This an out of way bar and restaurant. Good food; BBQ, New Orleans classics like Gumbo, Ja","useful":1,"cool":0},"1JBSqmjl6fbUaf3r79jGAA":{"text":"We ate here twice and came a third time for drinks.  This restaurant is on a shipping chan","useful":1,"cool":1},"h-GNOoWOp-VLHtjNG_faoQ":{"text":"Was a very surprising experience.  I didn't expect to like the food since it was a restaur","useful":1,"cool":1},"nZN5oh1qB6jCvZAEZzOCPA":{"text":"This is beyond me, I've never  ever had food this bad! I am flabbergasted...fries were gre","useful":0,"cool":0},"ju5tafiE2OSELZ9fbXOFJw":{"text":"Found this place strictly by accident. It was bingo night and the place was hopping!  Wait","useful":0,"cool":0},"6Zl9FFfgVBcFL_VeANhQCQ":{"text":"This is the bar at Pontchartrain Landing and it actually does have a rotating light above ","useful":10,"cool":3},"kRRRIx3B6iqmLTKSECIVsg":{"text":"Pretty neat place to say the least. Located in a RV Park/Condo area right by the Industria","useful":0,"cool":0},"0c1m05Aol7gue8kUPTU0Dw":{"text":"I've eaten at The Lighthouse Bar & Grill once before today and left completely satisfied. ","useful":3,"cool":1},"H2CbSRzR-HOLOqCxo3dpzA":{"text":"We stayed at the rv park for a week and frequented the restaurant/bar.  The food is fantas","useful":0,"cool":1},"JQcYV8BbRBp6d4UctoSbvA":{"text":"This place totally took me by surprise. My husband and I were driving along lakeshore driv","useful":0,"cool":1},"wcj3QZb4cSbsJcEvCqqpzg":{"text":"Our family had several meals here in a week's time. We stayed in Pontrachain Landing. Ever","useful":0,"cool":0},"Yp-a5msKI1Rbsb5SjyZ0Nw":{"text":"Such a cute, fun place! A complete gem. We had the swamp balls, crab cakes, and burger and","useful":0,"cool":0},"im2TiGF7IkarG2Seu4CV6g":{"text":"How in the world this place got 4 stars is beyond me. Was not really busy but could not ge","useful":2,"cool":1},"0Ka7cqsLUMj34hTv2O5umA":{"text":"I've come here a couple times with my SO and a couple friends, and was thoroughly satisfie","useful":3,"cool":1},"_ebAnb7g2BTfByjh8x8ICQ":{"text":"Great time at this restaurant. Good selection and great service. Entertainment was a great","useful":0,"cool":0},"xDfQZ7YdfSWmIbsey_zrDQ":{"text":"We stayed at the RV park located next to restaurant.  We ate Sunday brunch. I ordered the ","useful":1,"cool":0},"sJoCjvXW_tjhUK1Bgmj19Q":{"text":"The food and drink is just OK.  Kinda pricey for what you get.  We split the NOLA appetize","useful":1,"cool":1},"IjDm1sjZDFETBo9if0-EmQ":{"text":"While the atmosphere was nice and there was a good band playing, the food was not great. M","useful":0,"cool":0},"InUuAUNfvEy0SZpfspQ7ig":{"text":"I had fried catfish and asparagus, and both were superb. In face went back for lunch next ","useful":2,"cool":1},"6tVg1wJm9l_F-QgC_tcUyg":{"text":"I ordered from Uber eats to try this restaurant. The food was okay. I got a hamburger with","useful":1,"cool":0},"MEWANXktpc7LNybpzXLmwg":{"text":"This place terrible! This was the worst meal and the worst service I have ever had in NOLA","useful":2,"cool":0},"EPeot7VdKIqsJKKZz3ukgA":{"text":"By far the best fried shrimp and oysters I've EVER had. I also had a bowl of gumbo, excell","useful":0,"cool":0},"rZg37IGfB8pD56rAy-jSYQ":{"text":"One of the worst steaks  I've ever had wasn't worth 26 for shit waste of money and food","useful":1,"cool":0},"jaXegLoVMjXWetVaa72gLA":{"text":"this place deserves a 0 star!!!!!!!!!!! Horrible service!! arrived at the restaurant at 12","useful":0,"cool":0},"8HHQrzLPgDg6uSHTtyzfCg":{"text":"I will never patronize this establishment again! I ordered a creole club sandwich through ","useful":0,"cool":0},"SqSuukzpBVHCLHioNBJ8_Q":{"text":"The Lighthouse Grill restaurant on the property has the VERY BEST Gulf shrimp, oysters and","useful":0,"cool":0},"NWMvj6YqaIWa8mLh-5-9Aw":{"text":"We've been her twice and that was one time too many.  I should have read the reviews first","useful":0,"cool":0},"k-LqiailfWaclgCY5SLXqA":{"text":"Food is decent, atmosphere is lovely. We've been here many times and have always had frien","useful":0,"cool":0},"Na16xbigWCQTak98SjUO2A":{"text":"Sometimes the food is excellent, and other times it's absolutely horrible.  It's really un","useful":0,"cool":0},"or75wuBegG83SjLnDF1sKw":{"text":"Service just to start was AMAZING. Our girl Deanna showed us the ropes on what bomb food t","useful":0,"cool":0},"rV5x46mu1dxToW17DnIjsQ":{"text":"I had a fish \"po boy\" with what was supposed to be Cole slaw. The sandwich was on a pistol","useful":1,"cool":0},"ZNRjqK5gSp7pUz6wy7fylQ":{"text":"This was a nice place to eat.  The scenary was beautiful and the service was very efficien","useful":2,"cool":1},"0aZ3lftfDeUoHMMbfOKx7g":{"text":"Lame customer service, but good food.\n\nI was all prepared to eat leftover pizza and my dau","useful":1,"cool":1}}