{"1CyKraYNzrIvv3c4Zd1CMQ":{"text":"You definitely want to make sure your staying in place where your going to get what your g","useful":2,"cool":0},"eEi_6f9tYd7PjED9C-px6g":{"text":"Great hotel! Loved that the location was close enough to everything to walk to but not in ","useful":0,"cool":0},"qY-nsWkq_KhBk514yAr8OA":{"text":"Very disappointed I will never book again, the bedsheets had human hair on them, rooms wer","useful":2,"cool":0},"0zpFxZoOVXOGrPdCNFbZ3A":{"text":"The hotel exterior and interior is super cute, but the room itself was average.  Beds were","useful":0,"cool":0},"2gTDLZ1AbbrWzvO-q7FIJw":{"text":"There's not much that could dampen my JazzFest experience, but this place was a bummer.  I","useful":3,"cool":0},"IHrr79U0b8trop0JvPW2mg":{"text":"Priced right for what it is. Nothing super special, but can't beat the location! Staff wer","useful":0,"cool":0},"L7MZr5nIsmPDMt6Y7s-IDA":{"text":"I really liked the place. It's in walking distance to everything. The price was right. The","useful":0,"cool":0},"NlziZtOJUj5PU2YD2MsJXA":{"text":"Pros:  If you are on Frenchmen Street for the music this is the place for you.  Location i","useful":1,"cool":0},"1Fx1UNO_gfWxwUedVZhsng":{"text":"This place is awesome,  perfectly clean, reasonable price,  the personal is super nice and","useful":0,"cool":0},"0i6xIB7sPnVzat_mkBqQRQ":{"text":"A favorite place to land for more local food and entertainment. Take your time to walk the","useful":0,"cool":0},"zziOjkVBFtHUEaNpC-SVeQ":{"text":"Great place in the heart of Frenchman.  Awesome shared balcony.  Pool and hot tub.  Rooms ","useful":0,"cool":0},"NLeGByn6b-OXhihEzmnbGQ":{"text":"We had a great experience at 519 Frenchmen Street. The staff exceeded our expectations and","useful":0,"cool":0},"0DQQTFw4ZiD1sfT_9nsKKw":{"text":"EXCELLENT! We rented the one bedroom unit and everything was great. The kitchen was spotle","useful":1,"cool":0},"G_MEHmQLh6HPdQM1pBQFAg":{"text":"Clean & cute! Step out of your door & right into the action on Frenchmen St. I was worried","useful":0,"cool":0},"kvUpWREfJ7v87vmaXIxOaA":{"text":"I was part of a group of 6 who came here for Jazz Fest. We booked a two bedroom room 9 mon","useful":2,"cool":0},"VH_0OK1WqxEvhZC97gZHdA":{"text":"I can't say enough good things about this place! Chris at check in was so informative and ","useful":0,"cool":0},"XcEH_Hqz3O9MvXletMEHOw":{"text":"Let me start by saying. Do not believe the pictures. room was dirty the carpet had some po","useful":0,"cool":0},"eVSCb_JufoSjGO1z4R2cxw":{"text":"I spent a week here to visit my family over Christmas, and was very disappointed. The staf","useful":2,"cool":0},"_VW0sldU4z9bXrYOmqqNHg":{"text":"A great disappointment in the Frenchmen Orleans, this room  303 had a smell a pond entry a","useful":1,"cool":0},"gDN4KRq7jHIGgqLy1YfabQ":{"text":"I would never stay at these accommodations the furniture was not even garage sale quality.","useful":2,"cool":0},"OwR9AvmbLTShJhbgSDdqcQ":{"text":"This place is NOT bad at all. Set your expectations properly before you come.\n\nI think we ","useful":2,"cool":1},"rAw6pbfRQmg2sQRbC8Iilg":{"text":"We booked our reservation sometime near the end of October. As others reviewers also point","useful":0,"cool":0},"rlGRan98KNNCt69AZ8OVcQ":{"text":"The Frenchman Orleans \nCould be a little bit nicer. \nBut it's in a great location\nAnd othe","useful":2,"cool":1}}