{"v2ngFvsWYExQplyU7vHZKw":{"text":"I was in desperate need for some new glasses when I decided to go onto Yelp instead of tru","useful":3,"cool":1},"t6EujASW1_lORX8iJJBZ2Q":{"text":"I went to Bright Eyes for contact lenses and glasses. The service was professional and com","useful":3,"cool":1},"PKtu9I7oF0iCljJt3YJaUw":{"text":"I have to agree with all of the other reviewers. The doctor, staff, and the selection of f","useful":2,"cool":0},"2Hf3S5Wx96BT8SOXQw4OHQ":{"text":"I would have never known this eye doctor was here if not for my insurance. Dr. Korcz was f","useful":2,"cool":1},"F3qzl6EepjR4rGoCNHpVlg":{"text":"Great service, friendly, thorough, and quick! I got my annual eye exam for contacts here, ","useful":0,"cool":0},"K3oOj09Ul5b996huZAcGeA":{"text":"Found Dr. Korsz on yelp 2 years ago and I am so thankful I did. I have seen her three time","useful":0,"cool":0},"GI78ZnensOd-wYut9FUwUA":{"text":"Just giving them another great review after I went for my yearly checkup! Whenever I call,","useful":4,"cool":2},"TMijezMLQSBgR6-Ugt2qRg":{"text":"Dr. Michelle was professional and extremely thorough. I have been wearing contacts and gla","useful":6,"cool":2},"zNd6TMK5aceRqSZ2VHCRBQ":{"text":"This place is fantastic. I was traveling and lost my glasses. I got them a copy of my cont","useful":0,"cool":0},"5ju7Ygilb7bRpSJ0oFBcsg":{"text":"After trying a few places to get a last minute contact prescription that I needed, I stumb","useful":5,"cool":4},"cak5J3VulWGsvH1jO3SK8w":{"text":"I am so happy to have found this gem through Yelp that I feel obligated to share my wonder","useful":7,"cool":5},"2es3cAosIjRXcA8AkT8UkQ":{"text":"Dr. Korcz is the most thorough and educated optometrist I've ever been to. I found this lo","useful":4,"cool":3},"u76iCglk1ueKQA1q_ZUFGA":{"text":"I've been going to Dr Michelle since 2008, ever since a neighbor recommended her (though w","useful":5,"cool":3},"J2UyrsaU0QM7O1X1yPRptQ":{"text":"This is a small shop that sells contact lenses and glasses. The optometrist is professiona","useful":4,"cool":1},"R4zTQKokfyGRzLXkqvypaQ":{"text":"Great experience! The reviews on Yelp were positive so I decided to try them out with my n","useful":7,"cool":3},"AGbTMNWurpQ_0k8tg0VeqA":{"text":"Lovely experience. All of the staff was super helpful, nice and friendly and the glasses s","useful":0,"cool":0},"IPezGYjHw6vV0SGjWKja6g":{"text":"sometime about two months ago my vision started to experience some degree of consistent bl","useful":13,"cool":6},"yYvsZX7680xHRSzeDqBmjg":{"text":"This place is most certainly a diamond in the rough-it is on the bottom floor of a house/r","useful":4,"cool":3},"li0NfLCvSnnryT-LYYi6Yw":{"text":"After coming down with conjunctivitis, I contacted Bright Eyes as soon as they opened at 9","useful":1,"cool":0},"xdqjbkTkO8sVmBjyMKJuPw":{"text":"Dr. Korcz is awesome. The staff is awesome. I came here to get my eyes checked for the fir","useful":5,"cool":2},"4_sVpcT5Ja9lzHDFpdGq2g":{"text":"I'm from out of town and my son broke my glasses. I was able to come in as soon as they op","useful":0,"cool":0},"sFsoS4oIvCgRsuum60GbMg":{"text":"Extremely satisfied w/ my experiences @ Bright Eyes Optique! Dr. Korcz was extremely patie","useful":0,"cool":0},"3XSsBPRpYGsPOp2REMGTbw":{"text":"I randomly got an eye infection and ofcourse my eye glasses were not at all up-to-date. I ","useful":5,"cool":3},"VRs7nyx5yYiX56RQICMYPw":{"text":"My favorite optometrist I've ever had. Very thorough exams and answers all my questions. E","useful":1,"cool":1},"6XotydPCL4P1jCPuP4-pCw":{"text":"I went for a routine eye exam and found Bright Eyes to be very customer focused and knowle","useful":0,"cool":0},"8R5UokXsab3yiMmX5mbNyg":{"text":"Dr. Korcz was wonderful and her staff was very friendly. She took her time with me, unders","useful":2,"cool":0},"Wphc3G006RDLpxnwCLNyMg":{"text":"Gave me floppy contacts and charged me ten dollars for \"contact training\" in which the ass","useful":1,"cool":0},"tueHC3qQomGhi_FYQObJFA":{"text":"Made a last minute appt on Friday afternoon/evening for a Saturday exam. Unfortunately a f","useful":0,"cool":0},"lSiaZMXkQVehlEgfZhROUQ":{"text":"Love this place! Excellent, knowledgeable doctor and friendly, helpful staff. Great select","useful":1,"cool":0},"yC7OY59VXVqNLsEAxabhRw":{"text":"Great place. The staff and the doctor are cool. No real complaints. Parking is usually ava","useful":0,"cool":0},"tD-BMN4W509WZVGNMoicnQ":{"text":"Great office. Everyone was friendly and welcoming. Abundant street parking (at least at 9a","useful":3,"cool":0},"6ohk-W_iav7RrJe91UKaNA":{"text":"Dr Korcz has been my eye dr for many years and she has never let me down. She is always re","useful":0,"cool":0},"y_VzYTXsqf_HXNqrOVsygQ":{"text":"Really nice staff and Dr. Michelle is very professional. She seemed to genuinely want to h","useful":4,"cool":3},"x5GtJGYXAJRqY9CHQGdILQ":{"text":"I have had two visits here and I think Bright Eyes is great. I saw Dr Korcz once and a fil","useful":1,"cool":0},"wcx7oHJAzzJ2-rBFPKv3aA":{"text":"I told the receptionist (sounds like Debbie, but spelled differently) when I was here that","useful":9,"cool":6},"7OQV3iJIExrb5THZLndMJw":{"text":"Highly recommended for eye exams.  Courteous staff, professional service, convenient locat","useful":9,"cool":2},"aQOst91zhr6vIkg5OUJGFg":{"text":"I've gone here for three+ years now and always had a great experience. Dr. Michelle is ver","useful":0,"cool":0},"ITLMrcuieBYlyGutFTSsrg":{"text":"Awesome experience here. Don't have insurance and staff was great about getting me the mos","useful":6,"cool":4},"rI2Kgb9h844VSdQXlOMbzw":{"text":"I was seen right at my appointment time by Dr. Andara.  It was a quick (but thorough!) exa","useful":6,"cool":3},"OnjRAdqOIDLqhyy9R_Ohdg":{"text":"I decided to come here based on yelp and that their eye exam was the cheapest I could find","useful":9,"cool":4},"hWYavHMe7AogdcX8ngm1qw":{"text":"While I spend a fair amount of time on Freret, I'd never noticed Bright Eyes Optique until","useful":5,"cool":2},"IsaWuW_LB9i8jaKoUi4bjQ":{"text":"I'm from California and have had the same doctor for years.  It's hard finding someone you","useful":0,"cool":0},"-Lx3OZZGSP334lCBoBv9JA":{"text":"I have been seeing Dr Korcz since I moved to New Orleans 5 years ago. I can't say enough g","useful":0,"cool":0},"tEuK2hNwcEKBwqoSpPYs_w":{"text":"4/5 old school value.\n\nthis was a trip! it's this tiny little thing on the far end of frer","useful":6,"cool":1},"gUJ9VricBQxtQ_N4unBbIA":{"text":"I have recommended Bright Eyes to several people who have had just as much success as I ha","useful":6,"cool":4},"toGo2mYOT4EDnyR-s41zlQ":{"text":"DR. MICHELLE KORCZ is my optometrist for as long as she'll have me. I trust my eyes to thi","useful":0,"cool":0},"XpGIakubDJ3U431P-SqO9w":{"text":"I came here for an eye exam. She was very thorough and was able to show me what my lenses ","useful":0,"cool":0},"V-cRzVOgOy0uFDMs23NR_Q":{"text":"I rarely ever write poor reviews for businesses, however in this situation I was extremely","useful":7,"cool":0},"3jsAKmFCoN3NwX2bp_fvlQ":{"text":"I have been a patient here since after hurricane Katrina and Dr. Korcz has always been kno","useful":0,"cool":0},"_TlXMHhPszHCpOGTYo9xOA":{"text":"When I called, they had appointments available all the next day which should have been my ","useful":1,"cool":0},"1C7tZPv40pPgNoFmScfRTg":{"text":"I went here to get my prescription updated, and I wanted to try a small business rather th","useful":3,"cool":0},"ubQrWinT2iGAnb7WojaeKg":{"text":"I made a Yelp account specifically because I've had such a bad experience at Bright Eyes. ","useful":9,"cool":0},"Ue1E6mbYT6r4WJ827VGqtA":{"text":"When they say your eyesight takes a nose dive after forty, listen to them!  By the time I ","useful":3,"cool":2},"gY_8_feOrQ9QWH3PNxK3Tw":{"text":"Throughout my visit it felt as though they only cared about getting money out of me. I gav","useful":2,"cool":0},"kiSSZVCkDRqy8TQCaGgtiA":{"text":"We have been customers for about 7 years, parents a d kids. The staff is wonderful. Some h","useful":0,"cool":0},"CqrNZPu7I2DXpd62MSo-rQ":{"text":"Overall I liked the doctor.  She's friendly and explains things in a very easy to understa","useful":2,"cool":0},"ZsSffOmSgB5LcCA_5vMqag":{"text":"This place is a hole-in-the-wall & diamond-in-the-rough for sure. As other reviewers state","useful":2,"cool":1},"vG0Tb19zodk7X02kx3DvDw":{"text":"Very friendly and good care very sweet staff . I called ahead with my insurance and was to","useful":0,"cool":0},"4PQjkJXerae521Qiyji1xA":{"text":"I was referred to Dr. Korcz by a friend after being disappointed by experiences with two o","useful":2,"cool":1},"gaYp-Z8HdBzwo3GhePkAmQ":{"text":"First and last time coming here. They are a snap away from ghetto (the receptionists). I w","useful":0,"cool":0}}