{"qSCCNv6JsHpQL8_uJoL9zQ":{"text":"This place was absolutely awesome. 75 cent oysters. After 2 dozen I moved to the excellent","useful":1,"cool":1},"eRXb4tCPrb_HFOXbKNOZPQ":{"text":"We ate here several times mainly because of the excellent Shrimp Ju-Ju appetizer.  In fact","useful":0,"cool":0},"6CGPUGJd5mJzAStG-4B6Yw":{"text":"Amazing!!! Alligator wings so delicious! Professional  guys work here, high recommend","useful":0,"cool":0},"QYKF5Fq25kJhbHGb3URRRA":{"text":"Sat outside for an early dinner before the Kentucky Derby. We had the chicken, ribs and ma","useful":0,"cool":0},"7SGDlEDdCGZ-065_72AX8Q":{"text":"I enjoyed Grand Isle so much that I came back twice during my one week stay in New Orleans","useful":5,"cool":1},"corZ9uqgjJirpEt5nK-8vw":{"text":"This was an outstanding experience. Great customer service great food will come back again","useful":0,"cool":0},"Z-T-aHnE9zBqcY-yu9wvog":{"text":"After searching forever we land here, wait for a table of 8 was only 30 min... Really good","useful":0,"cool":0},"3bMsOYBE71pcixLgLOuGLg":{"text":"The food took a long time to come. If the kitchen had been fast I would have given it 5 st","useful":1,"cool":0},"NgQvTXn95HKGnlTTu7aI2g":{"text":"Came here for dinner but the wait was 2hrs long so we sat at the bar.... soooo glad we did","useful":1,"cool":0},"6M4-lOLMInnn6h30E78fBQ":{"text":"I had the boiled gulf shrimp appetizer and the chicken with roasted vegetables entre'. Eve","useful":1,"cool":0},"xNlUpgKHlFk89ihskMnTOQ":{"text":"This place never disappoints.  John had the alligator sausage po boy and I had the boiled ","useful":0,"cool":0},"1BoR9d_UxMWdARTgNQNuwQ":{"text":"Went to the restaurant on a Friday evening and it was not busy with the exception of a bac","useful":0,"cool":0},"j4ecgtsqn3VIMRxiyqyb3g":{"text":"This place is great! The bartenders are wonderful and the oyster bar delivers great compan","useful":0,"cool":0},"To7kD5cPd1cfZDWUpcRzkQ":{"text":"Nice location and nice looking restaurant.  Our waitress was good also.  Unfortunately, my","useful":0,"cool":0},"fwzFlm0n46GvqBMvCSLpMg":{"text":"Enjoyed the shrimp poboys... We tried each kind and thought they were both good. The highl","useful":0,"cool":0},"NguaDXzmWnyuGDyveglMJw":{"text":"Nice waiter! Onion rings and Fried calamari was alright but the Entrees are tasteless. Cre","useful":0,"cool":0},"0Gsw03cPFeXdaWFJtq8s6A":{"text":"I usually like the oysters here but this time I had lunch.  Mediocre at best and really en","useful":0,"cool":0},"pGWguqKpuVyGRl4VmSVqog":{"text":"Not how you expect a business to be ran, un professional on so many levels. Just open your","useful":0,"cool":0},"tepyQ_9toNwJTcfkNdp9Pg":{"text":"I had a hard time with this one. Most of the options were a little pricey and not a huge v","useful":0,"cool":0},"7A1Bm5t8MqigdN8z3U3PeQ":{"text":"An cajun restaurant with local flavors, warm decor, and friendly service by the Harrah's H","useful":0,"cool":1},"sIFwex11PJhLOiWXp9LZSQ":{"text":"Went to this place obviously geared to out of town conventioneers because it was convenien","useful":0,"cool":0},"0IZo7RSXg-h8al_wM4aaXA":{"text":"My sister asked me if I was hungry at 10 PM and we were sitting in Grand Isle around 1030.","useful":1,"cool":0},"DrSSzFU1QEqRZTAMCoVz3Q":{"text":"There service is amazing. The food was over the top. Crawfish & Mac-n-Cheese was to write ","useful":0,"cool":0},"hTAgJMi49qbMgs8MHtNTSQ":{"text":"Came for lunch on the recommendation of a native Louisianan. \n\nShrimp basket was good, Mac","useful":0,"cool":0},"oeqoRhwYIyo6pVM7Z_jyFg":{"text":"The new and improved..... great nig window views bright and friendly. ..the place for burg","useful":0,"cool":0},"vOgugwRBSDckY3GbVEfOjQ":{"text":"I do not know what is happened to this place but the service has gone completely down hill","useful":0,"cool":0},"iwpd2TP3wN1YjPjAN8uu8Q":{"text":"Food was great but the service was absolutely unacceptable.  Waitress was a mess and took ","useful":0,"cool":0},"1HAgXNQAFtl-kxQ9Z0WE1A":{"text":"My boyfriend and I visited New Orleans for my first time and we decided to eat here for so","useful":0,"cool":0},"ZG09dF04OEqZMcHPRrORVQ":{"text":"Their burger is top flight. So is the shrimp and grits. Highly recommend this place. Got t","useful":0,"cool":0},"5IXwLpPMxTJyh8yybk2E8Q":{"text":"I am a New Orleans native, and eat out often. I tried Grand Isle last night with a friend.","useful":0,"cool":0},"LjyzT1YNrscCVVlaMzjEFw":{"text":"We did a \"Cook and Catch,\" where we caught fish in the bayou and brought it to the restaur","useful":0,"cool":0},"tIUs4T6Eex5JyQvbXcgEcQ":{"text":"Our concierge recommended this place for a late lunch.  We had huge po boys!  My catfish p","useful":0,"cool":0},"z4GI46CJEhwO1BwyzLryHQ":{"text":"So.....this location was recommended by one of the hotels during our stay. We had a rather","useful":0,"cool":0},"912efzBPpzJt2hkTTPyzdA":{"text":"Let me start with our hostess. I didn't get her name but we walked in with one in our part","useful":0,"cool":0},"O84NE_9yS-XIxX7C4r2O9A":{"text":"What can I tell you something about this restaurant?  The place is CHAMP!  Service is very","useful":0,"cool":0},"VmDNyjw_noU-ge0Xqt6BLg":{"text":"We were lucky.  Our waiter, Mark, enjoys food as much as we do.  His recommendations were ","useful":1,"cool":0},"-10HedmZWDK8bGP-fmMoBw":{"text":"Tried the St. Louis ribs, the meat fell off the bone it was so tender. The BBC sauce wasn'","useful":0,"cool":0},"jY7I2FJ5xCIepoL4Kxi32w":{"text":"Terrible experience. Waited over an hour for our food when the restaurant was empty then w","useful":0,"cool":0},"-E16PI4pImrNRe9A2IWdgw":{"text":"Looking for good crayfish?.... this NOT the place. I was sorely disappointed. They were sm","useful":0,"cool":0},"wog2iVTactLL1-U7nELkHA":{"text":"I tried the Shrimp Caminada Po-Boy and the stuffed burger. Both were delicious. When you w","useful":0,"cool":0},"-vWwT906gE0khsn3mArWbg":{"text":"The location for this place is great.  It's right near places like Ernst's and Manning's, ","useful":1,"cool":0},"VfN84KZwsAvPTle_DXOhkQ":{"text":"I love shrimp and grits, but my entree completely missed the mark. The shrimp on top of th","useful":0,"cool":0},"iDzYCI-3trNwa8siB1bHAw":{"text":"This restaurant was simply ok. It got such rave reviews so perhaps my expectations were to","useful":1,"cool":0},"7fyk0p0ZwcOHfFcaNKg4hg":{"text":"3 stars because the bar staff was great. Walked in and no one was at the hostess station t","useful":0,"cool":0},"wspZ--wIlnIrhZXpoubcOw":{"text":"This place was awesome! The oysters were great along with the Cobia fish and boiled shrimp","useful":0,"cool":0},"knE75bAU7t98Uf06Lr-e3Q":{"text":"Caminada PoBoy is the best poboy in the world(although not traditional). Its a must have. ","useful":0,"cool":0},"vVMRi8OwO7HWYSCH8AiLlg":{"text":"Oysters very good, raw and baked, but service was very slow and not very customer friendly","useful":0,"cool":0},"7vsrR-n1K0ZDfbDi3acDLQ":{"text":"Fish was very old tasting. \n\nThe restaurant felt like a tourist only restaurant. \n\nWait st","useful":0,"cool":0},"CO3J9B9QM69MOHktMCYNCA":{"text":"I have been to this restaurant twice in the last year. Both times i have enjoyed the food ","useful":0,"cool":0},"SM-nIZ1vAZy33K2jz3FWKw":{"text":"The worst ever. They think your are a tourist and inflate your bill. Manager did nothing. ","useful":1,"cool":0},"g2ENtbwpKaJiLiatQDQqvg":{"text":"The Onion Rings are lightly fried and thin, the way I prefer my onion rings.  (The half-an","useful":1,"cool":0},"EnJ9Wjw-AeDDs1W0sN61kA":{"text":"Great food, great service and a Happy Hour!\nPrices were a touch high but considering the l","useful":0,"cool":0},"Bwdlg4Le7kCGVZ5hPBv01A":{"text":"A great late, last minute dinner spot! We had just driven from Chicago, were so tired and ","useful":0,"cool":0},"O3i9wWaHNC-OCrbNZ_kW1g":{"text":"Walked into the restaurantd for lunch (march 1st 2012).\n\nBasically, the service was amazin","useful":0,"cool":0},"X10y9U_Rh3kOuoQvk3OflA":{"text":"We've been coming here since they opened.  This place never disappoints.  The smoked fried","useful":0,"cool":0},"n2nVUdS_bOfIQDO1-fQ2IA":{"text":"The Grand Isle is right by the Harrah's hotel where we were staying. We went there for a l","useful":0,"cool":0},"bzeJDdM_FOzTmko3TSyoWw":{"text":"Happy hour 4-6:30 with half price beer on draft -local brews featured.  Liked Abita amber","useful":0,"cool":0},"GidGf2umdD0ki4i24pHdnw":{"text":"In New Orleans for a couple of nights, the Valet at my hotel recommended Grand Isle to me ","useful":1,"cool":0},"6ZUbIYzlwa-4dIOW99QXng":{"text":"While walking the streets of downtown New Orleans near our hotel on vacation recently, we ","useful":1,"cool":1},"zdy0Bx2LxiuGb-P4bu4UFg":{"text":"Really enjoyed the ambience-outdoors in great weather. \nFood-raw oysters & smoked fried oy","useful":0,"cool":0},"ISKRyeH0aEr0RwAYLSooUA":{"text":"We had dinner with friends @ Grand Isle last night. The food was was wonderful as usual. W","useful":0,"cool":0},"09KZwQyh0s2NjJ5chifQhQ":{"text":"A nice restaurant with a beautiful patio shared by a few other establishments including ma","useful":1,"cool":0},"9wnY8M4pKTn6nJJX3vKJcw":{"text":"Originally stopped in here to grab a drink while walking in the French Quarter....but the ","useful":1,"cool":1},"cQOhbT-j4E30JGUrDgWngg":{"text":"My go to spot when in NOLA. Fisherman's stew is on point and the oysters couldn't get fres","useful":0,"cool":0},"Mas4jw5h09-C23bjn9doQg":{"text":"I liked the Seafood Gumbo, but it wasn't anything crazy different or spectacular. The Gran","useful":0,"cool":0},"p3RxGnvOSIT4etSDU4Z7RA":{"text":"I can only speak for the Shrimp and Grits because it is the only thing I order. Why? Becau","useful":0,"cool":0},"GY_94VSTC3IQlVohDJ9sIw":{"text":"Came here after a Yelp event with a group of friends. They gave us a nice, large table and","useful":5,"cool":3},"12XojwPhmUymP4kS7DiaZQ":{"text":"Great Hurricanes, and the best onion rings of your life. Krista was our waitress and she w","useful":1,"cool":0},"0Bx2Vn5N77Hw31Cwxismgg":{"text":"Three and a half stars. Clean bathrooms, great service from our bartender Sean. The barbac","useful":6,"cool":6},"dJcYgqDufjTRwwVjsXtpZw":{"text":"Stopped in on a Tuesday around 3pm. Only a few customers were there. Needed a quick bite. ","useful":0,"cool":0},"qz2Dq_fTdIu6pKEEpdNCRw":{"text":"This is one of our fave lunch spots. The Caminada poboy is one of the best sandwiches in t","useful":0,"cool":0},"CSc25RGY8SoUbqZCt5_jQw":{"text":"We revisited Grand Isle Saturday, 28 April and once again enjoyed it. The Hubs had the jam","useful":2,"cool":1},"4oZ2v9re52c9Nje9F7SpXQ":{"text":"The food was exceptional.  We ordered the dozen oysters and boiled shrimp.  We had a pitch","useful":0,"cool":0},"4h8W7rxKdh8a_3J314nDxg":{"text":"Best oysters I have ever had.  Ever.  Sit at the oyster bar when Darnell is working.  I wa","useful":0,"cool":0},"e0PVuAXMVYzSF2e_2L2gDg":{"text":"It's passable food. Probably more of a 2.5 stars type joint. The place is nice and the sta","useful":0,"cool":0},"Nwvxrk1DeUYzwcYFDTmeFg":{"text":"Best raw oysters I've ever had.  Ever.  I mean, what a treat.  If you're in from out of to","useful":1,"cool":1},"7oxSme5V6PMc4xDMCfiImg":{"text":"OK, so the food is phenom, and my latest intake was this deep fried mascarpone cheese and ","useful":0,"cool":0},"lsAcV5QF7yOwICJBx5QLlg":{"text":"Came here with my boyfriend about a week ago because I'd had a rough week prior and this w","useful":0,"cool":0},"XPp38TDS5Kx1ru9wzMCBtg":{"text":"First time in NOLA and first time eating Crayfish... Spicey and tasty. Shrimp and pasta wa","useful":1,"cool":1},"IbHWVoA1QreIlVY4tQec9g":{"text":"The pancetta and oyster linguini is above average. However, it took a while for our food t","useful":0,"cool":0},"b1ZIRFdYjsDKV891JnxCrA":{"text":"The place was very loud the night we came.  A bunch of six and eight tops really cranking ","useful":0,"cool":0},"g3hQ6C_8Yel4MMapZ0k68Q":{"text":"We had raw oysters - they were great.  I had a Po boy that was pretty good, but I've defin","useful":0,"cool":0},"zV9y5Coj5Zjf5NNPVusuQQ":{"text":"The mussels were good but over cooked. The tomato sauce and bread was good. The tuna tarta","useful":0,"cool":0},"H5xkHcvJ7ISuHIFxezLIYQ":{"text":"Visiting New Orleans for a national volleyball tournament at the convention center.  Dinne","useful":0,"cool":0},"Efp1mrL_xHNgywigXddQMw":{"text":"Hate to sound pessimistic, but I ordered to Creole Catfish entre, large. Instead of filets","useful":0,"cool":0},"XgU9pmDRzR-8R7YPxFRApg":{"text":"Oysters were fresh, food and service were great.  The chili fish was flakey and flavorful ","useful":0,"cool":0},"KBUK0oncOUHvU3dZWKyHPw":{"text":"Went here for lunch and was very satisfied.  The gumbo was pretty good but the shrimp pobo","useful":0,"cool":0},"QI8OERCMg6yFl27-n4CeNg":{"text":"Get ready fr the best in town folks. New chef, new menu, updated decor, outdoor seating, f","useful":0,"cool":0},"k4dqPey22Z_7hH34IahF1w":{"text":"I was just strolling around when I stumbled to this restaurant! I was in the mood for stea","useful":1,"cool":0},"H_P3l-BXJRI7LQ-NWb69ZQ":{"text":"5 star service, but it was a quiet Monday evening. Food was good, but nothing amazing. I h","useful":0,"cool":0},"lnIk_QcpplEEdL1HYGOEdw":{"text":"As many times as I have had Mark's gumbo, it only seems to keep getting better.  I brought","useful":0,"cool":0},"zkXmoIH6FjrwVUmxzPkHAA":{"text":"Loved the fact that they are dog friendly. They had 2 great outdoor seating areas. The foo","useful":0,"cool":0},"ic6bUxYkqfHwcLy2Am25Bg":{"text":"Just ate there for the first time tonight. From real \"Acadiana Cajun\" area and must say th","useful":0,"cool":0},"RwxSr6m4wWbo7O011fN4mA":{"text":"Stopped in here for a quick beer at the bar as we were walking around the district.\n\nWe ha","useful":0,"cool":0},"i88M_SsVPYRjYRsTjJ9b6w":{"text":"The smoked fried oysters are really good. Very smoky and spicy!\n\nBacon Cheesy Grits: very ","useful":0,"cool":0},"48Np7mVVHphx3N2Vpfqtfw":{"text":"Went late evening for cocktails and appetizer. Four of us seated outside. Very friendly an","useful":0,"cool":0},"rgBVslzgr3TRbtlochEsnw":{"text":"8:30 checked in to the Meridien and was referred to this place by my hotel. \n\nI walk in at","useful":2,"cool":0},"xkoL5ILycW7MylSx2ko3tA":{"text":"Best gumbo in NOLA! Drink the Pimm's cup. It's a great balance of alcohol and not too swee","useful":0,"cool":0},"80BsREHwupU1MiE7CuPCgA":{"text":"2 lbs of fresh, hot, spicy crawfish were delicious as an app! I had the Shrimp 'N Grits as","useful":1,"cool":1},"ET9mWv7t6AVCmXhW6Q64nw":{"text":"Nothing Grand about this place. The menu was very limited. I asked the concierge at my hot","useful":0,"cool":0},"2IZ_0vtfli6hF8FWu6q4Ew":{"text":"Sat down at 7:30, left with no entrees at 9:40. Called 2 managers over to the table and bo","useful":3,"cool":1},"d8sfxIRD94mjOrydNalRyA":{"text":"We ate here as a group of 4, then later in the week as a group of 5.  Great menu. I'm alle","useful":0,"cool":0},"4Lqo2BWAVCiC1xMbf2SDxA":{"text":"Serioiusly enjoyed this place last night.  Arrived during a crazy football Saturday night ","useful":0,"cool":1},"v62omTF6orNwhOajZu0Kpw":{"text":"Becoming one of the best most consistently good local warehouse district restaurants. Many","useful":0,"cool":0},"Lk1k044V8sM6sXdJApYoeQ":{"text":"Concierge recommended this place - so off we went.  Service was a bit slow, which I can ha","useful":0,"cool":0},"t8ClBNvRt40gb7UOYzw25Q":{"text":"It's easy for your eyes to be a bit bigger than your stomach at a place like this. I alway","useful":2,"cool":0},"DgnD6rtion7qAaqHfNlwZg":{"text":"Bad food, bad service. Waited over an hour at lunch for a sandwich and cup of soup.  Gumbo","useful":0,"cool":0},"J3YqQ2MQOo96uVoHVZd-Lw":{"text":"Great service.... I had the ham and cheese melt with caramelized onions.., came with au ju","useful":0,"cool":0},"Wl2LMPhkuLnF5qKgPJ8U7w":{"text":"Awesome restaurant, food is outstanding, drinks were not watered down and the service was ","useful":0,"cool":0},"cQS-tXyluPX2Dm6qbY2nBg":{"text":"We had a reservation at 8:15. It was busy. Three out of five of us ordered oysters on the ","useful":0,"cool":0},"5fWDkpWcL0OQrQgChOetdQ":{"text":"this place is a real joke, the food is so nasty. i got sick and so did my other half. my g","useful":1,"cool":0},"ell8blUUW0HULTsS3smu8Q":{"text":"We arrived in town around 7 and asked our concierge for recommendations if casual dining. ","useful":0,"cool":0},"lMeYTpCWLnLy0k_tPRX3Kg":{"text":"I thoroughly enjoyed my experience here.  We chose it because it was close to our hotel, a","useful":0,"cool":0},"b2c6N3E7dXoYYPeCSvv1tw":{"text":"The restaurant was fairly empty on a Saturday night. The two of us were told it would be a","useful":0,"cool":0},"rx3FxOqFrYhFjrcreFCr-w":{"text":"We ordered shrimp and crawfish. The flavor was delicious but the prices were way higher th","useful":0,"cool":0},"cK-T6qDH5C6eopM_10sXDA":{"text":"Amazing seafood! I travel a lot. And I really do mean a lot. I'm landlocked by Colorado bu","useful":0,"cool":0},"4Y8oZs3bE7GYTXFdxhQLRA":{"text":"Super delicious food- we ordered the calamari (which has a delicious sesame dipping sauce)","useful":0,"cool":0},"kGHUhWwXARBdoQkN5QKyvw":{"text":"Third time eating at this restaurant. It was not as good as the first two times. Menu has ","useful":0,"cool":0},"PJNqbMDWDMBJ_uOQvJjFbg":{"text":"We wanted convenience and family friendly while hoping to try some local fare (our first t","useful":1,"cool":0},"5P2t4-d1I6EBYGlNgWmZ8Q":{"text":"I loved everything about this place! I sat at the bar and had oysters and several appetize","useful":0,"cool":0},"1shtryIjQZp2oU-_SYFTSQ":{"text":"OMG u gotta try the boiled shrimp!... I mean the jumbo boiled shrimp!!! Tasty as can get a","useful":1,"cool":0},"Fp5zh-kS-zxdrGi9W2UKPw":{"text":"Chanced upon Grand Isle as I wandered through NOLA. Started with The Awakening. Quite good","useful":0,"cool":0},"UnlPt7SqbT-QGNGxii_rvQ":{"text":"This is my favorite after work place in NOLA. Beer and oysters need I say more? No, but I ","useful":0,"cool":0},"73LK-LAwC24icNyc1h1kZA":{"text":"I discovered this in October when I walked to Harah's from the Quarter. I like the lunches","useful":0,"cool":0},"wkTwZhliihio7Y1UfR-5Ig":{"text":"Terrible is the nicest word I can use to describe this place. I wouldn't normally comment ","useful":0,"cool":0},"rEENGsz6hLT24sG9zzj36g":{"text":"Really more of a 3.5. Went after a day at the convention center on a recommendation. The s","useful":0,"cool":0},"6J1Gtx8EtY1N5oqEVyuzzg":{"text":"Oh, What A Night!  Those are '60's era song lyrics that were popularized by Frankie Valli,","useful":1,"cool":0},"uL-mPp1PD03wMJOh9fZEQA":{"text":"This is a nice location with decent ambiance and generally good service.  I've usually got","useful":2,"cool":0},"_opSA1F2sPUVS5Ls2wSv3g":{"text":"Just landed in New Orleans and had to get a cold beer and some fresh oysters and the Grand","useful":0,"cool":0},"BfKI-zGl83469iRvDdV4EA":{"text":"The smoked fried oysters are some of the best oysters I've ever had. They rub them in brow","useful":0,"cool":0},"NBbZnkU2r5VNNV2pB7Z5cw":{"text":"First visit to NOLA..3rd day here , I've been to some well known restaurants so far.. deci","useful":0,"cool":0},"-G0Yk9btLHj8NVZOL40clA":{"text":"I found myself meandering through the streets of New Orleans, simply famished. So famished","useful":0,"cool":0},"TcBMmGjCBFw2qZV1TTdiYg":{"text":"For a fantastic meal while waiting for your cruise, stop by the Grand Isle. We had The lar","useful":0,"cool":0},"OyA4_NfYFQ7Tuh3ibBUUug":{"text":"The Grand Isle served up the best food I had in New Orleans.  I went for a reception at th","useful":0,"cool":0},"3V6Ihm4UGXUkGn-kzxNXGg":{"text":"Tyrone at the oyster bar made the whole dinner worthwhile!! Him being a fantastic mixologi","useful":0,"cool":0},"ey-0e_6hTZv_cenV0oWaMQ":{"text":"It's worth mentioning that all the servers were white and the back of the restaurant was b","useful":0,"cool":0},"gDeopjqPEiu0o0HF0FbTvQ":{"text":"Excellent food. Excellent atmosphere.  Our server James B was awesome. Even though its in ","useful":0,"cool":0},"TuZPcROKaMbOd7CIX7LwfA":{"text":"The onion rings were really good. They offered a whole fried snapper that was crazy huge a","useful":0,"cool":0},"cMkcS2WQhG172v4KFWG_Yw":{"text":"Grand Isle was recommended by the hotel concierge and we walked in for dinner. There was a","useful":0,"cool":0},"TGvCyRqmS-FyWXRrW6UgSw":{"text":"grand isle's convenient location and ample space just can't make up for the slow service a","useful":2,"cool":1},"i5wdBM-JmDbcydyMew6HfA":{"text":"The food was incredible. Best seafood and Cajun I've had. Amazing oysters. They were slamm","useful":0,"cool":0},"zcGaCyNvV-FGd-8scf7rIQ":{"text":"Wonderful spot. Great service: accommodating of our food sensitivities, hearing difficulti","useful":2,"cool":1},"p1p8eGNpFwaisOaYCe46_g":{"text":"We were downtown so decided to try Fulton street. Ended up at grand isle.   Sat down and w","useful":0,"cool":0},"Wz_KFdZiZWAdJLwBRaP37w":{"text":"The best dining experience of it entire weekend was hands down the patio fo Grand Isle. Th","useful":0,"cool":0},"nSv69i1d0VNEJwDtxgmWGg":{"text":"We stopped into this restaurant after walking in the rain seeking out a place with good fo","useful":0,"cool":0},"RbwvpMshioO1XUhviNOTqw":{"text":"Went here with a group of friends. Food drinks and everything were awesome. Tried the cala","useful":0,"cool":0},"6FDczDRSsCkPz0243i2iJQ":{"text":"I ate here for lunch after attending an expo at the convention center. There was a wait fo","useful":0,"cool":0},"TeRIh2jDZtLSfxRu7Gp1SQ":{"text":"Stopped in here for dinner and a drink and it was excellent. I sat at the bar, the bartend","useful":0,"cool":0},"9MQ6lt4erPBGxkjkQVpydA":{"text":"Our waiter was totally unenthusiastic. His service was poor. Too many rules: can't have ha","useful":1,"cool":0},"T57TCVVbSkl7KWbaG71dZA":{"text":"We came here during the mardi gras celebrations. We made reservations which turned out to ","useful":0,"cool":0},"9TVsEbXIo0n11EjzsSr-Zg":{"text":"I really enjoyed the artful display and flavorful seafood served at Grande Isle. The servi","useful":0,"cool":0},"sASi17sXJITFItzT7bNQjw":{"text":"I first tried this place on Fulton Street during the first week of Jazz Fest while staying","useful":0,"cool":0},"0XbAFRZ4y4KmejjYh9vaxQ":{"text":"Fantastic service! We were told about this gem by one of the hotel staff. My friend got th","useful":0,"cool":0},"--e3S85vBt0V51UnKtJ4Vg":{"text":"Wandered in here for lunch on a Sunday knowing nothing about the place. Fabulous food! The","useful":0,"cool":0},"AxsnAoKDhCBuWNgR9jUDhA":{"text":"Visiting New Orleans for the first time and this restaurant came as a recommendation from ","useful":0,"cool":0},"OA6G0O9r6M7UjFamGYZ0BQ":{"text":"Okay so let me tell you about my girl Cece. My grandma has raved about this place for year","useful":0,"cool":0},"FHlqt6O6Wd7389riWFA6Uw":{"text":"This was one restaurant in NOLA that we did not Yelp before coming. It was 6pm on a Friday","useful":0,"cool":0},"UxS3dsKxT8IWpPB7GavjVQ":{"text":"Love the food here.  I've been here 4 times and everything has been excellent.  Oysters ar","useful":0,"cool":0},"rLudtFRGfnWrlhAFfgcKMQ":{"text":"Get the alligator sausage lo-boy. It's absolutely delicious. We went for a late lunch and ","useful":0,"cool":0},"vt-_vbAhPJy3g92E6NCjRg":{"text":"Had a craving for a late snack in New Orleans and The Grand Isle fit the bill... with thei","useful":0,"cool":0},"6OcA12yo7CQwK5-8m4Y80g":{"text":"Had great food, and great service. The atmosphere has a vintage motif and was clean and ro","useful":0,"cool":1},"X7Z-pKYiNoiVm_WIAiR6ZA":{"text":"Oysters, greens, alligator wings, shrimp and grits - all farm to table fresh and delicious","useful":1,"cool":0},"3t8emJ4EeJunNxic9Gyfxg":{"text":"I was looking for a place to really enjoy louisiana food. The restaurant was inviting and ","useful":0,"cool":0},"XGwlBaJR5GWfVCZXSqz3-g":{"text":"Went here for lunch today.  Excellent oyster sampler of baked oysters.  Colleague thought ","useful":0,"cool":0},"NoNCWXsL6q8bFKZ-TBYpXA":{"text":"I had and would recommend the Grand Oysters, Shrimp and Grits, and Lavender Margarita.  \n\n","useful":2,"cool":0},"6vuQG9h_6_TOLI_L89cIOg":{"text":"Went there with my conference staff peeps on a Sunday evening. Place wasn't super busy, an","useful":0,"cool":0},"35R4Yv3R5s4sfW6ti8YesQ":{"text":"I had dinner with some friends at Grand Isle the other night with some friends. Company as","useful":2,"cool":1},"Qeyu5KpJBxomInH8aDNSdw":{"text":"Pretty solid choice if you are downtown and need to eat.","useful":0,"cool":0},"UNRiF1CtFGqQ-gp3Qi4iEA":{"text":"One of my favorite spots in NOLA. The swordfish is underappreciated but is some of the bes","useful":0,"cool":0},"VjakTiWrTS6nzZa1Dsqhfw":{"text":"I really like this place! Good for a group or business lunch. Close to the convention cent","useful":0,"cool":0},"dCZRQL6sQhsVa08-DsSr_w":{"text":"Hands down one my favorite joints in NOLA!  Great food and equally great local beer select","useful":0,"cool":0},"BdGAUprk16JxyzVZnM0n5A":{"text":"Great staff. Great food and atmosphere \nNot a fan of seafood but the oysters were amazing!","useful":0,"cool":0},"w3-PyiB6ak_LE7MVBJxUxg":{"text":"We went for dinner on what seemed a busy night. Our waiter informed us right off that they","useful":0,"cool":0},"kcrVRUBRIz69uVlrEmOWZQ":{"text":"I've been wanting to visit NOLA for a long time and had expected to be met with several no","useful":1,"cool":1},"4bLhITSB49jis8H0hj6wXg":{"text":"Great time at the isle. Had awesome full oysters. They were $0.06 with a pitcher of beer. ","useful":0,"cool":0},"ojbMjvlam9RDBYkk0EzFIw":{"text":"Great service saved them. Butt hole calamari killed them. Deserve a 3, let's push them the","useful":0,"cool":0},"Z7001VKLRv7l_sEym3cayQ":{"text":"I ate here with a group of eight. The staff was cordial and efficient in serving us. The m","useful":0,"cool":0},"CNJ88BwALSiBdUKlFAa5nA":{"text":"I went here with a group of friends on a Friday night, and everything I had here was great","useful":2,"cool":0},"izNtnQUBd5ky368aO0NQzA":{"text":"After a long exhausting day working at the convention, we decided to try this place. The c","useful":0,"cool":0},"gUYZu6XYOK4gQd_A7P2i4w":{"text":"Went for a late dinner.   Service was awesome.   Sat immediately and drink orders taken ri","useful":0,"cool":0},"puUnOuBK-E0k4LXmhU_89A":{"text":"With the help of Brad, our stellar advisor we had an awesome meal sitting at the bar. \"Smo","useful":0,"cool":0},"xuALT2uBfhyuuUtvu0gr3w":{"text":"Ate at Grand Isle recently while in NOLA on business.  I would recommend you look for a mo","useful":0,"cool":0},"6xcGtCq10iDvTJXA5TEfog":{"text":"Pros- The food was decent and our waitress was pretty attentive and friendly \n\nCons- Walki","useful":0,"cool":0},"REaQUZFT92D8qjd5JbSsnA":{"text":"So I only came to this restaurant because I was on my way back to my hotel from the conven","useful":0,"cool":0},"v68l1X4tzIwUKXxDfoBSVg":{"text":"We had the seafood gumbo and chicken and sausage gumbo and they were both great !\nWe also ","useful":0,"cool":0},"SCTZubt25hxmqap1Zs7ybQ":{"text":"Had the raw oysters and another oyster platter...all was great...no complaints, prices are","useful":0,"cool":0},"-yrsECxWfcPP23puIY9LFQ":{"text":"The food was barely edible, not worth the price and the server was awful. We ordered the \"","useful":0,"cool":0},"jyKzwPwljZV0YpiNA2sB_g":{"text":"So hard when in NOLA to pick a place to dine...this is a FOOD TOWN! Tired after all day to","useful":0,"cool":0},"QVgTBqNOIdBLYVwIK_LtaA":{"text":"Got the name of this place from shuttle driver. I guess if you want good.authentic food, a","useful":0,"cool":0},"M3PWNfMBRKHB0hY_FEGUDA":{"text":"our hotel concierge recommended this place. the strawberry cocktail is AWESOME! service is","useful":0,"cool":0},"aZ_sCtPiRf6EFbfvlez5IA":{"text":"I have been here serveral times and have yet to have a bad meal...Gumbo was very good IMO ","useful":0,"cool":0},"_hflh-EHhDglsZzXedZzyQ":{"text":"We stopped in here for lunch because it was near (nearer than other options) the conventio","useful":1,"cool":1},"OQXdAFBWh15sWcT50mTzGQ":{"text":"The hostess was nice, and the food was decent but very pricey. Our waitress had a HUGE att","useful":0,"cool":0},"0kj0eFjgnKgMc2ktDCLXkw":{"text":"Great evening! Large group-9 in all- seated promptly. Server was very efficient and has a ","useful":1,"cool":0},"O2lrU-c8E45dWX2vIpkIwQ":{"text":"What great bar scene!!! Had the cherry jubilee with shrimp Ju Ju and half dozen oysters. A","useful":0,"cool":0},"wBapejQBaAfDh_nWG6W5dw":{"text":"Sit at the oyster bar with the oyster boys! Virgil and the crew will give you a great time","useful":0,"cool":0},"vTGzrkoPWvYCvO7YZNDTUQ":{"text":"We were referred here by our Hotel Concierge. It was the last meal of the trip and I was s","useful":0,"cool":0},"Z1tge_OjsmCgnLpmsFpstQ":{"text":"SO happy to find this treasure... fresh seafood, great staff (we loved Jessica, our server","useful":0,"cool":0},"8x14risptpj1UIVySa56xw":{"text":"This place is amazing. The food tasted good &  our server Raven is a sweetheart. I would d","useful":0,"cool":0},"AIOAgSIGBioYXRSp8AK9PQ":{"text":"Amazing baked oyster!  Bbq shrimp and grits I highly suggest. Also try the Po Boy Shrimp s","useful":0,"cool":0},"DOIBnd5d-IWrT9VqsCkUVA":{"text":"After a long day of travelling this estalbishment was a nice evening out. First off was th","useful":0,"cool":0},"kvdO_57dUYnbO0kdedtukA":{"text":"This was an interesting meal. The three of us sampled a variety of seafood dishes. We star","useful":0,"cool":0},"zFigcARXH91oE6TpomJgcw":{"text":"Restaurant is very clean and beautifully decorated. Hostess was sweet. Our waitress, Kim, ","useful":0,"cool":0},"0MXuv57DvkpQ5oRr0dTLSQ":{"text":"Service was great, the restaurant was clean and had a lot of character. My alligator sausa","useful":0,"cool":0},"j3lQ1APWTfzKtF8v0J-tVQ":{"text":"Beautiful Carrara marble bar. Attentive staff.  Frenetic Xmas eve, while the (fun, fake) \"","useful":1,"cool":0},"pZowNxQeRapVcfiSrnEjLg":{"text":"Let me start by saying this is a \"foodie\" restaurant. By that I mean hipster take on tradi","useful":0,"cool":0},"XCQkvb2GK-lyINS_bN-vhg":{"text":"We had to leave most of our food on the table. It was simply \" not good\". The boudain ball","useful":1,"cool":0},"B2dx8omLrx2VAQrdd57IZQ":{"text":"I was looking for local seafood and we found it here.  Not a super exciting place to eat b","useful":0,"cool":0},"YQCNVnVxCEyBwrXbsO3HSg":{"text":"We came in here initially for oyster poboys but couldn't bring ourselves to drop $22 for o","useful":0,"cool":0},"g8UBDW46kayBtUEg3MXzMw":{"text":"Awesome staff- great waitress. Downtown. Sat outside enjoyed the weather- grilled swordfis","useful":0,"cool":0},"3y3iP444Y0dVb17zUCTlqg":{"text":"Came here for dinner with a co-worker. I had the redfish on a half shell recommended by ou","useful":0,"cool":0},"gGPREnaZZUKpouFMF3aQ7g":{"text":"Wonderful the staff was super friendly!! The food is definitely delicious!!! So Great.  Ha","useful":0,"cool":0},"DvlkXNohf2ehKntKKm6SGg":{"text":"I had my favorite (two!) meals in New Orleans here since I had to come back a second time!","useful":1,"cool":0},"HKpkjbTfCR3E9HlxY_NfzA":{"text":"I am sooo glad we were starving, ignored the Yelp ratings and decided to walk to what was ","useful":0,"cool":0},"y2PNfW9WX6Omj8Krd-a5Kg":{"text":"The white wines and the baked oysters were the real star here.  awesome staff and great, m","useful":0,"cool":0},"af4E-ocgoDBbZii8C4h72w":{"text":"Pleasant outside dining, nice live jazz band playing. Nice wait staff good food very satis","useful":0,"cool":0},"feNWfjT_xUo07xNJOc-AIQ":{"text":"Enjoyed our lunch here. Had boiled crawfish (potatoes, corn, sausage, mushrooms) for $10/l","useful":0,"cool":0},"7o2n4rI8N-sAFvhB9QEfww":{"text":"Mediocre spot in town.  Convenient if you are trolling for an easy restaurant to be seated","useful":1,"cool":0},"vvI8x-zH7pL1yOAtKQ2ctw":{"text":"In my week in NOLA I came here three times. That's how delicious the food is! Perspective:","useful":0,"cool":0},"X8wJcP0HZ7WMw3OQ7mgjLw":{"text":"I had a burger as a take out order. Honestly it was not good, this place might be good for","useful":0,"cool":0},"YtKwL2kO9JEAoxMGVhT8TQ":{"text":"My husband & I had appetizers &dinner we ordered turtle soup and the gumbo. Both were very","useful":0,"cool":0},"LF4GgUsgEQVDlCZhhHVKqg":{"text":"Incredible! Oysters and calamari are some of the best in NO. Our group of 5 went here for ","useful":0,"cool":0},"NpoPJNbY4tjv04zXKe_rfA":{"text":"This is the spot.  Good food and good service.  The coffee comes in a French Press.  the o","useful":0,"cool":0},"6DOV2ypR4tDsk44PP7x78A":{"text":"This resultant was soooo good ... happy hour is a must.  Great view from our table ... our","useful":0,"cool":0},"OfGg0CPfwuATk6F7huBVdQ":{"text":"Came while in town for a conference. Service was great, seafood was delicious. The oysters","useful":0,"cool":0},"4PuJd0BAq0NaB1fFilmGdw":{"text":"This is as close as we got to eating at Grand Isle as, even though there were tonnes of em","useful":1,"cool":0},"VLzDmVmFE4dQizvU_CvrWg":{"text":"Great staff. Great drinks. I ordered the shrimp and grits. Definitely a fav. I am going ba","useful":0,"cool":0},"EYwxQtmsCckanu8_TjBC_Q":{"text":"This was our very first stop on our girls trip. We stopped for lunch - saw po' boys on the","useful":0,"cool":0},"tUlzpVeJo2n-3MEkWorFwg":{"text":"Handcrafted kiwi strawberry Bellini and smoked fried oysters were incredible!  So glad tha","useful":0,"cool":0},"N0vEQ8FrOsCvZrjEPPxBiw":{"text":"Onion rings, oysters, and salad were wonderful. Nice lunch spot. Close to Hilton, W, Lowes","useful":0,"cool":0},"FCE5J4yXVecY-Rk8bW3NNw":{"text":"Had the caminada po boy and wasn't impressed.. Won't be back .. The Asian slaw on the shri","useful":0,"cool":0},"BzwMZdT5ckj_eV7RIE80Rw":{"text":"What a gem! Went here with a large group after a convention and we all had a great meal! I","useful":0,"cool":0},"6_cYpkzSdUaTV1EpIO1Jqg":{"text":"Food was okay. Nothing spectacular, except the onion rings. I'll go there just for them! S","useful":1,"cool":0},"ksDpo_WWQBWmIVkfaMTvzA":{"text":"We went for conference center lunch break and had oysters and crawfish--2 dozen oysters an","useful":0,"cool":0},"nyLxBZA718TM3Sl1gP7p3g":{"text":"Good stuff. Had the seafood stew and fried crawfish tails. It was my first meal in New Orl","useful":0,"cool":0},"LE5ggg79s1uTBgbFKFL40w":{"text":"So I've been here a few times for their amazing happy hour. Great drink specials...especia","useful":3,"cool":3},"elDlSYhZTG4H2vdRvSk8YQ":{"text":"This place was so amazing we ate there two nights in a row. Allen the bartender/oyster shu","useful":0,"cool":0},"_oETTSkbknXGH1jMmCPPiw":{"text":"This was a disappointment from the time we walked in at 11:45 am.  We received our lukewar","useful":0,"cool":0},"XmsTyDFeGjCKyuyFhg5bAQ":{"text":"Stumbled upon Grand Isle while walking around the Convention Center area while staying at ","useful":0,"cool":0},"gPwoBoMvUObzF3i6FWwFPA":{"text":"This place is awesome. Be sure and try Mr. Graylyn's stuffed Mirliton ground for an appeti","useful":0,"cool":0},"DsM0hOSo3uq6Hydu3Q29uA":{"text":"Atmosphere was very relaxing. Staff was personable. Food, specifically the stew was really","useful":0,"cool":0},"OMfpXyhzx-CkXT7ng-2A0g":{"text":"We were in town for the Rock-n-Roll Marathon.  We ate here the first night as it was withi","useful":0,"cool":0},"h6Mt8rrhVagFRMqs05f8mw":{"text":"Amazing location. Food was awesome. Do yourself a favor and get the smoked fried oysters y","useful":0,"cool":0},"P-3VdjJao7D-F7ur0KOVog":{"text":"--Grand Isle was our favorite place to walk from our apt. with our dog, enjoy a fresh drin","useful":1,"cool":0},"Cl4Iy4ZiiTLl2NLwnYSBRA":{"text":"Tourist Trap . After waiting way to long for a table finally seated ( place was not that c","useful":0,"cool":0},"-EG8hOT0lE1qkAGrVs4a8w":{"text":"This is my first visit to NOLA, and it won't be my last if only because I find the people ","useful":0,"cool":0},"JfkPVGsDj9p2uFCpsCr2gg":{"text":"Stopped in as I had a Social Living coupon I needed to use.  We decided to just order wine","useful":0,"cool":0},"xbr-L7Nrw2CEAqD_1ayYKw":{"text":"Great food and great service. Had raw oysters then gator wings (delicious) then whole frie","useful":0,"cool":0},"j3CE1paCrgsmB5zj3Rzq_Q":{"text":"We tried this place since it was located near our hotel.  This place is just as good as an","useful":0,"cool":0},"UwatXFmB11SpMZYHpyjhdw":{"text":"It has probably been a decade since I sent back a plate of food. Though I am a foodie, I a","useful":0,"cool":0},"NU9I1DJj8HMTQg6KcyQR5Q":{"text":"Wonderful atmosphere, clean and upbeat. Food was amazing, new and intriguing. Very busy bu","useful":1,"cool":1},"KRDxJo0dK8BMrpK59QvRRQ":{"text":"A very clean and trendy decor...this place was a nice place to go to for lunch.  The hoste","useful":1,"cool":1},"2XiltWHnwP69-7b1CGSV8Q":{"text":"I love this place. If anyone ever wants great seafood, I always recommend this place, and ","useful":0,"cool":0},"vDwJ2hqRXibc-L8Qp5OGlw":{"text":"Really loved this place.  Us girls all came here on our last night of a bachelorette weeke","useful":0,"cool":0},"3ISQzMwlZWmtpkiUUOm5GQ":{"text":"It's been about a year since I last ate here, and something must've happened with ownershi","useful":0,"cool":0},"MNErvJY12rBDS_oe0Kt4rw":{"text":"The place is location is a very nice area in New Orleans. The waiter was very knowledgable","useful":1,"cool":1},"oWucUuEdBGiMlw4SnDEfOg":{"text":"I'll go ahead and be honest- we only visited Grand Isle because Acme Oyster House had a li","useful":1,"cool":1},"8Q7Y3oXNTcBYgc3T3pkT3w":{"text":"I had the roasted chicken. The chicken was very flavorful and juicy. The veggies were tast","useful":0,"cool":0},"ODteFACzYxBQ29Ej96X6kQ":{"text":"Had dinner with a group of 14. It was Monday night and not crowded. Our waitress was very ","useful":0,"cool":0},"IbcP0pgHNGdZuZHNS-As1A":{"text":"Walking down Fulton and saw the couple just finishing their dinner so I asked how it was.\n","useful":0,"cool":0},"QBnJ8IinMtJ9IcAGfXEi7w":{"text":"Ate here with family on New Year's Eve.  We all enjoyed our selections. Very good onion ri","useful":0,"cool":0},"yO3cCkpVq59w7r9L2LhLtg":{"text":"Because it's in a touristy spot I had low expectations, but I thought this place was great","useful":0,"cool":0},"VqDqE5rsKWdbW96H1Gvd7w":{"text":"The shrimp caminada is fabulous!!! As well as the po boy w/shrimp & catfish was also great","useful":0,"cool":0},"ItTrr3l0a3TndmJecml7vA":{"text":"First of all the staff here is amazing!!! They are so attentive and personal! So much so t","useful":1,"cool":0},"LP7wNRt9YbqZ9OzhWWqWNA":{"text":"So this was one of the best shrimp and grits dishes I've had in a long time.  It's very ea","useful":0,"cool":0},"ZwOFtUnqDlBGV60789OATg":{"text":"I stop in from time to time at lunch to see what the specials are. Each time I was delight","useful":0,"cool":0},"gVROElzm11dTbnIZjth88Q":{"text":"Great location, nice outdoor seating, nice service, good food.","useful":0,"cool":0},"sSWatA5NKe4aomenJyr06A":{"text":"Amazing Oysters (both baked and raw). The gumbo was delicious. Atmosphere was fantastic- w","useful":0,"cool":0},"HPhLMZ0Q_3t8liyd9fmLDg":{"text":"Service is slow, took a while to get seated.  Not sure if customer service is top priority","useful":0,"cool":0},"iU6XMCARzVqD4FN9Qq9iVA":{"text":"Loved the setting, in Nola fashion outside of the french quarter the doors opening out wit","useful":1,"cool":0},"7rRuN6atd3GrkvbiZltKpA":{"text":"To preface, I took my boyfriend and his two kids here (son 16, daughter 11) on May 23 for ","useful":0,"cool":0},"pJhc5RUEof1B1En0YxhbpA":{"text":"Wonderful dinner - the oysters and the redfish were delicious.  Our waiter Mark - was fast","useful":0,"cool":0},"OONnbqKP0DVHy9c49jZ87A":{"text":"Every year we come to jazzfest we hit the happy hour at the grand Isle restaurant almost e","useful":0,"cool":0},"pYI9Ks6MDhqbnX9dMA66VA":{"text":"Oysters Oysters Oysters!\n\nWe came during the NBA All Stars Weekend and the charbroiled oys","useful":0,"cool":0},"OUK9UBT7VRkb4KuWRdL8YA":{"text":"We had just checked in to the hotel and tired and this place was close. Waiter was forgett","useful":1,"cool":0},"v4xXv9CrKABKWL-bcRZoxQ":{"text":"We ordered the Char grilled oysters, Red Fish on the half shell, and the fried livers with","useful":0,"cool":0},"iHvmSb8qYdm2sE2zbHzN3Q":{"text":"We ate here the night before we left New Orleans to return home. We got the shrimp and cra","useful":0,"cool":0},"B0HE0TYe8Lzy0JUrYBU4ww":{"text":"Been here twice and both times excellent. First time for oysters raw and baked both are ex","useful":3,"cool":2},"KBwP8J0Lohdt60pnqd4eKg":{"text":"After a long day of Aquariuming and French Quartering (with two 3-year olds and an infant,","useful":6,"cool":3},"Ge5jIw98JpwjFyhIrji8Aw":{"text":"Pretty good, I had called ahead to see if dogs could be on the patio and they said yes. Wh","useful":0,"cool":0},"Gs_48PluBwdG3DMdFYydoQ":{"text":"As convenient a location and as nice of a decor this place had, the food was far from desi","useful":6,"cool":1},"UtIYY-OfIGvBsRYvJwpJBQ":{"text":"We are regulars - love the salad with the green goddess dressing and the oyster sampler!  ","useful":0,"cool":0},"RRcbaQfJfVGaV_W6kTU98A":{"text":"Googled the closest restaurant to the Hilton Riverside.  SO glad we went here.  Joe was ou","useful":0,"cool":0},"kyqzxRblrqU5z9Nj4CtEuQ":{"text":"Oysters! 60 cents each all day on Tuesdays with a pitcher of beer or bottle of wine. They ","useful":3,"cool":0},"Wple8Nok76rr8ZM3zarbJw":{"text":"Great casual spot with a full bar conveniently located right next to our hotel, Harrah's. ","useful":1,"cool":2},"Vp3a8pQsei5b5iGsyQE_KA":{"text":"Came here for lunch and lucky for us we were seated before the rush came in.\n\nPros:\n-Yummy","useful":0,"cool":0},"UHhgs7jGnQQyJ-9gRjuHeg":{"text":"OMG, I am in love.  Of course I love Grand Isle too!  The pictures were awesome.  We have ","useful":0,"cool":0},"3Q9vlAcO_lvV-b7S4lMuPw":{"text":"The Grande Oysters were outstanding. Laced with Tasso and lightly fried. Those didn't last","useful":1,"cool":0},"bLPScx3Nx1VlZ2Se2XqDIw":{"text":"This place is great! I randomly happened upon it while wandering around trying to find a p","useful":0,"cool":0},"WmDvXYrG7SxtA63jwoHT1g":{"text":"I came here with my mom during Christmas season. We were looking for reasonably priced New","useful":1,"cool":1},"9oiubAtLM4tYtolOTqsw_w":{"text":"In our search for great local seafood and good outdoor atmosphere, we stumbled upon this a","useful":0,"cool":0},"SKI9BxUeP-_zT0B8B7ceRQ":{"text":"We popped in here to have a bite and listen to live music playing just outside the door. F","useful":0,"cool":0},"RmrPJtBNyELwd4vmLRT6mQ":{"text":"Great service! Had the gator po boy and it was wonderful. Everyone at the table was very h","useful":0,"cool":0},"DAHlMmqQHeBnTfCUnV-kLA":{"text":"Fantastic Cocktails!\nDrinking the storms away.  Sazerac and mint & raspberry mojito are ve","useful":0,"cool":0},"61E1grlE8vVFWVOEsFdI9A":{"text":"Not happy. Half of restaurant closed due to understaffing. Wouldn't let my 7 year old at O","useful":2,"cool":0},"yP-3o7wOq_RZVqmzsVp7RQ":{"text":"This was our first stop in New Orleans and it was lunchtime. Shrimp po boy was out of this","useful":0,"cool":0},"8ryaTXRbwtkraUHArKFZTg":{"text":"Not good!  Service really slow, food marginal except the oyster were good. Took 20 mins to","useful":0,"cool":0},"IYVQBLvDqZvp8o3gquFWyA":{"text":"It was OK -- I wanted to go back to Mulate's, but my wife wanted to try something differen","useful":0,"cool":0},"GN8XV2oCbj73KiMhbkTktQ":{"text":"amazing Hickory cold smoked oysters, in house cured ham.. onion rings are fluffy and crisp","useful":1,"cool":0},"9Z6oB96qdOyy1F20FFfmQA":{"text":"Even though I lived in nola for 2.5 years and my boyfriend is from here, we never really h","useful":1,"cool":0},"9JQd1ERjUIey15JNUOQyzA":{"text":"I liked this place.  Onion Rings to die for and Baked Oyster Sampler was excellent.  A bit","useful":2,"cool":1},"jryHvv-PVOZVZPkZrW0P5Q":{"text":"I really liked this place even though their sweet tea machine was broken, the atmosphere w","useful":0,"cool":0},"Qg7cogb6tCjzF8YcL3v59A":{"text":"This was our first stop in New Orleans.  Food is pretty good, they give you huge portions.","useful":0,"cool":0},"SYMo41GOtCkHOObNjh_kag":{"text":"We had a great dinner at this restaurant last night. Food was great and we had great servi","useful":0,"cool":0},"D3_eaUyNia1laQQuOIh_5w":{"text":"Very friendly staff, stiff drinks,  and excellent food.  The chicken gumbo was delicious. ","useful":0,"cool":0},"LXRR0LW83THlM9j6KVSs4Q":{"text":"Started the night with cold beer and fresh oysters. Moved on to fresh chilli batter fish a","useful":0,"cool":0},"_ykheCy11_XfaDcQExE5mA":{"text":"Stopped in for a few drafts and some oysters. The place was empty on a Wednesday afternoon","useful":1,"cool":0},"S5pxhnHEdbntTV1LASH6Mw":{"text":"To paraphrase that epic masterpiece from the 80's, National Lampoon's Vacation...\n\"Sorry f","useful":0,"cool":0},"cVTETlrPuSZDI5-OHYouCw":{"text":"A great restaurant with good happy hour drink prices.  The Redfish on the 1/2 shell was aw","useful":1,"cool":0},"ndpxNRJbr27pRbmmvyBjzg":{"text":"I really like this place. We had the shrimp as an appetizer. Amazing. Reminds me of the ba","useful":1,"cool":0},"2khke8vKEiWqO9ee1Q7vlQ":{"text":"We came here almost every day we were in New Orleans. The first time I came in was right a","useful":1,"cool":3},"Yeita6Y3Tl9Y6hv4Y93rRA":{"text":"Best oyster bar in New Orleans! Had the smoked/fried oysters, the red fish, a shrimp po' b","useful":0,"cool":0},"AE4do5NoVknsaa6LyTRB1g":{"text":"The happy hour is great but avoid this spot if it isn't happy hour. It's over priced with ","useful":0,"cool":0},"_WAgWvosk9Io595lD4DPyw":{"text":"This place is one of those you go by convenience, rather than as a select choice. Food is ","useful":1,"cool":1},"TRnBJ236olcIA90LqZzz4A":{"text":"Food was mediocre. Our waitress had an attitude. -\n\n-Shrimp Poboy sandwich was very plain ","useful":0,"cool":0},"VH-U5ZavR0tCzBEVR986bA":{"text":"Average food. Below average service. Our server did the disappearing act several times. Th","useful":0,"cool":0},"3-4CeJRc-5Ta5KNt5Kto_g":{"text":"Tried to get in one night but was packed. Lucked out with bar space the next night ... Eve","useful":1,"cool":0},"jSbQO-tATvZOEa9DfTMPqA":{"text":"The only reason this restaurant stays afloat is because of it's central location to all th","useful":0,"cool":0},"2FbQWNm5bYzw_D6u0AsgIA":{"text":"It was busy due to a convention and the world series game going on. Staff was friendly. Ha","useful":0,"cool":0},"Xau3wsIVOTNupBCWjKgSgg":{"text":"There were 6 of us in our party looking for a place near the conference to eat. (and I'm v","useful":0,"cool":0},"ffRowyA_KBFriFK06CgYIw":{"text":"I decided to go here with my daughter and sister on our trip to NOLA and had mixed feeling","useful":0,"cool":0},"J2s77tWAmMcn4cuS22-MNg":{"text":"Great food, great atmosphere, and AWESOME drinks. Their bartender Julia makes incredible i","useful":0,"cool":0},"KluVxg14Bnw24nWR3MGHJQ":{"text":"Last night was the first time I've actually eaten food at Grand Isle, since the previous t","useful":6,"cool":5},"8Kp_Z9wD7B6YORmzHRLAPA":{"text":"Great place!  Very friendly and easy to work with. Great po boys, local beers and desert.","useful":0,"cool":0},"Diq8ffdQvqF5qjB0_4ZHiw":{"text":"We were across the street at 12 Bar for a pre-game party and we decided to drop in at Gran","useful":1,"cool":1},"oR33Gn1OUlAr-i70UciDKg":{"text":"My name is Ruben. I grew up here in New Orleans so the cuisine is not new me. I found gran","useful":0,"cool":0},"5YePw8i3pfnQTed33eGgPA":{"text":"Meh. It's good for what it is, but don't expect blow your socks off authentic cuisine. Med","useful":0,"cool":0},"KR_Q7qlyzIMhNcf7jLL4HA":{"text":"Enjoyed the food and excellent service from Alex \nour Waiter and Will the Manager.  We cam","useful":0,"cool":0},"0biGtwg9_Gw3JsQUf6N_mw":{"text":"Great service (thanks, LaDonna!) and the food is super yummy! The chef put together a soft","useful":0,"cool":0},"yIepvx3jljvWtg77BdywzA":{"text":"Came on a Friday night because at the French quarter it was impossible to find a table wit","useful":1,"cool":1},"iNnFYk5kiE6VKqbjpAbTNQ":{"text":"I've been here four or five times. I usually sit at the oyster bar and chat with the shuck","useful":0,"cool":0},"cl_-5doA8CKVNruLpvI4cg":{"text":"My wife and I had dinner at Grand Isle before a concert at the Fillmore.   The location is","useful":0,"cool":0},"9Fqigtuwy2YzifefIOkKlQ":{"text":"Shawn and Clay were the best and honest  bar/oyster shuckers. They have the biggest oyster","useful":0,"cool":0},"cqO0ryqzYsvzR5GRT8byig":{"text":"Our waitress was great, the food seemed to be enjoyed by most of the table. I really enjoy","useful":2,"cool":2},"h-lNJ81ZPTnasRNqI3916w":{"text":"Excellent food. The blue crab legs and shrimp and grits were awesome. The sauce on the shr","useful":0,"cool":0},"VyeP6E6kkGgKfuiCf5BdPw":{"text":"Every time we visit New Orleans this is our first place we go to for our Po-Boy fix! They ","useful":2,"cool":1},"LdN0dEq-W_HvXF2hvTKRLg":{"text":"Hospitality was nice. Chargrilled oysters were okay a little undercooked. I ordered crawfi","useful":0,"cool":0},"KXDKG_UssX9RhURkappFbA":{"text":"Great 'alley' location. The whole area is very casual with outdoor seating almost everywhe","useful":0,"cool":0},"g20uQXLY5014Ive0LYgMLQ":{"text":"Went for dinner and started with the crawfish beignets. Delicious! If they served those wi","useful":1,"cool":0},"liiqdZINLznv1O2UQrOsGA":{"text":"I've been to GI a couple of times now and it's a solid choice for a group with diverse tas","useful":3,"cool":2},"3qQ-6xMKIhdiMlYpBJmXwg":{"text":"Service was excellent.  I was not blown away by the food.  I felt it to be overpriced and ","useful":1,"cool":0},"OHifR_YsqEHipTCFFHNqVA":{"text":"DERRICK + great food = BOMB ASS TIME. Our server Derrick was amazing with outstanding cust","useful":0,"cool":0},"vga4BtFX_Bbr1G-2bfftWA":{"text":"Very attentive service and good food.\n\nWe went there for a late lunch and watched a couple","useful":0,"cool":0},"sfGZ94EuLKJtFqAAlXlgJQ":{"text":"Place to eat some southern seafood food. Nice area in the corner of harrah's hotel and cas","useful":0,"cool":0},"4Lj_ltcIjqWVTrrr1lCC0A":{"text":"Was just in town for a conference. Are at a different place every night, most of which wer","useful":0,"cool":0},"5Kx2oKfjTtv2ORsDNxJ-yg":{"text":"A group of us were going to check out Mother's, but the line was almost around the buildin","useful":1,"cool":0},"hkLUnPTmx_m17bA6ogsSDQ":{"text":"Wow. Seriously I don't know why this place is not rated higher. I loved their boiled crawf","useful":0,"cool":0},"dpLAWwFYbMFz_VhqWvLm9w":{"text":"The Char Grilled Oysters were the best we had the entire trip, we actually ate here on our","useful":0,"cool":0},"g7CIDLqW1dfrUguLylEZQA":{"text":"We came here as a family Thanksgiving weekend - visiting family who live in the area. This","useful":0,"cool":0},"ZRYYYzGlnaUTmlSIIWLczg":{"text":"The food here is good. There's nothing wrong with it. The prices are just crazy. It's in a","useful":3,"cool":0},"-uDDEXWri8rJFjL2kf68Lg":{"text":"Grand Isles is one of my favorite spots to lunch in Nola. Located in Fulton Street next to","useful":4,"cool":2},"EDH_bCdyqlVfq42LEfnjdw":{"text":"I  \nNever give 5 stars for a single visit, so we went twice on our recent trip south. The ","useful":1,"cool":2},"gETgXzCHR5_3ghwe8Bkw_A":{"text":"Good happy hour specials! The oyster special wasn't in effect when I went due to an oyster","useful":0,"cool":0},"NtZyM73CL8AgAOW0XBerGQ":{"text":"We stopped by for drinks & apps. Jason was an awesome server....attentive, funny, & knowle","useful":0,"cool":0},"cl1z-IZgip29Bz3SE5QcZA":{"text":"I love it. After working a long day at the convention center, I needed a beer and oysters.","useful":0,"cool":0},"rgZy45omLDA4gnlvNChQMA":{"text":"Could not have had a better experience at happy hour sitting at the oyster bar with Derric","useful":0,"cool":0},"vcBnmw0pVaYtYwZNgtNZ_g":{"text":"Tourist Trap!  Dined at Paradise Isle yesterday, Oct 5, 2014.,  The waiter told my friend ","useful":0,"cool":0},"QntSFgCKY3uF_z8qNnwoDQ":{"text":"Oh My Gracious! This food was so good. Had the oyster po-boy on fresh bread. The oysters w","useful":0,"cool":0},"zPwzcCoO_FU6Hyk1UFz7Rw":{"text":"Wow! Great food. No line. Had the raw oysters and gator sausage po boy, phenomenal! Super ","useful":0,"cool":0},"1YNB0yH8cxggud9UtJl4Bw":{"text":"We ordered the Jerk chicken po-boy, fried shrimp po-boy and gator wings\nThe gator wings we","useful":0,"cool":0},"RadbrQEp66HDJUe5EcMROA":{"text":"Solid place to get brunch/lunch. \n\nWe enjoyed basically every dish we tried EXCEPT THE ST.","useful":1,"cool":2},"uL1styoTYHUuev-eidT0qA":{"text":"I finished two drinks walking from Bourbon Street. I wanted more, to get that feeling of f","useful":1,"cool":1},"LgwlQzUQ00o8HDQBntxP7Q":{"text":"Come to NOLA all the time, first time here! Hostess sat us immediately! Super sweet! Waitr","useful":0,"cool":0},"4y2qa3nChG9nrw9Cd6ORBA":{"text":"Wonderful food and drinks!  Try 'The Awakening' for your cocktail.  Staff was lovely too! ","useful":0,"cool":0},"o0MRepYqlqctOEF_V2X05A":{"text":"Where to begin... this place is so good. The food is delicious but it's the hospitality of","useful":1,"cool":2},"1sGDP1emQ8JZopDMHhldlQ":{"text":"Came here with my SO and a couple friends for a birthday.  I was skeptical based on what I","useful":0,"cool":0},"3R2fFzuYQJuyjcfCxZR4Dw":{"text":"We were in town for the Sugar Bowl and stumbled across this place. We were able to get a s","useful":0,"cool":0},"ftAw9SGeqoL_we2y_wKjlQ":{"text":"Came back on Wednesday and Dominique, Clay and Virgil treated me right. The crawfish was d","useful":0,"cool":0},"EYV1V4wjSBpug5cFWbYuWA":{"text":"The outdoor venue was beautiful.  It wasn't too noisy.  The staff were all very kind but n","useful":0,"cool":0},"bw35TnzzrySCS1rQtePfFg":{"text":"We are in town for a basketball tournament and chose this restaurant based on food selecti","useful":0,"cool":0},"okO82vXJs29wPOuDoz2ZaA":{"text":"Don't miss this hidden gem in NOLA. Derrick is awesome. While shucking dozens of oysters a","useful":0,"cool":0},"8uZ9HbGHYbdQc7Ay1dB0xA":{"text":"Wow...I've been coming to NOLA for WSOP for last 7 years. How did I never hear about Grand","useful":0,"cool":0},"W0chi-VWVrgP9AZU8WAM7A":{"text":"Nice place with good food and atmosphere!  Had the étouffée and it was tasty but could've ","useful":0,"cool":0},"bemjPWBn9u_4BZ3be0ACEw":{"text":"One of my favorite chill spots in New Orleans. Great for oysters, which are the only reaso","useful":0,"cool":0},"jUT16o7zT3ax0aNwCmMY4Q":{"text":"Not sure where to begin...unfortunately everything from the beginning to the end was quite","useful":0,"cool":0},"nA35hDPiRCq5IUx8mlvgag":{"text":"One of the places that really is ranked between a 3 & 4 for me...I'm rounding up because I","useful":0,"cool":0},"F44CkBRdMS7VDRHhRlXPaA":{"text":"So usually I read reviews before going, but I did not. My review will sound similar though","useful":1,"cool":0},"ERuZ5Dnq2oOtPT1Jxz0aGA":{"text":"Thjs place is AMAZING,  Faija our server was absolutely fantastic,  the moment we walked t","useful":1,"cool":0},"KY3Nluy2ZV8DfGhSoJdWFA":{"text":"Really enjoyed my dining experience here! They were close to closing... And you would neve","useful":1,"cool":0},"RPFN6mim24Q0dyjqYSKYDw":{"text":"The first bite of my stuffed crab made Grand Isle worth 5 stars.  Flavorful, not at all fi","useful":3,"cool":0},"sJjRocVWlNdW1RZKVpiUZA":{"text":"Fantastic food and service!  Bread pudding has a creme anglaise sauce, which was an intere","useful":0,"cool":0},"QHh7ztUxorzp01Jimzv21g":{"text":"My wife and I were in New Orleans for my 60th birthday.  We were walking down Fulton Stree","useful":2,"cool":1},"0arjKjQQwXjme8cXOI84zg":{"text":"Wow!!! From the moment we walked in the door we had a great experience. Prompt greeting, s","useful":0,"cool":0},"KXCEPP60TEvm8Eb6_q9vFQ":{"text":"The first time I went,  myself and a friend where just trying to find somewhere different ","useful":0,"cool":0},"Rwi0oX8alfA5JcQuGOoqDQ":{"text":"We visited this restaurant TWICE during our recent visit to NOLA. The food was fantastic a","useful":0,"cool":0},"uZO002rlPfUu8RhoJ-O1TQ":{"text":"Where do I begin. I guess I should start by saying my two star review is hard to place. It","useful":0,"cool":0},"_Z3Qzi1LzUgPpoLHYvfsyQ":{"text":"Serendipitous! Amazed! Taken aback! Found this place on a whim on restaurant.com. I cannot","useful":0,"cool":0},"Yq02XMbmiZ1bDOLo4Ed0WQ":{"text":"A decent meal at an indecent price...\n\nMy duck po'boy wasn't all that great, but that may ","useful":3,"cool":2},"VntsquFB2iklsoca94cC9g":{"text":"Great Deep South feel to the space--simple, worn, and open with lots of space and high cei","useful":0,"cool":0},"c8hvC6XmyK_pJpg6Xqaiog":{"text":"Really great food and service! We were in town for NYE & came in on New Year's Day for lun","useful":1,"cool":0},"UC85kSUpjsGDRMBQ0ddUcA":{"text":"03/08/2013\n\nGorgeous day, early spring treat for a nice lunch for 2 (or so I thought). \n\nM","useful":1,"cool":0},"mB7iyfCnmIzwnTSuyxSrfA":{"text":"Thumbs down for Grand Isle, unfortunately. \n\nThe hostess at the front was very kind and fr","useful":2,"cool":0},"q2NOlR1_JsAK1KJN9hWzeQ":{"text":"I went there for their Happy hours\n\nService 2/5 - the restaurant was pretty much empty whe","useful":2,"cool":0},"GiEdH829ZIDBu9CxHyTUUg":{"text":"I had dinner here on Sep 19.  The food was good and reasonably priced.  Causal environment","useful":0,"cool":0},"yCvGG42ASkUxPvKTOggpOg":{"text":"They are only getting 2 stars because of the location. Anywhere else, this is a 1-star res","useful":0,"cool":0},"fYqbws6rbfG-BL1T5BQzkA":{"text":"The best oysters on a half shell I have ever eaten! I wish I lived closer to NOLA just to ","useful":0,"cool":0},"xCqQJb9C0VC7uBUF_Wi3mw":{"text":"The worst possible service ever. Our waiter was extremely rude and barely even came to our","useful":0,"cool":0},"3x1DLH_V6_QsBhO1D8zvNQ":{"text":"Delicious tuna tartare & boiled shrimp.  Lovely outside dining.","useful":0,"cool":0},"I35U3wUm7SOqPHubp-tZgg":{"text":"Great place to go if you are looking for a good happy hour in the cbd area. I ordered the ","useful":1,"cool":1},"t3nlSz9JiFB7Z4LVVdRGeg":{"text":"Great service. Delicious shrimp & grits! Macaroni & cheese was also very good. Will defini","useful":0,"cool":0},"911jtlSU4RRWgsYJxeGjZA":{"text":"The fact that there were only 3  customers should have been an indication...the seafood gu","useful":0,"cool":0},"k53KhqCO_zVvglJTLrOkUQ":{"text":"wow, you can book a table on yelp for this place?   \n\nanyhow... the server was over the to","useful":4,"cool":0},"oGupnItsocwrCFIa44yH6w":{"text":"What a hidden gem! This place is definitely worth the try if you're near Harrah's. \n\nWe tr","useful":0,"cool":0},"cy7zofUBeRggWY31a17TOw":{"text":"What a difference from one day to the next.  Went to happy hour Wednesday and everything w","useful":0,"cool":0},"uMFnntWsO2-LTMj5IbLosw":{"text":"Amazing food !! Beyond amazing customer service!! I was born and raised in New Orleans but","useful":0,"cool":0},"G2nswt6krFV1twAb5GDavQ":{"text":"Love this restaurant! I ordered the Crab Cake and Poached Eggs, which was absolutely delic","useful":0,"cool":0},"tnjJiSBTOxYGF8WWNJHn4w":{"text":"Had been wanting to try the $1 chargrilled oysters (what?! I know-a steal!) for weeks and ","useful":0,"cool":0},"kI2TlU8G0zr3T3FdWWoydQ":{"text":"I tried the Nola Po-Boy Fest winner and it didn't disappoint.  The Asian slaw was the perf","useful":0,"cool":0},"bjpCXvrNijJjvTtSaRNxnw":{"text":"This is one of my favorite places for outdoor dining.  I've been here numerous times and h","useful":0,"cool":0},"aimSFGpdlWaJwfX8qb9hXQ":{"text":"This restaurant was given a 4 star review so we went for dinner. I have to say I have no i","useful":0,"cool":0},"GNtLtX3MoJXgaq50s6lc7g":{"text":"The food was AMAZING . And the service was wonderful . 10/10 recommend the shrimp poboy & ","useful":0,"cool":0},"4nEVPnR24XMAyBOQge8Maw":{"text":"I tried the grilled redfish with spinach and the fried oysters.  Both were delicious and f","useful":1,"cool":0},"Xw6gLT3yYA0X-klYzDp1aQ":{"text":"I was nervous because of the number of stars but it was close to our hotel and others from","useful":0,"cool":0},"OhtCksgXDSsJsWWlA_1tOw":{"text":"How do you criticize a place where the wait staff are so friendly? Well, here goes. The ho","useful":0,"cool":0},"esJLKmbzmYyHEY2J7oNHcQ":{"text":"great great food and atmosphere. wait staff was superb!!\ni had the boiled shrimp. they wer","useful":0,"cool":0},"YjB3593wVKM8RHlkDVP0fg":{"text":"I approached the hostess about outside seating as the sign requested.  She said they were ","useful":0,"cool":0},"P-VXrRA6y5yCuo4aGgBlqg":{"text":"Grand Isle is a wonderful spot to enjoy a beautiful day or afternoon or head on over to af","useful":14,"cool":8},"pE426klweIz-8B44n3X1vg":{"text":"Even during COVID! This restaurant was a great experience and to think it wasn't even on o","useful":0,"cool":1},"WfqHjoUvJEA2evX96p39Gg":{"text":"The Best, we were here for oyster happy hour for .75 cent oysters. Mark was amazing and yo","useful":0,"cool":0},"xbMZvjgeBiXL33eQkMnteA":{"text":"An update to my review posted below: Jeff Hof, one of the owners of the Grand Isle did fol","useful":0,"cool":0},"gdVExdZZcv1C-nxmkrm2Bg":{"text":"We really enjoyed all the special Po'Boys Specially the alligator one. We went twice on ou","useful":0,"cool":0},"E9TjtlLotsqeRYPduHxQ-Q":{"text":"Now I am not of a fan of seafood but let me say it in poem form. ''Tis the night of Christ","useful":0,"cool":0},"sRj7Jq5o1rOWhL2rpZRbNw":{"text":"What an excellent meal. Had the hot crab dip appetizer which was full of crab and fresh. H","useful":0,"cool":0},"CpkE9sJvG_YJ_zkvZhzHlw":{"text":"You're forced to tip 20%. They automatically add it onto your bill. Food was good. Waiter ","useful":2,"cool":0},"PPuMUAjg-VHr3WqHZvjXZw":{"text":"Visited this place day before flight and really should have came there first! Roasted oyst","useful":0,"cool":0},"7KTHKZE3WFUMhHQg4yk4eQ":{"text":"We were going to go to Drago's but there was a long wait. We decided to try the Grand Isle","useful":0,"cool":0},"DEiuWZtXRQq6vZt4VBFFaA":{"text":"Just average...  nothing was bad. It just wasn't great. My biggest complaint was the food ","useful":0,"cool":0},"SCDSlWRokBykFJT45SbdDw":{"text":"So I'm only going to review what I actually ate so here it goes....for appetizer I got the","useful":4,"cool":2},"GlTO7c6XJfAxw7lyrNPn8w":{"text":"The crawfish beignets are to die for. Soooooooo good. Like my favorite thing for sure. But","useful":0,"cool":0},"NxLk3v8Gn97qP2TyrIbuFA":{"text":"My husband and I came for first visit and the food was good. But it took FORRRRRREEEVVVVVE","useful":0,"cool":0},"PAaEuDNpJ7UV5oxcrQP_-g":{"text":"Ordered 2 oyster shooters plus 3 to go. They were a tad bit pricey at $8 a shot, but so wo","useful":0,"cool":0},"ZmiccOc4CPd506drGFNzCQ":{"text":"I have heard nothing but great things about this place.  It is very pricy, for half a trou","useful":0,"cool":0},"zejxGOBjhpMjiMxBYlV1uw":{"text":"Good experience here. Big open restaurant with old pictures of native Louisiana citizens f","useful":0,"cool":0},"qQQnf6jNZW8rzX8u18TlIA":{"text":"We were in NOLA for Saralynn's Bachelorette party, and all she wanted was CRAWFISH! So at ","useful":1,"cool":0},"KM0KxKMpiEQmOaJSyEpWpw":{"text":"Our host was Amanda and Derek was our waiter. First off Derek was a phenomenal waiter. Alw","useful":0,"cool":0},"dqKL2p6tAtZr-FKhtp7ing":{"text":"This restaurant is very  professional and the workers always smile Ling, but most of all t","useful":0,"cool":0},"PCpSDYogEP7CzTe7E8OENw":{"text":"I had the pleasure of having lunch at Grand Isle this past Monday, Tuesday and Wednesday w","useful":0,"cool":0},"7GKeV0PtH05RF-71l-oR_A":{"text":"Awesome spot!! And phenomenal service. \nProbably the best service I've ever had actually. ","useful":0,"cool":0},"Nhzk4oGtpmA6Dq6n__4R0A":{"text":"We stopped in before the game on a Sunday at around noon but only because Manning's was a ","useful":0,"cool":0},"m05eGK1kZf7894d0HfGscA":{"text":"We enjoyed the fishermans stew. The broth was delicious and it was full of seafood. The se","useful":0,"cool":0},"fSppnBrglhitIdQ4QGwfEw":{"text":"Service was great! Mark was incredible\n\nBest deal in the place? Crawfish Boil by the lb. G","useful":0,"cool":0},"7fgr2Y3GZBVQUFsLYx5nXA":{"text":"Saw the new 11-8pm schedule with $1 chargrilled oysters ALL day. Decided to check it out a","useful":0,"cool":0},"-LhVbD3KLAuk5HcbyCLpQw":{"text":"Mediocre food, terrible service. One waitress was slow and forgetful, the othering rude as","useful":0,"cool":0},"1P89RdccFWHaeHvhklOnvw":{"text":"Arrived 45 minutes before the end of happy hour, and by the time we received our first dri","useful":0,"cool":0},"jvhr3KKq2ZQisUFQp7BekQ":{"text":"First off, should kick myself because we've walked by this place for years and not tried i","useful":0,"cool":0},"5SOQ5tjzSi2jLTWbnjPUOw":{"text":"This place was horrible! Service was the reason why! We wanted to move tables and the mana","useful":1,"cool":1},"Z0024zEyG7glEsKYx5XZUQ":{"text":"SOOOO FANTASTIC! Stopped in for dinner before the Pelicans game w/ friends and couldn't ha","useful":45,"cool":47},"Qi85HsGJxMUY1Gn7gUp_gA":{"text":"During dinner at Grand Isle, we were seated under the neon green glow of the oyster bar wh","useful":20,"cool":17},"ZVmCzWpvqJM1Ys4dQPbbNg":{"text":"First off, reviewing on location, it'll get a 5 star because it's on Fulton Street and the","useful":0,"cool":0},"3SSZRJW0jZrh_0ZaIzZeNg":{"text":"Gave this place a second chance because I like the ambience and location. I'm glad I did. ","useful":1,"cool":0},"cZwRQ49OwhlHL6wgf7vUJw":{"text":"It was a-ok. Went to lunch and got the burger with an upgrade to the veggie of the day rat","useful":0,"cool":0},"B8QCFMTN65mdOToQOyqK0w":{"text":"5 stars would have been the rating for our Happy Hour experience yesterday...but for the i","useful":0,"cool":0},"33KRpXQIFkP90yvpKgnbKA":{"text":"Don't go! The \"$$\" is misleading. The portions of salad and entrees are like those of side","useful":0,"cool":0},"s82K6NqQrWHJCJHx2R1-sQ":{"text":"This place is fantastic, great service, fantastic food and good drinks.  I would for sure ","useful":0,"cool":0},"CZV1qSNeLHqWWcN3L05ASA":{"text":"I was surprisingly impressed by the food when I ate there. One of the reasons it took me s","useful":0,"cool":0},"EF83Wiv1C9q8F-t7V8Gajg":{"text":"This place has an amazing happy hour especially if you like cheap oysters! I've tried shuc","useful":0,"cool":0},"4yyDS8qY4WzfPvTDcRialQ":{"text":"We were there the day after Christmas - a party of 6.  Everything started out O.K.  The fo","useful":2,"cool":1},"ZqNaAzfiRNy6YmO1x-0Fsg":{"text":"Arrived at this restaurant around 12:45 pm . They had a party of 4 waiting in the foyer be","useful":0,"cool":0},"lO1LiJPiHFf_M6yXWwNdag":{"text":"I haven't been to Grand Isle in over 3 years! I don't know why it's taken me so long to ge","useful":3,"cool":2},"RjJIfLG0IpSn-O2sYCD8VA":{"text":"The oysters were SO good! I had a dozen raw on the half shell and a house salad with the h","useful":0,"cool":0},"UymreCcN5U690mV6eDh7mA":{"text":"We walked the streets of New Orleans trying to find restaurants that had at least 4 stars ","useful":0,"cool":0},"lWpGYqhqWm1Kh0OHeLjpzg":{"text":"Great food, laid back atmosphere but that food though it hits the spot. If you like seafoo","useful":0,"cool":0},"5k0UP2PYkhjC9XWvy6jAZQ":{"text":"The food was absolutely delicious, however the service by the waiter was poor. He never ch","useful":0,"cool":0},"QBEYOppb4V1lKtAsc3GM3Q":{"text":"Ive always love a happy hour raw and charboiled oyster for $1 especially when happy hour f","useful":3,"cool":3},"mOgySU9GlID5YVpJ3PCxcA":{"text":"I enjoyed my dinner at grand isle.  We came in with a party of 12 and sampled many things ","useful":3,"cool":2},"cVWfm6HW2cicR1_VQkAcWg":{"text":"The restaurant was nice and the staff was awesome. The only thing that was off was the foo","useful":0,"cool":0},"ufJD5mJ0Mqpn6U02tfyFSw":{"text":"We ate here two days ago.  I had the ribs.  They were very good, but very messy, and the f","useful":2,"cool":1},"s-XYNSQFlWkhKoNbu-NSYQ":{"text":"A simple menu of extremely well prepared food with peerless service makes Grand Isle a gre","useful":1,"cool":0},"I732SFKaT44UiskasjBKAg":{"text":"Mediocre. Soggy poboys, dry crawfish, bland service. Don't waste a NOLA dining experience ","useful":0,"cool":0},"ntCt9ixzUkkJxGkrByGJNg":{"text":"Very Special - This was the first trip to New Orleans, for my husband and me.  At this tim","useful":0,"cool":0},"Ikd9XfGc1n_c8JZUmP3V-A":{"text":"The food here was amazing! Visiting from Jersey and their take on classic Louisiana food d","useful":0,"cool":0},"PiEs_JRjjLDM4ZUxuV2D7A":{"text":"Amazing grilled and raw oysters!     Talking about dessert peach pie was delicious. Not su","useful":0,"cool":0},"Hbu5fHFuTR5tsZxDUKKAKQ":{"text":"We took our family there for lunch today. We are Natives of New Orleans. We are staying do","useful":1,"cool":0},"LTpLoy8jKAUcFullO1kI3g":{"text":"Could not find many cheese items on the menu so I tried the Grand Isle baked oysters which","useful":0,"cool":0},"2dalL2c5p2MmDIZAoCy0Rw":{"text":"So I'll premise this review by saying I have a food allergy. So my experience here was ver","useful":0,"cool":0},"FXSVRBGz7YUEvsBX-YJPng":{"text":"Went for happy hour/dinner! Great deals on drinks and $1 chargrilled oysters (soooo tasty!","useful":0,"cool":0},"07UM3yy76Ieq-7oxggtC5A":{"text":"My dad recommended this place because he loved the shrimp and grits and they were AMAZING.","useful":0,"cool":0},"fPyLcRO-hwn1T3I4IgQ4vQ":{"text":"This is the first time I've been here since Covid and I can say they haven't bounced back ","useful":2,"cool":2},"I7MLPHTdNdx4N1MzOJwZ-A":{"text":"Grand Isle...I am so happy we found this place!\nWe came to NO knowing that we wanted charg","useful":0,"cool":0},"eqh5bRb1wM7_IhVWMQhLJg":{"text":"Go for the great Happy Hour, but continue on to the real food! I had forgotten that Grand ","useful":0,"cool":0},"7Y5WdfRJD9jK9LwRMFcEyQ":{"text":"Best oyster bar hands down, come look up my man Derrick and he got u. Very friendly and in","useful":1,"cool":0},"URLd_9KZYQSLqhZFZKn16A":{"text":"Had the Char broil oysters, crawfish beignets and oyster poorboy. Charbroil oysters and be","useful":0,"cool":0},"RdSkoPTqAktdPS1LaVHaaw":{"text":"Doesn't look like much but boy were we surprised!  Stopped in for lunch and couldn't be ha","useful":0,"cool":1},"oPFFReBeVndrSuwzNh6pGQ":{"text":"Although there is a large sign saying temperatures must be taken before being seated, our ","useful":2,"cool":0},"LvNtgW8IsowYkCV9nGqrIA":{"text":"It was the best food in Louisiana that I ever tasted love this don't hesitate eat here !!!","useful":0,"cool":0},"hZI7cBJEEG5sB3LseeNf3Q":{"text":"We found this place on a whim and oh boy were we glad we did. Due to Covid, they only acce","useful":1,"cool":1},"P54KWo4-NFz8kZZFOjrFLA":{"text":"Stopped in on a whim and found that it was a great choice. You really must try the smoky f","useful":0,"cool":0},"9pLlYAcgcGVp4dWwUZnfHQ":{"text":"We were in New Orleans for Mardi Gras and taking a cruise out on sunday.  We ducked into t","useful":0,"cool":0},"rBb3Q8vaOQPCaxEZeNbYKA":{"text":"I stopped by here on my birthday during my annual birthday happy hour food crawl and was p","useful":3,"cool":3},"BEzvXWrwrk9l4_asiXmuXA":{"text":"While still in New Orleans started with the Shrimp popper, this was 1 huge shrimp wrapped ","useful":1,"cool":1},"k-i3Qpinh0FTigC7Xl3frg":{"text":"We couldn't get a table in other restaurants so I called Grand Isle to check availability.","useful":0,"cool":0},"_pmNInm2e7OMxOEBleFQow":{"text":"Excellent service, amazing food, we had a ball! The drinks were amazing! The food is to di","useful":0,"cool":0},"R6FkwyqrcwuiqGq88teEWA":{"text":"Wow!  Hit the Happy Hour from 4:00-7:00. Stack of onion rings, half pound of the biggest h","useful":0,"cool":0},"rPSL8Xgon6-84p9Wx8ty1A":{"text":"Food was mediocre, it was expensive for what you receive. The server was rude and disinter","useful":1,"cool":1},"z4rl-pVJt_DL3EVvGAwsww":{"text":"I went back and forth about even posting this review because I'm embracing to say I've act","useful":14,"cool":7},"_7jQ0HzDPAEyatxJdIqFhQ":{"text":"I'm not gonna lie, I was in it for the drinks! My friend and I stopped in just in time for","useful":3,"cool":3},"ksuBNoJ1chCjRkGCQQl15Q":{"text":"This place has great atmosphere, my waitress was super , I would recommend this to all loc","useful":0,"cool":0},"FxBI3JVs3VvAQHosa1oYKg":{"text":"The friendly service helped set the mood for this relaxed dining experience. At our table ","useful":0,"cool":0},"B02MdTI2_yy63EkzpFEjyA":{"text":"This staff was incredibly condescending and rude. We went with our young 20 something grou","useful":0,"cool":0},"6smZ0FP_wmu_EAygXFcqnw":{"text":"Stopped in for a late lunch and sat at the bar. The two ladies working were super friendly","useful":0,"cool":1},"whmFoG-9bg0CLZe0_CVVgQ":{"text":"Updated review:\nI've been several times and the food and service has been extremely consis","useful":0,"cool":0},"uDbx3sCmlqM4uZ2RHW01ew":{"text":"The grand Isle was delicious and very savory I didn't think much at first when we first go","useful":1,"cool":1},"NBHdjdsf9pe9S4S0ooW47A":{"text":"Was looking for a place withing walking distance of my hotel, and I found this restaurant ","useful":0,"cool":0},"Ga_GRnEqIuYre_RiSixEdw":{"text":"Probably one of the best places to eat seafood cruises in New Orleans! \n- Food was hot whe","useful":0,"cool":0},"SUot0syrxIv6-5V3M2hPMQ":{"text":"We were able to get a table on the 4th of July. The hostess was great and after a short wa","useful":0,"cool":0},"NXsH1I-H02-VLdJj59nCQQ":{"text":"Food is better than most of the restaurants around Fulton Street, and still reasonably pri","useful":0,"cool":0},"p31qKcrJxJyHkzLgOqSxuA":{"text":"G.I. started as a \"captured restaurant.\"  In other words, it was an eatery that only exist","useful":3,"cool":0},"pcIY4U8em9v0lihiJ6vLCA":{"text":"Mediocre.  Not sure if it's due  to covid or what, but , as a NOLA native,  I just expecte","useful":0,"cool":0},"toojSKySzfePB8u1pDDuJA":{"text":"Hungry after gambling. Walked to go to Manning's but it was closed and saw Grand Isle. Fro","useful":0,"cool":2},"xx70raA5MU3IQP7sY0wd8Q":{"text":"Found it on a whim and made reservations.  Came in after my wife's graduation from Loyola ","useful":1,"cool":1},"qPvFcjKhkznQOFqE0oZ5og":{"text":"So delicious! The char grilled oysters were delicious. We also had the jalapeño fried shri","useful":0,"cool":0},"R4PaV7qD-lW5OQlYTQNQNQ":{"text":"We ate here on our first night in NOLA because it was close and recommend by the hotel. It","useful":0,"cool":0},"s0UKSMx4AL3fm1qpcYhGRw":{"text":"Nice place to come for a bit of sustenance after going to the WW2 museum. Rather touristy ","useful":0,"cool":0},"oPGHiC_zjs2AKZznVNX3Tg":{"text":"Came in for just an appetizer. The Ju-Ju Shrimp was amazing. Nice and spicy. The staff was","useful":0,"cool":0},"fom0wP8O6PMwRHHXebEy4A":{"text":"Absolutely love this restaurant!  Several co-workers and I arrived in New Orleans tired an","useful":0,"cool":0},"QCVyaG5_kDokihAxON8cXw":{"text":"I realize that my friends and I visited this restaurant during one of the busiest times fo","useful":0,"cool":0},"ck4Gvpd0VY3qWImPBLXA8w":{"text":"Had the fried oyster with garli aoli. The fried oyster taste only came from the batter tha","useful":0,"cool":0},"71FjtfXIzVn7RJDvmkRquA":{"text":"Below is the response I received from the owner/manager. I thought it was a reasonable vie","useful":1,"cool":0},"nz-U-2yeEOLCt-7A5FrH8g":{"text":"This place was so good we came here twice! Sunday is an all day happy hour, and our server","useful":0,"cool":1},"Fdbl6ljUEBLe4XQjZWZjbQ":{"text":"This was our first stop on the New Orleans food train.  Our concierge recommended the bake","useful":0,"cool":0},"nIAp3sMKoNdTbBS2wYwyeg":{"text":"First time to NOLA and this place caught our eye. We told our waitress it was our first ti","useful":0,"cool":0},"VItB2m5I-eUgE-7Ev0SKJQ":{"text":"Gumbo fair could've been served hotter and been spicier. We are quite picky about our gumb","useful":1,"cool":0},"CKox_nhhb49Y6ofjEuxG7A":{"text":"Absolutely delicious... everything we ordered! Particularly loved the crawfish cakes & cra","useful":0,"cool":0},"-2BfEeI2EA0kDZ3H7Xwmfw":{"text":"Awesome food and staff!  We went a large group of 25 for dinner.  We were sat at our table","useful":0,"cool":0},"4gdRamjtq2OQaBzYwsoSxw":{"text":"It was pretty good. Visitors will probably love the varied Cajun and Creole dishes. Oyster","useful":1,"cool":1},"hgvrrr_iOgdqTYW1UKRQeg":{"text":"With all the awesome spots in NOLA, don't waste your time with this trash spot, with trash","useful":4,"cool":1},"v-8DC9r9kLNoCKoDtrb_uQ":{"text":"Good luck if you get there at 945pm when the hours clearly state open until 10. \"We have a","useful":0,"cool":0},"FHHvUniYAEu0LwwbCEIu5g":{"text":"Blackened Gulf Fish - Amazing \nHad a great early dinner as a solo diner and waitress was a","useful":0,"cool":0},"QGZOfdGILuMG1Tpi9iHv-Q":{"text":"Private dinner party for 15, can be tricky but they did a great job. Private area, outdoor","useful":0,"cool":0},"pQfavIjyMZhTHaaM9OF-7w":{"text":"I had to update this review again because I can't help but respect Grand Isle Restaurant's","useful":6,"cool":0},"guJrf0hXThuTvjWJPsMMvQ":{"text":"I am going to have to concur with a few comments made by previous reviewers.  The food her","useful":0,"cool":0},"Jy-rRmVsf7U6lZTCzaeabg":{"text":"Great food.  Alex our server knew the menu and made great recommendations!  The Awakening ","useful":0,"cool":0},"79qKZQlwdApUb-NSl8z-Mg":{"text":"This place does not disappoint. I've been here twice and both times I was ready for more. ","useful":1,"cool":0},"C-KGmcMic2lgrC9dF2wNNg":{"text":"Excellent food and great service. Great seafood dishes all around. We ordered the baked Dr","useful":1,"cool":1},"OlX8xgqyjDI_C8F6HSHKiw":{"text":"You have to try the Jalapeno Oysters.  They were spicy but not overwhelming.","useful":0,"cool":0},"7ypXB6v5uoSNUCd5vUkJYA":{"text":"We held a private corporate event there that was Casino themed, and everything was WONDERF","useful":0,"cool":0},"BONXKo5kbMSdnq5SpZCvPw":{"text":"I needed to eat dinner and get back to work, and not have to liquidate my assets to do so.","useful":2,"cool":0},"d2udYoYTNeoIvYof25KuZQ":{"text":"Sheila was our waitress and she was great. There were 6 of us in the group and everyone lo","useful":0,"cool":0},"wAGByHU7T-YzpcLSe6EZkw":{"text":"Loved the food and the service! We had the fisherman's stew, shrimp and grits which was am","useful":0,"cool":0},"uIzvCAyZBiMHnBQompQQ-Q":{"text":"Great oysters at the raw bar, the oyster shooter also excellent. Smoked-fried oyster appet","useful":0,"cool":0},"pg-1_BgXXf8xGDZZWO5NBQ":{"text":"Happy Hour @ Grand Isle. Chargrilled oysters are great!  $5 local beer on tap, $5 wine and","useful":0,"cool":0},"ZyGRGRJEUEbHeKZ_o-4DUw":{"text":"First time here after our daughter said me must go, due to the Hurricane and COVID, it was","useful":0,"cool":0},"JB2E4Aciw1-itX74OzWtiQ":{"text":"Everything was fantastic. Service, food, drinks, and ambiance. Can't wait to go back.  Whe","useful":0,"cool":0},"M5OEOAY7Bupg2m160cuI5Q":{"text":"Love just about everything about Grand Isle, but $19 for a bowl of gumbo?  Seriously, when","useful":1,"cool":2},"W0ckP7vguRufoPoXzwCq7Q":{"text":"Good food and good portions. The menu was a little pricy but had some less expensive items","useful":0,"cool":0},"76YBP-GjvkPfpixgQ0syqQ":{"text":"We've been coming to Grand Isle for years! One of our favorite places and usually the firs","useful":2,"cool":0},"8tkqWaXM2bTj1_IEKlF6jA":{"text":"The Grand Isle was the perfect place to end my trip in New Orleans. The service and food w","useful":0,"cool":0},"iDdDdYyAVIgXiAdR1y4PmA":{"text":"We have nothing but praises on the quality of food. Pls pls try the charbroiled oysters. T","useful":0,"cool":0},"wFkHaenN1f30CVtRIrxoBA":{"text":"We had the oysters and the seafood platter. The oysters themselves were good but why all t","useful":1,"cool":1},"Kv7QicSDEluHLSl6nkHJUA":{"text":"shrimp caminada po boy = amazing!","useful":1,"cool":0},"GpUzo7CHM-gkd0PN65Kf6A":{"text":"Grits were very good and service was great too.  Great location and good selection of beer","useful":0,"cool":0},"4e3GE8W5Gz4azmfAP8Hfhw":{"text":"The entree took over an hour and we only ordered 2 house specials (Red Fish on the half sh","useful":0,"cool":0},"LmotZfaWnukHdPx8TcKHqA":{"text":"Located in the strip of Fulton street lies Grand isles. My hubbub had a gift card to here ","useful":2,"cool":2},"RpA9lz9TI7SeV43KKczNfw":{"text":"The two stars are for our server Johnny. He was great. \n\nNow I know this is just a tourist","useful":4,"cool":2},"0WFlYHzsdzWoJp0JAFvXzg":{"text":"We ate here pre-pandemic and loved it. Returned with expectations of a similar experience,","useful":0,"cool":0},"02HKjhfoPrIiIGU0QTetLw":{"text":"Just embarrassed myself by bringing out of state friends to this restaurant \nChargrilled o","useful":3,"cool":0},"PVQ8Fe86C1iqXP60ZNEFWA":{"text":"Incredible food and service! Will return again during our visit to New Orleans. Brined, sm","useful":0,"cool":0},"Jg3URuovTyiNIJWlVRG5dg":{"text":"Grilled oysters were excellent and the service was impeccable.  If you stop by ask for Aar","useful":0,"cool":0},"hbcjD0C5sefSN-gORnykkw":{"text":"I really enjoyed everything about my experience at Grande Isle. I came in on Thursday nigh","useful":0,"cool":0},"FliJZswfVXm0EeR5V9hD5Q":{"text":"Honestly, considering the location, this is a great restaurant serving REAL Nola flavors a","useful":1,"cool":1},"Ceu1OYpf_0zK7IUZk5bOdQ":{"text":"For our last night I wanted to pick out somewhere special to go with my daughter, it was e","useful":0,"cool":0},"AI_W6YE9ZPQssA4bvOLV_A":{"text":"I really wanna tell y'all how much I loved these chargrilled oysters but I just can't  lol","useful":0,"cool":0},"PJaqeWxq1T_erssfIyawRg":{"text":"Great find near our hotel. The oysters were huge and fresh, thunder cheese salad and shrim","useful":0,"cool":0},"FrYZ77IA0bgnDicINp-7cA":{"text":"Fabulous !! Will definitely be back! Oysters are the best I've had! The outside tables pro","useful":0,"cool":0},"AtYvixSzK52PZDnF9E_T-Q":{"text":"We arrived early for our reservation and was greet and seated immediately. \n\nRachel was ou","useful":0,"cool":0},"bkX62wTZbw8IMCLUiKP1gQ":{"text":"The food at this restaurant is delicious! We have had the shrimp and oyster po boy, oyster","useful":0,"cool":0},"Q4Zydfxo0AMQkWdy-wUnJg":{"text":"What a mess!!  I came here to dinner with a couple of high ranking government officials an","useful":3,"cool":2},"sTTzTNmN5HZhzVI3-QFYAw":{"text":"We loved Grand Isle. They have all day happy hour specials right now including the first h","useful":0,"cool":0},"AxqPNnOSypuaYacWLd4AYA":{"text":"If you are looking for some small tidbits of minced meat and veggies in a faux \"roux\" that","useful":0,"cool":0},"zNmG5oopRWPT2OPxFJCH3A":{"text":"No one beat the blackened fish with crawfish sauce.  This is probably one of the best dish","useful":0,"cool":0},"Pq2tWZ9PN6GGtl9aVh7HTg":{"text":"Went there with a large group, maybe this is why the experience was lackluster. They split","useful":0,"cool":0},"QZKmZK1CgMYeyrjujRdH9w":{"text":"Oysters on the halfshell were just right as Goldilocks said, not too big, not too small. P","useful":1,"cool":2},"Kw01fnVhksSzL35tQGca2Q":{"text":"Came to New Orleans for a week vacation. So far the Best place I have Eaten at. Their Blac","useful":2,"cool":2},"mtBdjqOcaImIv5bfj043-w":{"text":"Literally stumbled over here because the place across the street was so packed and I could","useful":0,"cool":0},"Msd4zUbzicKXxhaV74V9JQ":{"text":"Great food but the service was excellent. Aaron J took great care of us with prompt and pr","useful":0,"cool":0},"hejKmCfO_7MGrTqvL8ANRw":{"text":"If I could give \"0\" stars I would.  Friendly hostess & waitress, but was not allowed to or","useful":0,"cool":1},"0Vn4A7CzNQat8_ZTRWgGHA":{"text":"Mushy shrimp in gumbo and dry as a bone boudin. Disappointed since I'm from Louisiana and ","useful":1,"cool":0},"7TV4E2GJqgvlZs8Dv1o_Ig":{"text":"VERY disappointed. Ordered delivery through door dash. Kid's catfish plate, crab dip, boil","useful":2,"cool":0},"uiwDdPNUAcIM04sqga19TA":{"text":"Raw Oysters, Creole Crawfish Pasta, \nThere are lots of places to eat in New Orleans, espec","useful":0,"cool":0},"zDuc38gNFfZ3ty-iSw50bg":{"text":"Delicious food. \nWe came here by accident on our first trip to New Orleans. What a pleasan","useful":1,"cool":1},"_GZmPM3OkxQklNXdv0_AqA":{"text":"Great 1 oyster happy hr specials !!! Also charbroiled.  Had the muscles also which were gr","useful":0,"cool":0},"OZPiWrYFr-faw0x00N5Rjw":{"text":"I'm from a small town North of the actual Grand Isle and I can say that I wish this restau","useful":0,"cool":0},"WUqzYwTMwj2gEmdGA7nI2Q":{"text":"Everything you've read about the chargrilled oysters is 100% accurate. Delicious! I had th","useful":0,"cool":0},"FNmoDEHS9ZhSxSoCN0irbg":{"text":"Yuck.  Each of us ordered something different and nothing was good.vvhusband ordered stew ","useful":1,"cool":0},"_VG7YylBFTeeWSD4P-oU4w":{"text":"Great outside patio area and impeccable service. Food was on point. . Mark is the best. Ma","useful":1,"cool":0},"yXQYSBngP9dAg2E3Z-cSQA":{"text":"The char grilled oysters are incredibly delicious. The service as well and the location is","useful":0,"cool":0},"qk7S9lAbKhpY2GA4HNNCsw":{"text":"Service was good , little cool in the restaurant from temperatures outside but nice vibes.","useful":4,"cool":3},"iKnQVEbobnPeAqnr1vhXQg":{"text":"Great place to eat lunch!! Cool ac which is a plus! The food was soo good and great priced","useful":0,"cool":1},"3rt6nmmv80DcgVae5wB-MA":{"text":"My first time !!! And won't be my last!! Everything was better than I imagined. From the f","useful":0,"cool":0},"JJ9h21HnEVqv3k6Sa0Ie4w":{"text":"My wife and I were downtown and decided to stop in at the Grand Isle.  It was mid afternoo","useful":3,"cool":3},"R4K21DnqdzlgVQfNEnbudg":{"text":"The seafood wasn't bad, but the service was slow.  20% gratuity is added to your ticket au","useful":1,"cool":0},"pPmNEXiSecbKKEJg8svtKw":{"text":"I'm happy I was able to get my raw oyster fix before I left the city. I ordered The oyster","useful":1,"cool":0},"vpZ2cBsJXk5pgJNAmb1qPg":{"text":"Their Blackened Fish and crawfish was possibly the Best seafood plate i have ever had. Als","useful":0,"cool":0},"4tzqNQzpjqm3N_we3SPcVg":{"text":"Got takeout here before leaving NOLA and so glad I did! The fried oyster basket with fries","useful":0,"cool":0},"QpAT8m-jQKOubEi610ZpiQ":{"text":"I've been in town for a work conference and decided to try this spot out after a recommend","useful":0,"cool":0},"B5kVKCk0HaXNoO1i4r2cPw":{"text":"If you like oysters, the smoked fried oysters are a must!!  Ask for Octavio for your serve","useful":0,"cool":0},"uj0-3173Q3YDtdSQGQrZEw":{"text":"Consistently a great choice. The seafood is always fresh and the service is superior. It's","useful":0,"cool":0},"yto9aIKDIWVSB_mmiN5NCg":{"text":"Mixed feelings about Grand Isle Restaurant after my recent visit to New Orleans.  A beauti","useful":14,"cool":12},"9zZ2O3kMYbrLJ90hgX064g":{"text":"This place is amazing! Everything was delicious. The oysters were huge and the jalapeño po","useful":0,"cool":0},"7j1vVQ8K95ral75a2ZuBVw":{"text":"These guys are struggling. Blame it on whomever or whatever.  It's beyond the food or lack","useful":0,"cool":0},"xVkr-g2-MGVTKfb-a_W6bQ":{"text":"This was the first restaurant my wife and I stopped at as we arrived to NOLA!  It was even","useful":1,"cool":0},"XiYV5Wb9W562hqng2qqs5w":{"text":"The food was great, the waitress was great. I'd definitely come back. Oysters were delicio","useful":0,"cool":1},"66SDt-4imjgUlgAik9EptA":{"text":"3.5 years ago this place was outstanding.... after stopping in tonight the only thing I ca","useful":10,"cool":7}}