{"9QFUJaq4hT6ov-E5xw58HQ":{"text":"My favorite place to eat in New Orleans by a long way, and the house cocktail alone is wor","useful":0,"cool":0},"hXl8r89wwiWDMaTrBOAbLw":{"text":"I was really excited about going here. My parents love it so I really wanted to love it as","useful":1,"cool":0},"mTZo7L5ZEAx2d9vgRAKN7Q":{"text":"This review is related to the service rather than the food. Unfortunatley I had to write m","useful":0,"cool":0},"yBMHQ7NIPBAMBLoZTzS7Mw":{"text":"it's been two years since i enjoyed myself at Herbsaint. on a gluttonous day in Nola i sto","useful":0,"cool":1},"qe64nrXg_ygDOs-ddq5B-A":{"text":"The food was very good and the staff was attentive. However, it did take some time to get ","useful":0,"cool":0},"SPQpBDK-n5t0_48lvjXCyw":{"text":"Excellent spot, top notch food without a stuffy atmosphere. The perfect synthesis of Frenc","useful":0,"cool":0},"DlUZglkrCWEUdhitomwlwg":{"text":"Had dinner here last Friday while visiting New Orleans for the first time. The food was fa","useful":0,"cool":0},"i6zkFxHhcw8ZiPQCLx4qSQ":{"text":"Herbstaint is not the same. We have eaten at this restaurant several times and regret our ","useful":2,"cool":0},"--p2n6qCpGOUkdNHbfDBDg":{"text":"A lovely dinner at a lovely place in NOLA.  I had heard about Herbsaint on an earlier trip","useful":4,"cool":2},"NX_qQ-MB4yS_lUgms3POyg":{"text":"This is my second time at Herbsaint.  My first experience was so memorable , it was my fir","useful":1,"cool":0},"yGKaC-D7okaQyWQVNDz7yA":{"text":"Hands down the best food I had here so far and that says a lot. The shrimp gumbo was so li","useful":0,"cool":0},"8e3keha6NMI0O0Wf3kCwUw":{"text":"The food was very good, but a little too rich.  And I don't know if I have ever said that ","useful":1,"cool":1},"TFKjJRZGRv8NwU1RbISEuw":{"text":"Maybe the best restaurant for the money in New Orleans. The small plates can rock harder t","useful":2,"cool":0},"METLLh-XjFhPmCGiiahf2A":{"text":"Crispy goat?! Fresh yogurt tossed salad to go with?  Well yeah! I'm that girl who starts o","useful":0,"cool":0},"sGkj86jRRp7-rIyDrbxrog":{"text":"The food was exceptional and perfectly portioned. We didn't drink, but we ordered four cou","useful":1,"cool":1},"rpachHSx-wOc2pNtgwN-5g":{"text":"My meal here was fantastic and I would definitely go here again. My steak was cooked to ab","useful":0,"cool":0},"aphlOdgo4ygyVU6E4rxVOg":{"text":"OMG this place hit it out of the park!  Was there for a family celebration and everything ","useful":0,"cool":0},"JO4HpcP_nMEoleJX9euF_w":{"text":"Seriously the bet dessert ever- I walked her specially just to eat this dessert!\n\nPistachi","useful":1,"cool":0},"pBGxwHoBcLnVFtaZPMewKA":{"text":"I loved the menu variety the goat dish was unreal and served to me as my mate had the home","useful":0,"cool":0},"sBr8MmRmRrSseH-em8yS6Q":{"text":"The banana brown butter is the highlight of this restaurant and the main reason to dine at","useful":1,"cool":0},"0Y4WYKaTb6dHBwc7HNrYJw":{"text":"Another amazing meal at Herbsaint. First time for lunch! Sitting outside on a beautiful da","useful":0,"cool":0},"sjTu1y6KXHCuD0NGxng7fg":{"text":"Do you like public hair with your spaghetti, if so, this place is for you. I'm not joking.","useful":1,"cool":0},"xF-9oSWMACBOG2Ar-t02Fw":{"text":"I had my wedding \"reception\" here when I decided to get married in NOLA. I had wanted to f","useful":0,"cool":0},"FPLv6vCZmsUe-PKb-rVfuw":{"text":"Had a lovely meal here.  Excellent food & service.  Especially enjoyed the pork belly & du","useful":0,"cool":0},"mhsJ-BGhIGxZaFGxoJFcmw":{"text":"We liked you.  Gumbo was good.  Fried oyster and short rib appetizers were very good.  Tun","useful":0,"cool":0},"SkeGf955lRS3M_xsaEh69A":{"text":"On our recent trip to New Orleans, a store clerk in the Quarter gave my partner and I a fe","useful":0,"cool":0},"lebWmNmBwTb1GsDc2HteCg":{"text":"I recently dined here with a LARGE group of college friends for a meal that ended being pr","useful":1,"cool":0},"o7_2VOY61yKq3RYwSBi_bA":{"text":"Love this restaurant, great food, many bottles of great wine!","useful":0,"cool":0},"KBGDGnj4oVle2jGgSc639Q":{"text":"Duck lasagna was amazing and paired with the veggie of the day, roasted broccoli. We had t","useful":0,"cool":0},"JblWkZeoHrmJSp9gnnHfTw":{"text":"I am really sad about my visit to this place.  A group of 7 girls and myself made a trip f","useful":1,"cool":0},"pmX5ypVdiOy8aAeqFD53yw":{"text":"Accostamenti azzardati ma ben riusciti, sicuramente molto particolari ma che personalmente","useful":0,"cool":0},"xSLkNXeOl_dem9Nbx_xpkw":{"text":"Great location.\n\nGreat tomato shrimp bisque--like eating thousands of tiny shrimp in each ","useful":0,"cool":0},"yVa5gDJH9yYboXE_iLYQvQ":{"text":"Get the Gumbo. It tastes like it was cooked in a pot which has never been cleaned, in a go","useful":3,"cool":0},"BSYdbL080D3kOBivQudK8w":{"text":"I came here after my wedding and we had a rough start with some of the employees not being","useful":0,"cool":0},"kx_QMtHkKYPvs-Vc-liWLg":{"text":"Definitely my favorite restaurant in Nola! I was here for about 5 days and dined here twic","useful":0,"cool":0},"TV6KG2VRVbmKJ7UEXVINcw":{"text":"My wife and I ate here on our second visit to New Orleans. It was high on our list of rest","useful":0,"cool":0},"tSxgULBNAVOIaeSNAXMqUQ":{"text":"What a pleasant experience. My wife and I wandered in looking for lunch and were treated f","useful":1,"cool":0},"do0mZA49a2gXU_1XYR0XqA":{"text":"Food: 4/5. Service: 4/5. I wore jeans and thought I was under-dressed...until someone else","useful":0,"cool":0},"J6xgL0JLoAzNZobLRIjS0g":{"text":"Another great restaurant discovery in New Orleans. This one is located in the Central Busi","useful":1,"cool":0},"i5x-WjZKxDrfU7S4_CdHWQ":{"text":"Very impressed with this restaurant.  We had very very good food and wonderful welcoming s","useful":1,"cool":1},"JgjXQkOPMaO9Hoa9HO5vxQ":{"text":"We walked in at about 8:00 without a reservation and they seated the 4 of us in less time ","useful":0,"cool":0},"mInLLrxqg9bmuegBHLAu3A":{"text":"6 of us went after cocktails. Easy to find in the Central Business District on St. Charles","useful":0,"cool":0},"iIr3HfA3KOtyYTDFfXzNhQ":{"text":"First time in New Orleans, and this was the best restaurant we went to! Cool atmosphere, g","useful":0,"cool":0},"fiF7GX-Hj3Gxvr5wKZV1-w":{"text":"It's a Donald Link restaurant... nothing more needs to be said!","useful":2,"cool":2},"vMqrZVAMk7fH2U28XH735w":{"text":"So disappointed.  I mean really disappointed.  Do yourself a favor.  Do NOT go there.  It'","useful":1,"cool":0},"umARAPavWwMjvG-YS7rMPQ":{"text":"Delicious soup; good fish dinner.  My friends loved the frog legs, but I just can't eat th","useful":2,"cool":1},"mqZBIsBWXU4_duOxlfOWag":{"text":"I ate at August last night and has a great experience while sitting at the bar.  Service w","useful":0,"cool":1},"G022Afaz5I6c6rdOK5Agfg":{"text":"Good food and wait staff.  Bill for two with tip was about $120.  We had glass of wine, sp","useful":1,"cool":0},"_m9ZSaP5y0vE2q5HTzhmkg":{"text":"We had our 39th anniversary lunch there, and it was amazing!   We started with a Reisling,","useful":0,"cool":0},"p2zeK45kUomwybRpuKORTQ":{"text":"More great dining at one of New Orlean's best restaurants.\n\nButter poached fish dishes\nGum","useful":0,"cool":0},"D218tZiZ9xR-Sb9ygHFvyg":{"text":"Got in somehow on a Saturday night without reservations.  A great stroke of luck as this w","useful":1,"cool":0},"O-lurcrzBPURoq5Q8U0fBA":{"text":"Had a great lunch here today with my friend.  Had: crabmeat with gazpacho app,  fried catf","useful":0,"cool":0},"1eKdB1m64Rtbz56Mc2EVlQ":{"text":"Great service, amazing food, cozy atmosphere. Our table loved everything we ordered, which","useful":0,"cool":0},"9t10ANJnyvVL-Si9uCG3-w":{"text":"This was the best food we had in NO. The gnocchi was the best we've had ever, and we've ha","useful":0,"cool":0},"RrQLw9PS88gLPAxM9KDm3A":{"text":"2nd visit and just as good as first time.  Food and service top notch.  In a city with a t","useful":0,"cool":0},"mExUnonTjKvRJzVQEzNYpA":{"text":"ok. the majority of the reviews on here are like 5 stars but i dont feel that way but that","useful":0,"cool":0},"kRoEihuNOceb6CH0760zOw":{"text":"Hands down, one of my favorite restaurants of all time. It came highly recommended from a ","useful":1,"cool":0},"JQUowsnbcAHptkLkWRyXLA":{"text":"One of my favorites in New Orleans.  I ate in the bar area but was treated like a king, ev","useful":1,"cool":0},"8pap9r6orNwzXPfFjrn8eQ":{"text":"Herbsaint was another delicious restaurant we went to during our last trip to New Orleans.","useful":0,"cool":0},"D2jk7UzuedJ2Db3eDgYNLQ":{"text":"Not a bad walk from the FQ.  The food was really great, had a chicken and andouille gumbo ","useful":0,"cool":0},"yatIkSVqgEOwbE7yC6EkXg":{"text":"Strong 4 stars for Herbsaint. This was our upscale dinner while in New Orleans. I loved th","useful":1,"cool":1},"5WvXQVov-i7QqZOWgTUabA":{"text":"I was excited to eat here based on the reviews, the awards, and recommendation of friends.","useful":1,"cool":0},"J919zB-M2eWSK2bpaSyzsQ":{"text":"I was at Cochon and was impressed so I thought I would try the sister restaurant this even","useful":0,"cool":0},"BSYdNIFEpLPhr473_7hsTA":{"text":"Somewhere, sometime, someone thought\nBananas are a cheerful lot,\nBut coconut, that dandy c","useful":0,"cool":0},"DeatyA6lb7lhhzVKNZcWnQ":{"text":"Food was delicious.  Menu is seasonal.  Kitchen takes risks with interesting flavor combin","useful":1,"cool":0},"v0-SNu9w5h0USVfEdfsW6A":{"text":"I've been there several times, and it's never the same , sometimes is good others really b","useful":0,"cool":0},"k5-YZ9OpI49GA7IRoZa4dQ":{"text":"Dined here February 7th and enjoyed the shrimp & grits but hubs was a bit disappointed in ","useful":0,"cool":0},"-JvNL1uGtJpDjJYyBLkPXA":{"text":"Go to Herbsaint for a solid but unspectacular meal. Full? Yes. Satisfied? Maybe not.","useful":1,"cool":0},"KZUECE8UI8e-dCfr29zyUQ":{"text":"The food was good, but hard to appreciate since the portions were tiny. And ridiculously e","useful":1,"cool":0},"ZmAhthV3XN9TanphnYivtQ":{"text":"Literally worst service in Nola. Server had poor knowledge of wine and food menu. Waited f","useful":0,"cool":0},"p93Klbti2WXz8uqYfr6GEA":{"text":"Amazing! If you are looking for a culinary experience, this is your place. I was looking f","useful":0,"cool":0},"ki5u5z_KbSGynAfk4ZiLmg":{"text":"Another restaurant I knew I wanted to try before my trip to New Orleans. This time because","useful":0,"cool":0},"4uRR25-dZQXDwH2daI9Njw":{"text":"Herb Saint is a quaint restaurant off the main drag.  Service was fantastic.  Wine menu sa","useful":0,"cool":0},"NSSdLnZvxS_5JXCXO-edeA":{"text":"Wonderful meal...the one dish I remember the most was the pasta with the fried egg on top.","useful":0,"cool":0},"yxlf9bNOduEUHbSQolcrTw":{"text":"Everything was absolutely amazing! I'm originally from \"Cajun country\" Louisiana, and the ","useful":1,"cool":0},"lHNEaNV6GPJk0I11J6qe0w":{"text":"We came here because it was on the James Beard nominee list. We were able to get a later r","useful":1,"cool":0},"QsjMSSGQxfQNGYFJrhl94A":{"text":"So after all of the hype, this is the second Donald Link restaurant I've eaten at and left","useful":0,"cool":0},"IP8O3KC2xgrFcKXF6Mwexw":{"text":"Delicious!! Best bartender with great menu recommendations and extremely attentive. Gumbo ","useful":0,"cool":0},"b3zw2dkOup6E2Wn5VlQPag":{"text":"Herbsaint was an interesting experience. The atmosphere is lively and the artwork/decor is","useful":3,"cool":2},"V6NqE7YF0nyYh3e4hwuHiA":{"text":"Great ambiance, good service, and good food. Portions are on the smaller side which is gre","useful":0,"cool":0},"nw98zRMuHSMYyg8cpP608w":{"text":"Food was great! 4 ppl in my party and the lamb lasagna was yummy with an unexpected salad.","useful":0,"cool":0},"fVvrnf9u0tFj32eDvUydlg":{"text":"I once heard stumbling across a bad meal in New Orleans was like finding a unicorn.  Well ","useful":1,"cool":0},"3yUudZrLvVnTw6Xf4M8JTA":{"text":"Herbsaint continues to be our favorite restaurant in NOLA. The homemade spaghetti with gua","useful":0,"cool":0},"2tTyrN0KxloX39N1nsULaw":{"text":"Cocktails could be better, but the food is excellent. The Spaghetti dish is amazing. Gumbo","useful":0,"cool":0},"CvidBCuVtEBCTJNy82cCkg":{"text":"Visiting from out of town, and after some research, we decided on Herbsaint for my birthda","useful":0,"cool":0},"b-bZ6dgCc_KyUYJv5bjpuQ":{"text":"i had the \"Herbsaint Tomato and Shrimp Bisque\" and the \"Muscovy Duck Leg Confit with Dirty","useful":0,"cool":0},"IU12X9EVoY-4ljqWWlAN_g":{"text":"Recommended to us by a local, Herbsaint is a nice casually elegant restaurant in the Garde","useful":0,"cool":0},"cernt1kUkp00CGz3ypbRnA":{"text":"Starve yourself the day before you dine here, because you'll want to eat everything. We ha","useful":0,"cool":0},"hxU5kePSYP30eLONg7O2jQ":{"text":"When a group of my friends were in New Orleans for a bachelorette get-away weekend around ","useful":0,"cool":0},"e2Rw1TkvKGXLljbdz2hUew":{"text":"I really liked this place. Great flavor in everything. We were a party of four and everyon","useful":0,"cool":0},"Fq9yEZiLgecuuuEpbwNMog":{"text":"Great service.  Food Orleans style. Don't go if money is an issue. $125 a person for the b","useful":1,"cool":0},"DTP_cNM_4Kg3tA8_XgF6Qg":{"text":"Great meal; big groups welcome. We got the following: \n\n- short rib app\n- spaghetti with e","useful":1,"cool":0},"FJ6n7qBfHqrrbvp_lCWYwQ":{"text":"Visited here for a business dinner and could not have been more impressed.  The staff, ser","useful":0,"cool":0},"NOx0G2wngCvpyYzts6nlNg":{"text":"I am from new Orleans and have had many good meals in this town.  Herbsaint is average to ","useful":0,"cool":0},"beE-ISFAOrHhGTVXNG-ZAQ":{"text":"Cute little place located in Saint Charles avenue. Went in with my friends and we ordered ","useful":0,"cool":0},"-KoVqas3GGWAuMBNnCI6xA":{"text":"Yes,  Really, just yes.  Crab over beets as a started - really what an amazing combination","useful":0,"cool":0},"GI4SIYW2ACgUE1JoqsxRjw":{"text":"I recently tried Herbsaint with a friend of mine, who had wanted to try the restaurant for","useful":1,"cool":0},"XwH6GPH8lGRIalLgITZsow":{"text":"Great for lunch or dinner.  It's got a fairly eclectic nouveau American menu.  Delicious s","useful":1,"cool":1},"9bEhrJ-ip_MSoMP0OB8EZA":{"text":"Had dinner here with a girlfriend - seriously, one of the best meals I've ever had. Based ","useful":3,"cool":0},"_ucyHQPQpXPAER2fdKwRKw":{"text":"OH HELL YES, New Orleans. \n\nIf you are anywhere near this restaurant do yourself a favor a","useful":1,"cool":0},"zkIcDptmL2-Zly8nozFcxQ":{"text":"I have been visiting Herbsaint for many years and have enjoyed many family and business me","useful":2,"cool":1},"3R72bPIhwCoCFjhKJDUG5Q":{"text":"Really nice place! The food and flavors were solid and the experience was great. The bread","useful":0,"cool":0},"26I2jRYX4be_Z_qrsYEwvg":{"text":"We chose to do 3 small plates, to taste variety and leave room for cocktails and dessert. ","useful":0,"cool":0},"holrY-wrA3xB8PjoE35ITw":{"text":"Had a great lunch.\n\nThe spaghetti with the fried poached egg on top is still one of the be","useful":0,"cool":0},"6ZF_I2UHJZG_HdeCO7OjbA":{"text":"Dined here with work colleagues. Service was excellent. Wine recommendations were on point","useful":0,"cool":0},"XorR_q-S7LvjstvmQME0Sw":{"text":"Ok what can I say about this place. My husband and I are foodies. And hands down we though","useful":1,"cool":1},"_cPf-Y0NO4gVgsywLXPfFA":{"text":"Great meal with friends in early September.  Service was spot on and the food is outstandi","useful":0,"cool":0},"z8poNYY5LwGkapW5zjUk0Q":{"text":"Food was top notch. We couldn't get a table until 9:30 and the staff still delivered and a","useful":0,"cool":0},"0VcCZqdwL6dLYXlnsgrWmw":{"text":"I went to dinner here on a Friday night with my husband and his family. I was not impresse","useful":0,"cool":0},"Gt_1fFYYKR7-h0QYFlKY6Q":{"text":"My new favorite spot in NOLA. Im still thinking about and talking about the hot sauce and ","useful":0,"cool":0},"M6j6j3QgQBu6tqKPXmBtcg":{"text":"Vaunted during a business trip and can honestly say this has been one of the best meals I'","useful":1,"cool":0},"OVk45dcnmZ4zefQCB_uI3Q":{"text":"I never write reviews, but we went to this place last night and it was incredible. The Pim","useful":0,"cool":0},"AuBAxss4fzGcQ-V8AhdRhw":{"text":"Service superb. Excellent wine list. Hubby had the duck confit. Good not great. His chix a","useful":0,"cool":0},"TJw9G_c9Xm7i_KN97IKdIw":{"text":"This is my very first review, although, I frequently use the site for info. \n\nFirst our se","useful":0,"cool":0},"E8sVBkVvSCrFZQSgcDvL2Q":{"text":"A loud, crowded restaurant with delicious fare. We listened to a Texan pontificate about h","useful":0,"cool":0},"sVK4PJcwhN8drtHekRrmvg":{"text":"This was one the first restaurants we dined at in New Orleans and easily on of the the bes","useful":6,"cool":4},"5ZskhBvVBTdgsNch8E4fFA":{"text":"Good food, great location, nice service overall.\n\nHerbsaint was very accommodating when we","useful":0,"cool":0},"kfzvvx2SwYe7qSe6evC1LQ":{"text":"Our waiter asked what we thought of the appetizer; a house made spaghetti in a parmesan cr","useful":1,"cool":2},"lecZ-XeBNbQIfkrFYzNWjQ":{"text":"Just had a wonderful experience at Herbsaint! First of all, they accommodated my request t","useful":0,"cool":0},"a_HkvFGG6GknO_-nO6r9cg":{"text":"First timer. I love New Orleans food! Too flavorful! I can taste every bit of spice in it.","useful":1,"cool":0},"A6hvPuSFWYglOoI-NalMqg":{"text":"Ate here with a group of 8.  It was a busy weekend (right before the National Championship","useful":1,"cool":1},"lKhWiNyUeVeFP61DJW_mIQ":{"text":"Some restaurants should reconsider how proud they are! Credit card to make a reservation..","useful":0,"cool":0},"W5TmmjesZ5_QI3X1FKtNug":{"text":"Had a casual business lunch here.  Great food and service.  Would recommend.  Prices are v","useful":0,"cool":0},"_Bu2-FBu2KaBkDnz7nhA7g":{"text":"This restaurant is a gem. Wonderful ambiance. The bar is a show in and of its self. The me","useful":0,"cool":0},"N0ZSVNlH-1_TWsBevqAaPQ":{"text":"Love this place! The space is great and cocktails are a must! Love the tapas style / small","useful":0,"cool":0},"SHhzda5P3IZcWKY8oteG7A":{"text":"We went there on a fairly busy day, despite this the service was great. I got the gnocchi,","useful":0,"cool":0},"N0ScH9NXcjHthKPmo38M_w":{"text":"this was one of my favorite meals in New Orleans. I randomly stumbled upon this place and ","useful":1,"cool":0},"fGeZ1S7GL5XC-IYQU_b8EQ":{"text":"Great Food - Obnoxious Crowd - unfortunately we were there on a weekend night and there we","useful":1,"cool":0},"o-dBUlILHEn9-LDLk0PYNQ":{"text":"I just reviewed Cochon, so I had to pay due diligence to Herbsaint as well.  After eating ","useful":1,"cool":1},"9sdd_MwLZuKHebmfJ1MZgw":{"text":"This review is for cheese and dessert-well mostly dessert because who can screw up anythin","useful":2,"cool":1},"WCdK5ETKK4xmaM-kEGWCQQ":{"text":"This place was amazing! Went with my sister in-law and husband and she'd been there the ni","useful":0,"cool":0},"-CuHZX0au5M54nvVrRBLuA":{"text":"Excellent food, wonderful beer, friendly wait-staff and, well, it's New Orleans! How great","useful":0,"cool":0},"LarpUrFahGQjfOUKsCfGbg":{"text":"Literally nothing bad on the menu.  This place is top notch in everything they do. Excelle","useful":0,"cool":0},"btUj4a3wC0JH2SGRVomwYA":{"text":"We had one of the most amazing dishes I've ever had EVER at Herbsaint: the Rabbit Fricasse","useful":3,"cool":2},"H5DW0C4GM0ZHZCEi-CeOFw":{"text":"Fantastic restaurant, very classy and the service is impressive. They have an amazing caul","useful":0,"cool":0},"jQnDlbHIk8UfR1CJ3r7ipA":{"text":"I've come here twice- one for appetizers at the bar, and once for lunch. Both times the fo","useful":2,"cool":0},"1u4mNCYuaDYHy4UDjKejYg":{"text":"Fantastic meal. It took me months to eat my way through NOLA to make it here, but it was a","useful":1,"cool":0},"S_ZqSJsLpR1yLvqgz7uHJg":{"text":"This was a really nice experience but for the food it was overpriced. It wasn't a disappoi","useful":0,"cool":0},"gQlNxS7bAPN-yEcEpY8-Fg":{"text":"We went to Herbsaint for my birthday over the weekend. My husband had made reservations by","useful":0,"cool":0},"IkabI7Qv57skVP3K9BIeDA":{"text":"A lovely spot. I would definitely recommend this. I sat at the bar and dined for one as I'","useful":0,"cool":0},"3neTktzaquKOed7K2878tg":{"text":"In such a food oriented city, personal recommendations are always welcome. So, thanks for ","useful":0,"cool":1},"5jlEJvM8l79i2iVtpdsg3g":{"text":"If you a) are not a vegetarian or b) don't go with 200 of your closest friends, Herbsaint ","useful":1,"cool":3},"8n7tfQiDRfekfebJC2BeyA":{"text":"The excellent Cochon's sibling restaurant, this is a high-fat high flavor bomb of an eater","useful":2,"cool":1},"NK_cuPRwNezFpV7ubdyBGA":{"text":"One of our favs in the city was so disappointing.  Pork belly had the strangest flavor, ch","useful":0,"cool":0},"Y29je34lH2GKH_ZKviKcvw":{"text":"This is was a case where one bad dish can bring a four star experience to three.\nI don't c","useful":0,"cool":0},"YsiIGWp8RT3UphYTqKOV9g":{"text":"Wow, we had an amazing dinner here. To quote someone at our table, you know it's good when","useful":1,"cool":1},"0nIK8Jf6_p7_fN67DIIR9w":{"text":"A major disappointment! Four of us had dinner here on the 16th of Dec. Food was average at","useful":0,"cool":0},"-XC9veUyW58WLNmupDe73Q":{"text":"This was my second visit. I'll just say order the lamb and mushroom lasagna and leave it a","useful":0,"cool":0},"DpzXxZ5Tvm_VLy7NhVEVzQ":{"text":"Excellent food and service. Not a ton of vegan options but I managed to have a delicious c","useful":0,"cool":0},"6kO5f6AwD_INEHkHB8EsnQ":{"text":"Writing this as I'm eating here and this place is living up to my anticipation. It has bee","useful":4,"cool":3},"hLDRvK_QvGuoTqtl9n602g":{"text":"We happened to arrive early for our reservation. Unfortunately, that seemed to upset the h","useful":0,"cool":0},"9R2POqOYurNz_jfoX8TEHg":{"text":"My boyfriend and I sat in the very back of the restaurant which had a very romantic, dim-l","useful":1,"cool":1},"kAwNq_0ZS-CREmMCLkabXg":{"text":"I see only 4 stars? Are you kidding me? We just had dinner there the other night. It may h","useful":0,"cool":0},"rBHDQApMOcBojE3IGkSJ8g":{"text":"Everything was terrific. Food was excellent from small plates to entrees to dessert. The s","useful":2,"cool":0},"6GAXt8muRA5gum1QmpzSeg":{"text":"I danced around in my chair while I was eating. Damn, it was SO good! I can't have wheat a","useful":0,"cool":0},"ad33aYTz8EFH0LWyOrv05g":{"text":"Great menu, service and atmosphere. Easy to get a seat at the bar on a busy Saturday night","useful":0,"cool":0},"BDTUTXYS4kfLQ4DFJPGwIw":{"text":"Went there while in Nola for a conference. We mainly had the small plates, which were unif","useful":0,"cool":0},"tA0RvqWuegsPruq_ILdVuw":{"text":"I wanted to try one of Donald Link's restaurants during my first visit to New Orleans and ","useful":0,"cool":0},"5JFuK2AnSt-up5qojke2nQ":{"text":"I just returned from a visit to New Orleans with my hubs. Herbsaint was recommended to me ","useful":0,"cool":0},"XKnJOfA2oeMbo5IJxdnj4g":{"text":"When a restaurant achieves brilliance, shows promise and is never problematic, it's easy t","useful":1,"cool":0},"QGG1UA-9Q0Mg74PACguF6A":{"text":"This is one great restaurant.\n\n1) Excellent cocktails - I enjoyed the Kentucky Cat-5 - don","useful":1,"cool":0},"bhNrrEkRehIkGfyAwOp1nQ":{"text":"This restaurant was highly recommended to me. As soon as we sat down I spotted the biggest","useful":0,"cool":0},"Y905ZBzJ3NNhEQTjHYHOew":{"text":"When a restaurant is good all around there isn't much to say. I recommend trying this rest","useful":0,"cool":0},"ctmDq_Q53fyPB_CLO9W3tQ":{"text":"Stopped in here for lunch after visiting the World War II museum just a few blocks away.  ","useful":0,"cool":0},"AJBuOlUIpNjbvnCEnFhY5w":{"text":"This was a surprise lunchtime find for us tourists. Delicious, fresh sandwiches and small ","useful":0,"cool":0},"ecsZDppLvqpCWaIyclwYYQ":{"text":"Herbsaint was the perfect addition to our Mardi Gras experience. We shared several appetiz","useful":0,"cool":0},"BvoXkNJvpR4IvxhFrU-Cmg":{"text":"A strong four, and not to be missed on a trip to NOLA.\n\nWe rolled up 9 dudes deep, with a ","useful":0,"cool":0},"NNwxP5Eq2e1Wd1x7g6BaUQ":{"text":"Okay, so I know I rated a po-boy shop in the same five-star category as a fancy schmancy h","useful":9,"cool":9},"hwQOE-fp4dpm7yMzm1qX2g":{"text":"Wetted our appetite with a Cat 5 bourbon and a Pretty please. The Cat 5 was a good mixture","useful":0,"cool":0},"nYGafniQwmghEY6ZzTle_A":{"text":"Came for dinner with my wife on a Thursday night in February. Lovely place inside, but sin","useful":0,"cool":0},"Ox78CnrBbQuur3aCPtOGzA":{"text":"We were lead to this terrific restaurant by our foodie sister-in-law.  With the help of Ye","useful":0,"cool":0},"lHxZGl6yj7qf8cJCd8HzFg":{"text":"I hosted a group of 8 this past week and was hugely disappointed.  Maybe my expectations w","useful":0,"cool":0},"qfcgze7lX_DE4VwUKGpKMw":{"text":"I would give it 4 stars because the food was excellent and the set up of the place was ide","useful":0,"cool":0},"1tsr3FMdWG-RjxKXhjNQ2g":{"text":"Terrific Lunch. The gnocchi with pancetta and Reggiano Parmesan was rich and flavorful. Th","useful":0,"cool":0},"o1Ce1FTPAd4SW3vbVpMPng":{"text":"This was one of my favorite meals ever.\n\nWe had the gumbo of the day, soup of the day, cra","useful":1,"cool":1},"c-a63IdJhdEmkHUWyiJ9dQ":{"text":"Wonderful meal and almost perfect service.  The only issue we had was my wife bit into wha","useful":1,"cool":1},"37l8LmOl9xW4FVL7GFoAZw":{"text":"Herbsaint was an all-around amazing experience for me.\n\nI had just checked into my hotel a","useful":1,"cool":0},"NFPU-T9nl48sbC3EYWRR5w":{"text":"I can never say too much about this small neighborhood restaurant.  I never come to town w","useful":0,"cool":0},"i8Fb4AztERazCLbx5ETUxQ":{"text":"In preparation for our trip to New Orleans (a week ago) I asked my foodie friends for thei","useful":0,"cool":0},"oJ6ZmvNr2w6THg5TFXTF7Q":{"text":"Frankly. .. everything was good but nothing made me want to go back ... was still a good e","useful":0,"cool":0},"8Qs-ZRB4gccBOVmx2B9Z-w":{"text":"I went last night to Herbsaint with colleagues who are foodies and wine aficionados. Great","useful":0,"cool":0},"38cnR7dlIm6IhejK62Sb2w":{"text":"Terrific small bistro with excellent food. Wide variety of wines in the $50 range are a st","useful":1,"cool":1},"REo51UBsOXjlgXUCtKS2xg":{"text":"Amazing food and service! Came in with a party of 7 from Chicago and were treated amazingl","useful":0,"cool":0},"hkTDQ9rcR1kkXGpkClTjNw":{"text":"The menu was interesting. Food was salty. Not just one dish, all dishes. The worst part wa","useful":0,"cool":0},"opcFXceN3kJz0zfsbFnCzw":{"text":"Traveling wine makers are harsh critics, but I must say this is one of my favorite restaur","useful":0,"cool":1},"Y2ETwdjcD2SajDK88-9zlg":{"text":"Definitely come here for a special occasion or a date that you would like to impress.   My","useful":0,"cool":0},"M6DbaiY39dsnLPJQ6akXcg":{"text":"Sometimes good, sometimes not so good. Herbsaint is mercurial, but that doesn't mean that ","useful":1,"cool":0},"aUwl9sGtmkVCd_saNSk3Jw":{"text":"Fantastic dinner!  I was not expecting such a wonderful and innovative meal, particularly ","useful":0,"cool":0},"eHfl2j2W0EiXxLXmrOTqFA":{"text":"I came here two weeks ago with a large group of girlfriends. Unfortunately the service and","useful":1,"cool":0},"rzv-JA3bA_jCB67MEej69Q":{"text":"Good Service, Limited Menu, Vegetarian Hostile, and Lied About It\n\nWe visited this highly ","useful":5,"cool":2},"sqokpIARgArNfwbtqHn8ow":{"text":"Was pleased to return for another visit to one of my favorite restaurants in the U.S.  Unp","useful":0,"cool":0},"CaV92r1zyrRr5KBcf74UXA":{"text":"So good, it'll make you wanna slap your grandma down! The first time I heard this expressi","useful":3,"cool":1},"pZr9rfB0rADdAsUyL0aZdQ":{"text":"Outstanding, the small plate short rib and tuna are memorable, just perfect","useful":0,"cool":0},"caRq-H7yGzxug0QlExTM3A":{"text":"Exceptional food. Don't hesitate just go. Short rib was heaven. Pasta was amazing. The pla","useful":0,"cool":0},"293N2UH1BZ0FtZzxTc1wcw":{"text":"My fiancee and I were in NOLA on her birthday for a friend's wedding so I decided to take ","useful":0,"cool":0},"i5ckQMQR6fKnc7OMj28NRA":{"text":"Everything we ate was fantastic.   The rabbit fricassee small plate was full of rich flavo","useful":0,"cool":0},"Gn8T2vjdCrYRJEPOYX1Hdw":{"text":"I really love this restaurant! The service was very good and everyone was so nice. They ha","useful":0,"cool":1},"0WYryNqsRLs1HO8McAOMjQ":{"text":"Had the best short ribs of my life!!! Maybe best dinner experience in New Orleans EVER. Lo","useful":0,"cool":0},"visvqlGyVaDNDzlycYsxPg":{"text":"I wish I could go here and sit one day! my friend brought me back food in a to go containe","useful":0,"cool":0},"j2zhm4hWNppak-gJ2kRlVg":{"text":"Had a lovely meal at Herbsaint. We ate outside on the patio, and very much enjoyed the atm","useful":0,"cool":0},"rI3I9IikgBXDZYUpa6M71g":{"text":"We had a stunning meal at Herbsaint three years ago. Not sure what happened here. The gene","useful":0,"cool":0},"1HpwhAfJ0LUmfo4R9xTYFQ":{"text":"After reading the YELP reviews I made a reservation from home and we arrived from the airp","useful":0,"cool":0},"3teU-2er2baOXN_qcBNZoA":{"text":"The rabbit was a standout dish! If you're looking for fine dining at a reasonable price, y","useful":0,"cool":0},"8cu0ceUrw3MUYfJ5lfkBRQ":{"text":"Incredible food. Loved the patty melt and the crab. Great non alcoholic fruit punch drinks","useful":0,"cool":0},"HC_os6JRJaxE-995nBsmWg":{"text":"Based on food and drinks, I'd like to give 3.5 stars but since Herbsaint has the reputatio","useful":2,"cool":0},"tu_UK1vqnpyyW1QkYydDHg":{"text":"The pistachio and mixed greens salad was delicious, gnocchi melted in my mouth and sazerac","useful":0,"cool":0},"lCLMszwm5JyWyH70J-Q3_A":{"text":"This place is a high 3, low 4. The atmosphere is lovely and the staff was great. We did st","useful":1,"cool":0},"h4vvGzvHcLQ37YAWvBvg0A":{"text":"We had an excellent birthday dinner here. Special small plate of Louisiana grapefruit, goa","useful":1,"cool":1},"6-cRiDuVp--LiI1PQO6Y8A":{"text":"I usually believe that salads are overpriced at restaurants, but I would go back just for ","useful":0,"cool":0},"MZLXQA0Xr8TLsj8Vunh5ig":{"text":"This is a very charming restaurant. The atmosphere is full of natural light and very clean","useful":0,"cool":0},"tjP2lEGRtAYYrlivLKT4qg":{"text":"Four of us went on Friday night & it was not too good.  I had the shrimp with spoon bread.","useful":0,"cool":0},"-Qdxcpybcxo2VmRubehamw":{"text":"This was listed in the top 10 list of restaurants for NOLA. Service appeared to start ok a","useful":1,"cool":0},"U9OzSTFrbehb074J0EHdAg":{"text":"Normally I like to visit a place a few times before reviewing, but as my girlfriend knows ","useful":3,"cool":0},"LvFy4xIOqGTl7p4PzOcGrw":{"text":"I took my wife to Herbsaint last night for dinner and I have a mixed review. The food was ","useful":0,"cool":0},"NHo13IDNXnHd4ag74mnuTg":{"text":"Unfortunately, my boyfriend and I had a really negative experience at Herbsaint. We did ca","useful":7,"cool":0},"WjdfK5zaAYHXsPVL_5j8Pg":{"text":"Just came in for lunch and had one plate so not much of a sample size.  Ordered the cat fi","useful":0,"cool":0},"liQK5Nv3SpWWFM48nJ0ngg":{"text":"Really excellent place.  I've been a few times.\n\nThe service was exceptionally friendly on","useful":1,"cool":0},"Dbztmxc_FdIoscaIoPVv3Q":{"text":"We seemed to really enjoy eating at Link Restaurant Group restaurants (just by coincidence","useful":0,"cool":0},"DuaGc_GxSf5d0-Cqje6hPQ":{"text":"Went here on a date with my boyfriend and the food was delicious!! The place is cute and r","useful":0,"cool":0},"Zg8oJ9iwc0jbxkIgKLPi0A":{"text":"Has service really become the universal problem in top tier restaurants today? \nI'd actual","useful":3,"cool":2},"vuZ-KI8aHOQ2VmSE0Te9AA":{"text":"I hadn't been since the early days after Katrina (when it was fabulous and I was so gratef","useful":0,"cool":0},"sMJvoO0oHlCuTI9b2zj6qw":{"text":"Great place for lunch or dinner and has outside tables.  There is literally something for ","useful":0,"cool":0},"6Bi5WQt9bcFt-CP-qAxNeQ":{"text":"Great food and ambience - it felt like old New Orleans and not in the Gone With the Wind w","useful":0,"cool":0},"YGvM49eIYXc8V6idiEVO3Q":{"text":"Often when dining at Herbsaint I've been seated 30-45 minutes after my reservation.  Not t","useful":2,"cool":0},"TGImHw94Ga_iF-8ZRmqN7A":{"text":"Another terrific meal at Herbsaint. Great casual atmosphere without being too informal. Se","useful":0,"cool":0},"jSvXfbrnr9h1tuAWEsTyiQ":{"text":"Herbsaint is one of those (now) old favorites that occasionally falls from my radar yet al","useful":4,"cool":3},"pj30ly4avYnPhoVM27BjvA":{"text":"The small plates can be good but are inconsistent from visit to visit. The entrees are ext","useful":0,"cool":0},"5JMQsYxxFBPb0JM8VVY8tQ":{"text":"Great small plates and a creative touch to everything. Friends always seem to enjoy their ","useful":0,"cool":0},"qWO-PBGzyay4M9oyF4xMHA":{"text":"Having lived in New Orleans 2 years as a NYC transplant I feel like I'm always in search o","useful":1,"cool":0},"WU7BFdp9I8EnoYK6X7_lFw":{"text":"Hands-down the best meal, vibe, service and experience we've had anywhere in the US. We wa","useful":0,"cool":0},"_JDFY309d62-YqmIUxdqAQ":{"text":"We'd been excited to go for weeks, the first of 5 reservations at the best restaurants in ","useful":0,"cool":0},"VEzk-q6rAb4b3XSxVAGyRA":{"text":"My second visit. Great food, great wine list, impeccable service (all as previously). Veal","useful":0,"cool":0},"mr5AaHibFody3LpK0wmJcw":{"text":"One of the must dos on any trips is a nice dinner.\n\nHowever, this trip we decided the day ","useful":5,"cool":4},"zRKW8VIhSLpByGH2znc9Jg":{"text":"amazingly decadent dish. I will fly back to NOLA to have that again without a doubt. I enj","useful":0,"cool":0},"_-FDQrHWDb6m-NKdYVcsdA":{"text":"What can I say? This place did not live up to the hype, as much as I hoped it would. \n\nI w","useful":1,"cool":0},"WrkA2FHtLAAtn9JH49IWog":{"text":"Always great service and well- prepared dishes.  The ceviche was wonderful and the tuna sa","useful":0,"cool":0},"4RUjjcSu9jR3P6dWmuD0hA":{"text":"The pastrami sandwich is worth every calorie.  It was soooo good I might have to go back t","useful":0,"cool":0},"oWiDUWDgWANCvbGfTiEpZQ":{"text":"I had tried to make a reservation at Peche (another Donald Link establishment), but as it ","useful":0,"cool":1},"h2A9jIRB-FVgK3SgtljwzA":{"text":"Not much they didn't do right on a Friday night. Calm and helpful servers, to-die-for food","useful":0,"cool":0},"dI8Ou-M3PI-TXPnBldFfXA":{"text":"I had the fried catfish and the flourless cake for dessert. Loved both.","useful":0,"cool":1},"ncdJt-c9h0STSakpWELM3w":{"text":"I was here before Mardi Gras and before the Super Bowl with a group of colleagues in town ","useful":0,"cool":0},"VkkmT-RrdS4XmtkDQ4ejaA":{"text":"First ever meal in NOLA. So much flavor, really amazing. Had gumbo of the day with duck le","useful":0,"cool":0},"iy8Td2PxkhBGyCxFUKIYNw":{"text":"Best meal during my stay in NOLA. The watermelon gazpacho was so unique and delicious.  I'","useful":0,"cool":0},"gS7U5XtqM_T2Pv0KrGHT9w":{"text":"A nice location in CBD, on a corner with good inside and outside seating. Relaxed, elegant","useful":0,"cool":0},"g0uA_U1n_g58XUmACJSKYw":{"text":"Years ago I had a delicious flank steak and fries here.  I remembered it as one of the bes","useful":0,"cool":0},"4xp2tVWDsDkvjNML3FD_zg":{"text":"The duck confit was out of this world... Truly perfect in every way. But I am getting ahea","useful":1,"cool":1},"Q78g2nNDn83ew-8vr-bR2g":{"text":"Great service, dynamite food, excellent drinks. We had the gumbo, Louisiana shrimp and the","useful":0,"cool":0},"zRwIv0TPn7UEyzUmqqRNvw":{"text":"I'd like to comment on the food and the service here, but unfortunately, I can't.  I made ","useful":0,"cool":0},"J5FSkzJbo2LcpG-nyVfp3A":{"text":"One of my favorite New Orleans restaurants.  Although everything I've tried on the menu is","useful":3,"cool":0},"k_oxR2PAyD7jDw_rtJAk6Q":{"text":"Had the gumbo that was good.  I also had a salad with burrata.  Exquisite is the word that","useful":0,"cool":0},"irH1L7fxbI-z-l5npEbuqQ":{"text":"So the food measures up to what you've been expecting, great food that is made with real t","useful":0,"cool":0},"qr_fxXU8p0h1zFizy9OTNg":{"text":"My boyfriend and I came here to celebrate our 4 year anniversary. The restaurant has a chi","useful":6,"cool":3},"B8SvHBpgt3fy7RXMUWwB6Q":{"text":"Very noisy, but good food and excellent service.  We each had salads, which were tasty, an","useful":0,"cool":0},"czNXqCTJiSBm_556c-9QYg":{"text":"Aweful service! We made a reservation 2 weeks in advance and when we came in perfectly on ","useful":0,"cool":0},"rSMxezw9vRS4kYEU7hs-Ew":{"text":"On the positive side, meals were very tasty.  However service was less than stellar.  We h","useful":0,"cool":0},"B0BS2qODGAlcNuU1YQjxEg":{"text":"Love from the 1st bite! \nMy friend recommended this restaurant and I made a reservation fo","useful":0,"cool":0},"IvySrJoHjQHZdDb_L_WAuw":{"text":"We came here on a drizzly evening; it was kind of foggy and gauzy outside, which contraste","useful":0,"cool":0},"lUaXxHReXwqAYhq4mTnZog":{"text":"Amazing food. Great atmosphere. Fun outdoor seating! Will be coming back next time we are ","useful":0,"cool":0},"xDeCgRxBNUaAT_vt_UZo2g":{"text":"My wife and I had a lovely meal at Herbsaint.  The cocktails were inventive and deftly exe","useful":0,"cool":0},"trlHJepUGfQdCfD99V0jSQ":{"text":"The food was very good but the service was spotty.  I had the lamb special, which was good","useful":0,"cool":0},"552qJx4HBd0Bqn2JrTl22w":{"text":"First time I had frog legs and I won't forget it! Delicious...what was I waiting for? Thro","useful":1,"cool":1},"yQLu6jquPqmg2ai3PHpuZQ":{"text":"This bistro style bar/restaurant with its modern decor and well dressed staff set the stag","useful":0,"cool":0},"HDOBubhRqpa5dEON_kamTw":{"text":"Great food and amazing cocktails. Get a \"Lebanon, Kentucky\" from Ed at the bar.","useful":0,"cool":0},"10GIkYAfK8pdt5_zKfKTYA":{"text":"Just came from here and wow was blown away by the crab and gazpacho it was probably the be","useful":0,"cool":0},"g6YcTjGBSqicnVxd0BgYhQ":{"text":"My husband I came here for our anniversary dinner, and really enjoyed it. The ambiance was","useful":0,"cool":0},"QHRDQZjVNjrwNF9VB74kRQ":{"text":"Real good eats! Party of seven all left full and satisfied. The mains won't fill you up al","useful":0,"cool":0},"oqAp7trWxYgW25kkICfgng":{"text":"I enjoyed the food and service here in general however my grilled tuna sandwich had an oli","useful":1,"cool":0},"TTmnpVWtByVS32q6jqjD5g":{"text":"This place lived up to the hype. The gumbo was probably the best I ever had and the shrimp","useful":0,"cool":0},"MocHcvHMTuJdkKEmiMCFzQ":{"text":"Let me just say this past time I was at Herbsaint for dinner and it was so much better tha","useful":0,"cool":0},"UNzKCdx2a2PTO1fyEEDUEg":{"text":"Great meal tonight. I have Celiac and they were very knowledgeable and I has zero issues. ","useful":0,"cool":0},"QJXi7ERNdCu-TJ6m-dcyJw":{"text":"Absolutely Wonderful.\n\nI was a bit surprised.  I didn't think I would enjoy it as much as ","useful":1,"cool":0},"84aocJOdOV1p0b3hWG152A":{"text":"Excellent meal.  The short ribs were perfectly cooked- extremely tender and perfectly acce","useful":2,"cool":0},"RQ1dDyhzUA8NEf1Oo5Gx0w":{"text":"Easily one of my favorite restaurants in the city!  I've tasted several dishes which did n","useful":0,"cool":0},"ZO05SwIfkae-WpV23_iFAA":{"text":"Had a really good meal here on a Saturday night.  We only had apps and were VERY satisfied","useful":1,"cool":1},"kXUMwEp6FYRCpC3EzbUzQA":{"text":"A group of us came here as the restaurant was highly recommended by the President of our c","useful":2,"cool":0},"d1Y2WUjhYbQ7Ps5UuSFMUQ":{"text":"I found this place on yelp while I was in town for a conference. I am sooo glad I did! I h","useful":0,"cool":0},"O-qz0GwmUN4czmmIWIVaFQ":{"text":"Being a teacher in my mid-20s, it's not like I'm eating gourmet-ish French cuisine all the","useful":1,"cool":1},"o2Ts68NyLVAN8JF8wFUdag":{"text":"We made reservations and from the moment we walked in  everything went smoothly. Our waite","useful":0,"cool":0},"yMlHIMYlR_hyX2Udi1O6_A":{"text":"Excellent food and ambience. We were celebrating a special occasion and Herbsaint lived up","useful":0,"cool":0},"0NBEqjIwolt1keNI9UW_og":{"text":"This was our 6th visit to Herbsaint and as always everything was great.  We sat outside as","useful":0,"cool":0},"Zca-xAyMmywtQyd1yOQmJA":{"text":"This was a last minute decision and I am so happy that I made the reservation.  We closed ","useful":0,"cool":0},"24_xiG1e1_02QNmZdqIJeg":{"text":"Busy spot.  Lots of energy.  \n\nWent for lunch.  Maybe dinner experience is a little differ","useful":0,"cool":0},"Pw-6SL6azQbjb0yBsiXfJg":{"text":"The hostess said\" as you can expect we are running late\" as 6 of us arrived  on time for o","useful":0,"cool":0},"TkE4bhuB4uW6vxcH5eNF9w":{"text":"We all know New Orleans is full of fabulous restaurants...this one is a cut above the rest","useful":0,"cool":0},"dOxbHKvIvsULl3WcfBI9gw":{"text":"This is THE restaurant to hit of you are in New Orleans.  On this trip I have tried severa","useful":2,"cool":0},"iwqaVUuU88xR5zkDfKrl4g":{"text":"One of the best meals I've had in the city in a very long time. Don't miss out on the spag","useful":0,"cool":0},"HxxuaMthFKlm1VDKMxW92w":{"text":"Wow!  I was a bit skeptical, but this place was beautiful in atmosphere, food and service.","useful":0,"cool":0},"H6DC7b8ktfVu8Hu3wyi9bQ":{"text":"One of the top restaurants in New Orleans. Excellent service, extensive wine selection and","useful":0,"cool":0},"lvvw3K9inzSMJ-gehB-4MQ":{"text":"I love Donald Links restaurants... This was a disaster.  \n\nService was terrible.  \n\nThe ce","useful":0,"cool":0},"AOa6-X0CFJx35pxq-mqnlg":{"text":"For such a stuffy place (with prices to match), I expect much better service. I can get pa","useful":0,"cool":0},"z8jQmPL19rRaSbH2jb9roA":{"text":"Rich and decadent foods. Great open atmosphere. Good for lunch or dinner. Prices on the st","useful":0,"cool":0},"xFfdvE2cYEz1TDtPB7C1WA":{"text":"one of the 3 best places i ate in new orleans. went twice and everything was good, very go","useful":0,"cool":0},"kExgTIIpu1V_6GJGP8u6Kg":{"text":"I couldn't have been more pleased with this restaurant. The food was over the top. I had t","useful":0,"cool":0},"CLV0FIBzkKnSshaIswxcZg":{"text":"Superb! Stellar ambiance, efficient friendly staff, and excellent food.\nDid two dinners he","useful":0,"cool":0},"WR2REJS-NE45Zaw4lAf4gw":{"text":"Everything about this restaurant was impressive. Starting with the plum gin fizz (tart, sp","useful":0,"cool":0},"9_StcmDt79fPkY7DykI4vw":{"text":"Everything was great from the atmosphere sitting outside along the streetcars to the food.","useful":0,"cool":0},"xBRJ0HK59JGPl-lXlAcvvw":{"text":"Yum, yum, yum! \n\nThink this place is definitely Top 10 Restaurants of All Time. Yeah, it's","useful":5,"cool":4},"_TJh9c7AuHX0jeX1GuoraQ":{"text":"I had high hopes, but Herbsaint fell short of expectations, especially with regard to serv","useful":1,"cool":0},"zJJvVF2SYyEUvDJgOnsWYA":{"text":"I would pull this down a star.  Service very indifferent.  Had fish special, Wahoo, over c","useful":0,"cool":0},"ZS2rxwZXUfk4dYA9yX4NwQ":{"text":"I was really looking forward to this based on the reviews, but the service was really poor","useful":10,"cool":0},"GtupVV3Hsd0GxP4lATgYVg":{"text":"Came here for a birthday dinner on a friend's recommendation. The restaurant is upscale, t","useful":0,"cool":0},"PQ2hEbuFRgctwMTgHJdyUg":{"text":"When people ask me what my favorite restaurant in Nola is I always throw Herbsaint in the ","useful":0,"cool":0},"Y9YscTsrpfmvLb8HU_P6Wg":{"text":"so i went there tonight to be part of DineAmerica, i got the tasting menu which was a 4 co","useful":0,"cool":1},"x5Ke1HMArTP5nvY8RjhfHQ":{"text":"Our reservations for dinner were for 5:30p and the wait staff was finishing up their eveni","useful":0,"cool":0},"EuMzjpApz810VoZmMI63AQ":{"text":"We had a very good meal here.  It's very lively and it seemed to be full of locals having ","useful":0,"cool":0},"ZEo91HDZcpnISNpvFe2CLw":{"text":"Loved our Herbsaint experience! The food, service and atmosphere were top notch and we wil","useful":0,"cool":0},"er6vJ8SFIJVREDqV5pn2Kg":{"text":"We came to Herbsaint for lunch and they did not disappoint. Arugula, ham and cheese flatbr","useful":0,"cool":0},"JWy-2Xq2sUvkllPw-qNIRw":{"text":"Great ambiance and you can take the St. Charles streetcar there. Swordfish, lamb neck, duc","useful":0,"cool":0},"zfbOgrjfAAyYAXdf2o8dQw":{"text":"Very small dish even though they say \"Large\". Average tasting dishes, but I have to give c","useful":1,"cool":0},"xDyB9B_takF5IzH66ADkGQ":{"text":"fantastic dinner! it was our first anniversary and we are very pleased to have spent it at","useful":0,"cool":0},"nqF8MgVpRB2O5tmkte_r0Q":{"text":"Get the duck gumbo! Delicious! One of the most memorable dishes I had in New Orleans! We w","useful":0,"cool":0},"7W_77tBdhPKCCK5Z6Jaymg":{"text":"So delicious! My second time here. Husband had one of the best chicken and sausage gumbos ","useful":0,"cool":0},"aHvvkEu5M9AdKSJ_E6HnVA":{"text":"A forgettable experience:  In our recent visit to New Orleans, my group of Foodies placed ","useful":0,"cool":0},"mX7EHDRXxqa2ppHhRNkteg":{"text":"Was the first place I stopped in New Orleans. I knew it was going to be good when they had","useful":0,"cool":0},"adll_AmCwl7R6mTLUeWgSg":{"text":"Stopped by here for a nice lunch while in town for a conference. It was amazing! The menu ","useful":0,"cool":0},"1CRvOdXmv67g7mT7bP-QzA":{"text":"First of all, please let me say that the food and waiter service was superb.\nHowever, alth","useful":1,"cool":0},"hDddif6ss1Q56r3M2xKoZQ":{"text":"One of our best meals in New Orleans. Herbsaint has it all, great food, attentive service ","useful":3,"cool":1},"Ci2JwVvGaDBr_bP5Thgq0w":{"text":"Yum! Consistently good food and service. Nice beverage menu - at the time of my recent vis","useful":0,"cool":0},"CZJRSW4vYn6ERbrSOyH1mw":{"text":"rating herbsaint was really hard for me and I wish I could have given it 3.5 stars but I s","useful":0,"cool":0},"IP_ET1YolNOhtJmGmgN_6g":{"text":"So yummy and good. Definitely get the Greek Yogurt Cheesecake!","useful":0,"cool":0},"P49JRN3k8QJvhZ5XDtWECw":{"text":"So disappointing! Who'd of thought you could get a dry pork chop and snobby waitress in Ne","useful":0,"cool":0},"Xu3RS41BMp2iRAWAgOb0QA":{"text":"Our staff of six set out for a holiday lunch today, and we didn't even talk about work onc","useful":2,"cool":1},"RRVM4FAB-N6dSllzK_5Ltg":{"text":"A small place with a huge staff and lots of mistakes. The food wasn't bad but more than ha","useful":0,"cool":0},"sW4Kj005OYURFitwSIQ_0Q":{"text":"We had a very good dinner at Herbsaint during our long weekend in NOLA. As we are inclined","useful":2,"cool":1},"VOOigHF6YfmQ05t78Q2PHA":{"text":"As my cousin promised, you cannot go wrong with anything on this menu. Everything is absol","useful":0,"cool":0},"a7p8hN3wdqte20JFcR0Tmg":{"text":"The shrimp and grits were to die for. Also at the table - seared chicken confit, housemade","useful":1,"cool":0},"wpvbJ_Ts5GHRlIoV54jIsw":{"text":"We went for a fairly early dinner around 6 pm tonight- unfortunately unable to make a rese","useful":0,"cool":0},"Pw8LmcF0Wfc1h894Xo4Nlg":{"text":"I am too quick to forget about how much I like Herbsaint.  Luckily, I was reminded last ni","useful":1,"cool":1},"2BO387rQQuSqToN5c8HMFQ":{"text":"Lovely lunch in NOLA; weather cooperated and we sat at outside table. Small plate choices ","useful":0,"cool":0},"txlod6oP9sZ6c3CrYZkr1w":{"text":"Great food, very loud and kinda crowded. Table for 2 are small. Service was slow at the st","useful":0,"cool":0},"WfSlYbg9ksa-eFSOJMIAqw":{"text":"A great New Orleans staple. Always delicious food and good atmosphere. It is a bit of an o","useful":0,"cool":0},"BNQFaeu-f_W-ALBri-zXpA":{"text":"I recently hosted a group of 13 people here. I was impressed by the innovative approach fo","useful":0,"cool":0},"eyF2FQDpyKoFSH4gXo9uXw":{"text":"I ate here with some workmates after a tradeshow and it was amazing. We had the crabcakes ","useful":0,"cool":0},"8_Mb-eGh0GcEp_nU9s6vkg":{"text":"SO TASTY!  Seriously the best fried oysters I've ever had.\nSuper cool atmosphere + great g","useful":0,"cool":0},"sPZBPBQ5ErISuFndP0kJHA":{"text":"Get reservations well in advance if you can.\n\nLacking reservations, we popped in for drink","useful":1,"cool":0},"NxPvDt1o4EzcoBey8z36hQ":{"text":"Delicious. Tried a little bit of everything on the menu with a good size group. Fancy name","useful":0,"cool":0},"jJA5mCwxUvAT5d92BktUPQ":{"text":"Good service, high quality cocktails, quiet ambience in the late afternoon. Started with a","useful":2,"cool":1},"Eh47mkD9wOt684rHoV9e3w":{"text":"Herbsaint is my first choice for business lunches because of its wonderful food, prompt se","useful":0,"cool":0},"jqe6rZZJNHOqrhwCWwJz_Q":{"text":"Wine\nStarted with a Gruner Veltliner from Kremstal which was a bit creamy very acidic, but","useful":1,"cool":1},"RWt54m29VmlgxIA5--C8KQ":{"text":"A local recommended Herbsaint for their gumbo. I'm a gumbo freak, having grown up on the G","useful":0,"cool":0},"0YybS-iOsS90W6upklnScA":{"text":"My boyfriend and I came here for dinner while we were in town on vacation. The table was i","useful":1,"cool":1},"hZy6jNiHk1134d0uY4Njmw":{"text":"Weekday lunch outside at Herbsaint is a 5 star meal!  Innovative menu; great presentation ","useful":0,"cool":0},"auaX5fr-Cdbzp8OSfj-k_Q":{"text":"Went here for dinner the other night on a friends suggestion, and let me tell you so happy","useful":0,"cool":0},"mSqsXCLs9FVz9UnOslB8Jg":{"text":"Nice spot on the patio and really yummy food but one of the waiters charged us for a drink","useful":0,"cool":0},"W2CJIAeZEIOGvW1xRlV1fw":{"text":"It's good- really good. Outstanding, actually. My star off is that the place is so caverno","useful":0,"cool":1},"t3mFnpNgmrmqqqXs-UQR2Q":{"text":"I tried a lot of French restaurants in NOLA, so many recommendations that there just wasn'","useful":0,"cool":0},"jgrFeOyO-evZbm56vb1Keg":{"text":"This restaurant has an other level of quality, plate after plate was getting better than t","useful":0,"cool":0},"mF_g3FTxTI3OqUEStPxZsA":{"text":"At the start, hostess shows us to table but doesn't pull out table so my wife can sit down","useful":0,"cool":0},"d84dPZd5INq64EuMkF78Gw":{"text":"The food and wine at this restaurant were good, as well as the service. However, being sea","useful":0,"cool":0},"iTu06PDtLlmZXVHZ_V5tMQ":{"text":"This place was very classy, I loved the servers uniforms. We were served soft bread with a","useful":0,"cool":0},"hWhDYq-h47UVvFFa5LitfA":{"text":"My parents took me here for my birthday. Everything was delicious! There were some unique ","useful":0,"cool":0},"H53SxFmk8_2DQKTDm5cSCA":{"text":"Stumbled upon this GEM when wandering around the 5th circuit federal court building.  Amaz","useful":0,"cool":0},"mDvfKhYSPIw2NWHU3YHdgw":{"text":"Way overrated. An overpriced Ruby Tuesday's. Young unprofessional staff is aloof, confused","useful":0,"cool":0},"7LLLS5wfj2CA3uCyBQxqsw":{"text":"Five for food, four for decor and a surprising three for capturing the Indifferent Service","useful":0,"cool":0},"Pcg9OEVO2nS1yvHXqt018w":{"text":"Terrific restaurant.\nAwesome wine list.\nLoved the crab and pea dish and the spicy shrimp d","useful":1,"cool":1},"fVfOIwBVOEIe2-xuzkkElg":{"text":"I've been living in New Orleans for over 20 years so I know the food scene in this city we","useful":0,"cool":0},"5-Ql1RPbDpdtvAETdBzOcQ":{"text":"Another New Orleans Favorite! \n\nI'm a huge fan of Creole cuisine and culture (pre-American","useful":0,"cool":0},"b1ogcBdBgDA0cJbvN9Wszg":{"text":"A wonderful cafe with great service and delicious small plates. The lump crab appetizer is","useful":0,"cool":0},"izQTsRfZuUqvuqfy28nilA":{"text":"Nope, nope, nada....never again!\n\nWe had dinner reservations for a table of four and were ","useful":1,"cool":0},"C-M5NJt7sTXyIJV3mmyTSA":{"text":"This place was a disappointment. Giving it two stars because the service was fantastic. Th","useful":1,"cool":0},"k8AJoM3jhUr2C3Q82eredA":{"text":"The Duck and Goose  Egg Creme Bruleé the very best ever!!!!\n\nWhat a fabulous find - very i","useful":0,"cool":1},"ZAScaAYmN9d22Y8xwOg-JA":{"text":"Herbsaint was truly a great dining experience.  The waitstaff was attentive, relaxed, and ","useful":1,"cool":0},"MJtgYglYVA1GMHhYC92jEQ":{"text":"This was our third dinner of five following Broussard's and G W Fins.  Restaurant August a","useful":0,"cool":0},"7T10vW4dzBe9RA_Y1qKKxQ":{"text":"I would give this restaurant a 3.5. The service was a bit slow, and the meals were good bu","useful":0,"cool":0},"GFH0OMuRQuohpeHGfLokCw":{"text":"I truly enjoyed our meal here! I started with the Watermelon Caipirinha. It was the perfec","useful":1,"cool":1},"REwGQgTpOpJ-bYJFQQ6dag":{"text":"What's all the fuss about? Herbsaint was definitely good. However, it didn't blow my socks","useful":1,"cool":1},"QOHMgSOkwtIrT9iC3EfVTQ":{"text":"Ambiance and staff were great.  Appetizers and desserts were awesome as well.  Entrees (or","useful":0,"cool":0},"9Ie7mZXHeIoAusXfBSw7dA":{"text":"Tried to make reservations for 8:30, but was told the only availability was a table near t","useful":0,"cool":0},"Iy7Z2Wn-huiwqYsoQ6FQ7A":{"text":"Truly one of the better dining experiences you will have in New Orleans.   Fantastic wine ","useful":0,"cool":0},"H4VmeN7MXd_M3iIIhNxHdQ":{"text":"We started with salads and gumbo and then stuck with the small plates here and it was a hi","useful":0,"cool":0},"kuFcbAnezCwzSzJx8epqww":{"text":"I was hanging out in the Ace Hotel lobby and realized I hadn't eaten much that day. Some f","useful":0,"cool":0},"khzBmHCXLKEqSUI01SuHKQ":{"text":"I was not impressed with this place. Went here for a special dinner once, and I'm sure it ","useful":0,"cool":0},"m1cJi-rcehP7TqVCDoHvKA":{"text":"The waiter recommended the duck confit. It was beautifully presented, but was so salty I c","useful":0,"cool":0},"ltW2cfXeXBjphiLBqcOsaA":{"text":"Very seasonal and local cuisine.  Very little of anything healthy on the menu, though.  If","useful":0,"cool":0},"Xe8UoeFEid0Y-b0nQ_LP3Q":{"text":"I ordered the salad with the homemade spegetti with the fried poached egg on top & my fian","useful":0,"cool":0},"wHW_PwZLtLusEz6Ud9kS0g":{"text":"We were here on June 16th for my birthday,  I mentioned to the server that I had celebrate","useful":1,"cool":1},"IkNp1NTU1rLv33zsScOMMQ":{"text":"pork belly, creamed corn and pickled peppers.   a complete YUM.  enjoyed the salad, the ra","useful":0,"cool":0},"csl232vi1dc6dIFawH5AdA":{"text":"It's really something to say we were thrilled by dinner here after a full day of walking -","useful":2,"cool":2},"2gI4u2kBxzeNS717egGvug":{"text":"I am underwhelmed by Herbsaint.  I had strong expectations for Herbsaint, and unfortunatel","useful":3,"cool":0},"QYEc-PNYWwmEtKXNZrEyfA":{"text":"Another one of my must haves in New Orleans. If you want to stay in the CBD area for dinne","useful":0,"cool":0},"Y_1LaDB75XmvEqhwe6wYqg":{"text":"Wow! all of these reviews and not one person has mentioned the Brown Butter Banana Tart. T","useful":1,"cool":0},"VSXICpKnhVPyrcDmyc9_GQ":{"text":"First meal in N.O.     Average.  Only average.  Great table, great waiter.  We had the spa","useful":2,"cool":0},"fWriyjsiXqPCGK6qspUjZQ":{"text":"This was my favorite restaurant during a recent trip. After all the heavy cajun food I was","useful":0,"cool":0},"yLo-RBh6UputIlPhYF9D2g":{"text":"3.5 because I can't give it a 1/2 star...I have to admit the ambiance was delightful: cont","useful":0,"cool":0},"p3qRgTgfKyRkjjwgmzUoGQ":{"text":"Well this place a MUST!  In a town so saturated with top notch restaurants, Herbsaint ALWA","useful":0,"cool":0},"fCC0AMY5cK6U7RnCVc3PAg":{"text":"Even the leftovers were delicious.  Scratch that.  The leftovers were BETTER than they wer","useful":2,"cool":1},"ZBw6qWgVLJ2nntAptQ-etA":{"text":"Food was amazing. Atmosphere needs work. So loud you couldn't hear your self or anyone els","useful":0,"cool":0},"KI0tLzA0to3UWqxX8MDnMg":{"text":"Delicious, nice wait staff, didn't put us in a corner when we looked slightly bedraggled. ","useful":0,"cool":0},"WD6zP9mKQTnE1jZP_Lby2Q":{"text":"The food here is great! I ordered the jumbo shrimp for my entree and fried apple and cherr","useful":0,"cool":0},"M7I5BahFK25B8scS2sfh3g":{"text":"Wow was this place awesome!\n\nI came here last week with my family and was simply blown awa","useful":0,"cool":0},"4Pm0Y9GfzA4_K2eRABnDEg":{"text":"I had a very excellent meal at Herbsaint.  My friends and I came for lunch and we didn't q","useful":0,"cool":0},"0oM_BHeA5OpbhiJvzvxx7A":{"text":"When they say \"small plate\" in the menu of herbSaint they aren't kidding! The rabbit frica","useful":0,"cool":0},"I-WlwWC__xT7kKOlPrhPfQ":{"text":"Loved the quaint, small table atmosphere. We had a 8pm reservation on a Saturday night. Wh","useful":0,"cool":0},"cOMxEJMtXaMxpuu6cpQiUw":{"text":"Recommend the:\ngumbo\npasta with panko fried egg\nduck confit\n\nLove the bread. It's dangerou","useful":1,"cool":1},"eqlXzh_EQgDuzXG4X7XSkA":{"text":"I am not one who usually complains or gives reviews but I believe that this experience war","useful":0,"cool":0},"HksuQS364NwryOa-LRxQ9Q":{"text":"I did a large group dinner here, and the food was great.  Out of the 3 options we had - th","useful":0,"cool":0},"1Xq9mzx1Jc1sm7w6yK6XfQ":{"text":"Great spot.  The chicken and sausage gumbo, homemade spaghetti appetizer, rib eye steak an","useful":0,"cool":0},"H526zjB9MHt_8oje20h_FA":{"text":"Generally bad service.  Asked for a table for 2, we were told the empty tables were reserv","useful":0,"cool":0},"T4pz3Xcf_qJw6aijOUuBiA":{"text":"Ordered all of the small plates. Especially loved the  Baked Asiago, House Made Spaghetti ","useful":0,"cool":0},"fpWavDioi3mOTvZBcPJPew":{"text":"A much anticipated birthday lunch left much to be desired.  I must say never having Chef L","useful":2,"cool":0},"Kjdgo2Zp7XcsZlvAleiSNg":{"text":"Certainly our finest meal in 4 days in New Orleans, and the only way we got in was because","useful":0,"cool":0},"SoHZbe4l6MyAhh2dp63Uww":{"text":"I really enjoy Herbsaint each time I've eaten here.  The food is incredible, unique withou","useful":1,"cool":0},"Tb1uxPaU6Zq6OgpLXqQ0hw":{"text":"I liked this place for the food. The service was spotty and we were seated next to a huge ","useful":0,"cool":0},"N-L7FgtgSoNpvPOVNWq53w":{"text":"Expensive but worth every penny for a splurge here.  As in most good NOLA restaurants the ","useful":0,"cool":0},"-gf1Vg2kTp8O5qLhOTSG5w":{"text":"We made a reservation to eat at Herbsaint over New Year's weekend and were really looking ","useful":0,"cool":0},"KFoXHbxAwe0MV_sV51neZw":{"text":"Great first night dinner. Sat in the back near the wine storage which was a tad quieter th","useful":0,"cool":0},"2dt-z-id6G2NtzWRnNmMoA":{"text":"Amazingly delicious, waiter made outstanding recommendations. Homemade pasta was cooked to","useful":0,"cool":0},"_TJtGimv57uy30xbACFJtg":{"text":"Jon and I went to Herbsaint very last minute. I was eager for outdoor French food, and he ","useful":0,"cool":0},"mA680VDbDiFbTJXS6jwwuw":{"text":"This place is truly once in a lifetime meal experience. I ordered the fiedo noodles with l","useful":0,"cool":0},"9PXTgBpRaGuAJ1ljwemNmA":{"text":"I can honestly state that this is the best restaurant I've ever been to in New Orleans. It","useful":2,"cool":1},"lOJQA3iUGC9D5Wkpq_0TRw":{"text":"Been here a few times and every time I am blown away with how amazing it is. I highly sugg","useful":0,"cool":0},"wH0c0PeFoFvRBfk5k9ifFw":{"text":"Good food. Good service. But we sat down at 1:45 and they were no longer serving lunch eve","useful":0,"cool":0},"mstICPosCnI2Gs_bJn3k7g":{"text":"Nice little place. We were waiting for a manicure appointment so we stopped over for a dri","useful":0,"cool":0},"BYPfemX_620nAx_rXb6bJw":{"text":"Actually more like threee and a half stars.  We went to go eat right before the Sparta par","useful":0,"cool":0},"DPDSp8Z5oPZ7CzlTircG6A":{"text":"After a completely dismal experience at Acme Oyster House we decided to stop at Herbsaint ","useful":1,"cool":1},"kZdATZxm1zWrfS7Qgdg9WQ":{"text":"Best evening in New Orleans! Greatest Sazerac ever! Phenomenal food served with true hospi","useful":0,"cool":0},"1KSVZU9-nJCK_YDhGtFZPw":{"text":"Extremely busy and very hard to get a reservation unless you call a few days ahead. The fo","useful":0,"cool":0},"qRwV_OvcRdXk3R0Org3HHQ":{"text":"The meal was superb, nice atmosphere, and decent service.","useful":0,"cool":0},"9gYtTd_HyzC0Uuvm__NCxw":{"text":"My experience at Herbsaint was fantastic. My husband and I went on a date there during our","useful":2,"cool":1},"MBx90wA1QkBks4dpkrmFiQ":{"text":"Wow x2.\n\nOn a 3 night trip to New Orleans, this was our final stop. Each night, the food g","useful":1,"cool":0},"QFuEi6NRZePHAot5Gd3Xsw":{"text":"Making my way around New Orleans to eat since I'm here for work and gave this place a try ","useful":3,"cool":0},"LtXb6Lbg1UhwWhlKCSTPew":{"text":"The food was good, the service was not.  We were a large party with a reservation .  We we","useful":0,"cool":0},"K7pMRUennFxTCdlLSct46g":{"text":"This was my first time eating here, and to be honest it was delicious. The wine selection ","useful":0,"cool":0},"9cRxHLVcH1EYBxXb91bzMw":{"text":"It's a Donald Link place, so you know it's going to be up there with some of the best rest","useful":5,"cool":2},"nw_lc0aqOfStLAIrsjLvGg":{"text":"We ate here right before a show at Le Chat Noir. The food is good, the setting nice, the s","useful":1,"cool":0},"CbEO_od4cXMUWBEJElfEzQ":{"text":"Delaney the hostess was amazing!  We called knowing we were late making reservations, but ","useful":0,"cool":0},"4TD2ksl3V_m3tgnAcP_XtA":{"text":"Menu is oversized. Literally.\nVery loud! No sound buffer, hard to hear our waitress who al","useful":1,"cool":0},"1B6s9KhyyquWyRBwj-2yxA":{"text":"I really want to like Herbsaint, as it has a fantastic location and great ambiance, but I'","useful":5,"cool":2},"XDbZHixGEnYqT-b6vDyVRg":{"text":"The food was very good, but not exceptional by New Orleans standards.  Our party of 2 was ","useful":0,"cool":0},"IQWXTZqvJ4Mfwb9f_nuMLg":{"text":"I've only been to Herbsaint two times or so.  The food each time was great.  But they will","useful":0,"cool":0},"rmJbEGFE1vYu53TVyPeQ-g":{"text":"It seems like the place is a bit overrated. Food was ok but service was lacking.\n\nI ordere","useful":0,"cool":0},"fL8NyGT10f69vfN2lBgjJg":{"text":"Great service, great room, great food, great experience.\n\nThe drinks were inventive and ta","useful":0,"cool":0},"p6IJOkhsh0XfeWdC4AJ8Ng":{"text":"The place was busy on a Thursday night after Mardi Gras.  The service was really very good","useful":2,"cool":0},"yrzTKZZPEqdzm_xlqroIww":{"text":"I second the previous review: Cochon is much better and more fun. The appetizers and early","useful":1,"cool":0},"6d4zBMJxvUIveihLYcUr3w":{"text":"The food was fantastic. I would give this restaurant a higher rating if the service was be","useful":0,"cool":0},"cOvy-BHpLOSjTwI5eSOeeQ":{"text":"The glimmer of distant stars. The brilliance of streaking comets. The birth of new planets","useful":6,"cool":4},"erwMMjr-FOw74fn9ySReZg":{"text":"My entree, the steak and potatoes, was outstanding. Truly.\n\nThe bread was warm, fresh and ","useful":1,"cool":0},"hg5XC49Q81sL8p6dMv9W6A":{"text":"We stumbled onto this unassuming little gem at lunchtime - having escaped the gaudy insani","useful":0,"cool":0},"9jCatbPL8NpYM-niBp5azA":{"text":"We recently visited Herbsaint because Donald Link's reputation. We enjoyed the food, howev","useful":1,"cool":0},"_6yRwg1NAZ5W7wEncwALLQ":{"text":"Amazing food and atmosphere.  Eating outside here on a beautiful night is the best.  Don't","useful":0,"cool":0},"7BjjeJl28wjq9FsokRYrtA":{"text":"Excellent food, great service. Can't wait to come back again. Drinks were also great and b","useful":0,"cool":0},"cUyoQIb9FscMtfK4YQF-qg":{"text":"I ended up here because it was very close from the hotel I was staying at and people I was","useful":1,"cool":0},"kwLmV4QnKyq4kBPgESsj0A":{"text":"Our dinner plan was preset for Cochon.  Unfortunately, when we arrived at Cochon, we were ","useful":0,"cool":0},"fGKaMdoQWFyjhGaEadlSVA":{"text":"My husband and I ate here on our honeymoon after a recommendation from a friend. It did no","useful":1,"cool":0},"Xc44uVN47dGBQ1LEXmbm4w":{"text":"Went for lunch but have been there previously for dinner.  This is a really great quiet li","useful":0,"cool":0},"r1urmjqGepovmBVJRhSOsg":{"text":"Ordered spaghetti, short ribs, gnocchi, chicken, duck, fish of the day, and steak. Also go","useful":0,"cool":0},"_fjF1848kEwUKODPE-RMcQ":{"text":"Four solid stars for Herbsaint.\n\nWe had a business dinner for 6 people here, and really en","useful":0,"cool":0},"TxWYHSS_dR215xJaaVIBSA":{"text":"Excellent food and service! The crab beignets were light, flavorful and one of the better ","useful":0,"cool":0},"kl4bHHAtXGFJjvNFEkY86w":{"text":"We came here for desserts. The desserts are to die for. We got the flourless chocolate cak","useful":1,"cool":0},"WOSFDf6WFkkUATuuU52n2A":{"text":"We came here on the recommendation of some local bartenders. It did not disappoint. The po","useful":0,"cool":0},"KRcIffMzWBidcbi-NijzPw":{"text":"Had a delightful meal here for my 37th birthday.  Generally, I'm fairly... judgmental (INT","useful":1,"cool":0},"mQr-JfRldsJGtddgMLytOg":{"text":"I think Donald Link is one of the most talented chefs working today, and Herbsaint is an o","useful":0,"cool":0},"dyvLt9B_W62rUp4LwYP9_A":{"text":"I love Peche and Cochon but had not tried Herbsaint --- I was missing out! I had the grill","useful":0,"cool":0},"XBWYciEaOgZ8XukmSr2XVQ":{"text":"Stopped here on way to Garden district.  Cute spot.  Split a shrimp app that was so so yum","useful":0,"cool":0},"eTbtemtKI2YLsIrU4IGL4Q":{"text":"Donald Link is a brilliant chef but his restaurant management skills leave a lot of room f","useful":0,"cool":0},"aBnnZhOXp2mK44sHeVlu-A":{"text":"I came with a large group of co-workers and the only place they could seat us was on the o","useful":0,"cool":0},"5wWd57o9i5SvNrjDm1JfQQ":{"text":"Went here for lunch on a Thursday and was really impressed.  I think of all the places we ","useful":1,"cool":1},"w4sQFwIKcN1pEMuu93Ae_Q":{"text":"Don't be dissuaded by the three stars I am giving this lovely little eatery on St. Charles","useful":1,"cool":0},"leLKenn-6HeLlzlkH8umEQ":{"text":"First to start off our server Lauren was AWESOME!!!  She gave it a go and really impressed","useful":0,"cool":0},"7uoKTnpCvOG82SrYLeQtoA":{"text":"I was disappointed with my visit to Herbsaint.  First off, the restaurant smelled like fri","useful":1,"cool":0},"TqsIQw-Ghh59k34j8A-v4Q":{"text":"Honest food prepared exceptionally well. I very much enjoyed the poached tuna and today's ","useful":0,"cool":0},"MKV02H5gTMTcAFP-mtXgVg":{"text":"This place came  so highly recommended.  It was disappointing.  We had a late reservation.","useful":0,"cool":0},"amGvU5nANm3WL556JaTcug":{"text":"Great food but the management and servers were very selective in who they were nice to bas","useful":0,"cool":0},"LvqxsKp16fiFVDFqyZ15IA":{"text":"They are pros....nothing happens by chance at a restaurant of this quality.  Had a lunch o","useful":0,"cool":0},"5z6NqVDj2L58rkdneaPWfA":{"text":"This place was confusing... great chef... great pedigree, but the worst interior you could","useful":3,"cool":1},"bwZH2AoghXTkFgiYcdhf2g":{"text":"mmmmm.... seafood gumbo, fried brussel sprouts, and duck confit over dirty rice.... some o","useful":0,"cool":0},"Jn8xAulxDfGc0ty1Gppm_A":{"text":"Every dish is incredible!\n\nI love this place. I love how Donald Link is clearly a New Orle","useful":1,"cool":0},"MYl9qCqNjixcPkQCu7L7og":{"text":"Very disappointing.\n\nOur server was super nice though, added the extra star for him.\n\n-The","useful":0,"cool":0},"o4b-R8imLpkAMkmp0pT7-A":{"text":"Nice casual ambiance. Solid waitstaff. Not too noisy but a good busy vibe. I was seated at","useful":0,"cool":0},"ebZPrqDY3uUsseYrq6gtaw":{"text":"I agree with several of the other reviewers here, Cochon is a little better, but still - H","useful":0,"cool":0},"_EC1f9QIRoBv51S1W_D4JA":{"text":"One of my favorite restaurants in New Orleans.  Some of the best short ribs I've ever had ","useful":0,"cool":0},"1J9Pf4N6mF-I9b3-VGXaRw":{"text":"Great American Bistro menu and well balanced cocktail selection. House made spaghetti, rab","useful":1,"cool":0},"Kb5joAQI3BTIpc2idLDVGw":{"text":"Oh- so Outstanding. I had chicken andouille gumbo and the field greens salad and both were","useful":0,"cool":1},"RyihNI-5ZFay_hkUjjAljg":{"text":"I've never been 'wow'd' by Herbsaint. Maybe they've just been \"off\" on the three occassion","useful":1,"cool":0},"Ynhz1mBWF_TC-Q-aM6bd-A":{"text":"Absolutely top notch all the way around. Herbsaint does not disappoint, even with VERY hig","useful":2,"cool":0},"AKr7nYz1OIYgCZPGq9BovQ":{"text":"Really 4.5 stars...Delicious!  Go right now.  Menu is original, cocktails tasty, and the g","useful":1,"cool":0},"D49noYrKhIDR55eMPp71XA":{"text":"You must try spaghetti with poached egg.  Amazing sauce!  Soft shells were a little heavy ","useful":0,"cool":1},"SZZ88dx56x2VBjs01WzhVg":{"text":"The menu has something for everyone!  The dining room was vibrant and energetic and the se","useful":0,"cool":0},"c05MNbdtrbsPPeDNpk1xfQ":{"text":"Just amazing. I chose this restaurant for a birthday dinner because it had so many 4- and ","useful":0,"cool":0},"-4RmcC3PnZyg3o1FMGYBsw":{"text":"Excellent food, mediocre service.  \n\nDrum is excellent, but the sweet potato bread pudding","useful":2,"cool":0},"5QuAl22hOUIAyxM5YCwmWQ":{"text":"Thank you United Cab for making me late for my dinner reservation...not just 5 minutes...b","useful":2,"cool":1},"q_xMO6WdVYajxR6UJzbqHg":{"text":"I've been here quite a few times for dinner, and it hasn't ever knocked my socks off.  The","useful":1,"cool":1},"WiZgeV7I9xM6trf-BGJ8KQ":{"text":"We have been here twice over several years and find it to be a solid 5 stars each time.  O","useful":0,"cool":0},"p0Y5B0SslTOeX9BePCZ0Nw":{"text":"Probably more like 4.5 stars. Excellent service at the bar. Great cocktails. Food was some","useful":1,"cool":1},"DzCiuOZOvkaZ-NSw5H4o0g":{"text":"It definitely did not live up to the hype.\n\nWins:\n- Location\n- Decor & Build out\n- Cocktai","useful":0,"cool":0},"jyQw1f_OJWYu0xk3fIp5UA":{"text":"We have eaten here twice and I don't get the hype. We went once and had a terrible experie","useful":2,"cool":0},"KKtd1azdbklAk8SqzlGmrg":{"text":"Great service from a knowledgeable staff will help any diner dive into this marriage of Fr","useful":1,"cool":1},"yEY4T11W2zSw8UHe1z3gYw":{"text":"First caveat: Technically, if half stars could be awarded, my review would be a 3.5 stars.","useful":4,"cool":3},"N27sWB8O-DY7mYF_H1rtGg":{"text":"Such a wonderful place. 5 years ago we had a magical evening here at a sidewalk table and ","useful":0,"cool":0},"VvL3jaElJ3s-_0L8aaXk9g":{"text":"seated on time (early)\nbread: very good\ngumbo (chicken and andouille):  best I have had in","useful":0,"cool":0},"P6z3-8awspG66Am-RzPpLQ":{"text":"This place was good, but we had better food in NOLA.  I think this place is a little hyped","useful":0,"cool":0},"KSqpY_sf5JwzMtDoUTN65A":{"text":"K took me to Herbsaint for my birthday dinner. I don't know why it took me so long to eat ","useful":1,"cool":2},"f8AO2-sIMXGmc84peRsRTA":{"text":"Yum yum yum! Got a chance to stop in for lunch and loved everything I ate and drank. The S","useful":0,"cool":0},"6YwlRK-9PhzEfRxAWnyDww":{"text":"Sometimes ordering chicken at a restaurant will surprise you. Herbsaint was an excellent c","useful":0,"cool":0},"dmebNMj1fU0-RAOe0PDoUw":{"text":"Great meal and good service.  Had a selection from the menu and was impressed by the diver","useful":0,"cool":0},"vCStQKPHi57XiXMXKJIsQw":{"text":"Such a lovely restaurant .. We sat outside, it's very romantic except for the occasional t","useful":1,"cool":1},"9Y9q0YNFd0G1SGpPF5IcYA":{"text":"The atmosphere was quaint. The service was good. We enjoyed the house made noodles with a ","useful":0,"cool":0},"ksbRFMk0c8DQoBl-7gHY2g":{"text":"Outstanding NOLA dining experience!  One of my all time favorites in New Orleans.  Excelle","useful":0,"cool":0},"CT-iG-mJp8oBItngYSq_wg":{"text":"Finally had the chance to experience Herbsaint, and it certainly didn't disappoint.  The s","useful":0,"cool":0},"EkflTL5A8QddALitm1jOLQ":{"text":"Highly recommend! Had a fantastic meal with great service. Ordered the fish special and it","useful":0,"cool":0},"HlABEFzNSkIz0jyqE2VTmw":{"text":"The food was interesting. Field peas aren't often on a menu but were delicious. Portions w","useful":0,"cool":0},"5EnB51PswjBydwFoMwGrgw":{"text":"Finally after a number of trips to New Orleans where schedule would not allow it, we had t","useful":1,"cool":0},"UQVDZHQ6mGKe1Pady-w0kA":{"text":"I've was looking for a great restaurant in Nola and I've found it!!! The food here is sooo","useful":0,"cool":0},"3fSUOTIVCadja5zxU6qINA":{"text":"I was taken back by surprise with my experience with this place! Had a reservation at 8pm ","useful":0,"cool":0},"NS4VbQ2inCn30pn4WBQV9A":{"text":"Herbsaint is complete with outstanding atmosphere and food.  It's a small, bistro-style re","useful":0,"cool":0},"5R_UiVDctpgRldq-4PVaZw":{"text":"We are in New Orleans for the first time and have thoroughly enjoyed our culinary experien","useful":0,"cool":0},"lB_i1YHYemaLcweGvFtmKw":{"text":"Wow...Chef Link brings it to the table\n\nWhat can I say, while the tasting menu looked supe","useful":0,"cool":0},"QeZARAwvWulUwCSPpZC29w":{"text":"I would have liked to give Herbsaint more stars as the food was excellent but the service ","useful":0,"cool":0},"SVxnjuCPZG4LHMzsL88EWA":{"text":"I came with a large group and we had a prix-fixe lunch. The waiter gave the impressionhe h","useful":1,"cool":1},"8IQasnv48G-b3wxDhFOzYQ":{"text":"I'm kind of a food geek - so when I was in Houston for a barbecue competition, I took a da","useful":0,"cool":0},"40hM4TaDFl8x8U0Nqd8fOA":{"text":"After realizing we were in the FQ on a Saturday with no clue where to eat, we stumbled upo","useful":1,"cool":0},"vOCT0xCO9SBuWsfwBKaySA":{"text":"Very tasty! Another Chef Donald Link restaurant... I love them all! The dishes are French,","useful":0,"cool":0},"w9G96yLvzZV7lY_lHVOq1w":{"text":"Good service, here. The salmon dish was fearful and excellently prepared. The duck was spl","useful":0,"cool":0},"Fh7Md602hNsoLZy7Gzu9lA":{"text":"We ducked in on a rainy Hallow's E'en.  Best thing that could have happened to us.  Servic","useful":0,"cool":0},"0YzFn0PaRcsgA2-tRgORgw":{"text":"Visited on Sept. 6 and had my best meal on a weekend trip to NOLA. Began the meal with an ","useful":0,"cool":0},"NhRM9MoQSVqkbsz4JcNKXw":{"text":"Herbsaint where have you been all my life??\n\nThis is one of the first reservations I made ","useful":0,"cool":2},"zD1js3eEuPXltIOhqVJfkQ":{"text":"After visiting Herbsaint and enjoying our meal a few years back, my wife and I decided we ","useful":0,"cool":0},"xJAH77RAHVvqeHMOJHZDxQ":{"text":"Excellent restaurant!  I attended a small group dinner here and truly enjoyed it.  The tom","useful":0,"cool":0},"Oa2dShhoPryAa9wr_VmM4Q":{"text":"Had to wait until 815 to be seated..... With a 745 reservation. We were seated outside and","useful":0,"cool":0},"7y-OGqgTx2SPSRwgx5u66Q":{"text":"Duck Gumbo = perfectly smoky & spicy\nShort Rib = one the best plates EVER (a hall of fame ","useful":4,"cool":0},"4CoTZo0KbHWlVRv5XQ7iew":{"text":"Stopped in for dinner and ended up in the \"one stool short of a six top\" bar.  You will un","useful":2,"cool":1},"s2wULNp2xlj_QrKlfGIGSw":{"text":"Herbsaint was the scene for dinner on our second night in town.  The wife and I are big fa","useful":4,"cool":3},"KuI84xXxHcnHnSNoLZIGDw":{"text":"Finallyyyyyy, I made it and in loveeee!\n\nWe made reservations a day in advance for three o","useful":11,"cool":10},"Q5LK4LLH99z5znWhVGDTBw":{"text":"Try it 2 different times on two separate visits because I was told it was really good.  I ","useful":0,"cool":0},"4wAb_yJZXZtD8M0gzRm-TQ":{"text":"I hadn't been to Herbsaint in awhile, but it was my birthday, and my wonderful wife was ni","useful":0,"cool":0},"vjsonFkpLmD1jz0wW1S7NA":{"text":"Came with a big party at the suggestion of a local who wanted to try it out.  Big mistake.","useful":3,"cool":2},"_zh7yjY8G7QsgkFN7nj4-g":{"text":"Delicious and interesting food, professional service. The lamb lasagna, a special of the n","useful":0,"cool":0},"z16be1arryxsBNEYU6hcKw":{"text":"Several locals recommended Herbsaint as a go-to second night spot for a solo dinner at the","useful":2,"cool":0},"lhMe03zZSMufuMlA5GRbCQ":{"text":"Everything was fabulous here. I especially liked the homemade spaghetti topped with a frie","useful":1,"cool":0},"Vx4YjUuzjR1fp9e5MoNjBA":{"text":"Herbsaint was the perfect Nola meal to kick off our fabuous weekend in the Bayou. A fab li","useful":3,"cool":1},"KXnjgRtYP-3a-M66vgbZEA":{"text":"I really wish I could award Herbsaint 3.5 stars. I had a large dinner party planned for a ","useful":3,"cool":1},"aD8dK6kGMxtEndEGoIOflw":{"text":"I ate here recently on a Saturday night  with a party of 11 guys on a bachelor party.  Her","useful":6,"cool":2},"3hotWd3dSSPuigDgRjzWgA":{"text":"Charming location on St Charles Street and really wonderful delicious food. Duck confit wa","useful":0,"cool":0},"RhnN4SJ3AG3WKKi7I8U5Vg":{"text":"We ate here last Thursday.  Made our reservations well in advance.. But the reservation sy","useful":0,"cool":0},"I9UDvz0p7znWwP0JT3Grlg":{"text":"The decor was lovely and to-date. The soft colors and and simple settings let the food shi","useful":0,"cool":0},"FCFBkfxjHI-llOYL_zOZ4g":{"text":"Our first meal in New Orleans during a visit from Chicago got the trip off to a solid but ","useful":1,"cool":0},"ShxSqIwMX8FcfigCLbsAng":{"text":"Great food!  I swear.  But I got sick at 2 am.    You don't want to know.   Maybe I just g","useful":0,"cool":0},"C40PzwwVF3AsFmOzTs6RcQ":{"text":"This is what dining out should be: great food, friendly courteous staff, and top-notch dri","useful":0,"cool":0},"b_4EAFfPNNYPampFmJG5bA":{"text":"Food was great, hot and fast. I had the red fish that was seasoned to perfection. The serv","useful":0,"cool":0},"JAxoOw2qnj7ungoX8ug2WA":{"text":"We were so surprised given its reputation and James Beard Awards that this turned out to j","useful":0,"cool":0},"-vyN6oTt2e122N-jGo7zpw":{"text":"Went here on 2/24/14 for my birthday while on vacation.  We had the short rib and asiago c","useful":0,"cool":0},"_jH-KTjv1JrfP68fGwKikQ":{"text":"This was an amazing restaurant all the way around.  I would go back for sure.  I had that ","useful":0,"cool":0},"eSb3A-txbxYRHc49IHyAog":{"text":"Best food of our NOLA trip. I had shrimp with grits and collards as my main. Was a very hi","useful":0,"cool":0},"FkaI0BHa2K8oPbJZeN7BcQ":{"text":"I think this place may get a 3.5 but I am rounding down because I'm not quite sure about i","useful":0,"cool":0},"WJgC8Pfsw4mSTZUw4Ih_kw":{"text":"great food, just like every place in this town. great drinks too, definitely get a cocktai","useful":0,"cool":0},"E86q_9N1rdB-W-Pq3q6I2w":{"text":"OMG, delicious!!!  Every dish we tried was AMAZING.  The roux in the gumbo was lick the bo","useful":0,"cool":0},"ftC6wMwByQiMGjfcVJ4gaw":{"text":"Herbsaint, one of Chef Donald Link's first restaurant, a James Beard Award winner for best","useful":1,"cool":0},"iqRQZZznexgV0PuKzb1lbg":{"text":"From the food to the service everything was top notch. I visited with my fiancé and we lov","useful":0,"cool":0},"bSr0tGoJYKtfbOWAKLGifA":{"text":"This was our most disappointing meal during our one-week vacation in New Orleans.\n\nThe foo","useful":4,"cool":0},"ZimmmLkudYZ_vc61xCg3DA":{"text":"We have been here last night for my husband's birthday! I must say we had the most swell t","useful":0,"cool":0},"QlCmD-etH45p8jtt1pWicw":{"text":"This is a fancy place that is very accommodating. Walked in without a reservation, got a n","useful":0,"cool":0},"EcgDRr4LhXiWOcXRXx_0nA":{"text":"I went to this restaurant a few years ago but it's a meal that has not been surpassed yet ","useful":2,"cool":1},"yH54BhXaIBKiN8Z-pRQcYQ":{"text":"I've visited twice on two recent trips. The food was 5 star, the service of was 3 which is","useful":0,"cool":0},"rFnHwhXhFc-HnSCmiLYPpA":{"text":"last lunch in new orleans, just like on the last visit. good fair predictable but i wish i","useful":0,"cool":0},"dGgef3Thz9meemgyEJwkNg":{"text":"Wonderful!  Great food...even the heavy-sounding items were light.  We had 5 different sta","useful":1,"cool":0},"KVyFOoX05gZIqv0K3ROQ6Q":{"text":"Wonderful wait staff. Seated immediately based on reservation. Appetizer of lump crab meat","useful":0,"cool":0},"ZEFdVliHXNqOXRuGdi3d-Q":{"text":"Great experience. The Watermelon Crab Gazpacho was really tasty. The steak was perfectly c","useful":0,"cool":1},"voqUTZbHcRxDrzGxl0q0tg":{"text":"Great fun vibe. Excellent food and drink. \nTheir Gnocchi w/Proscutto and Parmesan was supe","useful":0,"cool":0},"Q4e8FAuYkqM90LEPwXTrig":{"text":"One of my favorite places to go in NOLA.  Incredible food with a very nice staff.  We allo","useful":0,"cool":0},"f0s2IpoeC4uB8BNohPp9HA":{"text":"Points for serving ice cold drinks in cute jars. I am not a fan of tomatoes, however, thei","useful":0,"cool":0},"8af61hTw1VZLwW8aoiJf1g":{"text":"The food was excellent, but nothing strikingly memorable. Donald Link's second restaurant ","useful":0,"cool":0},"l9ngKAAEYVkDpFEXVl3usQ":{"text":"Terrific food and very thoughtful sommelier that made perfect pairings.  Ended up having l","useful":0,"cool":0},"D7vRM10hWkDjI8UWK5GSuQ":{"text":"Started with the arugula, buratta & beet salad which was so simple yet amazing! Then the g","useful":1,"cool":1},"7X6mJ_qQrg34uJaIyvGAaA":{"text":"Very nice! Had the Pork Belly entree and the kale salad, cooked to perfection. My friends ","useful":1,"cool":0},"3g69MHF3IQm7nEyLJ28MOA":{"text":"Herbsaint was amazing. I dined here recently with a reservation of 12, so we were seated i","useful":2,"cool":2},"Oet4s8CE72BX4CA3jwbsNQ":{"text":"Unreal. Pork belly was to die for. Every entree and small dish was of the best quality and","useful":0,"cool":0},"tdBQAYeM6m41G_ADg5MHIw":{"text":"Delicious food. I'm vegan and they were very accommodating. 3 stars because the service wa","useful":0,"cool":0},"14W5xyjA6guSSSCrNAYAvQ":{"text":"Wow! This place is amazing - not to knock other places that I love but I can't think of a ","useful":0,"cool":0},"nZIiK5FSpBcFxPmX63e-mw":{"text":"One of the worst service experiences of my life. The food was ok.\nWe were there with a lar","useful":1,"cool":0},"gZAaWlPAIMsxHKHO-xNhUg":{"text":"The hype is real, y'all. Four and a half stars to the best meal we had on our trip. The si","useful":12,"cool":8},"N3AWloHqCqe3lYMNFGpcHQ":{"text":"You really can't go wrong at Herbsaint. We have been three different times, and every time","useful":0,"cool":0},"p0SMZ-u4dVc8E3IxD6nDyA":{"text":"Delicious and the atmosphere is great. Lots of light, romantic and contemporary. \n\nThe foo","useful":0,"cool":0},"Vp9jl4BJH7T9_eiElKDB2g":{"text":"Herbsaint is owned by Chef Donald Link (who I have \"followed\" for years -- no stalking, pl","useful":1,"cool":1},"dHARjBvzeDQa05oyBnwKrA":{"text":"A most EXCELLENT meal. Check hasn't even come yet. Reno (House Manager slash Sommolier) ch","useful":0,"cool":0},"BFbADuW7GZJ8Q8_IR9pCsg":{"text":"Excellent food, beautiful presentation, really great cocktails, a nice room.  Delicious, i","useful":0,"cool":0},"CI4uBAV4kRIBs_PHcdkVyg":{"text":"Mmm, this place was good!  We shared appetizers and they were all yummy, and then I got th","useful":0,"cool":0},"scWme3ov5DOU7VkSK6aPEQ":{"text":"no reservations for lunch - just came in and sat at the bar.\n\nhugest, most tender plank of","useful":3,"cool":1},"lUWpvIq0M0n9B51PZIIFsw":{"text":"A couple of nights after eating at Cochon, Herbsaint's sister restaurant, we had an almost","useful":1,"cool":0},"RmihW6dw-MXNWa2JFaPMzw":{"text":"I've passed this place a million times and finally went there yesterday. Things I like are","useful":2,"cool":2},"FchQTrLNxekZqxZnAJG4PQ":{"text":"Great lunch!  Attentive and friendly service.  Very nice simple atmosphere.  All four of u","useful":0,"cool":0},"1SWziDsivFPIYtiPYAYewg":{"text":"They have an excellent menu, with very fresh ingredients. The staff is professional, espec","useful":0,"cool":0},"kwHyEtpV6rTZOE_rTRu_Fg":{"text":"Make sure to reserve a spot. This place gets super busy. The food is amazing here. Definit","useful":0,"cool":0},"5U7c_gN9-y5ZNni9B4SBPA":{"text":"Sadly does not live up to its reputation. Disappointing given the exceptional southern hos","useful":0,"cool":0},"2lzNtmadu_r_5LNvPmrGow":{"text":"Herbsaint is one of those restaurants that I have been saying I wanted to go to for a few ","useful":5,"cool":2},"zeT24yAw7-O5LxJeG5zTlA":{"text":"Fries were the best I had in Nola. The pork belly was super greasy/fatty. Smelled like cat","useful":0,"cool":0},"rUAAu_iioWV7aRyO6ww_AA":{"text":"Herbsaint is by far, hands down, the best food in New Orleans. As locals, we have been twi","useful":2,"cool":1},"cwsiMrHCL76y0zC4HG4YmQ":{"text":"Loved the food! We shared several of the non-entree dishes, including the crudo and the Si","useful":0,"cool":0},"82akimK6ajd-gKgZy5CzjQ":{"text":"Had a very nice experience at Herbsaint while I was in town for a convention.\n\nI was with ","useful":0,"cool":0},"XgtfdorE3Y7ZWaOph0D1qA":{"text":"I had the braised lamb neck covered w/ feta cheese and herbs over butterbeans. The neck wa","useful":1,"cool":0},"YQrRzu8WVP76C0IA-jSPqQ":{"text":"I was bummed out by my last visit to Herbsaint. Our table was ready right away, but it was","useful":0,"cool":0},"qfbE-2zjEpzAcsifO7Drag":{"text":"We celebrated my husband's 40th birthday dinner at Herbsaint. We were visiting from Sacram","useful":0,"cool":0},"hbgL72aA-mpLOfMKCG3Y3w":{"text":"Visiting New Orleans we definitely wanted an exceptional meal during our stay - Herbsaint ","useful":0,"cool":1},"JEZBDTRlZ24Xm0d8FxUQgQ":{"text":"You can't go wrong ordering the specials on the menu.  The pasta with the fried poached eg","useful":0,"cool":0},"71RtbgLfrhPpIo1cvLZNoQ":{"text":"Came here for dinner on New Year's Day with a friend and we were so excited to check out t","useful":0,"cool":0},"KP56S4cR6UgVypKc47ix6g":{"text":"My daughter who lives in the Warehouse district picked three restaurants for us to eat at ","useful":1,"cool":0},"UX96-YXUU_vAW3qix2laSA":{"text":"Had lunch at the bar.  Service was excellent.  Ordered fish special, which was drumfish se","useful":0,"cool":0},"-1N8g3MAdoF2PcBqgTR1Tg":{"text":"Big fat dissapointment.\n\nWe were unapologetically seated a half hour late.  This is one of","useful":2,"cool":0},"v0ypN_6FbnbwxXjlOLmxag":{"text":"best restaurant i ate at while here for jazzfest, and i ate at Cochon, Jacque-Imos, Stella","useful":3,"cool":1},"Hf2_Z0jpSmS3abdOo1xsOA":{"text":"Off the chart delish! Donald Link does it again with another wonderful dining experience. ","useful":0,"cool":0},"OUakWvaJLtKMY5LoLA4_jQ":{"text":"Awesome atmosphere and excellent food! The lamb lasagna, gnocchi, and crispy goat were per","useful":0,"cool":0},"uzxRS535zWwgOtGUA-YNqA":{"text":"This would have been a 5 star meal save for two pret-ty significant details. One was the t","useful":2,"cool":0},"LC68FwCWTRmZ-IwgVAcrbw":{"text":"My boyfriend and I came here for dinner while we were in town on vacation. The table was i","useful":0,"cool":0},"Fw0CaQPYHj9h_TtLb0UHog":{"text":"Reservation over four weeks in advance. Waited 40 minutes for a table that had sat empty f","useful":4,"cool":0},"ZLqIAc0R_zMnAJnovL2mDg":{"text":"Creative and delicious food! Attractive surroundings! Attentive service! The duck confit i","useful":0,"cool":0},"UTeAFz_m9SDNRr6aRR216g":{"text":"Only meal I'd consider a \"miss\" from the trip. The service was abysmal--it was so bad that","useful":0,"cool":0},"wjRXIwMMmx-ZF-vWV7uCVQ":{"text":"Solid restaurant and nice fine with great service. 3.5 star for me but not quite four star","useful":0,"cool":0},"KQZysiETzm-4PuDZMKnTNQ":{"text":"Excellent food and service.  Both casual and elegant (gee, remember when we didn't need so","useful":0,"cool":0},"VMCBJlJu-3Q1jNsVeA0yXA":{"text":"Really disappointed with this restaurant. After a few excellent reviews from trusted local","useful":1,"cool":0},"NgjHRf7kaJYFkQ8UHO1r1Q":{"text":"I can't say enough good things about Herbsaint. We have been coming here for years . With ","useful":0,"cool":0},"PE7iM6UzC-eGRtbpL_ILxQ":{"text":"We enjoyed our dinner at Herbsaint very much. The perfect location on St. Charles Ave. tak","useful":0,"cool":0},"VWWS3HSQt0yPKPGVWNn4qw":{"text":"Another fine meal out in New Orleans. The thing that holds Herbsaint back from being a 5 s","useful":4,"cool":1},"NsTunK7Fihnr3UWwMrlJpA":{"text":"Reserved a table for two for dinner. Very romantic setting as we were seated at a table in","useful":0,"cool":0},"XwaeRyzFyUHSl0e4QCpd3A":{"text":"Terrible service for such a well established restaurant. The food was good but there are s","useful":0,"cool":0},"riUeQTN-NkxDjvBV1U3Tug":{"text":"I ran down here for lunch on a recent trip to NOLA. I'm a big fan of Cochon and I wanted t","useful":0,"cool":0},"QcMrWiWFsB0qJefwMyEg7Q":{"text":"I quite enjoyed Herbsaint.  The ambiance is great, nice mix between high end and casual.  ","useful":0,"cool":0},"8Ff_eqrq2sxgQ2boiSbQeA":{"text":"The food was 5-star! However the service was disappointing. There were attentive, but had ","useful":0,"cool":0},"Oow88dzRmIAqpcfVlry6tQ":{"text":"Came here with coworkers on Tuesday at 8:30pm with a reservation. You need to make a reser","useful":1,"cool":0},"xB8qjkvVjroPbsUsFQvVPg":{"text":"The perfect weekend in NOLA - first night go to Couchon for dinner.  Second night, Herbsai","useful":0,"cool":0},"CPsD64wfvlY3M8Td3JDdKA":{"text":"This used to be one of my favorite restaurants in New Orleans but I'm absolutely sure they","useful":12,"cool":2},"22kJhdviMjwyk7zv3TmgnA":{"text":"Service was slow.  The menu was limited.  We ordered several small plates ...fried oysters","useful":0,"cool":0},"w695ZXVrHy2UNqVvY5MvAw":{"text":"Three of us made a reservation here on Lundi Gras because they had a balcony. We decided t","useful":0,"cool":0},"2OUBvxrNAyvzBzT4Jfs4YA":{"text":"Our first night in New Orleans\nCame on a friends recommendation \nEverything first rate....","useful":0,"cool":0},"2Fu8z5wZULN74p4cctfv3A":{"text":"The food was spot on - creative and well a blend of great flavors; however, the service wa","useful":0,"cool":0},"vSUxXO0ac3W99dlyaqLCvQ":{"text":"We had a lovely dinner here on a recent Monday night, nice, friendly atmosphere and great ","useful":0,"cool":0},"-jhO8xCJ-0zkkpy1QngzSg":{"text":"This used to be one of my favorite restaurants in New Orleans but I'm absolutely sure they","useful":6,"cool":1},"lfcMc9edglsqpx3zLChZZw":{"text":"Afternoon lunch so it was not the full menu. Service was not the usual warm and attentive ","useful":0,"cool":0},"FdEoWwDIZnGRUCsAnb8D_Q":{"text":"Chef cooked my steak au poivre perfectly!\n\nI am a former vegetarian and the mere pinkest h","useful":0,"cool":0},"7hcl02UP2Wm1PuMb8nXIrw":{"text":"This place came highly recommended By some NOLA natives. In short, Herbsaint delivered a s","useful":5,"cool":2},"j-qWMzAiCo4g37zS-5mNrg":{"text":"The food was amazing, the taste of the gumbo was especIal not a regular gumbo, the fry oys","useful":0,"cool":0},"0yicJQEwI5iwYFvbN0N8UQ":{"text":"Everything was delicious except for the gumbo.  We did NOT like it at all.  I thought mayb","useful":0,"cool":1},"6Vl5sdubFC20tBA96SAwVw":{"text":"Years ago, my fiance and I went to Herbsaint and had the best bread ever. It was a buttery","useful":2,"cool":0},"1zIlKVQUqgVpenoJzY3GHg":{"text":"Absolutely everything on the menu is spectacular. We came with a large group celebrating a","useful":0,"cool":0},"L8LOkpoDGc4L6zWkujhUfQ":{"text":"Very unique menus.\n\nVery different food combinations.\n\nNot the same N.O. Food at all.\n\nEve","useful":1,"cool":0},"XNByp_yAPZn61XTXpbL-qA":{"text":"Definitely recommend this spot. We came in just for appetizers and drinks and can't wait t","useful":2,"cool":1},"Wp-G7tiFXmVef2Yqx_j4IQ":{"text":"Do come in for lunch.  Order two small plates and a drink from the bar and prepare for one","useful":1,"cool":0},"PSFPGrzNXcMITh9E2j34Vg":{"text":"Might have once been great, but it just was not now. A shame to waste a meal out in NOLA o","useful":0,"cool":0},"39YAkrGqA0ErHplY9PYKSQ":{"text":"Fabulous! Wonderful food! Herbsaint is a must visit on your trip to NOLA! The chicken and ","useful":0,"cool":0},"V6daCCJItiep3M8UjbA2IQ":{"text":"This was a good place for a nice meal. I started with the soup of the day which was a baco","useful":0,"cool":0},"0ttB97rScsQHBUy9JGHDlQ":{"text":"Food: we had the house tomato shrimp bisque and several small plates. All were excellent, ","useful":2,"cool":0},"_2pzsQ09iWyJaVTo8ZTqdA":{"text":"Not pictured are the entrees because I was too busy stuffing my mouth. I got the lamb lasa","useful":0,"cool":0},"vG2DLJ3U72jbg4EbTeQyQA":{"text":"Meandering around on July 4, and ended up at Herbsaint. Beautiful little spot on the corne","useful":0,"cool":0},"aTUIcI_ScWdwTDz-nudrhQ":{"text":"Kind of disappointing, especially for the price.  I loved Restaurant August, which looked ","useful":0,"cool":0},"lQ3Nd8QPA7yH7D0Eplnefg":{"text":"This review has been a long time coming.  I've eaten here many times and have never had a ","useful":7,"cool":4},"tLxmiGoQbeY7yXKzwXXmUw":{"text":"Came in with a group of 5 people and we all ordered multiple small plates, entrees and des","useful":1,"cool":1},"JZCjBDxX069K35vKoBfXwA":{"text":"Wonderful dining experience here! Read about this place as an up and coming spot in NOLA s","useful":3,"cool":1},"syke3DxyuWmYGfDVLL0APQ":{"text":"Our first road trip for the year and my girlfriend booked reservations 2 months in advance","useful":1,"cool":1},"YlHUKf3fi0igFiAyiJsrFw":{"text":"Sorry to be a party pooper but I can't recommend HS. Our entrees were tasty, BUT--\n\nThe no","useful":1,"cool":0},"T6WnvOuqCGcPOmq2cge_Ew":{"text":"I really enjoyed my dinner at Herbsaint.  I started with the ceviche, which was the best c","useful":2,"cool":0},"CaaREUS1i6TlUKAd_zm2UA":{"text":"What was , was and what is, well, is just unfortunate.\n\nAlthough still the best of the Lin","useful":0,"cool":0},"DrLkOvcDVTeLOx9IyoVaNA":{"text":"Our group of NYers and Los Angelenos went to Herbsaint tonight and had a thoroughly enjoya","useful":0,"cool":1},"5Cmj7Ie8V_0vWXxNP4MFIg":{"text":"Very friendly bartender. Great shrimp small plate! I loved it. The flavors were amazing. T","useful":0,"cool":0},"cL-jcJdmtkFek3LI3fTBhg":{"text":"Great service. Great food. I love that they experiment with flavors - the curry creole com","useful":0,"cool":0},"I6b8zclF64647Jk-FHnn2g":{"text":"This is located in the downtown business district of New Orleans. It's owned by a relative","useful":4,"cool":4},"HlQ16HqPkhCIyVWU11-rJA":{"text":"Excellent appetizer, entree, desert, and service.  The gumbo was out of this world as was ","useful":0,"cool":0},"Wcb_BR7B0IEr7L2RMZFYcQ":{"text":"My uncle and I dropped into Herbsaint before the Sugar Bowl as this place looked good and ","useful":0,"cool":0},"wxJKURmgkP6oHFOcB_L7dA":{"text":"This place is simply stunning. Beautiful newly remodeled space, gorgeous people, and food ","useful":2,"cool":1},"pkLmfysT7tVypihOEJGyxg":{"text":"Recently had lunch here twice during a business trip. This is New Orleans dining the way I","useful":0,"cool":0},"-LAlpvj8FEiVM5QjAWLmMA":{"text":"The service at lunch  was inexplicably terrible, not for the usual reasons, but  because t","useful":0,"cool":0},"UyMbWyzDT2OlCCye6a0epA":{"text":"Usually when one is relegated to sitting at the bar for dinner, it's somewhat disappointin","useful":0,"cool":0},"LoxnYRqdBZaTZEzOThNQQQ":{"text":"Nice establishment with very good food. The grilled flatbread with shrimp, zucchini, provo","useful":1,"cool":1},"wHwW1_oRoe2NaHd2HPvptA":{"text":"By far my favorite spot in Nola.  The food is always incredible and the service just as go","useful":0,"cool":0},"iLvR3U7XFPln3nLFGO5v7g":{"text":"I should have read the Yelp reviews more thoroughly before I dined there. \nFriends had rec","useful":1,"cool":0},"T3FC5JyNSyGgf9JJP9353A":{"text":"Had a very pleasant meal with a large party. Portions were very small but the food was wel","useful":0,"cool":0},"OWyVDCOibAQDa34Xpu9ICA":{"text":"We had reservations and were seated right away. Amazing experience, top notch service. We ","useful":1,"cool":0},"YNacCgYWpfTzf2NArY6oNw":{"text":"Love this place for lunch or dinner. Modern and simple dinning area with some nice outside","useful":2,"cool":0},"Fm7A2vzTKRAwu7YchbcfIA":{"text":"Meh! I heard great things about this restaurant. I've been looking forward to dinner here ","useful":1,"cool":0},"AmfMm-amTry9rhGtRC-94A":{"text":"Well served, clean and superb! The short ribs leave you wanting for more and the tasty duc","useful":0,"cool":0},"0yOJnCoUvL9URNH0fXa8aQ":{"text":"Lovely looking restaurant away from the mayhem of the French quarters. It does tend to be ","useful":0,"cool":0},"8tp3PkCfhbR-VRfdo2Re5g":{"text":"Horrible service, terrible experience. Server was awful and super inattentive. Spent most ","useful":0,"cool":0},"B4lgRRi_lCcE0bD8NPctOg":{"text":"Service was not great. Our server was not interested In being at work. Drinks very slow to","useful":0,"cool":0},"daRWWAAO4s7rqfZid_e-Bg":{"text":"I already knew I was not the right person to dine at this place as I do not fancy French c","useful":5,"cool":0},"A-9UVZfqpn2pj8s2eAXqvw":{"text":"WOW WOW WOW... I cannot say enough about how great this restaurant is. If I could, I would","useful":2,"cool":0},"OLj--M-pPqBgyVY0kZ6Vhg":{"text":"I have eaten frequently at the Link restaurants, Cochon, Peche, and Herbsaint. None of the","useful":1,"cool":0},"yxLHLVdaPQAmc0VNBVY4XQ":{"text":"Nice location, good portions. The atmosphere is really pleasant, too. The lasagna is delic","useful":0,"cool":0},"ejMkfSdSpil3gnKn6DEzoA":{"text":"The service was rushed and came with a bit of a edgy attitude. But the shrimp and fish cev","useful":3,"cool":0},"oBiGTu7JSASzFTmh9VpexQ":{"text":"Herbsaint is in the perfect location in my opinion. Far enough way from the French Quarter","useful":1,"cool":1},"JRhfcLe3wJfI1bun_fDArw":{"text":"Awesome food. Friendly service. Duck and goat both recommended. Their spaghetti is out of ","useful":0,"cool":0},"AbwB74EjPveIPJBznVqwnA":{"text":"Unbelievable. Great service and cuisine. We brought our own wine and the appetizers, sides","useful":0,"cool":0},"wERl4Zvq3O7YvIUmeNKWbw":{"text":"If you want a romantic, delicious, and modern yet classic setting for dinner, then this is","useful":3,"cool":1},"4ufNYifPKm_ugm8Yo6Lhyw":{"text":"Herbsaint is a refreshing offering of one of the many Donald Link restaurants. Like his ot","useful":1,"cool":0},"dhx_S5Mzzn1i74nMHdNW9g":{"text":"Herbsaint has been on a running list of NOLA restaurants that I wanted to visit for a whil","useful":2,"cool":1},"C4ufHJZb8EaD2vWdVgGjBA":{"text":"A modern New Orleans dining experience in a bustling site. The device was well executed an","useful":0,"cool":0},"s9wV2x4-1kvDnaU7h7zHHQ":{"text":"Use to be one of my favorites in NOLA; however, we arrived for 6PM dinner last night, Frid","useful":1,"cool":0},"Ccfr8RqeaZFTdks0oBxtzQ":{"text":"The food was marginal at best.  The service was atrocious.  There are many wonderful resta","useful":0,"cool":0},"E8XXilwjFyl988WfQiB59w":{"text":"Their chicken and andouille gumbo was not the thick, rich gumbo you associate with New Orl","useful":0,"cool":0},"czXgzqlaKkdOJ4IxFd2HUA":{"text":"I would give the dining experience at Herbsaint 10 stars if it were possible! My two frien","useful":0,"cool":0},"I9nUrfLFFoIZ9Zd2260CbQ":{"text":"Hmm, kind of underwhelmed.  It's the kind of place that *should* get 4 stars: fairly casua","useful":4,"cool":0},"eA-XhkdvsyulVGsoPCAtiw":{"text":"This restaurant has wonderful food and service.  I did an argument at the Fifth Circuit co","useful":0,"cool":0},"ksKvNsRwvZ6F90YmqByHOA":{"text":"One of the best meals I've ever had in my life. The gumbo was phenomenal. The lamb was phe","useful":0,"cool":0},"niZHxYn3-1nUCP4XOz-LaQ":{"text":"Wonderful lunch spot with excellent service! We loved Justin! He wins the best server we h","useful":0,"cool":0},"jM5aCo4yctgVbq5a6ADRdQ":{"text":"Excellent restaurant.  Everything we had was top notch, from salad and cocktails to unforg","useful":0,"cool":0},"WYiGTZ8fOuwXPI0SITCfPQ":{"text":"I would like to voice concern regarding the complete lack of professionalism and courtesy ","useful":2,"cool":0},"8fzHxuCAXCwmoQR4sTCFZg":{"text":"So delicious! Go here for phenomenal food and calming ambience. I got the mussles and dirt","useful":0,"cool":0},"NtBN6Ym1gri1xE-NrarQjw":{"text":"We had dinner at Herbsaint on our recent trip to NOLA and it was one of the better meals t","useful":4,"cool":3},"j9xg7MBod3vphxvofvYXog":{"text":"Wonderful lunch spot with excellent service! We loved Justin! He wins the best server we h","useful":0,"cool":0},"g7g5sq14nDAJ-1bnRetl_g":{"text":"I've thoroughly enjoyed every meal I've eaten at Herbsaint.  This time my husband had the ","useful":0,"cool":0},"lx-zuEmCTA0xGzgNYFd5fQ":{"text":"Incredible food. I had the duck confit and it was sublime. Lovely atmosphere, as well.","useful":0,"cool":0},"kjPMAs6LuhY_DVpykN78Tg":{"text":"Was recommended this place by someone. Was super excited to try this place out. We came fo","useful":0,"cool":0},"cNzXQua7xiholQzCkFDzeQ":{"text":"Boyfriend and I went to Herbsaint on a weekend trip from New York based on a recommendatio","useful":2,"cool":1},"B7VcMi4IrYrGqI4hRlcUjw":{"text":"Stopped in here the other day for an early dinner date. Haven't been here in a long time, ","useful":1,"cool":0},"2fbtLTnkhIgOC2dCQ9YHVQ":{"text":"This is possibly some of the best food I have ever had in my entire life. We had the Beef ","useful":0,"cool":0},"GIv4fzWN1BZNiu37p_J4yg":{"text":"First of all, the place was packed! Luckily we have a reservations. I ordered the gnocchi ","useful":1,"cool":0},"DB3Y0NtWTI5S9WAVhgHA1g":{"text":"We ate here with a big group and it was soooo good.  It's my husbands favorite restaurant ","useful":1,"cool":0},"zcnOgHVz1fhomSWFZr6vYA":{"text":"Very solid meal. Professional-feeling restaurant without being overly fancy, and our servi","useful":0,"cool":0},"njETDxNedN2uEtp6RqHtQw":{"text":"Impossible to have a better dining experience! This place has the best gumbo I've ever enc","useful":1,"cool":0},"m_CsqMsTY6O7wZZvYTuF5Q":{"text":"New Orleans is my city, my place. I was born and raised here, and I cherish coming back. O","useful":6,"cool":0},"yroUu-sJ_2IzhoOPvTjUGQ":{"text":"I've eaten here several times but last night was quite disappointing. The noise level was ","useful":0,"cool":0},"ASO71NkkWdqwpnASTgYHsA":{"text":"Good food and great service. I was not that hungry so I settled on the shrimp & grits appe","useful":0,"cool":0},"FvBBVmp_KfF6y1uZvhYsGw":{"text":"A lovely place.  Very comfortable, nice restaurant to dine solo.  I had endive salad and s","useful":0,"cool":0},"0KG9pdxmDB_Pi-QXxZzIww":{"text":"Man, what a disappointment.   We came here for our office Holiday lunch because we have al","useful":0,"cool":0},"Naiuf0nDXWXSQQrAIoBMqg":{"text":"We somehow scored last minute dinner reservations for four and we could not have been more","useful":2,"cool":2},"OTsvfjH_z4K6fzkY06qetg":{"text":"Neat restaurant with some good meal choices. I wish I would have been able to really enjoy","useful":0,"cool":1},"MSS7pKEy7N92PX6m78n5Vw":{"text":"Delicious food. Great service. We've eaten here once before and it was great but tonight w","useful":0,"cool":0},"WJpuOBRFR-D36G1ghwk77w":{"text":"What a great place for stellar food, ambiance  and professionalism from our waiter. Made r","useful":0,"cool":0},"Qk8NznUH8tKsFMYvHO5MlQ":{"text":"Our party of eight was very pleased with our experience here. The service was excellent, a","useful":0,"cool":0},"RE0QxhsN3vsPBldZInXkDw":{"text":"The managers, hosts and waitstaff are on point... we had reserved for a table of 7 but end","useful":0,"cool":0},"F3AL9VmsTfIXSZ89BL7ktA":{"text":"I really enjoyed going to Herbsaint.  Not only was the food excellent, but they made a REA","useful":0,"cool":0},"io_NAHig-xmQQ65F6RyEgw":{"text":"Love this place so much!  The pasta dishes are amazing, love the homemade spaghetti and th","useful":0,"cool":0},"uB3p03npOFe75Yd-0KZxtg":{"text":"Relaxed atmosphere, friendly service, good food with reasonable prices what more could you","useful":0,"cool":0},"snOJIGX9W2GpVqJF96OCLA":{"text":"Ate on a stormy night. The place was packed. The drinks are delicious and strong. I had th","useful":2,"cool":1},"8g5Q67uI9gAutwE5HDdOBQ":{"text":"Enjoyed the food and the service was also quite good. Outside dining option was very much ","useful":0,"cool":0},"64CKtsiqbwrzvSE9GwOUZg":{"text":"Chef owned/operated, with fine but unpretentious cuisine, in/out dining and a small but va","useful":1,"cool":1},"U4oaxJ8Wsg7yM_vUxPMWqw":{"text":"So, we went here for our one year anniversary. This place was suggested us by a friend. Co","useful":0,"cool":0},"x_NJf9SDV2LsYgYRQFdsVA":{"text":"Herbsaint is one of the best restaurants in New Orleans. I went there for dinner last nigh","useful":0,"cool":0},"WszJRvrwofSL3imDWWk8WA":{"text":"This place is pretty good. Maybe in a city other than New Orleans it would get 5 stars. Fo","useful":0,"cool":0},"EAatNRnaPPYmt8UJN2t43Q":{"text":"Fabulous food and service. Would definitely recommend beautiful restaurant wonderful menu.","useful":0,"cool":0},"QAxIx-mhBxZJjNNMPWgBwg":{"text":"Great place for some fresh fish specials and the gumbo. Excellent wine list and specialty ","useful":0,"cool":0},"dqLJ6OW06BrypJE6xG_zYA":{"text":"Pimm's Cup\nWarm Bread and Butter\nChicken, Tasso and Andouille Gumbo\nBaked Asiago with Oreg","useful":6,"cool":3},"gTLG6EB3wNLyTFj0bG4IQg":{"text":"Amazing!\nLocation, location, location\nThe weather was perfect and we had our puppy with us","useful":3,"cool":1},"-Yy0k23vMPTBeWmpTvT_RA":{"text":"Hands-down my favorite restaurant in New Orleans. Super elegant and romantic atmosphere, y","useful":4,"cool":2},"IzwrbDX85sSaMXDMmjHU_Q":{"text":"Right on St. Charles Avenue at the corner of Girod St., they are currently offering outdoo","useful":4,"cool":3},"J5zajwLirPmENIlaBciKFw":{"text":"My boyfriend and I meant to go to another restaurant but they were closed, and the staff o","useful":0,"cool":0},"9qDogI_X7RVpjoj391K8Fg":{"text":"This is possibly some of the best food I have ever had in my entire life. We had the Beef ","useful":0,"cool":0},"5pAkToOa7x9luZv3H752vA":{"text":"We just got back from NOLA yesterday and Herbsaint is ranking as our best meal in New Orle","useful":0,"cool":0},"2CXJ2yq3fwsbbSJ-o_PMuA":{"text":"Oh man. My team had dinner here, and everything was spectacular! There were 10 of us I bel","useful":1,"cool":0},"QoqgHsau2qtou6e_NqEZWg":{"text":"Sitting outside in the early spring air, across from a beautiful woman with the streetcar ","useful":8,"cool":4},"sFRli-VLSmlLSptpOraf-A":{"text":"Want to start by saying that I visit Herbsaint every time I am in New Orleans, but that wi","useful":5,"cool":0},"Pzq1HCyuBJYCoC7F41fycw":{"text":"We came here on a recent visit to Nola, we came upon it wandering around after riding the ","useful":2,"cool":1},"YX5bq-C3xGWDEvDNd391Tw":{"text":"The lamb and mushroom lasagna was a thing of legend! I have never had a dish that well don","useful":0,"cool":0},"OR5ecl6F9WD-zajjjofIqQ":{"text":"If no reservations, get there early or wait.  Kentucky Cat 5 is thee drink.  Whenever in t","useful":0,"cool":0},"oESBH_WyXUDFChrjbnJj0w":{"text":"Came to Herbsaint bc it was highly recommended by a local.  We were in town for a bachelor","useful":0,"cool":0},"cPsFclYGhTgPvXwbg5jGkA":{"text":"Food poisoning.  From the moment we walked into Herbsaint, the service was unattentive and","useful":0,"cool":0},"mMlFvl09UDaFdyUEZC-fDw":{"text":"I've been to all of Donald Links restaurants, and this one stands out from the three in te","useful":0,"cool":0},"sYbPYdESFEcEmXrDCAEqyw":{"text":"We go to Herbsaint every time we're in New Orleans. It never disappoints. Even if you don'","useful":1,"cool":0},"_oeyS3EtUamVNrX4hjkuVQ":{"text":"Years ago when Herbsaint was in its early days it was our hands down favorite restaurant a","useful":1,"cool":0},"v0tmByzDbC9ozRTTP3I7aA":{"text":"Our original brunch plans fell through so we decided to come here after seeing all of thei","useful":0,"cool":0},"_2LLjnKtCgC7VwMzX8ENbg":{"text":"Wonderful menu selection with new age options and flavorful menu.  We ordered the Tuna Cru","useful":2,"cool":1},"Ok8Kr66CAme5ihS3iSOKJg":{"text":"We went here for new years eve, so they had a set menu. Nothing was impressive, they charg","useful":0,"cool":2},"wBIec0wOqDJMC_ffXDIvDQ":{"text":"Herbsaint was exceptional. The service was excellent, and the restaurant has lovely, unobt","useful":1,"cool":0},"XZlFntJMM4qu4uLSJjbIFg":{"text":"Really enjoyed our dinner at one of the Link Restaurants.  We started with the baked asiag","useful":1,"cool":1},"dQvmaE1M6xMcHEkW9dxvgQ":{"text":"20th anniversary dinner was perfect. Hadn't been here in too long, and remembered Herbsain","useful":1,"cool":0},"nrgNZ_lQdDcyIyr1zu3TBg":{"text":"Was excited to eat at this iconic restaurant and boy oh boy was I disappointed. I'll start","useful":0,"cool":0},"-7X6Yvbr-NI2lbHmLcT9vA":{"text":"This was recommended by our concierge at our hotel.  The food was marginal, but over salte","useful":0,"cool":0},"jLNxt6oG4CWDve5Jdtx3Pg":{"text":"Herbsaint was highly recommended as one of New Orleans best restaurants. I was not totally","useful":2,"cool":2},"S9D_ZE-eTRZE01SymPWWWA":{"text":"Oh my goodness. Come here, come here, come here. If nothing else, come here for the spaghe","useful":1,"cool":0},"GxydJPSENDzPrl0OKqzVHg":{"text":"After having a bad experience at a James Beard nominated restaurant, we stumbled into Herb","useful":0,"cool":0},"PJUr1TJb8_aX_Kpxwm9VLg":{"text":"Came here for a Friday ladies lunch and we had a wonderful time. I would suggest taking a ","useful":2,"cool":1},"UA3CaCqjAOtEJDhUMwQyDw":{"text":"Almost 5 stars, everything was great except the noise (more on that later).  My partner lo","useful":1,"cool":1},"bcvMXEOEgnJA95qTXzVeZw":{"text":"My birthday was friday and because of the virus we had to do a \"to go\" menu. I chose the G","useful":1,"cool":0},"Fg3X_zmX-yTjaub_8TBxGA":{"text":"After hearing about Herbsaint for years, I finally got the opportunity to visit last weeke","useful":5,"cool":2},"mTVxNoJ-SlNmOaMYzp7IIw":{"text":"** 3.5 stars **\n\nDonald Link's first restaurant, and one of four of his restaurants visite","useful":4,"cool":1},"-dt9e4kdr_bOde-IhG4iQg":{"text":"It was really difficult for me to figure out how to rate this review and whether or not to","useful":3,"cool":0},"zsRy4xj5Gwf5I9BpmvSf6Q":{"text":"Had the vinaigrette greens and the fried oyster appetizer.  Both were great- the sauce acc","useful":0,"cool":0},"ar8E9BUqv_E36PbjQrxXOQ":{"text":"enjoyed the lunch. flavors were above par.  the staff was as expected and did not go above","useful":0,"cool":0},"9eYWrgrKnRRxZANR7BeDZA":{"text":"This is everything you'd want in a dining experience. Awesome ambiance. Attentive waitstaf","useful":1,"cool":1},"VEDISDbzeSW_6zsuidNIyw":{"text":"OMG the short ribs!! Get several orders. Good wine list with affordable but delicious opti","useful":0,"cool":0},"JLwIsXB3AleoiKD0uipa2Q":{"text":"From a good Fodors review--I made a reservation here for me and my wife on our NOLA trip f","useful":1,"cool":0},"YytF3jf1buUMhEHiSf4Z2Q":{"text":"THIS ORIGINAL LINK RESTAURANT IS THE BEST, & not too  \"Olive Gardened-up\";\n$15 & UNDER BIS","useful":5,"cool":1},"C3LO16oBfkFILB3dwkx8hw":{"text":"Excellent from Sazarac cocktail at the bar through multiple plates through dessert. Excell","useful":1,"cool":0},"-vwUWPt4i3E4yLk8Olt7zw":{"text":"Herbsaint is the first restaurant I visited in New Orleans and my first true experience wi","useful":8,"cool":4},"AB4m60A4pi1f0R1ANSPn1w":{"text":"We has a good meal at Herbsaint. If everything had gone according to plan this would have ","useful":0,"cool":0},"uTt1eYbTA9B1AXVlKqtp5w":{"text":"Amazing meal. Amazing place. This spot is destined to be on our list of favorite restauran","useful":1,"cool":0},"XIVg2T8iK3HgtII8ex8cmg":{"text":"If you come here and don't order the house-made spaghetti with fried egg, you are missing ","useful":0,"cool":0},"aAqLfwuR3zt2xlU5QorDxw":{"text":"Enjoyable atmosphere and food.  I recommend this place to most people who have never been ","useful":0,"cool":0},"FGTj799ZjsxZ9qAPisyMLg":{"text":"The food was excellent - I had the Muscovy duck confit which was tender and very crispy. M","useful":0,"cool":0},"vhHvrAe5g-lfNoU6J30w7w":{"text":"This place knocks it out of the park, and has done so for the 15 years we've been visiting","useful":1,"cool":1},"xMCqLb0WMcqPRjKHUOAnQw":{"text":"Definitely a good restaurant, but seems to go over the top on some part of the meal, from ","useful":2,"cool":2},"iftruartpwZK-pQRH1Z9MQ":{"text":"We had an excellent dinner here. Two people were assigned to our table and they provided u","useful":1,"cool":2},"zz-iprX2iIKbg3GTxENNsQ":{"text":"The staff was very attentive and the food did not disappoint. The steak was cooked perfect","useful":0,"cool":0},"byOBeLZ-UBB9-Ze-Gc80BA":{"text":"This food is amazing! I had a small gnocchi plate. I also had an apple dessert and several","useful":0,"cool":0},"nMaZRKrVpCAilD0xbApu4w":{"text":"Still as good as it gets.  The house-made spaghetti with the deep-fried poached egg is sti","useful":0,"cool":1},"-yEFGZy6OGhHflVuDQk1jQ":{"text":"The menu at Herbsaint is varied, offers several clean food choices consisting of French an","useful":0,"cool":0},"EK_HfOxpFToo6Cg73DSRVA":{"text":"This place is small and a little out of the Quarter, but walkable.\nFood was outstanding an","useful":0,"cool":0},"ve1Hh3v3oQoSl1DcxGMybg":{"text":"the only reason we went to this place was because there are a few online articles mentione","useful":0,"cool":0},"Z2Qg56kOuaZt50w1kZyUcQ":{"text":"This was the last of our dinners on our recent trip, so we had had a lot of good food alre","useful":1,"cool":1},"I1EKEanrTLc21zsMtSHuFg":{"text":"This restaurant has been on my list to go to for a long time and my SO chose it for his bi","useful":2,"cool":2},"-O1BmsX--rx2e0qw5FVDkA":{"text":"Burnt oysters, soggy shrimp, overpriced small portions and tacky staff.  First fine dining","useful":0,"cool":0},"Zu0Sb53i2kybnnx97rEJyQ":{"text":"Very disappointing experience. \nThe food was okay. The short rib was our favorite. The duc","useful":2,"cool":0},"Dj9sGF1VXLyA0LvUu-bbaQ":{"text":"Was here twice during my four day visit to NOLA. Didn't plan it that way. The food and ser","useful":2,"cool":1},"nAOIA1UmLfypLC1XuvRcNw":{"text":"To put it bluntly, Herbsaint redeemed our entire experience in New Orleans. I couldn't be ","useful":2,"cool":0},"Xf9SRgY8os6WiSA3Xocxtg":{"text":"Pretty amazing spot. I had the shrimp bisque and duck leg. Duck leg was probably best meal","useful":0,"cool":0},"OWSS547Ej9ip5Vwq-G33hg":{"text":"I think they put a cannister of salt in every dish.  I love salt but this was over the top","useful":1,"cool":0},"-SIzr0PnUwuNUSx-iXWyBw":{"text":"Heard so much about Herbsaint and I was excited to go. The place was not that busy for a S","useful":2,"cool":0},"LX7UCe-AajmbyHchmWIQaw":{"text":"Lamb mushroom lasagna was very good. Rich but paired with a salad that gave a good balance","useful":0,"cool":0},"W1t9EyRGESFQVsRsW1QY0Q":{"text":"The food was amazing! The service was aggressively hostile. The back of the house should k","useful":0,"cool":0},"bsBtoDPWd7Rnm5oEpivlbw":{"text":"I love this place. Sazerac is perfect and smooth. Food is excellent. One of the bartenders","useful":0,"cool":0},"YaGXt8C27zDKnC0VcEWhuQ":{"text":"Yikes.... what a sad experience.  Plainly, the service was average/acceptable for most of ","useful":2,"cool":0},"zxcpId_rgWb5-aavnDMocQ":{"text":"Herbsaint used to be one of our favorite restaurants to visit when we were in New Orleans.","useful":2,"cool":1},"BXr1grE9wqCBs8FAXfKXxg":{"text":"First meal this trip in N.O. and if there weren't so many places we wanted to try would re","useful":3,"cool":1},"82x-M-h8pI2YJO8Pu-pqLA":{"text":"I had heard about this restaurant all the way in North Carolina and was told that I HAD to","useful":8,"cool":2},"OJPhMVbRWKkZZ5IEyWkESA":{"text":"Very disappointed in their begrudged accommodation of my dietary restrictions (dairy, suga","useful":2,"cool":0},"YQ2uw5vO-4AkV2wI3kBDNQ":{"text":"I was really hoping that this food would blow my mind. But having been to many other place","useful":1,"cool":0},"bVvp2h_-uCta-hNymUGicg":{"text":"Herbsaint is delicious!!! The staff is hospitable, thoughtful and helpful. Sara helped org","useful":0,"cool":0},"9YLzVREvme-OxBsFGPeArA":{"text":"I was taken back by surprise with my experience with this place! Had a reservation at 8pm ","useful":2,"cool":0},"ToidkAn65-DiEOTnHMgDbQ":{"text":"Absolutely phenomenal!\n\nI had the pleasure of being treated here for my birthday by a grou","useful":3,"cool":2},"jNRdO9LL3kYOCCp4Dm_87g":{"text":"The food here was very good! My companion had the Duck, and the Gumbo. Both were good, but","useful":1,"cool":0},"QYpFHqhj5Jpus7PnXzvgwA":{"text":"This place was just a short walk from our apartment in the Warehouse District for the week","useful":0,"cool":0},"xQ8QEWnlGODAb_T4wvndCg":{"text":"Reserved outdoor seating and was seated   right on the streetcar tracks even though there ","useful":0,"cool":0},"2Kw8Bc4mwT3ExBN9Pg6I2w":{"text":"My boyfriend and I have been wanting to try Herbsaint for so long and we finally went for ","useful":3,"cool":1},"EAUmCfLyszETuJunBcEHcA":{"text":"Went for dinner with friends, and the experience was definitely worth the trip. Everything","useful":4,"cool":2},"DRjqCTAeXnjap2GJyyXqlg":{"text":"This was my second time dining at Herbsaint and again a solid dining experience. We were w","useful":1,"cool":1},"04mjrecWFKNixqxisw1cPQ":{"text":"This is one of my all time favorite New Orleans  restaurants! The cocktails, the menu, the","useful":0,"cool":0},"Im0npdsguxy3BA7s-b7COA":{"text":"Incredibly disappointed.  We went there after reading Yelp reviews with high expectations.","useful":1,"cool":0},"q62Koa4ksCnlSNJXeWgGEg":{"text":"Real paper menus..... friendly, relaxed service. Lovely atmosphere. Food is consistently d","useful":1,"cool":0},"WlMY55Z2e9W1IsA8bixd3w":{"text":"Herbsaint has been our go-to New Orleans restaurant for right at 20 years now and our last","useful":2,"cool":1},"dsiYih1F2OexOgZgFFaavw":{"text":"I have eaten here often over the years. It has always been a solid choice, but this last t","useful":0,"cool":0},"xqTeUcKX-CYZf5DtslHVWQ":{"text":"Impeccable service and unique and delicious food.  \n\n- The soup of the day was a red and b","useful":1,"cool":1},"lZQrozbuOpDAWMlf8MXhjg":{"text":"Always a pleasure! Full flavor and consistently delicious. Atmosphere is upbeat but not st","useful":0,"cool":0},"fAkXtt9LLNY31PyxezqHbg":{"text":"Herbsaint was quite good! On our trip, we ate at all the $$$ money money places and Herbsa","useful":3,"cool":3},"iMiPhvFCcAVRAMgU6-M3FA":{"text":"Chef Donald Link's culinary Mecca on St Charles offers a delicious blend of French and Ame","useful":1,"cool":1},"UOue8_zr5CettKw_ySrY5g":{"text":"Herbsaint is a James Beard award winning restaurant (2007) and consistently one of the 10 ","useful":7,"cool":6},"f6d0X6PruK72IpMZg790pg":{"text":"Great food and great dessert. Their service was amazing. After one person asked our dog's ","useful":1,"cool":0},"z_YBLbEcU_b92jefUF9nTA":{"text":"I was pleased to notice Herbsaint was near my hotel. It has been on my long list of places","useful":1,"cool":1},"pz4Lw0X4H_o1DopN24V5tA":{"text":"I was very disappointed in my Herbsaint experience. The atmosphere was subpar. The decor w","useful":0,"cool":0},"kccZwaicKRkAMP5fBfjuwQ":{"text":"The best meal I had in New Orleans and one of the best dinners I have had all year. We had","useful":1,"cool":1},"s10zrWzvjj1Efuu1svsd8w":{"text":"Lunch date before Hurricane Delta. We've dropped reservations here over the years but fina","useful":2,"cool":2},"QNNbldhfY-QHT9Nlv5TA6A":{"text":"10/5!!! So good. On a Monday night at that!! We stumbled upon this place, not dressed very","useful":0,"cool":0},"mukabYzoMIr-xjf8K6zOtQ":{"text":"Excellent! The short rib was recommended by my bartender. He took the time to not only ide","useful":2,"cool":1},"iazY6_sLI0IL9zdzrOZ6WQ":{"text":"Herbsaint is one of those classic New Orleans restaurants that have been around it seems l","useful":0,"cool":0},"HHtNJ90pGkwp82-ptVZPyA":{"text":"The restaurant was amazing from top-to-bottom. We started with the house spaghetti with a ","useful":0,"cool":1},"zMmMlDkXFbqVmyKWSp37_w":{"text":"Man this spot was perfection! The food blew us away and the drinks were exceptionally good","useful":2,"cool":0},"SF9KMXtG05NysdfGeOMQtA":{"text":"Herbsaint is one of those classic New Orleans restaurants that have been around it seems l","useful":1,"cool":0},"VTQcI9TXKBLbjRLrOF4Qkg":{"text":"My fiancé and I went to Herbsaint last week. We are visiting the city and really wanted to","useful":0,"cool":0},"gVg8Ibnp9s4WExgEhHb3iQ":{"text":"Staff is really nice, I like decoration. The duck dish is good. I don't recommend gumbo th","useful":0,"cool":0},"kawIyIm8XsGRfqcsUmcJjw":{"text":"Review is based only on the small plates, which I would rate at about a 3.5. Overall, I fo","useful":3,"cool":1},"vKp08OhG7bqBOfjUbTUyzA":{"text":"I had dinner alone at Herbsaint - not something I typically do, but wanted  a good meal in","useful":1,"cool":2},"9V1gVHcsoafnz-RtGFYyPA":{"text":"Dec 2014\n\nWe arrived in New Orleans on Saturday afternoon and after getting settled in, we","useful":0,"cool":0},"usqaKa59Kl0iXNniucc2Yg":{"text":"I really enjoyed the tuna on olive bread a must try, my husband had the meatloaf and mashe","useful":0,"cool":0},"o7qR3DuP2EtL98ioToKBAQ":{"text":"Despite the photos, the kitchen didn't execute tonight in the way I hoped.\n\nNow that I've ","useful":2,"cool":2},"ebKdVmNClj3VTf8V4zVbtw":{"text":"3.5 still ever popular, but the dishes a bit over salted.  i.e. short rib.  also had the c","useful":1,"cool":1},"hvk2xKdZagxvX1VIsRNRCQ":{"text":"Another post-Covid reopening triumph! Herbsaint immediately became my favorite restaurant ","useful":8,"cool":6},"hqOCwwG3QQdLaAYbSmgIsA":{"text":"Can I just start by saying this place is amazing! My boyfriend and I came from out of town","useful":0,"cool":0},"cZKfZfs9RDPk9eFQ79fM0A":{"text":"Stopped by for lunch and it was a fabulous meal.  Their ceviche with tuna, shrimp, pumpkin","useful":1,"cool":0},"MwgT03PtR4HqFT7iST9hkg":{"text":"We started with the gumbo (best we had on this trip to New Orleans) and Bibb lettuce salad","useful":0,"cool":0},"vOJwkTRiDqbsV-I-eCpj-A":{"text":"Great ambiance and service is too shelf. I ordered a sazerac and shrimps and fish ceviche,","useful":2,"cool":2},"mJKguWYphPIBMmBatX_Krg":{"text":"This place has food that is out of this world good, and service is amazing too. Not the qu","useful":0,"cool":0},"6Na-5Gwd2gOkPmU04QAWpg":{"text":"Multiple friends locals and visitors have told me many times to come and with COVID it's b","useful":0,"cool":0},"KTw7L9OUSlhEhXBe2GS3Fw":{"text":"I am still drooling over the food here! Made rsvp for a date night here Saturday. Parking ","useful":4,"cool":4},"vSwDUxC5km2iIPkIAQn2Ww":{"text":"Embrace the raves: this corner place on St Charles Avenue merits the praise. Start with se","useful":3,"cool":0},"CCfMuj593msYODhouULvLQ":{"text":"Slow slow service loud nice staff idk maybe COViD but would not come back   Maybe  after C","useful":0,"cool":0},"-tof6rQ_9q43Ih9ggvtwng":{"text":"Disappointment.  This place was a miss.  Called weeks in advance of a reservation and only","useful":1,"cool":2},"pDoJY3BKrFGoaVNNgHszWw":{"text":"One of the best dinners. Our waiter, Robbie, was a dream. Friendly, helpful and fun. He ma","useful":1,"cool":1},"_3UIkfFDeY5GXRPFii2ZVQ":{"text":"This is a solid spot for lunch or dinner in NOLA. We like the gumbo, fried oysters, bibb s","useful":1,"cool":0},"OdsGb7dzbL1WNlg96BObvw":{"text":"Service and food was spot on at this location. Have to say, whoever was cooking the protei","useful":0,"cool":0},"vjc9EqDD926Zmo0EFb13PA":{"text":"Everything about Herbsaint was perfect! The restaurant is beautiful and impeccably clean. ","useful":3,"cool":2},"7TGYTX5w66j6BLzdOOUrmQ":{"text":"5/21. Last minute decisión late evening with no reservations......hmm.  Walking down St. C","useful":1,"cool":1},"MiVvrnRw5ExbR-k-GUoC2w":{"text":"June 2020; Best COVID-19 meal. Reservation required. Hand sanitizer brought to each table(","useful":2,"cool":0},"iFGKBKq_B0tIBHsG9lSOpQ":{"text":"After checking into the Lafayette Hotel we ventured next door to this restaurant. They see","useful":59,"cool":44},"6GFouOAFuw547Sp-sRtBLQ":{"text":"I've wanted to try this place for years. It's really good. \n\nThe service was pleasant and ","useful":2,"cool":2},"JCw_ORAqHYMExwbqQPaeAg":{"text":"I have been hearing so much about this place and finally had the time to come try it! All ","useful":1,"cool":0},"TFFW_YwixEd2c0sv6KyaqA":{"text":"One of the very best sit-down restaurants our party of 8 had the pleasure of going to duri","useful":1,"cool":2},"xULs9JZVtwI4n546zM7unw":{"text":"Everything I tried here was good. Nice café on St. Charles with outdoor seating. The servi","useful":1,"cool":1},"eM3OC_Z2MQReE2UfUkZbHw":{"text":"Solid restaurant and nice fine with great service. 3.5 star for me but not quite four star","useful":1,"cool":0},"fD63hX5sRbeUs0ARZVeHSQ":{"text":"Had an opportunity to have dinner at newly reopened Herb Saint under the Covid19 social di","useful":3,"cool":2},"3i8Ns_x-IZyeMH-pDAQuiA":{"text":"Dinner at Herbsaint resulted in having one of the best bites I've ever had in the rabbit f","useful":5,"cool":1},"VikbYoHJ7bSTCIYj5FvSUA":{"text":"Excellent gumbo with a very smooth roux. Small bits of chicken, andouille, and okra. Rice ","useful":1,"cool":1},"cI_SuwAiD10LpAIDAtoY8g":{"text":"This is a top 10 establishment in New Orleans without a doubt. I enjoyed every dish I got ","useful":0,"cool":0},"dmTHsGbMxd0h9aZ1kBgZBQ":{"text":"I was recently visiting New Orleans and came here on numerous recommendation. A well lit, ","useful":1,"cool":0},"8U3ic_jiBmQJXq0Cmw-ohw":{"text":"Herbsaint is one of my favorite places in town- always good, all around- great staff, grea","useful":0,"cool":0},"VX3mGzb1g0bHTqinqHYImA":{"text":"quality food and service in a nice space downtown. bar up front and cocktails are nice as ","useful":0,"cool":0},"wZaeBq8ilRli1h5I3ZS_Lg":{"text":"The banana brown butter tart is still the best dessert on the planet. Ignore the suggested","useful":2,"cool":1},"Xmi86SRUjRWjAsY094-caQ":{"text":"Great little restaurant just outside of the French Quarter. I loved their small plates men","useful":1,"cool":1},"xb8snIX4EWnMjyfyxTSiAg":{"text":"Hi! \nLeaving one of my favorite spots @pluckwines  I stumbled upon this spot. The bartende","useful":2,"cool":1},"lGr8JppLHP1f6Bt7-hcs6w":{"text":"No atmosphere, distracted impersonal service, ordinary food for stiff prices.\nThere are mu","useful":0,"cool":0},"QPM9CQfRfrVXbH_w3laifg":{"text":"I feel compelled to lower my rating for Herbsaint after a few less than satisfying lunches","useful":4,"cool":2},"IushTCBK4x-S1T99aQI2jw":{"text":"This is a cool looking Nawlins bistro that has sidewalk dining and it's located diagonally","useful":76,"cool":58},"F2BtWSWlpNYEcEUX3YNy3Q":{"text":"we had a short meal with one small plate (spaghetti) and a soup (gumbo), but both were dev","useful":0,"cool":0},"yLq4vXmGWXSB93SdX9Uafw":{"text":"KenScale: 8.0/10\n\nAcclaimed chef Donald Link is a big deal in the New Orleans dining scene","useful":2,"cool":3},"sOyO3zoMLVHEAvMylUO4tA":{"text":"Dinner was wonderful. Everything was impeccable. I ate three things tonight that  had neve","useful":1,"cool":0},"n69SEpa1ka5hgz1Lk6VDjw":{"text":"Monday Anniversary dinner at Herbsaint - Donald Link's restaurant in the  central business","useful":2,"cool":0},"6r9913xzmNuaMmjZZP3DRA":{"text":"My must not miss spot every time I come to New Orleans: great location, creative and delic","useful":0,"cool":0},"6vFVa8rCBNgA8f9hajzLAg":{"text":"We've been recommended this restaurant several times and we finally decided to go for lunc","useful":1,"cool":0},"YkJ3KwIW_LQunaCy7qE3OQ":{"text":"I visited Herbsaint a few night ago solo for a late lunch. I saddled right up to the bar a","useful":2,"cool":1},"SP_IW0bHWxIpaVCcwBlZwA":{"text":"People beat a path to greatness......and when you walk by the window at Herbsaint and see ","useful":2,"cool":0},"9A-dUP5MA_sbpvtxZuQGkg":{"text":"This place is GARBAGE. We had a large party with a reservation that we rushed to be early ","useful":0,"cool":0},"qm_2kQcI_fEu383NEbvagg":{"text":"Amazing food! The ceviche was delicious. Great service and great experience. We will defin","useful":0,"cool":0},"tCQvIqKH4M2MGuRg1Nd_rw":{"text":"I was excited to finally check out this restaurant. I didn't realize it had been a staple ","useful":1,"cool":1},"VemtFoi8f-oP951izAi9Zw":{"text":"Solid dinner spot!\n\nMust have, seriously, homemade pasta in a creamy/cheese sauce app, and","useful":1,"cool":0},"-YCeJ0txgF7r177EdGdw7w":{"text":"Went for dinner with some fun coworkers. The restaurant has that dark rustic ambiance that","useful":1,"cool":0},"QmBSqYh_aiAM34vKCN0Ahw":{"text":"An absolutely amazing dining experience! Went on a date night with my wife and we were sea","useful":0,"cool":0},"wuduC6N0dB57khZ0uKEUOQ":{"text":"Party of four great Cocktails to start. The fries are best ever. Nice bottle of Gruner a S","useful":0,"cool":0},"VFbINTlBiPsn6rEqL68O6w":{"text":"My husband and I went here and the food was amazing!!  The decor and service were a little","useful":0,"cool":0},"XI_rYtlCwLGO-IWUD8DuRg":{"text":"LOVE! \n\nLove love love love this place. It's modern, it's stylish, it's fresh, it's French","useful":19,"cool":16},"4urb-qHy2JeHdKmhEus5yA":{"text":"We had an absolutely amazing lunch at Herbsaint. They had tables (distanced) right NEXT to","useful":2,"cool":1},"QNfo-djOLcGabbzHwJmN3g":{"text":"Just enjoyed a wonderful meal here. Fried oysters and the gumbo were top notch. Washed it ","useful":1,"cool":0},"Lo9kNt6YYZuhuMDhB9nMcg":{"text":"My wife and I went to this restaurant last week. We were in New Orleans for only a couple ","useful":2,"cool":1},"sJpU7WoCWn5X1AtB8TwA9A":{"text":"If you want fantastic New Orleans food, eat elsewhere. If you want pleasant, attentive ser","useful":0,"cool":0},"SHnOOMg2COQBxM_sNz-AFg":{"text":"When I checked in here today for lunch, Yelp prompted me to write a review. And it's about","useful":1,"cool":1},"prlmc_dm1vwJS7PTHNf6Sg":{"text":"We have dined at Herbsaint many times. It's one of my favorite restaurants in the Warehous","useful":0,"cool":0},"avrNLNrctlyEDx7HNVFnzQ":{"text":"Holy moly. We have had this place on our radar for a while and kind of avoided it because ","useful":3,"cool":2},"vOVHKVYLJi63RwecK-1Z_Q":{"text":"Proving yet again that when it's in the menu, order the duck. The confit served with green","useful":1,"cool":0}}