{"pdCD9ttRPvDyjyrMJe1HbA":{"text":"Very clean, very modern hostel. Location is right on bus line and 10 min walk from Streetc","useful":3,"cool":0},"1r3FB8GfPtYio2dux36kCQ":{"text":"This hostel is nice. It is still a bit in startup mode, but the accommodations are clean a","useful":1,"cool":0},"jWUUDiZhRtv_GTcRq6nXww":{"text":"They are great it's a nice place and they carried my daughter down the stairs because her ","useful":1,"cool":1},"7VLfD5V_FySV8cdAAYooJQ":{"text":"SUPERB ALL AROUND\n\nLOCATION: Within two blocks of key public transit stops, including airp","useful":0,"cool":0},"h9pm0GtB94KWRz5W-AtHLg":{"text":"A great place to stay. It saved our NOLA trip. \n\nOn a recent 3 day swing in New Orleans we","useful":1,"cool":0},"xP1gf5fZ9P3P4ZLDvQ9D3A":{"text":"My friend and I stayed at Site 61 over Mardi Gras weekend and it is probably one of the be","useful":1,"cool":0},"9LM8eoBZpZ7gJvRzCtjDsQ":{"text":"This place is amazing. The staff, especially Billy, are so nice! And the bathrooms are cle","useful":0,"cool":0},"agMeK_I0xFGOFyQ05qzsTw":{"text":"THE ROOMS\nI stayed in a mixed dorm (had three bunks) with shared bathroom. Although the pl","useful":5,"cool":1},"wy6EtKSs-Tg_kPyuVjoqwg":{"text":"Very clean, felt safe the entire time. The doors were somewhat loud inside but this place ","useful":1,"cool":0},"J40Aa_5U1HUt344BzpqumQ":{"text":"Beautiful property, clean and neat. Staff wonderful. I personally can't wait to visit agai","useful":0,"cool":0},"psM7cFZYg6wE_QeAdrm9Vw":{"text":"I lived in the Lower Garden district in NOLA from 1998-2002, and had been trying to get ba","useful":1,"cool":2},"BfZR9a8LXi1HZKJLmjFi7w":{"text":"A buddy and myself spent three nights here and I was very please. The private bathrooms an","useful":3,"cool":0},"B768MjFAwLfFyafZgcqcgQ":{"text":"I had never stayed in a hostel before and I was a little nervous about the quality and cle","useful":1,"cool":0},"5VBo6UGo25h4Cxa32dOE5Q":{"text":"I only stayed here one night briefly so take my review with a grain of salt! \n\nPROS:\n- Per","useful":3,"cool":0},"dXXs8upm1oPt9Jv0HEPmrw":{"text":"We loved it so much we came back a week later. We loved Nola. But I think we loved staying","useful":2,"cool":0},"KiggPPq3NwEmbsv8RvPxXA":{"text":"Very nice hostel. It's only a couple of months old O believe so everything is quite new. T","useful":2,"cool":0},"QdvkEkiLN-2oTsnbwzTpzw":{"text":"Can't recommend this place enough. It's a great price, very clean, they have private bathr","useful":1,"cool":0},"ZeupjVUBjarnPXQG_5JFsw":{"text":"I have stayed at a lot of hostels and this one is my favorite. I was traveling last summer","useful":1,"cool":0},"iocL4hIuXo5vvwB72ER4Ew":{"text":"Great place!\nI stayed in room with 4 beds.\nIt's hard to say that is a hostel. It's a reall","useful":2,"cool":0},"4L2rEylQT-0IK5252ygQGg":{"text":"Love this place  if you looking for good place to rest and enjoy a nice bed  nice people t","useful":0,"cool":0},"aWgGttKy0utM21m8ZCW5lQ":{"text":"Basically the nicest hostel you are going to get for $30 a night. They just made it a non-","useful":1,"cool":0},"Yd9-DZviS4d_b2MGp7Ge4A":{"text":"I stayed for two nights in the 2 twin-bed room and couldn't be happier. Very nice staff, v","useful":1,"cool":0},"cQC5MTHfXIK5SgG_aBdpFQ":{"text":"The hostel was a great place to stay when I was in town for a week around the French Quart","useful":0,"cool":0},"nPn00uc3icOAQFvf3HryVA":{"text":"New Orleans was our mid-way stop on our cross-country roadtrip, and much of what made our ","useful":0,"cool":0},"U1fuwRET7uCmrehAOIqm-g":{"text":"I have to say this Hostel was amazing! This was my first time in New Orleans and I primari","useful":2,"cool":0},"SGmX5Xs8fg3yPOKeO8gpIA":{"text":"It was great booking until the. Older woman told me I came to check in and they told me, I","useful":0,"cool":0},"OCPoZ8FK4_Bo0m22ArSBng":{"text":"Will definitely be back here if I come back to Nola!\n1) you can't beat the price! $30 per ","useful":1,"cool":0},"G4i6amBgxxxaDh28bv2m-g":{"text":"I adored this place. I had such a great experience here that I stayed a few extra days in ","useful":1,"cool":0},"fP4QjXE4nfbitQUpy4u__A":{"text":"I don't write a lot of reviews but this was my second stay at Site 61 and it was wonderful","useful":0,"cool":1},"9fREauNEIUDGOCLWZFPpvA":{"text":"I don't ever write reviews but this place was great!  Very clean, great staff, and the hou","useful":1,"cool":0},"BE312voAsNhr9MkJEgfjQw":{"text":"Just off the beaten path but lovely service and accommodations. Jean was very considerate ","useful":0,"cool":0},"NMzFYCYd1VrhJgCEYJbcdw":{"text":"I stayed at Site 61 for 2.5 weeks in January 2017 and it was the best hostel experience I'","useful":1,"cool":0},"QFVlEq1ajOTZFbP7JP5apg":{"text":"I stayed there for one night and those working there were friendly and provided good servi","useful":0,"cool":0},"pXgkPxZsy84timlGGqhSZw":{"text":"A great hostel and probably the best I've stayed at. It was very clean and they provided f","useful":3,"cool":2},"ZAMSgfQbSHAzzXqMZJh7Xg":{"text":"Such a wonderful place to stay. As a solo traveller I was a little skeptical at first of h","useful":1,"cool":0},"dZgwGTjnHiZjrjHy0aqK9g":{"text":"I couldn't imagine my NoLa trip any other way than with this hostel. My friend and I staye","useful":1,"cool":1},"p9yUCDI8bx2PuxY7s-nCPA":{"text":"A great hostel! Jean and the family were great fun to hang out with in the downtime, and k","useful":1,"cool":0},"FKBxWFeAeCvOe5vHd5Fqfw":{"text":"My best friend and I stayed here for one night and this was our first hostel experience. W","useful":2,"cool":0},"wz8FSaWsS5NFqB_On44L3Q":{"text":"SAFE, CLEAN, GREAT LOCATION! I was so impressed with this hostel. The staff is very friend","useful":1,"cool":0},"p9K1e7d6jofORLJhNzcWEQ":{"text":"My friends and I thoroughly enjoyed our recent stay. We met several other people while the","useful":0,"cool":0},"3MW08YryjJxKwZZoekfg0g":{"text":"I love this hostel! With a southern home vibe, Site 61 is surprisingly clean and spacious.","useful":4,"cool":2},"mrq6n8kDiKOnyu5DZlK5YA":{"text":"Clean, quiet place. 6 block walk to trolley that goes to Bourbon street. 3 dollars for 24 ","useful":0,"cool":0},"Wzc-6T32g4T61IerJ2-i1Q":{"text":"My girlfriends and I had a great time at Site 61! The hostel was very clean and the staff ","useful":0,"cool":0},"PuUDv3ilq5_702IpedhxPg":{"text":"I have been to NOLA several times and make this my \"go to\" for a place to stay. The house ","useful":0,"cool":0},"250wQtRC9RlZ5VSeZarcGg":{"text":"Great place located on the bus line in Mid City. \n\nThis place was right in my price range ","useful":6,"cool":2},"blNcTdROWjOwbzJdY08rtQ":{"text":"This is a great place to stay when in New Orleans and trying to be cost-effective. The hos","useful":1,"cool":0},"VQN8JCkPfbNWsVnJ-LxqqQ":{"text":"We found Site 61 on a site called Stasher to store our luggage for a few hours while we wa","useful":0,"cool":0},"NSwG5i8ofZCWZCfIcoHxDg":{"text":"I was in NOLA(New Orleans) after the 2020 Mardi Grass.I found here on Airbnb.The reason I ","useful":0,"cool":1},"UZXiygI3NvZ7L_qqy755EQ":{"text":"I did enjoy my stay, but you have to know what you're getting into in New Orleans and deci","useful":0,"cool":0},"l-McKqMa4PQ4Bir0iMcE9w":{"text":"I had the most incredible time here this weekend. I kid you not when I say this: this plac","useful":1,"cool":0},"BvgqiQmWRx0KTI-DdpWDhw":{"text":"By far the best hostel I stayed at during my month-long trip the US. I ended up at Site 61","useful":2,"cool":1},"tjmWK3v0R_0DkufaFAVW2A":{"text":"The eccentric proprietor does not allow service animals, in open defiance of the Americans","useful":0,"cool":0},"qIy3cpcg4UN865svLdY-Kg":{"text":"My 1st time staying at a Hostel in New Orleans and this place, Site 61 was very decent.  T","useful":0,"cool":0}}