{"mOFX_uJ62GVSJDntx26xlw":{"text":"Great little breakfast spot! \n\nThe donuts are huge though so definitely share one for two ","useful":0,"cool":0},"WdUC3IihA4xB9CyfSMO7Lw":{"text":"I love the creativity of the donuts. Always something new to try. The donuts are large in ","useful":0,"cool":0},"zjmh5T0cRPiMsnw1LtLV1Q":{"text":"I am amazed at the transformation of this space! They made it look spacious! The coffee me","useful":4,"cool":1},"Y2ROTqYwflF2_e0tlIoXOQ":{"text":"LOVE LOVE LOVE! Their cinnamon rolls are to die for!!! Lattes are LEGIT! But most of all t","useful":0,"cool":0},"4W2ikX_crTfcJanwIQQh-A":{"text":"My husband loved his sandwich so much he said his idea of heaven would be a place where he","useful":0,"cool":0},"GXePkj8zTBrqTsIMdejBmw":{"text":"District hand pie and coffee lives up to the \"family's\" charm. Fabulous coffee - even thou","useful":0,"cool":0},"zK3d5pzp_wuFcllGTGnwRw":{"text":"Friendly staff, quick service, the best cinnamon roll I've eaten.  They warm it in the ove","useful":0,"cool":0},"q4SCqRy-KlXXh6gcTkStNA":{"text":"I love this spot. Breakfast pie and cold brew are wonderful. I had one yesterday and woke ","useful":0,"cool":0},"KtdKFtfcrVXN8ay69pjCig":{"text":"Staffs are friendly. Pie crust are wonderful and buttery. The avocado strawberry is wonder","useful":0,"cool":0},"OWel2k5vrJSksJdqT1ZcnA":{"text":"Vietnamese coffee. Period. That's all. This coffee spot is definitely different than all t","useful":0,"cool":0},"kq-4z3bj4Go_BNUQXE7vtQ":{"text":"You have to try the breakfast pies before they go away next week. I made sure I ate two of","useful":0,"cool":1},"jrsxBlaHhzsJfku9B7Lw3w":{"text":"The hand pies and coffee are amazing- in particular, the cold brew. And the ice balls! Whe","useful":0,"cool":0},"aeQa0f4ct7IbwVY09GIPPw":{"text":"I can't (yet) speak for the donuts here, but they boast great salads and one incredible ho","useful":0,"cool":0},"5-vMXID1S89LM2jSNS76IQ":{"text":"This is a satellite shop of District Donut, they have the same great donuts with a smaller","useful":1,"cool":1},"Is6c81FaPhaTuaefbSnO7A":{"text":"Okay, so I love District Donuts. They're definitely purveyors of the Nouveau Orleanian vib","useful":11,"cool":5},"Q0k1mMDUmpLT8RS6PyJvlQ":{"text":"For such a tiny spot and specialized menu, this place packs a diverse flavor range and inc","useful":1,"cool":2},"C9-kdG48hZY21C-KY8nSRQ":{"text":"I love this spot. Breakfast pie and cold brew are wonderful. I had one yesterday and woke ","useful":0,"cool":0},"Rz4t7-2SuWruGU9pW_tBcg":{"text":"This place is so sweet! The one dude Adam who is always there is sort of quiet but opens u","useful":0,"cool":0},"yeViymhM96KvswXcFwc_sA":{"text":"So there's two District shops. The other one does coffee, big ass donuts and sliders, whil","useful":2,"cool":2},"B_CP5KQqImcM1aoLhZjH7Q":{"text":"I had the cold brew and it didn't need any cream or sweetener (if you're that kind of pers","useful":0,"cool":1},"MeR-Ufd9syVHuo7Hii9SEQ":{"text":"I hate to admit that I ate a doughnut this big and decadent...   :). Hell, if you are goin","useful":0,"cool":0},"j5mkb4qSdVMe-30tU8c4QQ":{"text":"Great coffee, good pies. 10,000 Faces beans and a creative menu. Go-to's are the nitro ice","useful":0,"cool":0},"L4SUfYCnbz0RTnnyfQoZVw":{"text":"Oh, my goodness. These are the best donuts I've ever had. No weird bagged fillings and ord","useful":0,"cool":0},"viVtlQoDWcHuP7IrO_SRRw":{"text":"This place is amazing. We came in for a few days from Boston and were so impressed. The st","useful":0,"cool":1},"yAheQ_NTcbVJdUL2sS6NrA":{"text":"Love the decor of this place! Nice antique touches and definitely on-trend. \n\n3 things I w","useful":1,"cool":1},"FcEQxOY3Wp75apNUil6E9g":{"text":"This location is so cute!! It is always less busy than the other one farther down magazine","useful":0,"cool":0},"GStgmYxRAm6KUfqBrSNhqA":{"text":"Here's the short of it -- a pocket gem I'm reluctant to share but the people, food, and co","useful":1,"cool":1},"26aU8Xb2atVPvB-9in7oQw":{"text":"What's not to love in this little hipster cafe? Great donuts, good coffee and friendly fac","useful":0,"cool":0},"fjBKSGOkRvnP_aT-dkJ2Kg":{"text":"This is the best District Donut location of all! It's never busy and still has all the gre","useful":0,"cool":0},"hqxJ62rLMeQPX_-64lKBJw":{"text":"I live in Chicago and am swamped by donut shops but these donuts are some of the best I've","useful":0,"cool":0},"l85avzmfZxXjmIXK8w9vgw":{"text":"Nice vibes here! The baristas were really being jovial when I came and it was great to see","useful":0,"cool":0},"bcmtKFeRTH7YRnduplMZxg":{"text":"EDIT: I down graded to two stars because they got rid of the pies and made it an annex of ","useful":0,"cool":0},"y3_OEKQj8k6_Vck8PkqkoQ":{"text":"Great espresso...I mean top five and I go out of my way to search out great espresso.\n\nSer","useful":0,"cool":0},"QcZqAI7_0WDFDlhitDVPoQ":{"text":"The staff are so nice!!!!!!! Simple done beautifully.\n\nLove the strawberry basil.","useful":0,"cool":0},"xsJW6EVCReFQMRqzxao91A":{"text":"Excellent new addition to the neighborhood. Interesting and creative craft coffee menu too","useful":0,"cool":0},"JqvfNeJOFi0Ap9uW51pSUQ":{"text":"Great cute place! Food was great- biscuits were delicious and so was the maple bacon donut","useful":0,"cool":0},"bpC2l-IRvNnsTsd_xPY5mQ":{"text":"Delicious cold brew and the best bacon sandwich ever! Highly recommend the Miso Praline Ba","useful":0,"cool":0},"IiT2kD9SS96402jgqKvmyA":{"text":"This is a perfect spot to stop in for a quick but inspired breakfast treat. It isn't cheap","useful":1,"cool":0},"yWsU5wFDF9xCCYdm5j-NZw":{"text":"Wonderful coffee!! I ordered a cappucino and it was amazing! Completely artisan and sophis","useful":1,"cool":1},"aN69cuVg8VAqH6lN5YP8zw":{"text":"4 stars for hand pies! They are so good, sweet and savory! And even reheated, they are sti","useful":2,"cool":0},"g9D0jvRoxijLV95mIm660Q":{"text":"Hands down best espresso in town. I've tried a dozen others and this is the smoothest!!","useful":0,"cool":0},"MFWYtcFDsK8pFDemVQYUgw":{"text":"Hand pies and breakfast pastries from the folks from District Donuts. There are both sweet","useful":3,"cool":1},"W3IT6R7F80NZpg3trMfueg":{"text":"Wanting to explore this part of Magazine Street, I had bookmarked this little spot on Yelp","useful":23,"cool":14},"1IoKo4JVc-sWBog4VWNhMg":{"text":"Friendly/knowledgable staff, cool interior and outside seating. The BREAKFAST PIE was deli","useful":0,"cool":0},"kL6C6IHrImTtyj_bP0vlyQ":{"text":"A friend told me several times that the breakfast muffin that contained a soft boiled egg ","useful":1,"cool":0},"HybK4m6JhkJ6sizVb1NQqg":{"text":"Great place in the Lower Garden District for the pastries & bakery fix. Great variety of o","useful":0,"cool":0},"b-cdhS_2U1Zp8Yqg9x0KHQ":{"text":"We loved this place! It was worth it to stop by and try their cinnamon and red velvet donu","useful":1,"cool":1},"Or7zWWuPEHKB4TpI8236fw":{"text":"Been 3-4 times.  Like the vibe. Plus is that I can easily walk there. Coffee is good. nice","useful":1,"cool":0},"5x0dsWVNX3DRwkY02yP48A":{"text":"Best Monte Cristo I've ever had!!  Line was long, which makes it tricky to wait for food b","useful":1,"cool":1},"_gBVmuaGXfE2baCRdsNlCg":{"text":"Stopped here for breakfast while in NOLA. The place is very small so you can just take you","useful":0,"cool":0},"yfm0ca0gsA-0Nwr1jvbvFA":{"text":"Visited this place hoping to order the Nutter Putter, was a bit disappointed they did not ","useful":0,"cool":0},"uufn8r8ndZ7mcDjSC7lS8Q":{"text":"Holy donuts! I hail from a land of countless old-school donut shops and a few trendy ones.","useful":9,"cool":7},"ngYZIy_wUBJ1vOg5e1tnmg":{"text":"SOOOO DELICIOUS! Like OMG! Got the Kung pao chicken pie and the shepherd's pie! The Kung p","useful":2,"cool":0},"vZEAHulwYqsRGNBOCyCwNw":{"text":"Donuts with personality and taste to match. Fresh, amazing real bakery smell. Kinda pricey","useful":2,"cool":2},"Wm4ADhYfiro0Y_WpnbrTag":{"text":"This is the best donut shop I have ever gone to.   I went with a few friends so we split a","useful":2,"cool":2},"_YeOk3GvUtnLjgHsTnVx3A":{"text":"Items Selected:\nTiramisu\nChocolate Milk\nBrownie Batter\nSweet Root - Beet Glaze, Candied Ca","useful":5,"cool":6},"bzQ2HVhKK2iUmHP-r2fwew":{"text":"In search for a quick coffee while picking up items on Magazine street, I finally had the ","useful":11,"cool":7},"DxqEM_5kcaSYtcvb2YeRXA":{"text":"The coffee is amazing and the service is fantastic.  I've tried coffee places all over the","useful":0,"cool":0},"RuAYSx8LiPGyqLMf8pBAxA":{"text":"This location is unlike District Donut's other venues, which are all decent-sized restaura","useful":1,"cool":1},"FeeVDatYVOpm1eaH3DFFTQ":{"text":"Giant donuts!! They looked so good that we may have gotten 6 donuts for 3 (normal sized) p","useful":1,"cool":1},"OWyQdGFOt45HQ1Gk0xJRSA":{"text":"OVER $16 WITH A COFFEE!!!\nI purchased two 5\" popovers, one a typical breakfast pie, the ot","useful":17,"cool":3},"G-MVBy-xlAfcIvkHdd4Etg":{"text":"District Gimmicks\n\nSo, let's start with the good. The structure and layout is fantastic. I","useful":4,"cool":2},"rOe1Sq003L5_3WUsMZl7WQ":{"text":"I was really excited for this place. We got there at 11 AM and they only had three donuts ","useful":2,"cool":0},"tCsS4ZUVu_DJwohsuwDYoQ":{"text":"A solid choice for the type of donuts you only want to eat one of. This isn't the type of ","useful":0,"cool":0},"q0Bk9bjrGxnXxUcOj0jcIQ":{"text":"I come here all the time for their stuffed donuts and today I decided to try their coquett","useful":0,"cool":0},"RIgnUJ0SxTVmpTsRw2AgIA":{"text":"Love their praline bacon, egg, and cheese biscuit and Vietnamese iced coffee! Best of all,","useful":2,"cool":0},"5t6jGR-CE9SeQQ-wjUOg9A":{"text":"Coffee: pretty standard coffee. Enjoyed my latte. \n\nAmbiance:  neat place to get dessert/b","useful":1,"cool":0},"BfK3N8Ft9lz-x6yebvtUdA":{"text":"Stopped by for breakfast and we got the bacon, egg and cheese biscuits (they're huge!) pum","useful":2,"cool":0},"zQ9gq29_E2BmGuK_jwTrfA":{"text":"Friendly staff.  Vietnamese coffee was delicious.  \nI can't have gluten but the doughnuts ","useful":0,"cool":0},"LdfkP-M4mtXyuM0cwJe-QA":{"text":"My girlfriend and I visited on the 9th of December in the late afternoon. I ordered a glaz","useful":1,"cool":0},"kvk_Dp0WemaYp61X2hd2Gg":{"text":"If you're on magazine street, this is the place to stop for coffee. \n\nThis was the first p","useful":4,"cool":5},"kUwlAur_qmYJoIiQ01cKHg":{"text":"Love their coffee! Food not suitable for vegans, but they have milk substitutes. Had an oa","useful":1,"cool":0},"oyM3PDCL_4k3Gz_ueiz43g":{"text":"I love this place and would normally give it 5 stars but can't bring myself to do so after","useful":1,"cool":0},"SvC1mkvG-ABrx_BgUodLig":{"text":"Who doesn't love donuts in the morning? Or in the afternoon? Or for dinner, OK you know wh","useful":2,"cool":0},"NxT2taOZtvr8hLnQwmKbGw":{"text":"We've come here about once a week since they opened. They definitely have room for improve","useful":4,"cool":1},"BrW_20Q4TCtvzL2l-rgg5w":{"text":"meeeh coffee. I imagine folks coming here because its close to Whole Foods. It was good bu","useful":6,"cool":2},"pD86L8I3HY8bM8afRe-5AQ":{"text":"WHY WASN'T I INFORMED ?!?!?\nQuietly last August, ill-conceived and over-priced \"District H","useful":8,"cool":5},"gnq0CK4YlMt1_ngwsFEVzA":{"text":"Super cute coffee bar and friendly staff. Coffee and breakfast sliders were delicious! Def","useful":0,"cool":0},"8YPDsOjlhuIaR4507XwvnQ":{"text":"Do yourself a favor and stop by this place if you are in the area (and even if you are not","useful":2,"cool":1},"vq82U7IrBfcZLy8IbZHP-Q":{"text":"If I could, I would give this place no stars. They are beyond rude. Me and my family came ","useful":1,"cool":0},"2r_I28BILNo9I7EWr3ibXQ":{"text":"To be honest I  did not go into \"District\" so can't really comment on the environs. Actual","useful":0,"cool":0},"9XUD1MwAplkJDyxCNLdxbA":{"text":"This District is a lot like the other District, except take away the one thing they do wel","useful":2,"cool":0},"AdLs0lPuWLYMk1W2EjXQvA":{"text":"This was going to be our last meal in New Orleans before heading back home this morning.  ","useful":1,"cool":0},"5WsoVWJ7VMah0uRw6evuBw":{"text":"Delicious donuts and cinnamon rolls. Haven't tried the coffee or burgers. They are always ","useful":0,"cool":0},"e5dv7pswiuH7zaeExGAKUA":{"text":"Best donuts ever! The staff was so friendly and outgoing. Gave great recommendations! It w","useful":1,"cool":2},"sGs9okiskML-uAIXUsETDw":{"text":"I've eaten here twice, and I like the feel of the place; but both times my hand pie has be","useful":1,"cool":0},"PDm2d5-fc8HPkPl5TIwTJA":{"text":"I'm not much of a coffee person but I crave the iced lavender latte.  Currently my favorit","useful":0,"cool":0},"5qWW12K7Jora-MotkjaG-w":{"text":"YUMMY and very cute! You have to get the Breakfast Muffin, everyone must try this Breakfas","useful":1,"cool":0},"GahZwvj0rRAjWC7altCkKA":{"text":"This place had a barber shop my whole life but being the baby sister to District Doughnuts","useful":4,"cool":0},"JMqOD1MBjOK5WyQVu_WirA":{"text":"Cute little donut coffee shop.\n\nWe arrived in the rain so it was easy breezy and all to ou","useful":6,"cool":7},"PRj8_6pdWLAJtFwwYe8fXw":{"text":"Two stars for effort because the location is nice though crampy. Anyone giving this old r ","useful":1,"cool":0},"2SFaN6U3kNFc40vjsBVOlQ":{"text":"$7.20 for one ham and cheese biscuit is too expensive. Good biscuit but is it worth a quar","useful":1,"cool":0},"aA1AtdXr6ygHHtpdZVIN1Q":{"text":"A cute breakfast spot! Line was out the door but moved quickly. Workers were on top of thi","useful":0,"cool":0},"S7R3pmFf0R0-kc8p1oFpmQ":{"text":"When Velvet coffee closed before I could try it, I was disappointed, but I believe this ha","useful":1,"cool":1},"G9Gx4abRKCOvxWLXtB2rxQ":{"text":"Stopped for a quick coffee break.  Was very impressed with the use of space.  Although the","useful":2,"cool":1},"90mNtBvKbl9_k9ZcRj4eaA":{"text":"Good coffee, one of many choices footsteps apart in this neighborhood.  \n\nIt's a tiny plac","useful":2,"cool":0},"U8TTTZPBttibVe5VgROxew":{"text":"Ehhhhh.\n\nIt's OK but I don't enjoy it as much as their donut slinging sister down the stre","useful":3,"cool":1},"m1Q8D5BrwPdVHtwcyvjEQA":{"text":"GET THE BRÛLÉED CINNAMON ROLL. If you love sweets, it is a must!!!\n\nCozy & hip little coff","useful":1,"cool":1},"g3I1_a0Dl9JyVnZlymhz9g":{"text":"I die. Delicious cannoli donut! Huge! Probably with my entire caloric intake for the day b","useful":1,"cool":0}}