{"EG7qWxQw5tAy4Y06vzI_-w":{"text":"MoPho was recommended to me by son who is a chef.  Very unimposing location, but the food ","useful":1,"cool":1},"GH2lIgeN_P_MVkyPXMoyRw":{"text":"First time ever trying this restaurant & boy it was not a disappointment! The hostess was ","useful":0,"cool":0},"D-o_THv5yD-ex-PwIZ4eJw":{"text":"I Want MoPho!\n\nFirst time eating Pho and I want more! Such a warm and inviting bistro near","useful":0,"cool":0},"KHE7HQvQZ4ZypsViXumC-w":{"text":"Went with a group of 9 people for a quick dinner before Celebration at the Oaks. My compan","useful":2,"cool":0},"jm0lu4AOsvvusdBd6K3PQw":{"text":"Everything we had here was good, but by far the best were the po-mi (banh-mi) sandwiches. ","useful":0,"cool":0},"Kbo-e5X510dRXuQkM-HA3w":{"text":"I went to Mopho yesterday. I decided to try something I hadn't before. I got the pad thai.","useful":0,"cool":0},"mNySl-7K0x-YBKU9UpQXuA":{"text":"I've now eaten here twice and have yet to try something NOT delicious.\n\nThe shrimp and tof","useful":3,"cool":0},"u4hnieENg8f1Ao8oYb7IdA":{"text":"I got forked at MoPho! \n\nWhen I sit down to eat, I carefully choose which food will be my ","useful":2,"cool":0},"v1shDQ7y3gHsAxa0RhsOtA":{"text":"Had a fantastic lunch here. I'm not 100% sold on Vietnamese food (although I feel I eat it","useful":3,"cool":0},"i8fcB_9rCrlhX-O6m75Sag":{"text":"I went to Mopho today because I was craving something different from the usual suspects ar","useful":1,"cool":0},"02z4eGxiUEB8VE2wUaj2WA":{"text":"I don't think I can write a totally fair review until I've had their pho but there was too","useful":0,"cool":0},"CO1AQBV_ZUspR3Vvma3MPg":{"text":"When I travel, eating is the cornerstone of my trips. I snacked my way through NOLA and ca","useful":0,"cool":0},"BOQSb-FVrfQ4-BE5RrpcMw":{"text":"Lukewarm oily broth vegetable pho served with a basket of wilted greens and about 10 broke","useful":1,"cool":0},"Ix5frNvbzRA0i9Yj1eef9w":{"text":"Cool restaurant. Relaxing atmosphere. For Asian food, it was a bit pricey. But we like to ","useful":0,"cool":0},"-CF6T6lyqoqcH_Hjdbvf4A":{"text":"Our first time here. The wings are as good as everybody says. Remember to drag them throug","useful":1,"cool":0},"vcJrr7jFPHCV0qpABYtubA":{"text":"Heed the description in regards to this place being Asian fusion; in many cases delightful","useful":5,"cool":0},"nt2d_qw8jhE2LaaigNWpSA":{"text":"If you wrap up everything I hate about Awfulstin, TX into one restaurant, it would be Moph","useful":12,"cool":6},"ECwFK6lj1Fnpa9i2ra7jig":{"text":"We came here on a Thursday night and we got so luck because they happened to be doing an e","useful":0,"cool":0},"U7SkNHwLXkS6KkTR6xb39w":{"text":"Honestly the ingredients are good and the pho is made out of bone broth.... But it's not t","useful":2,"cool":3},"C-ORA9mLekiIPeoeseoLgg":{"text":"You should definitely go to Mopho, I tasted some amazing food, but there were also some le","useful":0,"cool":0},"-CJIKMuKQTq8vWz0wvS7RA":{"text":"Brand new place and they just had a write-up in the Times-Picayune Lagniappe yesterday... ","useful":5,"cool":1},"YxuOLg7tQQRnhDAU9e8szw":{"text":"New restaurant that needs some more refining. The cheek with vermicelli did not have enoug","useful":0,"cool":0},"CIuzyzJGE7qR4oLOvo1b3g":{"text":"Their Lemongrass chicken wings are the best wings I have ever had.  Also, if you feel like","useful":1,"cool":0},"Nlcw5Nj9nX8uKgTkMLzoiw":{"text":"Yes it's packed and yes it's different.\nThe staff is great, our waitress was running her t","useful":1,"cool":0},"7C_3lTUMSvUM1jsmeFX64A":{"text":"I dug this place. It's a great Asian fusion joint. Keep in mind, it's not traditional. Tha","useful":1,"cool":0},"eeifycrUzZJTjDB7h49prw":{"text":"Nice crew. Good service. However, food was so greasy. It's not actually Vietnamese style. ","useful":0,"cool":0},"97GYhVJdOZVjf15eSR_X9w":{"text":"I could eat here daily, it's that good. The wings, just get them. Pho? There's pork belly ","useful":1,"cool":0},"b2J7wKabsP1m-edXW0LbMg":{"text":"If you want Vietnamese food, don't come here 'cause it's not authentic; they're more like ","useful":2,"cool":0},"-f1DA6wjZTN8hxlbsv5eqg":{"text":"Great grub. I'm a frequent visitor to N.O. & I'm a food fanatic.  My fiance & I loved the ","useful":1,"cool":0},"e_w4qBAjb8MCH3dpjZn9Yg":{"text":"Great food and atmosphere. Pho is wonderful and very good quality. Staff very friendly.","useful":1,"cool":0},"8svlC8Ra7SGqNUdhtmz9Sg":{"text":"Super interesting menu! The chicken wings are their best seller and rightly so. They are a","useful":0,"cool":0},"DLbs5znDd0yeg9k8XnQj6A":{"text":"Weirdest pho restaurant I have ever been too. If I ever come back I would not order the ph","useful":0,"cool":1},"CtwPpD1eQ2oOMypaYSdw3g":{"text":"The pork belly bowl was delicious. Casual environment and relatively inexpensive for a gre","useful":0,"cool":0},"avqGuviclmZ1VIN97O7O_w":{"text":"Awesome spot for trendy viet food.  Particular strengths are unhealthy appetizers and the ","useful":1,"cool":0},"CfsrzsA9TCK0alkL4sfI3g":{"text":"BLUF:  The first time I went here I wasnt very impressed but the past few times it has bee","useful":2,"cool":0},"ywsdDId5Pw9pVEeIg8KWNQ":{"text":"Duck po-boy (really bahn mi) for $8? Yes please.  So tasty...Still dreaming about it four ","useful":0,"cool":1},"N8TZuyxK-VA7-g26Y5NPNw":{"text":"Good lunch spot - we enjoyed sitting out back and the service was more then adequate.  Ver","useful":1,"cool":0},"uS-q3EwsYIoMvrT75xt9Cg":{"text":"It was really good the first time we went. So we have been going back frequently since (4 ","useful":0,"cool":0},"XCI8WG2NKQhMmV-RxIastA":{"text":"I'm loving the chicken wings, bubble drinks, ribs, po boys, fowl pho with duck and tofu, a","useful":1,"cool":0},"63wt_2_3pull1l8GOP8IHQ":{"text":"Don't come here expecting authentic pho. That's not what you're going to get. They do give","useful":1,"cool":2},"Mrl056W-LxLzfK0vgtR-pw":{"text":"MOPHO is one of my favorite \"Asian Fusion\" restaurants in New Orleans. My favorite element","useful":1,"cool":0},"1mvkgcG1u3Lj96zkh7MV_g":{"text":"It pains me to type this review because I want so much more for this place, and we even ha","useful":1,"cool":0},"jQZzsimJaFd4fTlasPyIUA":{"text":"Good good, weird ambiance- very dark. The duck is do good! Tangy and delicious! Pho was ju","useful":0,"cool":0},"M6oOO1eqfYuGeNjglj9TBw":{"text":"the tea drinks w boba was incredibly flavorless and the boba itself was rock hard. actuall","useful":2,"cool":0},"ukGLLXiHzxSbR5oomPqNaw":{"text":"The chicken wings were excellent, however the pork belly dish was nothing but a dried up p","useful":0,"cool":0},"tC8GwVIrWTuq0KlB8wl0TA":{"text":"Great food, great drinks.  Great owners! Clams are a must! Everything is delicious.  Love ","useful":1,"cool":0},"m_aGvMNtNBCOk0hZTJ91lw":{"text":"The food was great and Mopho has a great atmosphere. Must order the brussels sprouts! Don'","useful":0,"cool":0},"w0mkiMwSOosheU2i8XLNPw":{"text":"Wow! Food is definitely delicious but pretty pricey. I have come here a couple of times. T","useful":2,"cool":0},"B5xUqMksJeqytVdqYzjTKA":{"text":"Wings were excellent.  I wouldn't typically order wings at this type of restaurant, so i a","useful":0,"cool":0},"l1qn5RbrMHJkefhCioyvcQ":{"text":"We started with the shrimp spring rolls(good)  and chicken wings with ginger (sweet).  The","useful":2,"cool":0},"05kQile740_Ut4C6haKJBA":{"text":"Amazing Pho with even greater service. For 10 dollars (lunch special) received a large  en","useful":0,"cool":0},"aGLArd5AwPpJSLcEDhX3zQ":{"text":"So I heard about this place and as I drove up all I saw was the Burger King because the pl","useful":2,"cool":1},"qwdT9hHnLD-moQ0en8PkFg":{"text":"Pho Tau Bay is closed?! Sad sad news for New Orleans!  I decided to try this place. It got","useful":0,"cool":0},"CcfdfX6qpNRXD-Vh4askCg":{"text":"A group of friends and I decided to try this place out.  The atmosphere is nice, the staff","useful":1,"cool":0},"ELxHpvWdr0-LM8LLNlWWKg":{"text":"Mopho's dishes are always fresh and tasty. The chicken wings are to die for. Crispy, and t","useful":0,"cool":0},"rq8u7B_40TnakRh7Pccr2w":{"text":"I always try to make a trip to mopho when I visit New Orleans. I've got nothing but good t","useful":0,"cool":0},"WNYTCfNxzAjwSnk-GEJ-KA":{"text":"Pho me once, shame on you; pho me twice, shame on me.\n\n(Apologies for adding to the world'","useful":6,"cool":0},"DWZHHiKvtCCNzqIeRCGg5Q":{"text":"Great food. Oyster app was very intriguing. Pho was inventive and delicious. Crab noodle b","useful":1,"cool":0},"SMCbReo86mxSI2Iz5ov-Eg":{"text":"Absolutely delicious, never a bad call. Waitress was kinda rude but whatever it was busy I","useful":0,"cool":0},"1_AqVXo47czyyBL0lvhc5g":{"text":"First, I have to say how much we love this place and that we really enjoy food here! Espec","useful":10,"cool":4},"kMZWVw3YWKYRxW2U4AiBLA":{"text":"If you're like me and enjoy traditional Vietnamese food and not fusion crap, then you won'","useful":2,"cool":0},"O7ZVDgtlnwlt9LQkg1X7UQ":{"text":"The oyster Po boy and the spring roll was the best thing. So good on those. The frozen old","useful":0,"cool":0},"Ili182_Li1NgTbmXLa5ljg":{"text":"Amazing Pho! I've eaten at a dozen Pho places since I first tried Mopho and nothing has co","useful":0,"cool":0},"TbXzkNSbBUY0YsuE32RXjQ":{"text":"Probably one of the best meals of my life. I got a late reservation here with my two frien","useful":0,"cool":0},"LK0G4V_Wq5oHHv9ron4K3g":{"text":"I'd heard a lot about this place and finally got a chance to head over and see what all th","useful":0,"cool":0},"gZR9KNddWNWwza6wHfcxHQ":{"text":"Was ok, wanted to like it more.  Oysters excellent but i wanted some heat from the chili. ","useful":0,"cool":0},"IfICVg00S08gs97LSMzssw":{"text":"The food and décor both lived up to expectations;  In fact, the chicken wings and fried oy","useful":0,"cool":0},"b_RFCHqIwupn6pomhwFQ1w":{"text":"Amazing food and service! When we sat, we explained the food allergies to our server, Mari","useful":4,"cool":2},"gg-rj7YpF6M636EhT1xK0Q":{"text":"Food was absolutely wonderful. I had the winter squash curry with nan, a nice drink, and w","useful":0,"cool":0},"1CtBlDIQ3d4wXJ45Sp0Bzw":{"text":"The moment I arrived I was greeted by a young man named Rob, who immediately told me my se","useful":0,"cool":0},"w35NPFF3BVXwfaE3nUOPEA":{"text":"Tried Mopho for dinner this past Saturday night. It was relatively busy, so we opted to si","useful":0,"cool":0},"nEpNh1HDckt3UL8XSIRvhA":{"text":"I came in with low expectation about the food since it has 3.5 stars and it is a fusion fo","useful":2,"cool":1},"Bigry8S9T8_0yQFjuDFIaA":{"text":"The wings were really good but the food wasn't as good. This MOPHO is a NO GO unless you w","useful":1,"cool":1},"hg7Qa1IjYL6xkVEvVraeIA":{"text":"We came in on a Wednesday evening wanting to try this cheeky named restaurant. We were gre","useful":2,"cool":0},"tA41hNgFijPO0wZNzuH0OA":{"text":"It's all just so good!\n\nSo flavorful. \n\nI like to build my own pho. But I honestly haven't","useful":1,"cool":1},"3IpSds5vslA4RG8uFPiWbA":{"text":"One of my favorite spots in New Orleans for consistently excellent and unique cuisine. Sad","useful":0,"cool":0},"93ERNUR6R-6D2m5YkXx6vg":{"text":"My husband and I went to Mopho for the first time last night after hearing this was a yumm","useful":1,"cool":0},"gD0ArW61sMC-4-9km3rMSQ":{"text":"Excellent appetizers in the crispy chicken wings and fried p&j oysters. Both the pho and t","useful":0,"cool":0},"S-NmpE7EOTTulcHNgwhapg":{"text":"Let me start off by saying I love Vietnamese food. I eat it once or twice a week! Once we ","useful":0,"cool":0},"20juJBJNr97B3JuY_w_t2g":{"text":"I have never had a sub-par meal here, ever. I'm not a big pho guy, and I love this place. ","useful":0,"cool":0},"RbcuGIGUoKYrA_yvWmdU2Q":{"text":"Went here for lunch around 3pm on a Monday and there were still about 15 other people ther","useful":1,"cool":1},"mniVcGnWFqtgBX8_danx_g":{"text":"I have eaten a lot of asian food and asian fusion.  The food was okay, just wasn't asian i","useful":3,"cool":0},"lmYn_6ispYKwFPV5O7KrnQ":{"text":"The pork belly bowl is pretty good, actually! It goes better with rice, and a fried egg on","useful":0,"cool":0},"vWGTUGVWFJKuVEDnx42dcQ":{"text":"Great food that's flavorful, imaginative and just downright good. This is fusion food wher","useful":0,"cool":0},"0vwTtFvFoU8khVbSCeWf1w":{"text":"Delicious pho for an inexpensive price. I recommend the fowl broth - it's meaty and butter","useful":1,"cool":0},"BCyKXglttiWfQFVvdMPxDg":{"text":"Unfortunately, MoPho has been in a decline lately after a good run for several months, whi","useful":1,"cool":0},"_pPEe4VeaN6Gl-isOvR3YA":{"text":"You had me at booze infused bubble tea and it just got even better from there.\nEat here on","useful":2,"cool":1},"chrLol_DO8Ln0UaDJWz6Ag":{"text":"Wow...late night Postmates score!!!! Pleasantly surprised with the quality of the food we ","useful":1,"cool":0},"tkWOb6SYHz8aGmODrD8nIA":{"text":"I met a friend for a quick dinner before work last night & our servers name was Devin, and","useful":1,"cool":0},"agSxR367OUpgKlPOa5VEyQ":{"text":"What can I say, but this place needs serious revamping. The partners, Jeffrey B, Michael a","useful":0,"cool":0},"4PAEf_3AP-C8jqZJsiYnPQ":{"text":"THIS PLACE WAS AMAZING! Being a vegetarian from California, I had a hard time find things ","useful":1,"cool":0},"h8XxCoQD5BTGL6qP--4b2Q":{"text":"This is not your traditional Vietnamese cuisine, The food was good tho.  We had the curry ","useful":0,"cool":0},"ysccrEv50zY3w2BtflIplw":{"text":"So many great things on the menu. I'll start with appetizers, the P and J oysters are spec","useful":1,"cool":0},"KN1Jbk_6UvMh3u9s54RvyA":{"text":"Eh. - That's probably the first word that comes to mind. Not terrible but not super specta","useful":2,"cool":1},"qDcmZIrJ2l8-Pq_mee0BDQ":{"text":"i wanted to eat here twice before reviewing. my first visit was about a month ago and i ha","useful":2,"cool":0},"ewdDVB9HeS-ofsVZCEB45w":{"text":"Definitely was nothing to brag about. The \"asian fusion\" that they claim to have had was n","useful":0,"cool":0},"RhW_fuZOT3lG7VkeNDtCag":{"text":"Stuck to the basics and ordered the beef pho with oxtail, flank, and pork belly. It was pr","useful":4,"cool":0},"kMggsmOknoaxLSdcJ8oAbw":{"text":"Wow what incredible service and food! We had the wings. Until now my favorite wings were a","useful":0,"cool":0},"JoakfOzI69y94zo6fNRq8Q":{"text":"We ate at Mopho twice while vacationing in New Orleans. We live in San Francisco and have ","useful":0,"cool":0},"hMYiVykYM_ZORtVG0VI3yA":{"text":"Mopho was way better than I expected.  The first thing that impressed me was the extensive","useful":0,"cool":0},"USipLOxjmkuxAwVTdBjgUw":{"text":"Wow! I'd heard about this place for years. Finally tried it. This food is cooked with love","useful":0,"cool":0},"Um9NXMrmAFtFdllPiwASJA":{"text":"The best pho I have ever had! I ordered the \"And today we eat meat!\" bowl. If you like mea","useful":0,"cool":0},"9i_5bZF_z1_4e6jI-0MjIg":{"text":"Tried this place the other day with friends. It was later in the afternoon so it was slow ","useful":1,"cool":0},"BlN9UHR1UvPtjzytK4pAmw":{"text":"Important for readers: Do not park at areas not designated for MoPho \n\nLuckily when I arri","useful":2,"cool":0},"mkdqToEF1tqkEz7yp_9lPg":{"text":"This is my second time going to MOPHO. First time I had the MOPHO bowl which was pretty go","useful":0,"cool":0},"-lBWtP5de1u0whWrDBnf5Q":{"text":"Food was fabulous!  It is NOT Vietnamese, so don't expect it.  The chef even said it is no","useful":0,"cool":0},"AoptZ6pVxdrfzrBFIR4wmQ":{"text":"Warren H. \nVery disappointing. Decent appetizers, although wings had clearly been frozen a","useful":2,"cool":0},"-KQTSpJVqfaG7s2PC5qDNg":{"text":"Spring rolls are hearty and good, but the chicken and waffles? It was a savory sweet combi","useful":0,"cool":0},"ji1KRfC-V7LhEayTygJ8Ag":{"text":"Been here three times now so I feel like I have a good grasp of what goes right and what g","useful":0,"cool":0},"qYdMDEPMnjHv8cKk2DYGQA":{"text":"Went there after cycling. The menu is very limited. I thought it was a little pricey. The ","useful":4,"cool":0},"dOzTdyBZoHDDFLzE2Sx3-A":{"text":"Good place for a quick meal\n\nWe stopped here at the recommendation of the folks at Second ","useful":1,"cool":0},"eTTQoB8dxeWNIaHuWRhffw":{"text":"The food & drinks here were a little hit & miss. We took a cab all the way here in the rai","useful":3,"cool":0},"rFU7Z6pJgMTlt8DxeWo-wg":{"text":"Definitely still 5 stars! \n\nWe went there on Saturday for dinner and were seated in Sam's ","useful":0,"cool":0},"VAeP7pIt_2-viq9oTfcpOg":{"text":"All of the food was sooooo yummy.  Asian/Vietnamese food with a twist.   The pork belly bo","useful":0,"cool":0},"Jh2afneg4bbVeMKTK2Xx6Q":{"text":"NOthing special about thie place\nAttitude from bar staff until it was time for tip.\n$5 gla","useful":2,"cool":1},"9tt3ACPE0GT9p-qs_2nPiw":{"text":"One of the best meals I have ever had in my ENTIRE LIFE!!! Chef Trey Smith is AMAZING!!! W","useful":0,"cool":0},"_T_NtYQ58PO_yZ6R_Tu6Mg":{"text":"I came in for the pho and it was terrible! First of all, my friends and I chose this place","useful":0,"cool":0},"KFzFaHPZfKRMG1MPWE4Q_A":{"text":"Sat at the bar and the bartender was knowledgeable and engaging. Great cocktails and was e","useful":0,"cool":0},"-LNOmwbCIDaA3YOzL-5cxw":{"text":"Went here for a quiet Sunday night dinner and it was the perfect spot. My friend and I bot","useful":2,"cool":1},"2fkzc7OyW83ZUmiqicVbsg":{"text":"I am a long time user of this site, and have never felt the need to leave reviews. That be","useful":2,"cool":0},"sem5vjOYDsoTuQ-YHc6AtA":{"text":"Been several times in the past few weeks.  I've had one of almost every entree, multiple a","useful":1,"cool":1},"2KT9k7an-OX2DigPi8zXOg":{"text":"Great menu with interesting appetizers that are easy to share. Don't let the outside, smal","useful":1,"cool":1},"bHl_lf3N2_3SSnvEtIi-5g":{"text":"First off, the staff is friendly and attentive. For my last visit I started with the crisp","useful":0,"cool":0},"oADe8CWWfPVIm6OaKfUxSA":{"text":"We've been fans of Mopho since they opened. Tonight we had an unexpectedly more-than-norma","useful":0,"cool":0},"KQ1tuKdlm9D5fogfzq8l3g":{"text":"Good Wings. Aside from being some of the largest wings that I've ever seen, the mixture of","useful":0,"cool":0},"0_9QS4ij5lgunIDU8Oq51Q":{"text":"As someone from NYC who's had lots of pho, this was awesome and very different from what I","useful":1,"cool":0},"seljxGDxxllK4_3h1gjx3g":{"text":"Been here at least 3 times before and was disappointed this time.  Seems the food is somew","useful":0,"cool":0},"9MW_7JoXnMKFfX1-IDbHlg":{"text":"This is what happens when hipsters open a Pho joint. Vegetarian pho was mediocre at best. ","useful":8,"cool":1},"gWtn2gulli-cemtFeGMJMA":{"text":"Really creative and tasty take on Vietnamese food. Worth the $9 uber ride from the French ","useful":0,"cool":0},"9ab6Ev4hPJlf5rzNX9PMBw":{"text":"This place was very yummy. I often thing pho is pretty bland, but theirs was great. And I ","useful":0,"cool":0},"-fjd9z9UZspvhaHIoPvXfg":{"text":"This is a fusion style place where they put the local and their own take on Vietnamese foo","useful":4,"cool":1},"g-J6hPBJWZLcT9zX2R56eA":{"text":"This place has the best frozen old fashions. Fun drink menu. Food is good and different fr","useful":1,"cool":0},"3bIhTMgByTAoBLlAMLBJkw":{"text":"I was so excited to go to Mopho!  Had seen the chef at Seafood Fest and was really awed by","useful":2,"cool":0},"6cDFvVYd64IL650ldXXQVw":{"text":"Totally wowed by this place despite being seated near the door and having mediocre service","useful":0,"cool":0},"liuHOc605Dmkj5sBC4A98A":{"text":"The pho tasted like water down broth. Meatballs I guess were homemade but didn't taste goo","useful":2,"cool":0},"Jx_mnlRKZPJNk2A3Q-LA4Q":{"text":"Veggie Pho was yummy! Good price and cute atmosphere outside. First visit and I will absol","useful":2,"cool":1},"FJv2bBv1HXSvhZlQWb9icg":{"text":"Pricey but good pho and really good wings. Sometimes they skimp on the meat in the pho esp","useful":0,"cool":0},"C3ghHqpB_VS2eaB-NQ-z6w":{"text":"This modern  and regional take on Pho and other Vietnamese dishes is such a delight.  I re","useful":0,"cool":0},"ffdfZ87lOfl66aMNyAa2PQ":{"text":"Came here with some girlfriends to nurse a Bourbon Street hangover on the way back from a ","useful":0,"cool":0},"XXgbAgOJ3pt-uY8EXOqYLw":{"text":"Wow was this restaurant amazing. We went during the week but I heard Friday nights are whe","useful":0,"cool":0},"34ltNiz30pvSE_t-Y6FrCg":{"text":"MOPHO- We've been waiting for you!\nGood mixed drinks, good wine/beer list. We dined at the","useful":2,"cool":0},"2DQLLZMYZtcLi4VRjUMrmQ":{"text":"Great place. Wings and bun are on happy hour. Sooo good and so cheap. Service by Penny was","useful":0,"cool":0},"mnSGBfYSThFHUgAHZ5Ptzg":{"text":"We got the fried chicken and waffles. The food was very unique in flavor and delicious. Th","useful":2,"cool":0},"47js3yXkUcR9pNy6zouo8A":{"text":"Last night was the second time I have been to Mopho in the last month. Both times, it was ","useful":0,"cool":0},"INmolcRGfhRFgS21qqK8AQ":{"text":"My friends guided me to this place as a good choice for vegetarians and they were right!\n\n","useful":0,"cool":0},"kczB5Ads_cJpOQCBQHRcmg":{"text":"Vietnamese food craving? Here's your place!\n\nFirst thing I noticed when looking at the men","useful":1,"cool":1},"TYBrDZLJQ5kUoxOc8HLhDg":{"text":"I had dinner there with family and it was great. Although, from what others have said the ","useful":0,"cool":0},"yDgQ1kC-RRVLLSb_hkQmng":{"text":"YUMMMMMMERS!!!!\n\nAs a Bay Area native, who lives near A LOT of traditional Pho restaurants","useful":2,"cool":2},"neF42JECkqt6UQJ7VO-lbQ":{"text":"Some of the food was really good (especially the chicken wings) but the clams tasted a bit","useful":0,"cool":0},"jIK8VSp4HJg2DHzq2n4lkQ":{"text":"Started with the chicken wings and spring rolls. Moved on to the salads and pulled noodles","useful":1,"cool":0},"02B7dv9T48FWgx36q00zUA":{"text":"This is probably my favorite fusion restaurant in town! I tried crispy chicken wings, the ","useful":1,"cool":1},"9O2hgTFHmhdj_5STy6eq7Q":{"text":"I had the wings for lunch and they were so tasty. Everything you order is well thought out","useful":0,"cool":0},"EBUgoM0ws6UHro9EXJiM1A":{"text":"Very unique menu. If you like to try new and different things, this place is for you. Ever","useful":0,"cool":0},"exUdZe34jz4HhCNljuNHWA":{"text":"the wings are so good. i like the tofu pho and my boyfriend gets the pork shoulder pho.","useful":0,"cool":0},"VB3wxYwmX22xV_TOC3e-tQ":{"text":"All I can say is that it was just \"ok\". The Thai wings were good but not great; they could","useful":0,"cool":0},"swIfdktnwulv2mJ0rmNAkQ":{"text":"Ok so I've never ate Pho before so I was excited to try it for the first time.... Our serv","useful":0,"cool":1},"ra4MAev5csJpy7lhB6oXSQ":{"text":"Mopho was so-so. Our service was good, and the server was nice enough. My husband had the ","useful":0,"cool":0},"Qjm8obDMIZ3KXd_fqYC7cQ":{"text":"Very disappointing experience given all of the hype about this place. The wings were solid","useful":0,"cool":0},"YzlGKMLLAu3HqWZDGVVAYg":{"text":"Ease of making a rezzy: \nThe time I wanted wasn't available, but 15 minutes later I receiv","useful":1,"cool":0},"kor0S6bQMC3ouV34LGDBuA":{"text":"So the interior was nicer than I expected from the exterior view and then they had a nice ","useful":4,"cool":4},"_yn9j8-fQCtVFY5ereuKYw":{"text":"The food is excellent but watch out for to go orders. The bartender is in charge of it and","useful":0,"cool":0},"V2T7zV9Ny3PTn9aX79Yiig":{"text":"Went to MOPHO with my sister on a recent trip to New Orleans and everything was great, to ","useful":0,"cool":0},"xb25jfiQ7djxdWdlDORyWQ":{"text":"We are so happy with every dish we ordered. My favorite one is pork belly over coconut ric","useful":0,"cool":0},"HNt2vG72DLkvnV0zNJaiPg":{"text":"Finally got to try MoPho. And results were good. The pho was solid, wings were good. Servi","useful":0,"cool":0},"Pvl0unHpRyP8lWlZVleC1g":{"text":"I had the pho with beef broth, ribeye, pork belly, and slow boiled egg.  It was a good bro","useful":0,"cool":0},"T9nYvgljTzkrjx2cfoLBSQ":{"text":"I get that it's fusion food, and that it's not trying to serve authentic pho, but througho","useful":3,"cool":0},"CtgiZxdf0CeH_xSZrutRVg":{"text":"I've never understood the hype of this place. The food is generally good but not mind-blow","useful":1,"cool":0},"d3Y4Vk5Vk6sxydH6P2qIng":{"text":"When Asian meets Cajun!  Chicken wings were the BOMB.com!  We added a side of white rice t","useful":0,"cool":0},"XHS71AZgEVEMr2dQIZmNrg":{"text":"We met up with friends our last night in New Orleans. Service was very friendly, if a litt","useful":0,"cool":0},"lLYdovtNVKwXs8tHzKgixQ":{"text":"Wait--I think I actually LOVE Mopho. We waited to try it out until Mopho worked out their ","useful":0,"cool":0},"l3_CC3ATCZJya_Z6nDv7UQ":{"text":"A gem, discovered on our last day as we were looking for a pho breakfast. Fabulous creativ","useful":0,"cool":0},"FY48BB1DimLdbtR9jYsn-g":{"text":"Brussel sprouts and chicken wings and the coffee boba were amazing!! Chicken pho was decen","useful":1,"cool":1},"kTsAi4huZTSqmPKGJxSpzg":{"text":"Casual and cute atmosphere. Service was great. Appetizers were delicious and taste better ","useful":0,"cool":0},"JdZP6y91PBrcda8RbaMJyw":{"text":"Positive - The start off I suggest the side brussel sprouts - they were my favorite dish! ","useful":3,"cool":1},"U9kK1ULbgG8TpHOgtakXWg":{"text":"I was there a few years ago and had good memories so recently came back  with my son. This","useful":0,"cool":0},"aKyvGPiecjKFL7uDsaNvyg":{"text":"I couldn't believe how amazing this place was. Usually when you think of NOLA, you don't t","useful":0,"cool":0},"Ev8XURCXMcvYAZuJbVR1Zw":{"text":"I'm now a Mopho regular and I've never been disappointed! Quite the opposite actually, alw","useful":1,"cool":0},"mHXn1Cy-4WuGo5OiB9UuEA":{"text":"I really hate going out to eat because people automatically get the assumption that becaus","useful":0,"cool":0},"hbUHnz0A12oxk7e0mOLyEw":{"text":"Bubble tea + alcohol = Me a happy camper!!!!!  \n\nCrepe myrtle boba tea & spring rolls was ","useful":9,"cool":5},"KL8EvqZDylp05aXjdV1QsA":{"text":"If you want to like Mopho, you have to accept it for what it is. WARNING: IT IS NOT A VIET","useful":3,"cool":0},"13Mrzta79ZhV0fgE3wvr0Q":{"text":"Food is good, but it's super pricey for some noodles and rice! The protein portion of the ","useful":1,"cool":0},"2xWU0QwKQEhiUwtvaj0Geg":{"text":"I personally didn't think it was that great. It was my first time trying pho and I wasn't ","useful":0,"cool":0},"8szD9oieaMCZk2QwFRgkqQ":{"text":"Amazing, amazing, amazing! I wish I had a place like this close to home. My mom and I are ","useful":0,"cool":0},"JJcjMCbAclRGgwe-MERYYg":{"text":"Far exceeded my expectations. I can't wait to go back to try to whole menu.","useful":3,"cool":0},"ZbhK65aTX42BrbxtqGUs8A":{"text":"The food was excellent.  I had the pork belly rice bowl and a side of broccoli.  Both cook","useful":0,"cool":0},"oVFTLIsm9GouISFjrRJ45w":{"text":"This restaurant will not survive on the strength of its \"pho\". There are far to many super","useful":7,"cool":0},"D2x_bNHY6Lc6Lu2TN-niKA":{"text":"Yes it is as good as all the hype!  Really enjoyed the sloppy duck bon mi sandwich....clas","useful":1,"cool":1},"uU0m05-IVEAe6DOkfs8u3A":{"text":"Just OK... The vermicelli came in a small portion. The pho was a huge portion but not too ","useful":0,"cool":0},"CNAUYBoWv1nxHNtqj2_DcA":{"text":"I am mystified by the enthusiasm for this restaurant.  I have been here three times .  I c","useful":0,"cool":0},"M9G6LJGshGc6NeRf0ahNdQ":{"text":"Really wonderful vegetarian Pho with tasty veggie broth, grilled mushroom, tofu, grilled e","useful":1,"cool":1},"GHzDeGVrCLVioH-Vfpu9QQ":{"text":"I've visited three times and all I can say about Mo Pho is give me mo! \nWhen I first heard","useful":4,"cool":1},"-xCEZZ2-46HVWWkp7UlKWA":{"text":"Fantastic lunch at Mopho. We ate fried oysters every day we were in New Orleans and the on","useful":0,"cool":0},"hR2PDJw8LpzfrAIJt3V_Gg":{"text":"I'm going to go with three stars for now, because it was definitely good!  But didn't quit","useful":1,"cool":0},"8N1VJrr314BAwErR8zEl7A":{"text":"If you're a seafood fan, chances are you'll love the black (with cuddle fish ink) sticky r","useful":0,"cool":0},"upYHJ1XEnPRgfawJ2KDgPw":{"text":"There ain't No Pho like Mopho! Any combination of ingredients served in one of several bro","useful":2,"cool":0},"fCb0_XQdzKJLdzLmu31Yeg":{"text":"YAY! We loved our visit. The staff was very prompt and knowledgeable. Atmosphere is very m","useful":1,"cool":1},"03ymW_cw_FKkbYZSwRPGNQ":{"text":"Tucked Away Treasure Of Asian Eating Pleasure\n\nIt was my first visit and was recommended b","useful":0,"cool":0},"GBIEq6MDZywstxAp6buKXg":{"text":"Brussel sprouts are incredible I loved everything we ordered. Boba tea was good, such cool","useful":0,"cool":0},"_VkuTeb_5bo8HUp90DdqJg":{"text":"OK I've never given any place 1 star before but there's always a first and unfortunately f","useful":3,"cool":0},"kJvdKtUxNo73qni2cDSxqg":{"text":"Just left & have nothing but great things to say.  We arrived around 9 on a Friday night. ","useful":1,"cool":0},"CZWpistO-ALLqhyP1P5QTA":{"text":"Wings are very good but too darn big. It's like eating small turkey legs. ................","useful":0,"cool":0},"4EHU-aiz0pUKIIbbfDCO0w":{"text":"Been here 3 times and have never had a bad experience. Wait staff is friendly and attentiv","useful":1,"cool":0},"Tzei65-ASfCaSXhuMgo0yA":{"text":"I'm not that in to Vietnamese and cannot judge with knowledge on the quality of pho, etc. ","useful":1,"cool":1},"OTMKI_fzvDUAUekNL4H5Og":{"text":"I went yesterday and the shrimp spring rolls were sooooooo good I literally drove back tod","useful":0,"cool":0},"qwIsMj1hWvH_Vaako7Pjgg":{"text":"Vietnamese meets NOLA. Fresh, local ingredients. Wonderful oysters . Noodle bowls. A  Mew ","useful":0,"cool":0},"sIHaGm1f83Ix3NczBRTiDQ":{"text":"It was really good the first time we went. So we have been going back frequently since (4 ","useful":0,"cool":0},"478Soz4Y2g-mAjNBdbxTEg":{"text":"Mopho? More like I don't know want no mophuckin pho from this place!\nApparently ordering a","useful":3,"cool":0},"sx6s3rX-xXH-nFA8OFvWOA":{"text":"Great atmosphere, location will fool you (next to Burger King). Delicious sprouts, drinks ","useful":2,"cool":0},"gY0fIdwtPvJM7Ds9gmiTtA":{"text":"Tried MOPHO today for the first time and it was excellent. I've had pho before, but not li","useful":0,"cool":0},"ZIJL8sz2RvmqhP4h2anb4w":{"text":"This place was amazing! I was overwhelmed by the menu but the food exceed my expectations.","useful":1,"cool":0},"Epu_z76XPhKOHgnDPCFmHw":{"text":"Seriously,  I mean seriously best fried oysters ever. And the pho broth was unbelievable .","useful":0,"cool":0},"Wx102o8xTNmTJdPM_sr8pQ":{"text":"Spectacular!   Great vegetarian pho and spectacular crispy Brussels sprouts.  Great servic","useful":0,"cool":0},"006lCd1h2KtnTDmzOlx6qA":{"text":"Food was great but the portions were very small. I ordered a beef broth, and chose 3 meats","useful":1,"cool":0},"ugzza0bPNvuBCelVGhnMmw":{"text":"Mopho is ok Asian fusion. I loved their Fried Chicken Wings for their delicious sweet and ","useful":1,"cool":0},"qATBiUv5E6_Bixh3iZSA6w":{"text":"We came specifically for the chicken wings and pork spring rolls and were not disappointed","useful":2,"cool":0},"MxR2nXmdyHRYoYle7-RkPQ":{"text":"I heard so many good things about mopho so I was dying to try this place out.  \n\nOrdered c","useful":0,"cool":0},"oTW4lGBpnRRQ-vozLktqqg":{"text":"It never fails - Mopho is in the elite of new New Orleans cuisine. Almost a perfect fusion","useful":0,"cool":0},"C_JhahGralVzJZV7xJNtmg":{"text":"Good food, sweet servers!\n\nAbsolutely lovely outdoors area where they do a weekly pig roas","useful":0,"cool":0},"lrEHcHkM8ihM1EnOxZ8G6w":{"text":"Hit or miss.  The dinner menu needs a few more traditional dishes.  A steak or chicken dis","useful":0,"cool":0},"wrTr3-yyk_-pqgFP7Ls8sw":{"text":"Great little place! Love the decor! Staff was very friendly! Had the Crepe Myrtle Boba Tea","useful":0,"cool":0},"UBrRshzu2y8g4oaZ2lVLsg":{"text":"I wanted to love this place but the food was hit or miss.  Great pho, including vegan pho,","useful":0,"cool":0},"uM1OfWS03KWjtnPL-oC2kw":{"text":"Happy hour wines are barely tolerable.  The wings were over cooked and the pho was too sal","useful":0,"cool":0},"kzeTZyoyG8XGUAfE72nZCA":{"text":"Maybe I'm just not used to how they do Vietnamese food in the south... but I have never ha","useful":0,"cool":0},"GgwShfeYPWHIRwcB3AjHdQ":{"text":"VEGAN REVIEW:\n\nWho would have guessed that there would be an amazing Asian fusion restaura","useful":9,"cool":7},"0_LMChKFGkQuWbzgpLG86w":{"text":"Late lunch win in New Orleans! We had the som tam, pork belly bowl, and vindaloo chicken a","useful":0,"cool":0},"9gUr6aEjxAdJoLNXJt3UMQ":{"text":"Was soooo excited to try this new place close to where we live but I was disappointed when","useful":3,"cool":0},"HBTh7rVsa836Alc_rHzdoA":{"text":"Place is casual, the people are cool AF and the food is PHO'king delicious!\n\nI've been her","useful":4,"cool":5},"bVCFTQA0583PzoxDN0O2pw":{"text":"Great service! The food was good. We are spoiled being from Seattle and having authentic V","useful":0,"cool":0},"08qA3ANQnLX8fYJaZ5fk_A":{"text":"I have been to Mopho several times and have usually enjoyed my experience. \n\nMy first time","useful":12,"cool":6},"XAw8WhtCOFlTX8FpmTLf0Q":{"text":"This place has everything going for it and they are doing everything right!  A+ all around","useful":3,"cool":0},"1d7S0PAPVWrnZ8nZU5jngw":{"text":"This is one of my favorite restaurants in the city. As far as appetizers go, you absolutel","useful":1,"cool":1},"BGcBDPpB18RTpYqyoP_yXw":{"text":"Sigh. I've been twice and both times I was not overly impressed. The first time we went, w","useful":4,"cool":1},"BYMvq6MKWnQ8RGqaMqur9w":{"text":"Hubby and I had another wonderful lunch at Mopho today and they again lived up to all of m","useful":1,"cool":1},"LiZp7iMwKDsfQ8LYJbh2gw":{"text":"Food overall was good, but portions were tiny. Bbt drinks very delicious.\n\nWe had the pho,","useful":0,"cool":0},"GC6aVnm-y_cnNNITucyb2g":{"text":"Our first time at Mopho turned out to be quite a memorable one. The bar tender was very fr","useful":0,"cool":0},"tTehMmSoh7faGu0JtkrqbA":{"text":"I ate here for the first time today and had lunch. I am shocked that Mopho doesn't have  a","useful":6,"cool":2},"SyYtkGLi7GBYN-ocjMn2-A":{"text":"great twist on traditional vietnamese. try the wings and the oysters.","useful":0,"cool":0},"JGO3HdfjRjwtzhgvQXaB5A":{"text":"I would give it SIX stars if I could. Having grown up near Little Saigon in So Cal, and li","useful":0,"cool":0},"imeFPQ-1SGZKaw5nH2O2mw":{"text":"This place is just awesome! It is the best south East Asian restaurant that I've ever been","useful":0,"cool":0},"APDjCXLZM4Vm_5RrXXpDIA":{"text":"We ordered the Crispy Fried P&J Oysters,  they were hot and tasty, I especially liked the ","useful":0,"cool":0},"eJTe6wYIlxTsoRSZ2ckMCA":{"text":"Stopped here for lunch and had a sandwich at the bar with crackling.  Very tasty BBQ meat ","useful":2,"cool":1},"DOJlDrTZr5vdxQPrhl1cSA":{"text":"Do yourself a favor- eat here. It's slowly becomes an addiction. AMAZING food, awesome bee","useful":2,"cool":1},"dyGPxrYF62yQv8OXTnMUkA":{"text":"I would go back but I might steer clear of the the Specials.  I got the glutinous rice cak","useful":0,"cool":0},"rmJycbFh5WfkEsnA5uS2Hw":{"text":"There's always something a little off about this place, and I find that really endearing. ","useful":0,"cool":0},"XbYNASueAaczYKUVNyG2Jg":{"text":"this is catered to white people, cause asians know where to get real pho for a lot better ","useful":0,"cool":0},"CxBn6d_87wI-BOV66fOjYQ":{"text":"First off, if you're looking for authentic vietnamese this isn't the place for you. This i","useful":2,"cool":1},"rhDVVW1nkUeazSrQrRa4RA":{"text":"Old fashioned boba tea? Sure. Fried Oysters with Bleu Cheese? Sure. Brussel Sprouts with S","useful":1,"cool":2},"No8Unmd5cqzis8XULWkt-g":{"text":"Everything else is crap besides the pho , the pho with tendon and rib eye is the best pho ","useful":0,"cool":0},"nT3sA_MYjZ7aoJwPB7Sung":{"text":"Enjoyed it. Good selection, tasty food with spotty service. Nice flavors and not too much ","useful":0,"cool":0},"WNgi9u7uZXs11Y9MGYUcIQ":{"text":"Lamb neck green curry literally could not have been better! And the circulated perfect poa","useful":1,"cool":0},"8t97naVPKWP8zFcQIPa8uA":{"text":"I had a veggie pho that was on the menu (not the mix and match one) but i must say, it was","useful":1,"cool":0},"A5Qvs9nwgwGmwFB4zzuLIA":{"text":"Beautiful atmosphere, nice looking food. The food tastes okie. I did not like my clams muc","useful":3,"cool":0},"g4wM6cKp9N2adUb2qO2Ozg":{"text":"The pho is not authentic and not very flavorful. I think the food is beyond fusion and los","useful":0,"cool":0},"1crFaX5Ks1HEGfi0kuLDnA":{"text":"Everything about this place was great! The wings are outstanding, the beef pho was delicio","useful":0,"cool":0},"45oiV5W_NuzPodOj3nhBBg":{"text":"The menu is exceptional with so many delicious things I'd like to try. The culinary master","useful":3,"cool":1},"ZFO9K-YobofuMN6V5flHiQ":{"text":"If you are looking for a real pho place, this is not it. The food is decent and the pho is","useful":2,"cool":0},"pga7NcIHu8RWA3XV6RCPaw":{"text":"Me and my son eat a lot of Vietnamese food. At least 4 times a month, sometimes 3x as much","useful":1,"cool":0},"9AeE7Jfrwnt_4S50wYyDvw":{"text":"Have never had a bad meal here. The Brussels sprouts, wings, and Mocho are a go to. Love i","useful":0,"cool":0},"_GHalWs0hwoGVljRoh1IMw":{"text":"I was not so sure of this place when I read about it...Vietnamese fusion restaurant owned ","useful":1,"cool":0},"HhMulw8oJBog2YopNw7rGQ":{"text":"Best Pho in town! Love this place! Their dishes (not just the pho) are bold and tasty and ","useful":0,"cool":0},"TsuphjPMZYzTD65cCSQIDA":{"text":"Roadtripping through New Orleans...\n\nThe food here wasn't authentic, it was \"okay\" . Serve","useful":0,"cool":0},"5glPxpm5sXMglYxwnuWvXg":{"text":"Great place. The pho is good, but so are all of the entrees and appetizers. Good stuff and","useful":1,"cool":1},"BkIB95QYGXkDDMP987JZQw":{"text":"We happened upon this place when enjoying City Park and it was the best meal we had during","useful":0,"cool":0},"i3inMZ0JtN3M1nY0SZaIWQ":{"text":"The tofu and cauliflower on rice was delicious but tiny - 4 pieces of cauliflower and a do","useful":1,"cool":0},"lYKSszhNtuEPStIx-I4kJg":{"text":"Sitting at Mopho and getting best wings i ever eat in my life! So delicious! Very friendy ","useful":1,"cool":1},"SHiXqQLoF1pjI7LXdGDxOA":{"text":"I wish Yelp allowed 1/2 scores or used a 10 point scale because I feel guilty giving Mopho","useful":0,"cool":0},"Xw5Yj40JUc85hJJwq0Tyig":{"text":"Simply love this place!!!! The food is always good and exciting! Service is always friendl","useful":0,"cool":0},"eZrIfqnEzpv2oelNSjcXTQ":{"text":"Excellent Service, Great Atmosphere, and Incredible Food!!! I had a really great experienc","useful":0,"cool":0},"BgDNJmBV0eDc4xAmrBIbdg":{"text":"This isn't your Vietnamese grandma's pho, but it's still good (yet different). Think of it","useful":11,"cool":4},"UQG26J4F2NWBba7hTSt_NQ":{"text":"I heard someone comparing Mopho to Namese - and I don't see any comparison worth offering.","useful":1,"cool":1},"AqF4nIihFN0-mhrJ5uR80Q":{"text":"Definitely not your typical Vietnamese restaurant. They do an interesting spin on it thoug","useful":1,"cool":0},"kUUqmwx5zOwi9u7_p6rXMQ":{"text":"A HomeRun from Start to Finish! \n\nFried Oysters: Amazing\n\nWings: Like no other we have had","useful":0,"cool":0},"XC02yibxMk5k6tOZvWgcJA":{"text":"This is one of my favorite restaurants.  The Refresher Pho is delicious, I order it every ","useful":0,"cool":0},"sLv092orI-ET_ECogCdqUw":{"text":"My boyfriend's beef pho was bland (broth) and the vermicelli left me unimpressed. The menu","useful":0,"cool":0},"5YVeoVtkpuuMfPKXDJa2Pg":{"text":"Went for happy hour. What's not to like? Really good wings with an Asian flair half-price ","useful":0,"cool":0},"9E553LbMQN3WdaoCl2E1ig":{"text":"It's a brilliant menu. We have never been disappointed here. Try the chicken wings. I alwa","useful":0,"cool":0},"xPNjHE4cpOXYATu4CzXgBQ":{"text":"You should know, I am Vietnamese food obsessed. For the past two years I've been working a","useful":2,"cool":1},"8ITBJU18Pn4pgWOUzIjc4Q":{"text":"I want to give 3.5 stars, but I can't...so I'll give 3.\n\nI was having a hankering for pho ","useful":7,"cool":4},"RT-m5ZuwMovlIYdj8FE7dg":{"text":"I came here with my girlfriend's family right when they opened for lunch (Saturday at 11am","useful":0,"cool":0},"cGDSw5cQFLUNIaoNJ6Sx3g":{"text":"Came here for lunch during my week long visit to New Orleans. It was one of the few places","useful":0,"cool":0},"rntAmmE1kwjay0KbqfO-ww":{"text":"Lunch here is supreme! The pho choices are ample, providing some fun opportunities for mix","useful":0,"cool":0},"qTJemlkAS7ZRbTMgV2MqMg":{"text":"I was able to make the soft opening as well as the two following days after. This place co","useful":8,"cool":0},"7sSiCih9B5RjDafLCWGnqg":{"text":"Phenomenal. The best pho I've ever had. The Brussels sprouts & spring rolls were also wond","useful":2,"cool":2},"0ojqHJLcy_oUVV-Wdm-4nw":{"text":"Recently went to Mopho on a Thursday night with low expectations as asian fusion is not us","useful":0,"cool":0},"NRL2u0yPiOv1ZpWis7eRRQ":{"text":"I have no clue why this place only has 3 1/2 stars. We were extremely pleased with our foo","useful":1,"cool":0},"GCWt0Z3LNGUBoVHSXcN_qg":{"text":"Very bad experience here today.  We \"were\" very regular customers( at least once per week ","useful":0,"cool":0},"SQIOKuRV0_FIxAwJ3pR5OA":{"text":"We had an excellent dinner at the bar on Veggie Feast night (Thursdays). The tofu dishes w","useful":1,"cool":1},"O72Appph9OKhRhprUs3cRw":{"text":"Went to Mopho today for first time today and it was fantastic. had the clams and spring ro","useful":0,"cool":0},"VYXyxCzKMASPSOTefSZAyw":{"text":"Everything the wifey and I had was great with a pleasant twist to it. Crispy ginger chicke","useful":0,"cool":0},"jlHin83Qi77i8UaSPb8T-w":{"text":"I'm hesitant to give a restaurant that just opened its doors five stars but this experienc","useful":6,"cool":2},"rfm6ZcX8Qgw8iU79XhGwKQ":{"text":"I am by no means a pho expert, but I absolutely love this place. Everything I have eaten h","useful":2,"cool":0},"Y6bKMtyK02vhA5doR_z7qA":{"text":"Never disappoints. Ironically, it was the first time I had the pho and it was awesome! I u","useful":1,"cool":1},"irlbNzKgZDbSA7lSx_4h-Q":{"text":"Had a fabulous first experience. It's more of a Cajun Vietnamese fusion. Jude was an amazi","useful":1,"cool":1},"lfqFVhvj4Y7X8YUYon_uVg":{"text":"This isn't one of my go to places, but every time I eat there I really enjoy everything an","useful":0,"cool":0},"bJsHr24yPoz6J2eA2F_n_g":{"text":"Being that I was Asian, I liked the idea of a fusion restaurant and Mopho was the place to","useful":2,"cool":1},"lRnutsFBIT4qoO017pUI6g":{"text":"Mopho's atmosphere is nice.  So is the staff.  Our waitress and her assistants were friend","useful":0,"cool":0},"r_sMY9YNyRGQpW-ZtCVj6A":{"text":"Came for a late lunch and hit happy hour, great prices, delicious, creative food and local","useful":0,"cool":0},"13o3nNxb8cKZB3Kdi-elcw":{"text":"I never was a big fan of pho until I had mopho.  I tried \"the refresher\" on a cold winter ","useful":1,"cool":0},"SzA_o_xKkGHDgb8KRURvgw":{"text":"I think 2.5 stars would be more appropriate.  I had the veggie Pho.  this was kind of a mi","useful":1,"cool":0},"0Y9y8i74LvWHj2BD9BNtGQ":{"text":"We went at 2 to miss the busy lunch crowd, yet it was still very busy. Ordered 2 orders of","useful":0,"cool":0},"YR8fTZdHAiBF28ZkkP34yg":{"text":"I've eaten at Mopho countless times with the first time being just months after the opened","useful":0,"cool":0},"IrxnNbUwXg7Hn6YiRr4NAA":{"text":"We always enjoy this restaurant. The only downside of our last visit was that we chose to ","useful":0,"cool":0},"O9wdwHLR7a6P0pvtmbQkog":{"text":"The flavors at Mopho are great, but the pricing and portion sizes are confusing.  We paid ","useful":1,"cool":2},"wr7MGMKCtFj-W5kdRHNuCg":{"text":"We brought our parents to their first Vietnamese restaurant and they really liked it.\nWhat","useful":0,"cool":0},"ftUHnWNbSiO3wjxb-GZKhg":{"text":"I've eaten there once, and I was truly surprised to find its very different take on Vietna","useful":1,"cool":0},"dAnurqwd4ecaIz5cbAdcZQ":{"text":"Mopho almost has it. A couple of refinements and it could be amazing. Came here on a Frida","useful":2,"cool":1},"PI_P81bbgnPipixnjlbDhw":{"text":"Creative Asian Fusion in a casual atmosphere. Could have had a better Chardonnay by the gl","useful":0,"cool":0},"q6saMFgLq31U89kcJShzBg":{"text":"Dinner at Mopho was wonderful. We started with the Brussel sprouts and chicken wings.  Bot","useful":0,"cool":0},"0AWJUGselULIXsr1mQXEXQ":{"text":"Pork Belly was out of this world good. Really really tasty.\nBut on the other hand, 2 mains","useful":0,"cool":0},"MR-yicS82B8aHMuitAey6g":{"text":"Coolest little place. We loved the Doctor's Wife cocktail, the pork spring rolls, and the ","useful":0,"cool":0},"AnnLODnMVHGNJj2nFgYG1Q":{"text":"Fantastic menu, great service, intriguing house drinks.  Had the whole fish & housemade ri","useful":1,"cool":0},"mFvtVpiqhEPt-Y1HEe3srg":{"text":"MOPHO is a fun place -- Vietnamese with a creole twist. I first heard about MOPHO on NPR d","useful":1,"cool":1},"KBulafqUJryaDQG0HRvfNg":{"text":"The food was great!\nThe only thing we were kind of disappointed about is that we went for ","useful":0,"cool":0},"oQZF9UbB8HcooDKzvuu9Lg":{"text":"Great wings.  Noodle bowl was tasty.  Loved their roasted pork special.  So tender and was","useful":1,"cool":0},"Vj9oabqbO1K_VZrV0qVfvw":{"text":"The pho is terrible and bland - neither Vietnamese nor cajun. Everything is overpriced. Se","useful":0,"cool":0},"2Jgyf--VzmuFuMk6bLeiWg":{"text":"The crispy fried P&J oysters were the single best appetizer I've tried in months. We also ","useful":0,"cool":0},"Ld7vSoPOl_ayyNfX2tR5WQ":{"text":"My father and I shared the whole fried fish, which was Redfish. It was so good. Even thoug","useful":1,"cool":1},"mFWLYRpaPTum4J81Skycxw":{"text":"Ordered takeout tonight (close to their closing time), had 2 different Pho bowls--both wer","useful":0,"cool":0},"LDYRuIQPY-0DJiV_s_asfQ":{"text":"This is a MUST TRY restaurant. \n\nIt's not in the mix of where you probably are if you're v","useful":3,"cool":2},"LN-Jro4WAd9W2Cf7LwjzHA":{"text":"Good and great. The pho made with beef broth very oily...the hush puppies burnt but such i","useful":0,"cool":0},"vrjPJGheMjzgg6Im75uDHg":{"text":"Disappointing visit to Mopho last night.  We waited 25 minutes for our wings despite being","useful":1,"cool":1},"DFUoQhOhiJF58YrIe-xClQ":{"text":"Vietnamese with a local New Orleans twist? I'm down.\n\nIt's in a strip mall removed from th","useful":2,"cool":2},"940Vnf3PA8I-jCcp842AzQ":{"text":"I never imagine that I will eat similar korean oxtail soup in us. The pho's soup is not a ","useful":0,"cool":0},"A7NWGPjx6Vxg3v-TlOhTkg":{"text":"Awesome Creole Vietnamese fusion. Small menu centered around flavor (not a bad thing!). Fr","useful":1,"cool":1},"kPlYpCVxDQLckZ4Kx7S8vw":{"text":"My friends and I were staying in the French Quarter, where there are plenty of culinary ch","useful":1,"cool":1},"7Ddz021OMZ_vEg4mIe_mxQ":{"text":"I was served a chicken wing that was completely hard, all the way through. I almost broke ","useful":0,"cool":0},"bcI6AS6PwCjhONXAFsH2hQ":{"text":"I love a good bowl of pho and was \"pho-king\" stoked to learn that there was going to be a ","useful":7,"cool":2},"ATkWsicIOLKv9SkdD9lGvg":{"text":"Pretty darn good.  I had been looking forward to going for quite some time.  I'm actually ","useful":4,"cool":0},"KeRONiLdvc7iRNLWB04DiA":{"text":"Was able to introduce a friend to Mopho, which seems like an extra nice thing to do. Hit i","useful":0,"cool":0},"Mxvof7uaqX2ExZRVxzz4FQ":{"text":"This place have a good decor and outside sitting area too. I was eating here with some fri","useful":0,"cool":0},"p3BYAhYUlnMkX_blez9llA":{"text":"First, I have to say how much we love this place and that we really enjoy food here! Espec","useful":1,"cool":1},"HgbIoc7d7GDVchNdFdgR-Q":{"text":"Absolutely packed on a Friday night. Hour+ wait for a table for three. They have a gorgeou","useful":0,"cool":0},"KJjss-vaLeYzRGM5gvfqow":{"text":"I absolutely loved the food. We had gotten an oyster appetizer that was suggested and real","useful":0,"cool":0},"oCmwjVwvBjqQ88zeneN1NQ":{"text":"I'm Vietnamese from Orange County, California.   I know when pho is good and when it's jus","useful":0,"cool":0},"M2-rLffrzYjnfFwrDwJDGA":{"text":"Not for me. I'd go back for the shrimp rolls in a second. The paella was extremely overpri","useful":0,"cool":0},"-wQGgmL3waJZX4L63-v6SQ":{"text":"Walked into Mopho tonight around 6pm, hostess was rude as can be. She didnt even greet us ","useful":3,"cool":2},"ssAIiprPXMtvVkA2bHxBrQ":{"text":"- Spring rolls with shrimp were very flavorful.  The shrimp were perfect and the peanut sa","useful":0,"cool":0},"eaDacNyc0pTLKcnIg1Zg3g":{"text":"Food is good, no denying it. It's not great, by any means. I typically don't trust \"fusion","useful":0,"cool":0},"uDPbGM_8EpNF4UqnfMXrCw":{"text":"A different Vietnamese restaurant among many in the City. Similar dishes to the others wit","useful":0,"cool":0},"0DLKox_k7XlzJ6adxj-ZYg":{"text":"Seriously, went in not expecting much but boy was I surprised. This place is awesome. Thos","useful":2,"cool":0},"_cpTnK3oSKVzZ_bGIWymfQ":{"text":"Worst Vietnamese food I've ever had the displeasure of tasting. Picked up a to go veggie p","useful":0,"cool":0},"R7OJg8gxkdLhlc-1TYSXyA":{"text":"My partner and I have visited MoPho several times and if you're looking for amazing pho wi","useful":0,"cool":0},"bM-fZQ7KOf8p3d6M08fiGA":{"text":"Absolutely amazing. The food and service were great! Be careful if you order the wings bec","useful":0,"cool":0},"dULiYiZfV4P8etIc25PX1A":{"text":"Really delicious food. Quirky thoughtful menu, Not my favorite spot for Pho, but its not c","useful":0,"cool":0},"zgotVQkZzcMLGYRuTQqhQA":{"text":"Before we were seated the hostess wiped the table with a dirty looking dish cloth. Leaving","useful":2,"cool":0},"OLyghDF7mg0zN_Mt2rynWg":{"text":"Fantastic ! We have the Pho and Oysters to bring home often. We've also eaten there and lo","useful":0,"cool":0},"wahw_VqrNldnhBpFyFAzGA":{"text":"I can't get enough of MOPHO! I've eaten here at least twice a week since moving to NOLA! T","useful":1,"cool":1},"uZku3DUqajrsJoVPvifqnA":{"text":"I wasn't expecting this place to look the way it does, it's dark and feels like you're in ","useful":3,"cool":1},"swhCDi76umtbVnGwi5G9Wg":{"text":"This little place fits perfectly into Mid-city. It's laid back atmosphere w/o an overly pr","useful":0,"cool":0},"ufS_Ary8_5bM90KW61KFRA":{"text":"I can't say enough good things about this restaurant.  The wings are amazing, and the menu","useful":0,"cool":0},"1wWpBd3WwOEswgoIdGu5-w":{"text":"Delicious cocktails, delicious wings and delicious pho. I love that you can add so many un","useful":0,"cool":0},"aLEPsWtvRV8IjfO7cEbd0w":{"text":"Incredible attention to detail in preparation of flavorful, well-balanced dishes with frie","useful":0,"cool":0},"x8dv5Z_I1dH221mVZxbogg":{"text":"This place has interesting toppings, such as rooster comb, and a good drink selection\n\nThe","useful":0,"cool":0},"C_VhtIiUE0pZAz8rZu4j5Q":{"text":"We tried standard pho and off menu pig roast. Both were amazingly tasteful and delicious. ","useful":0,"cool":0},"m8mIP5kPfX1Gqo2zMnkHUQ":{"text":"It's not every day you find A top Chef in a strip mall, but here he is. Chef Michael Gulot","useful":0,"cool":0},"TwrOhvLq8eR_fUVRw9Mvzw":{"text":"This place has good food. I have not been disappointed with the food or the drinks. It is ","useful":0,"cool":0},"52SZYq98it-7lgl7KrxBYA":{"text":"Service was fantastic, beautiful outdoor seating. Vegetarian pho a was good, but I've had ","useful":0,"cool":0},"NvFD_6QvzhCW54oqPF1T8g":{"text":"I come here atleast twice a month and the Pho is always fresh. A couple times the noodles ","useful":2,"cool":1},"MtBg7Cej0RM3hyjo3YCtdg":{"text":"Yum. We came in decently hungry, and split the spring rolls and the chicken wings and left","useful":0,"cool":0},"E3Q3e8FVwmNOLKOZdP681g":{"text":"Pho yea.  Had the veggi and it was great.  Served in a giant bowl that may be mistaken as ","useful":1,"cool":0},"q1X7Fx-Y2Nsd8bzbu_nYlw":{"text":"Got the wings and pho here. The pho was really disappointing, both chicken and beef was no","useful":1,"cool":0},"77aXgJgT_M6W_TWCbi8gSw":{"text":"Kind of surprised to see this place has 3.5 stars. I loved my food... bowls of deliciousne","useful":1,"cool":0},"6cwwzADf8lYu2lQARvC_ww":{"text":"Visiting yearly Halloween weekend has created us to creatures of habit.  Going to the same","useful":0,"cool":0},"iVTdaAfO4gv_pM7pZlsa9A":{"text":"I've always come during lunch. the pho was delicious service was prompt and friendly.  \n\nA","useful":4,"cool":0},"9GWdGZ_yJANrTSk0r__1rg":{"text":"Chicken wings good but I've been thirsty all night since then so either a lot of sodium or","useful":0,"cool":0},"i_zStA3m_1ayDIvV-Tjy1A":{"text":"I'm hooked! I want to go back and try everything on the menu. The wings were insanely good","useful":0,"cool":0},"qW4zM3YiT6ql2ZLz2r_iaQ":{"text":"Thank goodness for Yelp chat that I found out about this place! MoPho (I heard an employee","useful":6,"cool":4},"3keSbohYINIf-lNUDK_XOA":{"text":"Had lunch here with a friend today. As always, the food is a treat for the senses with all","useful":0,"cool":0},"Pxa700knpGW1o2wUwNN7sA":{"text":"I had a great experience last night at Mopho.  The staff was very friendly. I started with","useful":0,"cool":0},"2vHCGxF5zB4RS7ClepuLWw":{"text":"They had me at whole hog bbq in the backyard.\n\nSo we walk into a crazy busy lunch service,","useful":0,"cool":0},"rJUfYgijMivLMuOboMdqZw":{"text":"Just ate here yum!! Great wings, amazing spring roll and the Pho is a-mazing! Laid back at","useful":0,"cool":0},"WPtkLhl41QtbqTaHaYNZ_w":{"text":"Oh my god. This place is a stunning example of how food should be made. The flavors are ex","useful":0,"cool":0},"HAA0dF5du0dhx_uP049lEg":{"text":"We ate here today for lunch -- got the Oyster Po-Boy as well as the Shrimp and 'country ha","useful":1,"cool":0},"2ZbBJM4oH9qxMbD8U6OTWA":{"text":"This was a second visit and it was wonderful both times. The atmosphere is nice and you do","useful":0,"cool":0},"HOZ9JfLLcLJftCiFzn4_dA":{"text":"I read about Mopho in Texas Journey and saved it for our next visit to NOLA. We were not d","useful":0,"cool":0},"NItVmtBEc5wdTEfoya2BaA":{"text":"I really wanted to love this place. It's been on my list for a while as well as it's siste","useful":0,"cool":0},"ZHiYhr3_IQYH9jVjLLrBEw":{"text":"Finally went to the last place on my pho list in New Orleans and was pleasantly surprised.","useful":0,"cool":0},"ShLmyM4OjXUEzAJ8gTBoGg":{"text":"MoPho is a Vietnamese-inspired Asian fusion restaurant located near City Park in New Orlea","useful":1,"cool":0},"K_oGewIlGlKAnHPKYkrJjQ":{"text":"I had the mussels, which was tasry. Nice blend of spices ans balance of flavors. One of my","useful":0,"cool":0},"ziEJyq4e8ZZeAwon_8nUiQ":{"text":"I've been to this place before, but they have apparently changed their menu recently. The ","useful":0,"cool":0},"-j-0CxGwEsKf5zJubNx8dA":{"text":"I had MoPho for dinner and I am honestly a little torn.\n\nFirst of all, I loved the atmosph","useful":4,"cool":2},"IqtBkkidpUHHODWrKrMPZA":{"text":"This has got to be the best place to get pho from. The people there were pretty awesome an","useful":1,"cool":0},"hr_U6_ncAGgiujk544qvrA":{"text":"Came for lunch on a sunny January day. Back porch was perfect! We had the signature salad ","useful":2,"cool":0},"tS9HesfrFo-EoudPbJ0FcA":{"text":"To think that we had to come to New Orleans to have the best Pho outside of Vietnam. Food ","useful":0,"cool":0},"WwqolmOhpUrBO2ZNtFPqzQ":{"text":"New local restaurant. Nice ambiance with outdoor fire pit area. Enjoyed the wood burn smel","useful":1,"cool":0},"orR270kgyf1P9oIhLUjgSg":{"text":"Really tasty rice bowl, super tofu spring rolls and the rice is just amazing. We had a rea","useful":1,"cool":0},"dgeNbgZXNeW_YFTh8bMLKg":{"text":"Def one of the best newer places in town. Wings and oysters P&J are a must. Beef pho was d","useful":0,"cool":0},"Hmc4aPDoaNmDhejKfb_LLw":{"text":"I was here about a year ago and thought the pho was a little bland, but I also had a cold ","useful":0,"cool":0},"XMAJZ6-ACahBr1RLVQS-xw":{"text":"This place was hands down one of the best restaurants I've been to. Ever.\n\nComing from the","useful":1,"cool":0},"rNm2oqhusIkLD1HhJ9pndw":{"text":"Fantastic food, great service, and a funky atmosphere.\n\nMy girlfriend and I went on a Satu","useful":3,"cool":1},"jCdkCCFYu38RtIVOMKBMpQ":{"text":"The first two times we went...great. Got fowl broth with chicken thighs and mustard greens","useful":0,"cool":0},"6wl5n4nhC1kw7pS1YENRdA":{"text":"Since opening, this restaurant has improved substantially. So, what's good? The wings are ","useful":0,"cool":0},"QEHzrwjedDNYEm9N5BYf3A":{"text":"Saturdays they do a whole roast pig (cochon). My husband tried it and enjoyed it very much","useful":0,"cool":0},"qvsZO4iDwk8-igRlSoXIUA":{"text":"The spring rolls are DELICIOUS!!!! I think we had 5 orders of them. The staff was very hel","useful":0,"cool":0},"XKl-RwSezBgd5yuOFPlGgA":{"text":"Love it there!  Nice laid back atmosphere. Staff is very friendly and attentive. Food is g","useful":0,"cool":0},"8cm-eN76Nahwko8ikw69EQ":{"text":"Love the pho. Can't beat the combination of ribeye, grilled mustards, and mushrooms!","useful":0,"cool":0},"pybCsQu9ko_FRhxli0Fnsw":{"text":"Looked forward to trying a new place to eat!! I must admit the crispy chicken wings were d","useful":0,"cool":0},"huGT2AduevlC2hmK-AgeiQ":{"text":"Yummy I get the lamb curry dish, the fresh shrimp spring roll and dip in the peanut sauce ","useful":2,"cool":2},"b_Mgbwa5GDNxs2Okh27SrQ":{"text":"Nice casual atmosphere.   Wings were some of the best I have ever had.  Also ordered the h","useful":0,"cool":0},"q2QE9eER04INIE3GcRX8PQ":{"text":"If you're looking for pho, this is not your place. Good service, clean, pretty tasty food-","useful":0,"cool":0},"1QFTlJVtU62K97lAfcbxeQ":{"text":"Most of this review will probably echo what reviewers before me have said: the spring roll","useful":0,"cool":0},"chLLaB3lnI4vmqytkU6tDw":{"text":"I am Mopho-natic! I have been to this place at least 5 times since they opened. On two occ","useful":1,"cool":0},"SywSNYjM0NgXxBipI17pyA":{"text":"First time eating here was yesterday. I'm giving the five stars specifically for the pork ","useful":0,"cool":0},"J1ykjInudwCdYuH989nUZw":{"text":"Oh my the wings are out of this world! My husband is not a fan of chicken wings, but he co","useful":2,"cool":1},"ctjY3R08t6fDWs9TAQQ9ow":{"text":"There isn't much to say, really. The draft list is great, drinks are strong and the alcoho","useful":1,"cool":0},"-r_nWEyQ5CQOUGueHbvFug":{"text":"ORDER WRONG.\nI went for happy hour and all was good.  Returned the next day during happy h","useful":1,"cool":0},"_EcXF7lwLVm5h4qLVeGCEg":{"text":"The food is good . The waitress was informative and service was great. Will come back agai","useful":1,"cool":1},"hRxkYS1KPKyMtErXNlX4-Q":{"text":"Great early dinner here tonight. Started with the wings which are the best in town!! Also ","useful":1,"cool":0},"P3xl_FwSQTOE3M2wPdm9_A":{"text":"In general I like mopho. But this time I was very annoyed. My order was specified to have ","useful":0,"cool":0},"CJ6ck_vQMyLAbUp8EoGQ-A":{"text":"The best vegetarian pho I've ever had. Also the most interesting veggie Po Boy was on the ","useful":0,"cool":1},"BhvTksd6_iivpFOPYJhn9g":{"text":"The bubble tea was good, the rest of the experience was not.\nIt took over 45 minutes after","useful":0,"cool":0},"-WmHt3WeNylpJQ8OgyGxOQ":{"text":"I went to Mopho for the first time this past weekend, and the overall consensus was that t","useful":1,"cool":1},"2zPUZ1ky4D0NrpHI2fs27Q":{"text":"Mopho offers an incredible take on Vietnamease cuisine. Outstanding spring rolls, and try ","useful":1,"cool":0},"6GzS1pqKskIaDZ2U-9yTdA":{"text":"Best pho I've ever had. I've had a lot of pho in my life and this by far was the tastiest.","useful":2,"cool":1},"ob5pgKtxHGxbbOTDGu7w9g":{"text":"The food is amazing but the waitstaff is terrible. Was rushed through my meal after eating","useful":0,"cool":0},"9Iq6EcJVgd-K_Otvzxi4_g":{"text":"Mopho is actually when two white guys experiment with Asian flavors. Sometimes the stuff w","useful":6,"cool":2},"CL7SgykKp9FyiTa0KduK0Q":{"text":"This pho really hit the spot. The place doesn't really look like much from the outside, an","useful":0,"cool":0},"3YWneTsB8AZlovEwgUFT1Q":{"text":"The wings were spectacular as were the fried oyster appetizer. All the variations of Pho a","useful":1,"cool":0},"ExmOFw69pHC2CLgNAxfVfA":{"text":"Ok, but not for my Asian palate.\nThe restaurant have a very nice decor. The staff very pol","useful":0,"cool":0},"KPpQySYIoDuzYAFlwOI0CQ":{"text":"Garage door open on a beautiful Friday, skipping the delicious chicken wings for lent, but","useful":0,"cool":0},"eIM6zZ2B9FsYdcMCo-2EaQ":{"text":"After two visits to Mo Pho, the moral of the story is: 'Do not be tempted to try something","useful":1,"cool":0},"zbPMAhGqWXEIftkaKIaVuQ":{"text":"Love this place.  Get the Pho, get the wings, get the salad, get the fish dish, whatever i","useful":2,"cool":0},"6ApP59bva96p4qjQjvlJzQ":{"text":"Really disappointed that it's not authentic pho. The meatballs taste like frozen Italian m","useful":0,"cool":0},"fzsG3d4Ko_rT5_xsVS8syA":{"text":"I'm so glad we were able to try this place!  One each pork and shrimp spring rolls plus th","useful":0,"cool":0},"QPp9zuM5-7kR6RhW4uZ_vg":{"text":"LOVE this place. We always sit at the bar whenever we make it in. The shrimp rolls are del","useful":0,"cool":0},"X5xhBy7RZ8zvUdHM3qvs_Q":{"text":"Two out of this world meals at mo pho, and I'm sure many more in the future. I'll start wi","useful":1,"cool":0},"HLggA7uSuEHOCind4runUA":{"text":"I had a terrible experience this weekend at Mopho. We were very excited to go out having h","useful":0,"cool":0},"GK2LmTbnBLazPD8jZAgaFg":{"text":"The food in this place is on point, which is the only reason it gets stars.  You wouldn't ","useful":0,"cool":0},"UppY7h519vgs7NmsGgmK4w":{"text":"The workers were so rude, I simply walked in and asked them did they sell bottled water, o","useful":1,"cool":0},"Cx_TZmSKswOCFYLmxrJB7w":{"text":"Mopho has recently been on my radar because of their pho \"toppings\" and boozy bubble teas.","useful":0,"cool":0},"ZLYi8sh6w-KTr1oChnGSUA":{"text":"We had a pleasant experience, from the greeter, to the server, to the food. The menu has g","useful":0,"cool":0},"Lsnar3dNi933wLVQwu3xfw":{"text":"Stopped into MOPHO on a cold afternoon for dinner. We started with the famed vindaloo chic","useful":2,"cool":1},"J3d_N03ZzR6kaMS9JWBoHw":{"text":"Chef Michael Gullota is a culinary artist. I never knew that I could get so fun tho about ","useful":0,"cool":0},"uBBQP_27iWnuDt5jgQdyQQ":{"text":"This is one of the very first restaurants I ever visited in New Orleans. I had the pleasur","useful":0,"cool":0},"WccmQKicDhFswLDrsjF8WA":{"text":"On previous visits, I haven't been wowed by Mopho because I find them to be too pricy, and","useful":9,"cool":2},"e775TDbnN5BbMMG_wPnnUA":{"text":"It was really good the first time we went. So we have been going back frequently since (4 ","useful":0,"cool":0},"lbVbM6QcIJTJLAPHQhKZqQ":{"text":"This place deserves more stars. Truly amazing pho (and I've been to a lot of pho places in","useful":1,"cool":0},"gdFeOr5GRQ_gwK41IlxanQ":{"text":"Best pho ever! Everything is really good, their food has so much flavor. Cool atmosphere t","useful":0,"cool":0},"WxE_-aMuaJXcGVrMbozUOQ":{"text":"Great service but that meat pho is one of the best dishes ive ever had. Seriously amazing ","useful":0,"cool":0},"K27Xx_h1gkvgPoSHlggR4g":{"text":"Never had a bad meal here--ever. Chef Gulotta is a master of flavors, the staff is sweet a","useful":0,"cool":0},"r6fDlad_xkOSkN0Ldxprmw":{"text":"I order takeout pho once or twice a week here. I order the vegetarian broth (because it's ","useful":0,"cool":0},"CWnmD9bI_YlrxV0LHlluQA":{"text":"Nice as a neighborhood option. The ambience is low key. Good options for cocktails. The fo","useful":1,"cool":0},"JPGOsdRj5CuTk36gAOw1Jg":{"text":"This is a superior Asian fusion restaurant located near City Park.  I dine here a couple o","useful":0,"cool":0},"dNWwOeLdEgiT0KWT0V8Ygg":{"text":"I don't get the chance to dine out as often as I used to, between a crazy schedule and the","useful":0,"cool":0},"VBubiDk1cPPE8hPNw0MFPg":{"text":"Every-every-everything we tried was so delicious! Sweet potato beignets!!!!! -- Omg omg li","useful":3,"cool":0},"vAuQqAzci6PpCl8qqeJoJQ":{"text":"Awesome little restaurant, with a classy kick to it. I had the sloppy roast duck banh mi w","useful":1,"cool":0},"E3Hair61LQdUnDmwFwXzaQ":{"text":"First time in NOLA and what an amazing time we're having here! Kelly was one of the best b","useful":0,"cool":0},"ciq3s9srs1gJ3DEA0UBaXw":{"text":"I love dining here. We are in the neighborhood. I am a huge fan of their pork shoulder on ","useful":1,"cool":2},"bsmL7yk0RyXeXSEk4KQgAA":{"text":"I recommend the crispy chicken wing appetizer. They were half off, because we went during ","useful":2,"cool":1},"tOtAD93IU8MVLgJnhos1lA":{"text":"highly recommend! I was in town for a weekend and stumbled across this place. I had the pu","useful":0,"cool":0},"RkJ6vsREe_Exah9HP5zzVg":{"text":"You can't go to this place and try something new every time. You will be highly disappoint","useful":0,"cool":0},"wQUzY5m-pUrcmYtMxo1YfA":{"text":"Came on a recommendation and was not disappointed! Took a couple minutes for us to decide ","useful":2,"cool":0},"3KWOkMXKiZ4k99DMa5CtqA":{"text":"From the outside and the shopping plaza this place is in it may not seem like much. But on","useful":2,"cool":0},"aQkPVYaeMtq5jvRKSOCdcw":{"text":"My fiancée and I ordered takeout from here not long ago, and we had mixed feelings about i","useful":4,"cool":2},"kmjwHoJJVYyy4cEgXLnO3A":{"text":"You can't name a place something as fun as mopho and have such a fancy/hard to decipher me","useful":4,"cool":0},"ohoexj35W0tJRg5DzPQb5A":{"text":"As an out of towner, when a local friend raves about a new place in New Orleans - you had ","useful":8,"cool":3},"6vbn2aofjNhImalgLX_HBA":{"text":"Ridiculously good. I had the black eyed curry over noodles. Wow. So good. My dining partne","useful":0,"cool":0},"Izv-wgyio5wTeIUgivSFDQ":{"text":"MoPho is a Louisiana/Vietnamese fusion restaurant, brought to you courtesy of the Gulotta ","useful":3,"cool":1},"so7H48On94zS0lbYufeuFw":{"text":"It may sound strange to say that a modernized pho meets Nola - is one of my treat myself p","useful":5,"cool":3},"em9CvTpgs2sTbk1TAS9sPw":{"text":"Cute location. Bomb ass food. It's all about those sauces (pretty sure my taste buds did a","useful":1,"cool":1},"2-thqRIvHQFE1BY6O_lx0w":{"text":"It was the end of our trip and, while we adore the cajun flavors all around us in NOLA, we","useful":3,"cool":2},"GYh9g66s6DWqd_f8y6h7Gw":{"text":"This was the first meal we ate upon our trip to New Orleans and it was fantastic. My husba","useful":0,"cool":0},"6GwrunRgHfjJEzQLAv8A2w":{"text":"Great for everything but actual authentic Vietnamese pho!\n\nI came from out of town and my ","useful":1,"cool":0},"aq5CdO9dIR_1GkTauAPyfg":{"text":"Simply one of the best meals we have had in the last few months --- and we dine out often.","useful":0,"cool":0},"JELqzqjM_RDEaFb5cvXLUw":{"text":"\"Beasley\" made my son and I an amazing Old Fashion! What a delightful  evening! Just might","useful":0,"cool":0},"S3yo1dNyw6b4yP0DBX96Vw":{"text":"I love this place . The pho was just what I needed after getting my tooth extracted. I als","useful":1,"cool":0},"0VWY45bZG3nVKj97PYMvfA":{"text":"I came here twice on a recent trip to New Orleans.  I was blown away by the food the first","useful":3,"cool":2},"VUjzN7s2a_11Lq_Lf3PLiw":{"text":"I have several food allergies that can make eating at restaurants challenging. But our ser","useful":0,"cool":0},"iV8LHGw9sIvNOONVOUBR6A":{"text":"When I found out that Mopho won wing wars festival in New Orleans I had to flap my wing en","useful":0,"cool":0},"t_3BZ7HQb96NG9o_SsoGqw":{"text":"You want to know what keeps me coming back? $7 pho that's at least two adult servings, and","useful":4,"cool":2},"NrkwNdYBwFT9QoKZOAKZFw":{"text":"Amazing restaurant. The wings are delicious and zesty with a spicy zing. Pho is tasty, and","useful":4,"cool":0},"QD862EJtMZJwwFGYgkWFOQ":{"text":"My bf and I popped in here without having heard of it. It was delicious! My coconut curry ","useful":0,"cool":0},"h6KQPnB1g5pp71FtwGmtIA":{"text":"This was the best meal I've had in a while! They had lots of vegan options and everything ","useful":1,"cool":1},"TJZMc1T2dnKjBPqTrg1WRw":{"text":"If you are craving traditional Vietnamese, this is not the place for you. My boyfriend and","useful":2,"cool":0},"g4aTtuUXAPOKKHgf8Y--IQ":{"text":"Exceptional!!!!Exactly what New Orleans needed. The drinks, the food and the staff are pro","useful":0,"cool":0},"UBCImIIZCc4PWF4ENLN-BQ":{"text":"A big disappointment shrouded in an excuse to call themselves fusion. I ordered their sign","useful":7,"cool":1},"9ZfY4GQIwZIE6Pv_hgbZCQ":{"text":"Pho or ramen? We've all struggled with this choice. From all of us who have been forced to","useful":1,"cool":0},"k7TF_x1hTGzHhoQ7jEi5pQ":{"text":"I think I say this everywhere I go but GET THE BRUSSELS SPROUTS. They are amazing. This pl","useful":0,"cool":0},"sEoQO9jifkYR6ENctsixBg":{"text":"Wings were delicious. Meaty and great flavor.\n\nThe brussel sprout spring rolls were also f","useful":2,"cool":1},"jC8Y2yjRFFzHRsXxQaOr6A":{"text":"What a fabulous find. Best value meal I had in the city. Based on the server's recommendat","useful":0,"cool":0},"9c1wrntQrMyWoi0i2w5zZg":{"text":"We stopped into this place on a whim, looking for Vietnamese food. Mopho did not disappoin","useful":1,"cool":0},"VzCDPuzb3DUTyBCNmMUIQw":{"text":"Our waiter was excellent\n\nNew Orleans chill and helpful\n\nFood is excellent!!!!\n\nThe green ","useful":0,"cool":0},"vuxJT8q47DDWgl7_UjPWbA":{"text":"Christmas Eve, hungry, just picked up a hungry teenager from the airport and had plenty re","useful":0,"cool":0},"WNvgCMliyE49yhirKCLd0Q":{"text":"Ridiculously good. Brought a group of fellow business travelers here for lunch and we were","useful":2,"cool":2},"ro6BT_5oVPxb_i4gNrPerw":{"text":"Amazing vegetarian options. Perfectly cooked food with flavours blending in well. Must vis","useful":0,"cool":0},"6Jcka-ZK78bKv4Wea7isXA":{"text":"Went in looking for a break from the Cajun experience on our visit to New Orleans. We were","useful":1,"cool":1},"6pKX2y73PhqNrVzS8ual4A":{"text":"WOW!!! Son picked this restaurant. My wife was a little hesitant but we became converts an","useful":0,"cool":0},"QPF5WoNldjkcxLii7FqXtw":{"text":"If y'all looking for authentic Vietnamese food, please go to any number of legitimately Vi","useful":0,"cool":0},"p4SlIcwZ5o3QBE09N7bzBg":{"text":"Their veggie rice bowl is really good! We were looking something healthy while heading bac","useful":0,"cool":0},"4wTmPA0Yp-uemnbkgAFaGg":{"text":"This restaurant is consistently good.I love the atmosphere and the great service. I look f","useful":1,"cool":1},"1DRi8jiHeTc6d9lqXoF7xA":{"text":"I had the crispy chicken wings, Vietnamese coffee, grazed pork belly bowl and the standard","useful":0,"cool":0},"5tM-m4Muwn6cGWv7hhhICA":{"text":"This place is bomb! We waited longer than anticipated, next thing we know, we got appetize","useful":0,"cool":0},"P68uW0pMoiVatNIbCDi23A":{"text":"Man this place has flavor down to a science. Every dish from appetizer to entree was a cre","useful":0,"cool":0},"GXf7p9kQiltrtpqlpZewmQ":{"text":"Beasley was our bartender and they made the BEST old fashioned I have had in a hot while. ","useful":0,"cool":0},"4He3eIWq5sYeGsqmEYr-Jw":{"text":"We were sat at 9:45 and the service was gracious about us being there a little late. \n\nThe","useful":1,"cool":1},"YdZMFkJB5x5Rw98X6QhB1g":{"text":"Very good pho, but let me tell you. The chicken wings here are some of my favorite in the ","useful":1,"cool":0},"ipaqrdBFAqJAxZw_76gE4Q":{"text":"Wonderful food and cocktails.  We loved it!\nThe Brussel Sprouts were fantastic.","useful":0,"cool":0},"4YjhbgwY5LTRnATvV-FKrA":{"text":"Been several times and always enjoy the eats. Only reason I can't go full 5 stars is due t","useful":1,"cool":2},"W-BkHDNSvfrDM3PBVtexCw":{"text":"Not impressed with the Today we eat meat Pho. Don't like the beef balls and the soup is to","useful":0,"cool":0},"VKGkJRd0aU6EIePoqquESg":{"text":"Owned and operated by the hottest young chef in the city (Gulotta), the food and service a","useful":0,"cool":1},"IZUaOGaQgqPQkIGddsF1EQ":{"text":"I was pretty excited to try a Vietnamese fusion place and had my expectations accordingly.","useful":0,"cool":0},"EXrZy0yXS39Ipjv1zvGYuA":{"text":"Place was great, food was awesome, and service was fantastic. I had the \"hangover\" pho and","useful":0,"cool":0},"ZVjkpsd1VZFRA7Pj5ewD_Q":{"text":"This is where I take everyone for wings when they come visit me! Pro-tip get them during h","useful":0,"cool":0},"S9I3NrOzKFAUbG_s9QJaEA":{"text":"One of the best restaurants I've been to in New Orleans (previously east coasters). Don't ","useful":0,"cool":0},"SyNvQPLCnTQV2i-mPNt3_w":{"text":"Overall great meal.\n\nThe Brussels sprouts are a must- the sauce they are in is so, so good","useful":1,"cool":1},"hzgNggty_Et4yCuBwwzSQg":{"text":"Great place to eat the only thing when you call to order. Sometimes the rude I'll put you ","useful":0,"cool":0},"wM578TT-p_ZDGNf31xyZHA":{"text":"Not only are we addicted to their bone broth pho, but the one time our delivery order was ","useful":0,"cool":1},"BNv84kxM6bCImbm_SbqSgg":{"text":"If I could rate it a six, I would. The Pho was a MOPHO dream. Worth the trip from Memphis ","useful":0,"cool":0},"fBLeSnrKbfCVTEbrbDcjBw":{"text":"This has to be the absolute best pho have ever had!!! The chicken wings just get here and ","useful":0,"cool":1},"gdwKSex5_iZnQnH4JIibpQ":{"text":"If you don't get the fried Brussel sprouts, you're missing out on one of the most amazing ","useful":0,"cool":0},"gpKUOpzvJrCcVRLS5iL2dQ":{"text":"Service was great. Our waiter even took off a the alcoholic boba drink that we didn't like","useful":1,"cool":1},"PvLdfSPiqVO_cVA-ypYr7w":{"text":"So I went here last week, I wanted to give it a 2 star but my husband said his food was de","useful":1,"cool":0},"0cj78I9wJn8ID3tl85XiAg":{"text":"Super yummy Asian cuisine with a twist! Their chicken wings are the best we've ever had. C","useful":1,"cool":0},"fCmhjvJ7-zmq50DPv5Gxxg":{"text":"First off I have been to MoPho many times, the chicken pho with thigh and pork belly is al","useful":0,"cool":0},"jLDvhtCH8-IbtEENrCw1lQ":{"text":"The great blend of NOLA cousin and Vietnamese flavors are unique but the food makes sense.","useful":0,"cool":0},"_qlcSvtCyB52fbB5Ybls-g":{"text":"Beef Pho W/ Meatball, Tripe and Tendon ($11): really clean broth, and I loved that it was ","useful":0,"cool":1},"CZOZ2C5UINRNF_wbdNtlww":{"text":"Mopho is a worthwhile experience, and upon your arrival, you are immediately welcomed by a","useful":0,"cool":0},"hXq5c919Bj41LvsWxUmvKg":{"text":"The service was great and the ambience is modern and comfortable but the food was very dis","useful":0,"cool":0},"9M2t-lQ67_LD9_8erJ3i1g":{"text":"Fried chicken wings with lemongrass and ginger alone would get 5 stars!!!! \n\nIm from TX an","useful":6,"cool":3},"AHO1juiSBOnIXsu0-mtXgg":{"text":"Great service. We tried the cochon that they have on Saturday and it was a delight. Very c","useful":0,"cool":0},"GCNuXQntE7vdbDm6H-3X5w":{"text":"We are locals and have been a handful of times. I would say our first was still our best! ","useful":2,"cool":1},"FD4Q0uMdHxSu4_phY859kw":{"text":"The wait service was slow and it wasn't crowded. Food was delicious  though. The wings wer","useful":0,"cool":0},"wBLELArcA7JRV-UUPrOX7A":{"text":"I haven't enjoyed a meal this much in a very long time. Everything was excellent. We were ","useful":0,"cool":0},"iFPa5ASj6MH2UhhvhI2jjg":{"text":"This places was highly recommended by a friend of mine so I decided to give it a try. Staf","useful":0,"cool":0},"ttu7h6c5ONE5nRs9AHA0zw":{"text":"Moph*ck Mopho, i ordered an entree bun, it had 4 small shrimp but cost more than pounds of","useful":0,"cool":0},"vb9rdH0sQDQ3dq9yoE_9Eg":{"text":"I found this restaurant through Maypop's website, so I was excited to try it. Their menu i","useful":0,"cool":0},"8JryY7PqSXnW9sbvcIvM8Q":{"text":"So far everything I have had at MOPHO has been outstanding!  The spring rolls are great an","useful":0,"cool":0},"YH3VwLD4UMHIfzQ5-S-aTw":{"text":"This is a good and interesting take on Pho. I like it! Boozy boba drinks are awesome!","useful":0,"cool":0},"z4FBrnkU91_kU7MS8Xzilg":{"text":"After hearing a piece on NPR about MOPHO, we were really looking forward to trying it next","useful":1,"cool":1},"py-x2xFizl_pjSgjCBHj3w":{"text":"When we hear about MoPho special \"Whole Roasted Hog\", we were thinking about Heo Quay. We ","useful":1,"cool":1},"viCuX0lEZsl85zz_AS49hw":{"text":"I'm a huge fan of Vietnamese cuisine and I have my favorite spots for a great bowl of pho,","useful":1,"cool":1},"OFGxcOyUfYalu6lZb0QJsg":{"text":"Expensive mediocre food, almost friendly service. Almost. And the pho had almost nothing i","useful":2,"cool":1},"M-HJQqDS0RSaibsGKw8mGA":{"text":"Excellent service!! Thanks Jamie :) Probably the best spring rolls I have had in my life! ","useful":1,"cool":1},"KBqoj9K6CqRDuZwyioSn3Q":{"text":"Not the greatest pho in the city and the workers seem a little disconnected from the custo","useful":0,"cool":0},"aLrxOOPdQ8qVHRgpWrZo3g":{"text":"Really expected sooo much more from this place. I came in knowing that it wasn't going to ","useful":1,"cool":1},"zkupVbh4j7oaSpWBuWpC8g":{"text":"So I give this place 2 stars because of pretty good service but food wise, it is not good ","useful":2,"cool":0},"r2nvbztwOJN94EgECYcLpg":{"text":"Mopho isn't the right name for this place. I was very unsatisfied with the pho. The pho wa","useful":0,"cool":0},"DRkgnoUzuEUgYu-OGMTFbQ":{"text":"Never disappoints. Since my first visit, Mopho has become probably my most frequent spot t","useful":0,"cool":0},"sb_G9DSlT6MjIrG5g8Uxhw":{"text":"Terrific, loved everything.  Eggplant bowl with rice, beans and couuchon de lie was amaazi","useful":0,"cool":0},"Cj3MvOB6RbAJOc5U2OvOnQ":{"text":"Wow, is an understatement!  Great service super friendly and helpful.  The food was incred","useful":2,"cool":2},"x-EGEe8WEAV5zKMQEcXjNA":{"text":"I really like this spot. Like another reviewer mentioned, this isn't an authentic Vietname","useful":2,"cool":3},"-kc17InPfs4tbztl3ASs2Q":{"text":"Really delicious. Clean, tasteful atmosphere with a great smooth vibe! \n\nSuper friendly st","useful":3,"cool":2},"NlwQWvzoFFXNcl7OjL47yw":{"text":"Soooo good! Really cool twist on traditional Vietnamese. Love the pho. Love the wings. The","useful":0,"cool":0},"oOWxRmU9yPArcVcbjAkzlg":{"text":"MOPHO?! NO, no MOPHO! As an Vietnamese American, I was looking forward to some good pho, b","useful":1,"cool":0},"6e8Mq8i8fjDLxsPP2oxJkw":{"text":"I rate that crispy chicken as my \"chicken of the year\". It's perfectly cooked with that ma","useful":1,"cool":1},"V6RaKeUenmXhLfSuaShelg":{"text":"It was our first time here. We were looking around for a place to eat since we were in tow","useful":0,"cool":0},"rnE7tf4qniDQvgfqJvk1Aw":{"text":"If you're looking for something delicious and different, MoPho is the place! The barbecued","useful":1,"cool":0},"rehue-aI3TyBMQnXJw9Nnw":{"text":"How this place is rated higher than 1 star is beyond me. I'm typically very skeptical abou","useful":2,"cool":0},"eufMNs1XClbvmfAw8S5u-w":{"text":"Great atmosphere. Pho is good. Not the best in Nola. Decent price though! I got to come ba","useful":1,"cool":0},"2AvOGJICF1q1vap6BNZ6eg":{"text":"I had a fantastic dining experience at this restaurant. The menu was a little intimidating","useful":1,"cool":1},"KN27G-pCOGFog9Zm7l0XrA":{"text":"So, I have to admit I was pretty excited to try this place; and while it was good, I did n","useful":1,"cool":1},"CXctBx4ToxP63G7p1GlyCg":{"text":"Great service. We were on the patio and it started raining. Our waiter Joey R was very hel","useful":0,"cool":0},"nrH_CkacfItaBMCffNjCaw":{"text":"New Orleans has lots of good Vietnamese food-- both authentic, and fusion. This is not eit","useful":1,"cool":0},"bHxIf26-mVxLU7z8S8vRKA":{"text":"When Pho meets Cajun country, it's expected that I need to try this effect. I found myself","useful":7,"cool":7},"FCmswMAilYdT25lAaFyQVw":{"text":"Judging from one take-out order, I have to give you guys 5 stars. Been hearing about MOPHO","useful":0,"cool":0},"_BXdfT9NqaEHzB8U6-Fjrw":{"text":"I LOVE this place I got the Hangover Pho the first time I went and have continued to get i","useful":0,"cool":0},"3xnHwrXW5SJ1ESKGn_gkAg":{"text":"We popped in on a whim searching for something with a lot of flavor.  Even with the reduce","useful":1,"cool":1},"nSUM3bDHvwaXtyR4u6Rg_Q":{"text":"I only eat chicken and finding a pure chicken pho (broth included) is really hard but Moph","useful":0,"cool":0},"M7iNX5u2Nl5_3NZGObXaTA":{"text":"Came for a quick vegan light healthy dinner. LOVED the brussel sprouts but the vegan pho d","useful":3,"cool":1},"3mjYLmz2jSgCemdl9nJP4g":{"text":"I had been looking forward to coming here for forever and finally made it for happy hour w","useful":5,"cool":0},"DQBlxA-SROLRehmWl4I54Q":{"text":"Every time I go to New Orleans, which is becoming more frequent, I must stop at this amazi","useful":2,"cool":2},"CNYH2UJQN3s26Xu0ghcBYw":{"text":"Had been devoted customers here. Have given rave reviews and talked about them to everyone","useful":2,"cool":0},"m7wri-3yuIk0NuJvTswtmw":{"text":"One of my favorite spots in town for Pho but they have so much more. Their appetizers, Ban","useful":0,"cool":1},"4gk_KkKsWE1cMuOUHTUXSA":{"text":"Overall I did not enjoy my meal here. I appreciate the effort but for me the fusion wasn't","useful":0,"cool":0},"N3ADQAb60GVdWpAVxnP5Iw":{"text":"Firstly, the service was pretty good. However, I ranked this restaurant low because of the","useful":1,"cool":0},"GO3bnNuRvPxHdPh73EkKtw":{"text":"We chose to eat dinner here at the last minute and showed up without a reservation. Only a","useful":2,"cool":2},"k0O3T9iS2ZuC-FrNNugm8w":{"text":"Pho is enormous and very reasonably priced. And the pork belly and crispy veggies are some","useful":0,"cool":0},"5sJ_189GuFiudiepZ6Ii2Q":{"text":"Excellent and creative fusion of Vietnamese and creole. Great variety.  The wings are not ","useful":1,"cool":1},"YCoNds9HjmhNVcIC2a83-g":{"text":"Stopped in by myself for a midday lunch. I made the error of not calling my order in early","useful":2,"cool":2},"PeFDfC8atbekJEITtyN6NQ":{"text":"Went for early dinner and was surprised with the half price happy hour wings.  Awesome tas","useful":2,"cool":0},"Lr6hmMPS07MbdfxzvJq92Q":{"text":"Loved our meal on a nice NOLA afternoon on their back patio. The brussel sprouts were deli","useful":1,"cool":0},"YTyd4m9joJdicPDbERgsbA":{"text":"Stopped by for the dinner on the first night in Louisiana. We ordered chicken wings and mo","useful":1,"cool":1},"NkeyNF66P-R3OxOCPLnNNg":{"text":"take out food in the time of corona virus.\nWe could've dined in, once my hubby went to pic","useful":0,"cool":1},"x0IdPzD2ed9mxn8aUmm8iA":{"text":"Yum for chicken wings for appetizers and chicken pho. The outside area in courtyard is rea","useful":3,"cool":1},"qnadRReHDaTfPwvxiGxmlA":{"text":"Omg.  Spring rolls.  Get them.  Get ALL of them.  Get ANY of them and you will want more. ","useful":0,"cool":0},"JOJJA8NpzgENTNiBOtmO1w":{"text":"Wow! I found another one! This will be a restaurant I visit every time I'm in New Orleans.","useful":0,"cool":0},"wMa7hsKxIMxek7f3O6E95Q":{"text":"OMG omg omg! Have you tried their Crispy Chicken Wings in ginger and lemongrass.  Best chi","useful":3,"cool":1},"BNSGGLiUJ70YQm6KX3ONug":{"text":"I could honestly write a love letter to Mopho, but I'm pretty sure they know since I'm the","useful":3,"cool":1},"k_KJjo6eJ8QHB0ACuDPylg":{"text":"good place sat at bar good service nice bar tender great menu great po-boy sandwich good b","useful":0,"cool":0},"9nb5izaEIFHgFdWMHJZbiA":{"text":"If you enjoy really unique Asian food you must eat here. It's worth the effort to find in ","useful":0,"cool":0},"k5vWjmWefpikuBsDbysR_A":{"text":"Right next to the amazing City Park, MoPho has tasty Vietnamese/Creole food.  Walk around ","useful":1,"cool":0},"gaOy-x5TNDf_Tja0t4EE0w":{"text":"Everything is amazing! I've never gone wrong with an order here. Fusion at its best. I'm s","useful":4,"cool":3},"4RzrIt7LCgMfTjEAvIo-9Q":{"text":"This is one of my favorite places.  The pho is amazing!  The add-ons to the Pho such as th","useful":2,"cool":1},"z4FG1RlGDrtQaPaMDPNIUA":{"text":"If not for their good wings I would give 1 star. \n\nThe entrees are way too fusion and tast","useful":1,"cool":0},"509Gig77Gg47K1pjGwvMpA":{"text":"Neat little place located in a small strip mall.   We tried this place in search of a non-","useful":1,"cool":0},"BfdvOCFzhOZk-aPXkTHe3g":{"text":"It seems like my reviews keep disappearing, maybe I need to find them hidden under archive","useful":0,"cool":0},"ITH42Oa1f0ycd1XRVWZcPQ":{"text":"Came to mopho on a Thursday night for dinner, I would describe it as Vietnamese food with ","useful":0,"cool":0},"Rbi-B9gxL_DA0H_LKWH6Wg":{"text":"SO good we ate there twice within a five day trip to NOLa. I could eat their wings every d","useful":0,"cool":0},"O624sNbN43sLywuJqEu8gg":{"text":"Had pretty high expectations and it was good but not great. Pretty slow service on a Satur","useful":0,"cool":0},"crx7sNZX6z2YN2oCeQBXLQ":{"text":"Understaffed on a Saturday night is inexcusable,especially for a place that claims to be a","useful":0,"cool":0},"hTDzERQsPh5aChT0MtoVLw":{"text":"Come by and what ever Mike recommends, order it. We ate smoked pulled pork with a hang ove","useful":1,"cool":0},"fCDf8L7UWBKoYDOh-M2w9Q":{"text":"Mopho is an Vietnamese Fusion / Boba Tea place located in Mid-City area of New Orleans. \n\n","useful":8,"cool":5},"I3W2LVXUqOVZB7Ib4TEo1w":{"text":"If you like chicken wings, you'll love these.  They are flavorful, hot, sticky and just pl","useful":4,"cool":1},"aX-qlqEBwrylShKAP9-trA":{"text":"Not as authentic as they claimed, but I would come for experience. Nice location, near cit","useful":0,"cool":0},"aJ2ctBEeJh-rUFb_McIKSA":{"text":"The chicken wings were AMAZING and definitely enough for a meal. The sausage sandwich was ","useful":0,"cool":0},"VbA4We-E5PtT5nkt_RtYsg":{"text":"YUM! This was the most memorable and unique pho that I've ever tried. While I was out ming","useful":1,"cool":2},"Ck89BH1AN7gI4C-mD3Itlw":{"text":"MOPHO is an interesting restaurant because it is not your traditional Vietnamese restauran","useful":2,"cool":1},"e71Ca7GYSmnAjRj3R2FzqQ":{"text":"It's a bit dark inside, but not uncomfortable. There are some really adventurous dishes on","useful":0,"cool":0},"1RBpEEhGnZpqxOy0V1w4tg":{"text":"New Mopho at the NOLA Airport Terminal horrible.  Food marginal and the bartenders awful s","useful":0,"cool":0},"PwWSr8wQXPmJQkLypmyiyA":{"text":"Not a pho place at all. Please do not call this pho and serve it calling it that. It is No","useful":1,"cool":0},"rClYsXMyK4cREY_Z7h929A":{"text":"$10?????\n\nThis is not worth $10. They could've AT LEAST presented in a way to make it LOOK","useful":0,"cool":0},"lGxSCXEWG6-9-At2LLJLkg":{"text":"My experience with Vietnamese food is sadly limited so I can't speak to authenticity, but ","useful":0,"cool":0},"77NxC3Ji1fem7ii_eokufg":{"text":"Great atmosphere. Did not care for the fresh spring rolls, as they contained deep fried sh","useful":2,"cool":0},"i--OGMxCNdGnyWPOwnMIzA":{"text":"Ok so based on food alone, this place is 5 stars. The food is awesome-Asian fusion done ri","useful":1,"cool":0},"gpmSFHYMsaqUCkLMTJTF_w":{"text":"This place is a disgrace to Vietnamese cuisine. Saw this place on Yelp and decided to come","useful":1,"cool":0},"Ghst3opXJ_d5zceiK3cesA":{"text":"Great food. Excellent service. And very nice ambience. Probably the best pho in Nola.","useful":1,"cool":0},"nGDEcvBAanpz43r5JulYdw":{"text":"Best Asian Fusion Food in NOLA!!!","useful":0,"cool":0},"dTiu3-6mh-e4dZsNobGmSg":{"text":"One of the top  Vietnamese options in the city.  My personal ranking 1. Lilly's, 2. Pho Ba","useful":0,"cool":0},"1YIEW_Pg2szY6BV0lhmZWw":{"text":"I never expected to try Vietnamese in New Orleans but I am glad I did. We heard that this ","useful":2,"cool":0},"yKelU0gwA9y4CeNBF7PTCw":{"text":"After touching down at MSY, we came here for dinner as I was in the mood for Asian fusion.","useful":2,"cool":1},"dYXb-GLqrtrxXsVFZizhoA":{"text":"My group came here for our \"last meal\" in NOLA, looking for something different than the u","useful":0,"cool":0},"l2sr2IIvj9_ga4zYvOXPPQ":{"text":"I had to give this place another try before I wrote a review. I had high expectations befo","useful":2,"cool":1},"ciEEMS2djRSehCHg97P5AA":{"text":"I got the glazed pork belly bowl and chicken \"pho\".  Portions were an insult.  The \"pho\" w","useful":0,"cool":0},"cA1zkYHDHaxrmj1GQmg3cQ":{"text":"This is one of my go-to neighborhood restaurants. Feeling sick? Go to Mopho. Feeling sad? ","useful":0,"cool":1},"Wg9cvYmAR6jgBRK8X3coqg":{"text":"After City Park, we were starving. Pho here satisfy  your craving. The beef pho was good n","useful":0,"cool":0},"_TmwYBMK_mBaX_r13q1SeQ":{"text":"We had a splendid time at MOPHO 's lady week. I highly recommend! The jasmine rice was sea","useful":0,"cool":0},"yB_15lvC9o70rJQw1Esvcg":{"text":"I tried this place for the first time a week ago and came back for the second time in less","useful":1,"cool":0},"L42_msfwMWfLdiIDYMLMkA":{"text":"OK, this is probably my favorite Pho places of all time. Among other things they will actu","useful":3,"cool":0},"Zis3YnCzyOGBnXI8XpDZZg":{"text":"Friday night and this place was packed! A good sign. The hostess said our wait would be an","useful":5,"cool":2},"wUTF-LVJaOBP3dET5HWz2A":{"text":"My second time here since the first time was just so good. Food is very tasty but they see","useful":0,"cool":0},"fB0pEYiMAeToiIhXsTZCEQ":{"text":"Came here a few months ago before COVID. The food was very good and we had bubble tea that","useful":0,"cool":0},"vItxHzvIe8BtuYerCyWEZQ":{"text":"Updated review:  came back for date night and was not disappointed.  For the first time si","useful":3,"cool":1},"RJ8wwnlUTf6ChKl8PaAuAA":{"text":"Mopho is one of those places that we've been talking about going to forever, and for whate","useful":3,"cool":1},"rzBghJqlz7MhLojyKiutvg":{"text":"Super delicious! Got my order of the chicken pho to go and the process was super easy and ","useful":0,"cool":0},"7rW-4JXMXBs1ynsUB5T5rA":{"text":"This review is 6 months late but here goes! I was road tripping across the US with my sist","useful":3,"cool":2},"KfgcQhUwrsasFDwKecgs1Q":{"text":"One of the better places in the city to get some Pho.  They also have a full bar if you're","useful":0,"cool":0},"RKtQyBlmGHSXyfTFTxRDNw":{"text":"THE BEST veggie pho in New Orleans, hands down. The broth is deep and soulful, the roasted","useful":0,"cool":0},"a8r4CpBbiLpPfGt8RfFJzA":{"text":"Pleasant and healthy place for a light meal.  Wider menu options than most Pho restaurants","useful":1,"cool":0},"kq_4BQdTMi5QARp6MKEvgg":{"text":"Thoroughly enjoyable ! Was craving Asian fusion flavors and they delivered !  A clean yet ","useful":0,"cool":0},"vVfcdRWtpLQ4LQGUXXbVXA":{"text":"Mopho is really good, except for the pho. I got the Beef pho, which portion and price-wise","useful":1,"cool":0},"m6nxMvwE0BhFAulBxqOK6A":{"text":"MoPho\n\nWas a questionable choice eating here with all the choices in New Orleans.\n\nChicken","useful":2,"cool":0},"KTVuE91MVZwX8_5O7Rb84A":{"text":"Service was great. Tasty drinks. Food was terrible. I had the Mopho drumsticks, cauliflowe","useful":0,"cool":0},"BYPy3rK7dX8x-bWUI5CDCg":{"text":"I absolutely despise this place. Came here for dinner with a girlfriend and we decide to s","useful":0,"cool":0},"cpmhTS42vCP2kgrVpnKkQA":{"text":"This is probably my new favorite spot for pho in the city. Try the fried green beans for a","useful":0,"cool":0},"aX74CMusVnfLtgoYqWBzkA":{"text":"Mopho is one of my favorite restaurants in the city. Every time I have guests in from out ","useful":0,"cool":1},"2inTYQaFvHYiUJS4IYB8GA":{"text":"After hearing so much about MOPHO through my boyfriend and my Yelp friends, I was excited ","useful":2,"cool":1},"8avetGUJowuq29Iw7G240w":{"text":"Dined with my gf at the bar on a Monday night. It wasn't super busy but busy enough that i","useful":0,"cool":0},"4HyUkF-hMq-VvrZQoMTbEA":{"text":"You know a bowl of pho is good when, after taking a bite, you excitedly utter \"Whoa\". That","useful":9,"cool":5},"5kRW0WEt10HATuln2X7ayg":{"text":"Came here twice so far, but will mainly talk about my most recent visit. Came with a frien","useful":5,"cool":2},"dicsRQrzRohEnxFylNNlNg":{"text":"We were skeptical about Mopho since it is kind of isolated in a strip mall, but do not be ","useful":0,"cool":0},"9lVDvMHbiCpvvrkb9fTBLA":{"text":"Where to start.  Been here plenty and I always enjoy the food.\n\nSome of the most delicious","useful":0,"cool":0},"YT4ZcqogDUI3JUtVpI9MvQ":{"text":"On a business trip and realize NOLA has a growing Vietnamese population and culinary inter","useful":1,"cool":0},"0HNRQhgEt6-MCAmz5RacJw":{"text":"Ambiance is corporate cafeteria. Noisy, crowded and overpriced for a strip mall location. ","useful":2,"cool":0},"6aoQ5pzdmv0mHg20HWFHFQ":{"text":"I love grabbing a bowl of pho at this restaurant! I love that they have different flavors ","useful":0,"cool":1},"SzPHEIDG0dCao0wWIKGUog":{"text":"Is it authentic, traditional Vietnamese? No. But it's delicious! Mopho has been a staple f","useful":0,"cool":0},"4eL_SJr-jux7iCE-AiSiFg":{"text":"We went with friends and the Pho was awesome, the chicken wings were amazing !! \n\nTwo of u","useful":12,"cool":4},"M1qsM-cJ0ERLUS0blOwJ0w":{"text":"Mopho is a great Asian fusion restaurant in midcity! Do not go here expecting typical Viet","useful":5,"cool":2},"ofy2WyWIahCujIksMZIyQA":{"text":"I can't remember what I love about this place, but I do remember that I love it. It has go","useful":0,"cool":0},"suk1zlfW0qlU0N7TeZSAFw":{"text":"Had reservations. Upon arriving they have posted on the door the rules. One of which is up","useful":1,"cool":0},"hvh8CjVulVV0Bjoni0G9ig":{"text":"Genius cuisine. Outstanding service.  They roast a whole lamb one Saturday a month.  Needl","useful":0,"cool":0},"HHbGOPpoiGRkB1zekJWbZg":{"text":"Who would have thought we would find such amazing Pho in New Orleans. This place was the p","useful":3,"cool":1},"uY9mq7zf42zMlAT_iX4d4w":{"text":"First time- amazing service. Second time- super ehhhhh. Really good apps and drinks. That'","useful":0,"cool":0},"7NPSy-M_2EjrvJRsv7yz3g":{"text":"Service was good. Barely any meat. Broth was soulless. I had to ask for soy sauce and hois","useful":1,"cool":0},"jY6CuBVvjGkiTo6MeBZNQQ":{"text":"The name alone almost got them 5 stars but since there is also a Pho King, I'll crown them","useful":3,"cool":1},"XPZ9CZlvirL9Cdmh2YLoEg":{"text":"Pho didn't taste good at all. Not normal pho. The only reason it's getting 1 star is becau","useful":0,"cool":0},"JL7ybbVLTNPpNPGsxCidjw":{"text":"Not much to say about MoPho but DAMN it good. Everything I've gotten from there has been g","useful":0,"cool":0},"0_pQOOMixe7gL71NBqox9Q":{"text":"The moment I arrived I was greeted by a young man named Rob, who immediately told me my se","useful":2,"cool":2},"EbE-mK4DTZALpADFMNw3UA":{"text":"Recently had their MoPho bowl, and although i loved how they added kale into the mixture a","useful":2,"cool":1},"OGab0zxhCENT1S0tbVgsHA":{"text":"We had the most delicious dinner here last night. Patio dining, exceptional service and th","useful":0,"cool":0},"KurybWK1SAVBsij-mFIZwQ":{"text":"Honestly super dissatisfied.... meat was raw veggies were old and stale. Should be called ","useful":0,"cool":1},"AlG5sjJ6cWzd7nEsTy0Oqg":{"text":"They have a framed, autographed photo of Kurt Russell and John Carpenter on the set of BIG","useful":0,"cool":2},"NCPHyk1aIj_iato8qU8Wlg":{"text":"I really enjoyed my meal here and loved the atmosphere too! It was modern and cozy.\n\nI had","useful":2,"cool":1},"uIJ9tQ2xl1hvVqXscnMwEA":{"text":"I have been waiting to write this review for so long, far too long actually.\nFirst, a disc","useful":4,"cool":3},"zwPhFedKXiduRJZ5LV5TaQ":{"text":"I fell in love with the oysters all over again. I mean every part of it's toppers & sauce ","useful":0,"cool":0},"vwHSixGaetkbuMaby3MlMA":{"text":"EDIT: I called about my issues with the food and the manager was very understanding and of","useful":0,"cool":0},"u_D_Iecp1B3X7U6Z_YSrsA":{"text":"Pretty busy when I went. Even the bar was full. Interesting menu with boba tea that you ca","useful":0,"cool":0},"nI_EtlHuxyRtm0o0SF7F6w":{"text":"Beyond a doubt the best Vietnamese Cajun food I've ever eaten. The Vietnamese caramel and ","useful":2,"cool":0},"oOITrl_2-8zrb1lVZZTaVQ":{"text":"To some, pho is a bowl of soup from some place in Southeast Asia. To others, pho is a soph","useful":3,"cool":2},"qWXB87E1hue6EsM-dwveyA":{"text":"As a person who just moved to New Orleans this is a must! \n\nSuper interesting take on sout","useful":0,"cool":0},"e3fY9-5rR2cVSwQjfNCfVg":{"text":"The food is very good here, but it's odd how they handle reservations. My party of three w","useful":0,"cool":0},"nPzifuTHfG0Q7pQcRh9DWg":{"text":"Mopho is one of those places everyone has always told me to try, and I just never had. I w","useful":0,"cool":0},"HEIdDZyOL7Cz0Xt-z5ExBg":{"text":"I gave them a 2 star rating, because they gave our food to another customer during COVID. ","useful":0,"cool":0},"f0wxihBijGREQ578qkQaDw":{"text":"This place! \n\nI was going to rate them 4-stars because the first pho I got was a little ov","useful":0,"cool":0},"fEqKVegnFWgzIF2OsRUsCg":{"text":"This was one of the first restaurants I dined in after restaurants started opening back up","useful":2,"cool":1},"tEJ65UJrLEZ-QArx4V1wJA":{"text":"I must have missed out because I was not impressed. The broth was so bland tasting, I was ","useful":0,"cool":0},"hr9O_5sksPT8d4_uzEfQwQ":{"text":"Decent food, but don't order carry-out...\n\n2/2 times that I have ordered food from this re","useful":2,"cool":0},"KDHRze1VIM2_JDjlGas5Tw":{"text":"The food was tasty if not exactly what we were looking for. If you want a modern take on V","useful":1,"cool":1},"0hmNm5PKp0YesncGePcTwA":{"text":"Not only does MoPho have a great relaxed atmosphere, the food is awesome. We had the chick","useful":0,"cool":0},"O8TJZfnhMCggMTOPgMRADg":{"text":"Great restaurant.  Food was yummy.   The server was friendly and helpful.   Nice outdoor c","useful":0,"cool":0},"0Bb4N0saYMa0VuG1E6SM5Q":{"text":"Was chatting with Jacque and Brandt at Coutelier on Oak Street and they raved about this p","useful":1,"cool":1},"Nw6fPC_MzqpfcrmOVxscyw":{"text":"I'm definitely coming back. Great food indeed. Awesome appetizer. Make sure to get the win","useful":1,"cool":0},"qqqBAvxq1fYBBwudFPDRUw":{"text":"Not a single aspect of the restaurant that you can complain about. Drinks are amazing and ","useful":0,"cool":0},"zwOQL-mPEuSNjd7J7xUA3w":{"text":"Below average food, friendly but slow service.  \nOnly food item I recommend is the Crispy ","useful":3,"cool":1},"DasOkcr6t--v-yWctNU0sQ":{"text":"Super tasty food and good service! It isn't traditional Vietnamese, but has wonderful flav","useful":0,"cool":0},"GskQteBWEPzSgnQwJCVaXA":{"text":"This was an adventure!  We were craving pho and found this place based on high reviews.  T","useful":2,"cool":2},"N6O1i3dWDLGO9ScQuPJ6Sg":{"text":"Had another amazing meal at MOPHO last Saturday.  The quality of the food and the service ","useful":6,"cool":6},"AqKqD_1l_9uYBrqd8vKiQA":{"text":"Was really disappointed in our visit today as MoPho has been one of our go to favorites fo","useful":0,"cool":0},"e4e4vpyS-JS__DZAGdr5OQ":{"text":"Atmosphere was serene and outdoor seating during nighttime is attractive. Wine listings mo","useful":0,"cool":0},"tFkbvalYwriZAApmJQDwmw":{"text":"My sister and I were ecstatic to try this place out. The photos from instagram was mouthwa","useful":2,"cool":0},"rEfAHn9Kb1Ch08jwYLeYig":{"text":"Do not sleep on this place! The wings are HEAVEN and everyone will tell you that! But my t","useful":0,"cool":0},"3Xq21HAJDtaqt8Qr7xFRHw":{"text":"I think Mopho is one of the best places in New Orleans. It is delicious and reasonably pri","useful":0,"cool":0},"tLBubR-uaJk0-LL5X5V8xw":{"text":"Really unique and interesting dishes. The staff is super kind and attentive. We had the sh","useful":0,"cool":0},"_iVr5KDCSjxyMkOOVLZ5lw":{"text":"Pimms drink good and refreshing the Chicken Vindaloo bites and hangover pho was absolutely","useful":0,"cool":0},"EdQkFVi7N3sSeW-6pgyD2w":{"text":"Great service, perhaps we chose the wrong items on the menu. Bf's sweet potato and brussel","useful":4,"cool":0},"N6t11TVhX0kZitM8zHbihw":{"text":"The chicken wings were pretty good. \n\nI came in a little sick so I can't say that I was in","useful":0,"cool":0},"GJ9r7bNeZyKcwr3g8UNIVw":{"text":"Was looking forward to my first NOLA meal out and was pretty disappointed with the 2 dishe","useful":0,"cool":0},"3iZ87Fr-C88st2udSrj-rw":{"text":"One of my favorite restaurants in New Orleans. My favorite menu item is the Asian chicken ","useful":0,"cool":1},"Yr6yXtApy48-R-yM5ZVvZA":{"text":"Vietnamese with a twist.  Outstanding wings, spring rolls,and crepe. Highly recommended.","useful":0,"cool":0},"rnxClso8uJsISnyOGD22_g":{"text":"Ate here this evening for the first time this year. Still amazing food but more than that,","useful":1,"cool":0},"N3WJDxW4X0Mci3x-QMBU4A":{"text":"After a rough transition into covid procedures they've got all the kinks out and are reall","useful":1,"cool":0},"JKICdzvrrXhV91d7RPPdkg":{"text":"Fast friendly service with delicious pho.  This is my go to place for creative pho.  The v","useful":1,"cool":0},"22NfIsrldtur43x-7nXK0A":{"text":"Had a delicious dinner at Mopho.  Cocktails were inventive and well-constructed.  I partic","useful":0,"cool":0},"BFpwLrqwzkav76vw4zXo5Q":{"text":"Caleb was awesome. (He brought us all the food we ordered!) He also never let the water gl","useful":0,"cool":0},"fSwebUrBxOoSs3SF19LxoQ":{"text":"Service was slow and lackluster. The menu makes the food sound interesting and well season","useful":0,"cool":0},"_D_CkF3kfHB17Egua6zq4A":{"text":"The food is amazing! Vietnamese with New Orleans style. Service was excellent. Our waiter ","useful":0,"cool":0},"zcF2iMavZ3zY4nSzSH8bHg":{"text":"Really great restaurant! It has indoor and outdoor seating and while most of the menu is V","useful":1,"cool":1},"K_wuRAHFkI-cGewGRzLMJg":{"text":"My first stop on my first trip to NOLA, and it did not disappoint! I like the different ta","useful":1,"cool":1},"VKZaUmNbpMa87migeGRRpg":{"text":"Excellent food and service. The wings with the signature caramel sauce were out of this wo","useful":0,"cool":0},"pvtArJiPjEtR65IR_xWHAg":{"text":"COVID-safe! Fantastic modern New Orleans and Vietnamese fusion that is just delicious! The","useful":1,"cool":1},"YIur0op1RKz_cMSczynKZQ":{"text":"I have now visited twice ~~ first visit my friend and I shared the wings, I had a Ginny fr","useful":0,"cool":1},"mFoAHZQcz_ycq7Hia4Q-Ew":{"text":"I went for a walk in a City Park with a friend, and after our super long walk we both real","useful":7,"cool":1},"rVSCsqNz0ig90NEjF4vT5Q":{"text":"Coming into this place, I thought it was just going to be a place with subpar pho and lots","useful":1,"cool":1},"idMYMP-IAHdf6V7mSl0vnQ":{"text":"I was excited to visit MoPho due to a Facebook post they'd made advertising a new sandwich","useful":3,"cool":0},"mLtN6t0OkNWdvEv1LRvKqg":{"text":"Huge shout of for AMAZING food and service. THANK YOU to Marianne, the GM, for your kind, ","useful":0,"cool":0},"Kwt7QPJ61gUIa7OAVWDWQw":{"text":"My experience here was mixed, recommended by a tour guide for Viet creole fusion...it was ","useful":1,"cool":0},"lEae0LSjuKG7BiKrBLYsvA":{"text":"Happy Father's Day!!\n\nWe had Crispy chicken drumsticks with caramel sauce \nPo mi sandwich ","useful":0,"cool":0},"qhD-sWljxQBHZRyWIBV2hQ":{"text":"as vietnamese americans, my family and i were very interested in this dining concept. the ","useful":0,"cool":0},"ZsNq8Gl-uY04f9DQta8EOg":{"text":"One of the best meals I've had in a very long time. The Pho Broth is next level (I had bee","useful":0,"cool":0},"jZu45V9tpjMvljuBhk4Wpg":{"text":"I am SO glad I tried Mopho for the first time because I can already tell this will be one ","useful":12,"cool":10},"JeVZwSLbuPoNPaUwv0guEA":{"text":"We ordered takeout and it was an exceptionally quick turnaround for food that was quite de","useful":1,"cool":1},"5xdUTI3bXpfEwdtly0c-0A":{"text":"Dine in early evening on a Saturday. It was slow and so was their service. But the server ","useful":1,"cool":1},"l-wGxPb-V3jfBUhQpIPzWg":{"text":"Mo Pho? What did you just call me?! On the outskirts of this busy town is a unique fusion ","useful":1,"cool":0},"4gpNlxm5hOXlRF0k45ZyKw":{"text":"After eating poboys, rice and beans, oysters, that nola cuisine we wanted to switch it up.","useful":0,"cool":0},"Ob6lY39d3WvLg5Xe3VeHuA":{"text":"Mopho is the best Asian fusion restaurant I've ever had the pleasure of dining at. The fri","useful":1,"cool":1},"p-6kVeOqQVsZVL1G94ykTQ":{"text":"The slow roast in green curry is nothing short of delightful. There is nothing to compare ","useful":10,"cool":5},"rpi8fNJDQ99M8GJDqlxejw":{"text":"$20 LUNCH IF I DRINK WATER & HAVE BAD SERVICE\nNew Orleanians are used to moderately-priced","useful":9,"cool":2},"5j-bPdovqjrkywhLFdA6Mw":{"text":"Their wings...oh man!  The crispy oysters...yum!  Went on Swine Saturday for a plate of po","useful":2,"cool":0},"5MmKDYRB7Vcmf5jZNcZ6Uw":{"text":"A little late posting this, but I have to say I'm SHOCKED MoPho was voted best new restaur","useful":2,"cool":2},"cgjzVXm-ziX_sugt6ZLXuA":{"text":"MoPho\n\n       My work place is not too far from City Park, so I enjoy trying those hidden ","useful":3,"cool":2},"2hdIRzi3jNRoVA2sPJ7now":{"text":"Very disappointed.  Second time chicken wings have not lived up to prior visits to MoPho. ","useful":0,"cool":0},"OrUKaGSRF_xNtbZfh1mwAA":{"text":"The food here is fantastic!  A bit off the beaten path but well worth the effort to get th","useful":0,"cool":0},"khRZBTGqbYkNIb6VnrFfPQ":{"text":"After many posts about the lengths they're going to for Covid-19 safety I was looking forw","useful":1,"cool":0},"0gCvDXvj4hYWAmjGQKcf0w":{"text":"I didn't know it can be so bad. The meat in the beef pho is tough, and the meatballs taste","useful":1,"cool":0},"nHERKDxusQP0ecLX6xnfzQ":{"text":"First timer, loved it! All except the drinks.. could do without the bubble tea.    Cucumbe","useful":1,"cool":1},"CICB9ahYdYhnVE4kpAQ30A":{"text":"I've eaten at Mopho quite a few times but this last time was a whole different experience.","useful":2,"cool":3},"HjeBuFbi_FoGUFcmp78Phw":{"text":"We love the \"inspired\" takes on pho.  The broths are really deep & rich, the meats are gri","useful":0,"cool":0},"laW0xky17C0_ldZlqPa3qQ":{"text":"This? Wasn't good? The food didn't really have flavor and nothing made any sense. Also, wh","useful":1,"cool":0},"V2KyfIqfK6kms7U8RIY12g":{"text":"Interesting fusion food served, some worked while other dishes were so-so. The service was","useful":0,"cool":0},"bkETPJThEhJigoKl-6uFCA":{"text":"Really, really good.\n\nThe couchon de lait on Saturday is crazy good.  You can get it as a ","useful":3,"cool":0},"nUlh6XWMsL1CJfOgg3Iszw":{"text":"A lot of my friends had hyped up Mopho as the best spot for pho but I must say I was a lit","useful":0,"cool":0},"n7y2TZT3Xq9LNDO0JIGuAw":{"text":"This restaurant was pretty good. Very safe w COVID, and the service was fast and helpful. ","useful":0,"cool":0},"GYLLea13MFDA4Ub7ZuUmIA":{"text":"I was a bit hesitant when I met a big group and this new hotspot since I knew they had a f","useful":9,"cool":4},"5i3zvHskzC6ZA74cX4XyZg":{"text":"MoPho exceeded my expectations! One of my favorite restaurants in New Orleans. I had been ","useful":3,"cool":1},"80J6Wz4y6zHyEKneanRLnQ":{"text":"I was excited to try this place. But, i learned that perhaps i don't want to dive too deep","useful":1,"cool":1},"4i5bJzY6i2D0fzANXnJDSg":{"text":"Service was good but the food was okay. We started off with Crispy Green Beans and Chicken","useful":1,"cool":0},"guIfX8KJA7sHjtw2zvRglg":{"text":"Had the vindaloo wings they were good not the best sauce but not the worst wish it was mor","useful":0,"cool":0},"tzPUvg_D8YxiJzMuWq-37Q":{"text":"Loved their Crackling Pork Bowl. The spicy glaze was spectacular on top of the perfectly c","useful":0,"cool":0},"pP63BdgiIz5YCDRvpZI53w":{"text":"What do you do when you're in New Orleans for the weekend, nearing the end of your trip, t","useful":4,"cool":5},"UqS_Vev7HkRHISmEPazo5Q":{"text":"The pork belly bowl is mostly pork shoulder. Very bland and unbalanced. Overrated food.","useful":0,"cool":0},"29cScLontfElVRj6X7KdPA":{"text":"I was excited to try MoPho after hearing that it offered Viet Cajun cuisine, but I was sli","useful":0,"cool":0},"NmZlxteyaOfnO8KSXsArdQ":{"text":"Lunch at Mopho was great, and the service was too.  Love a waiter who knows the menu, and ","useful":0,"cool":0},"M3JA_RTi3e0bCK2_seN_QQ":{"text":"After hearing many rave and great reviews, we decided it was time for a try.\n\nWe began our","useful":2,"cool":1},"UhuC5Bh8As9klUyF2s9aQw":{"text":"I had the meat combo pho and the quality was amazing. I highly recommend adding the tripe.","useful":1,"cool":1},"vlGX0MFmFFC6DeNeOOE_Nw":{"text":"I took a few friends who were in town to MOPHO recently.  All of us are foodies and we tra","useful":0,"cool":0},"q4aRDr-MA38PZhFPK4s5aA":{"text":"Mopho is the mofo. Mo fo your dining dollar with different delectable dishes dude. \n\nFor t","useful":2,"cool":1},"yBCIHCxqPzQEdyFcSV9mxg":{"text":"We almost didn't stop here while in New Orleans, but I'm so glad we did! It was some of th","useful":0,"cool":0},"znBKXA4fuisAZ3YYyK4ioQ":{"text":"We visited on a weeknight and it was fairly busy. We sat on the back patio which does have","useful":0,"cool":0},"SchfwYQmeGLEhLNqkKttkw":{"text":"The food was excellent....don't miss the chicken wings...the whole fish was transformation","useful":0,"cool":0},"OrH5qLupYTJPH1GjlRpTfA":{"text":"Mopho was an ambitious fusion between southeast Asian cuisine and New Orleans products and","useful":0,"cool":0},"rys09RCCT_REytgL4qdDDw":{"text":"I get the lamb with the green curry each time. This last visit I tried the wings and a shr","useful":1,"cool":1},"gB-RSVXlEBGcykZY51_wcQ":{"text":"Came here 4 years ago for the fried oysters. They were excellent, they no longer carry the","useful":0,"cool":0},"g1MtyeCVYMdgPAkzZEkRkg":{"text":"we had several dishes\nspring rolls: fresh, good acidity for the filling, amazing peanut sa","useful":0,"cool":0},"PkHx_2sMxvQoUJkBUquq3A":{"text":"I've eaten at every Vietnamese restaurant in New Orleans and this is by far the BEST  pho ","useful":0,"cool":0},"pP71BkUgOfYoSkEJKwBxYA":{"text":"Excellence. Start with the roasted Brussels sprouts, as well as the crispy chicken wings. ","useful":0,"cool":0},"CWXYG2OFur2zDvCejeflhA":{"text":"My friend and I stopped at this place to eat something new. She's been here before, but I ","useful":1,"cool":0},"RUxWA0CbcuKkMfOqQSCSug":{"text":"This restaurant has very good food, an inventive menu and good service. I tried the green ","useful":5,"cool":4},"BDcfIZGQorP_-mMr1SL4XA":{"text":"Omg go on Wednesday and get the ramen special. STUNNING. AMAZING. *chef's kiss* add the ch","useful":0,"cool":0},"t3r37rtHgehKGhA8StU-9g":{"text":"Holy MOPHO this was a great meal!! A friend and I came here impromptu because we were in t","useful":1,"cool":0},"o6igjvmaKFq_SGH3rxsnQg":{"text":"This American twist on Phở or pho is a Vietnamese soup dish consisting of broth, rice nood","useful":0,"cool":0},"RoIuEG6aiLYW8jCeuiRTew":{"text":"Mopho truly is a little tucked away treasure! You may see Burger King, Subway, and a snowb","useful":1,"cool":1},"9VPnJ51x0dceISQDhHvA8w":{"text":"PHOmazing whilst not curry!  For Tee!  Yes!  And Bobo T made the three so keep it real.  E","useful":0,"cool":0},"UGYHdqzLrUX_ZzGztgvZTw":{"text":"The service was exceptional. While there, I tried the chicken bites which were decadent an","useful":0,"cool":0},"GFZ4TmMPi-6SJNxZ1ONTSw":{"text":"So normally I would give this place 3 stars bc I normally don't like \"fusion\" places. But ","useful":7,"cool":6},"igrA--0r3WtH2Qu1lFiwfA":{"text":"Good spot to grab a bite. Not your typical or traditional pho spot so don't come here with","useful":2,"cool":1},"_fMpPtrdsmiNU_1Lk39F9w":{"text":"Typically eat Downtown or Midcity. Took streetcar here. Great vibe, drinks and eclectic fo","useful":0,"cool":0},"D7nqG67z0PUjI0_REa8eMg":{"text":"My friend and I decided to have dinner at Mopho and I was so excited because I've been dyi","useful":3,"cool":0},"0XsDD-tAwWd53f9wAIqH4w":{"text":"If you're looking for an asian restaurant, this isn't true asian, it's very fusion.  It la","useful":2,"cool":1},"90Gb9rKNvh6GguU0P6RBdg":{"text":"We had the crispy chicken wings, fried shrimp spring rolls, and the fried crispy green bea","useful":0,"cool":0},"zVJBohK3-RMeI7f2r5-5QA":{"text":"What a ripoff this place is. My friend and I just ordered two bowls of chicken pho to go. ","useful":0,"cool":0},"1l8qbtQTO4Fyq08SvrT49A":{"text":"Believe the hype! Not traditional Pho, but very good! The chicken legs are awesome. The po","useful":0,"cool":0},"tG6N_z90xe5lBE8QqhUPcw":{"text":"I messaged mopho on yelp and also sent them an email after they got my last order take out","useful":1,"cool":0},"1job18hHqSvBPeomeA_enA":{"text":"My partner and I flew into New Orleans last week, a day after our three year anniversary. ","useful":0,"cool":0},"U5RukdI5Z2bQkSXWWdmoVw":{"text":"I'm not always sure what \"fusion\" means, restaurant-wise, but Mopho gives me a good idea. ","useful":1,"cool":1},"BxB10ghF_69MDvy4DVEFMQ":{"text":"Vietnamese is one of my favorite cuisines but MoPho has definitely made the cut for my top","useful":0,"cool":1},"fbRZA2JzA0QHiXRY2Dogmw":{"text":"I was craving banh mi one night, but one of our favorite spots for some reason didn't offe","useful":0,"cool":0},"wrtcruCbvjnR-TZj-LPzdQ":{"text":"I normally am a big Mopho fan but my most recent visit here was not the best. \n\nLet me sta","useful":1,"cool":1},"XHUBD2o8zPvwXmP80yijfQ":{"text":"The service was good, but the food was very underwhelming. I had the tofu sandwich which w","useful":0,"cool":0},"x4XwjDnXssne-DKy_kyW5g":{"text":"Awesome awesome awesome! Every time we eat here, lunch or dinner, it's truly spectacular. ","useful":2,"cool":1},"8Q8XeetWh7VJbSAAuclXWw":{"text":"This is a casual Asian-fusion restaurant that pairs it's Vietnamese cuisine with hints of ","useful":13,"cool":10},"erTPxPLxiguUbwlBudP-mw":{"text":"This place is interesting, cool atmosphere. Drinks are great but for the pho if you are a ","useful":1,"cool":1}}