{"kSLE3hvDvPT5A8Nc_foDyg":{"text":"My friends and I did the ghost walking tour with Terri (think that was her name), she was ","useful":0,"cool":0},"TLRXvbhIY4Ecew8FF4g22A":{"text":"My wife and I took 5 tours in New Orleans last weekend and all of them were excellent!  Th","useful":0,"cool":0},"_J23vTiYV6RJmLAQqvargw":{"text":"My daughter and I did the ghost tour while visiting. Yawn. Probably the most boring tour w","useful":0,"cool":0},"HHJb35F9aYLEd3eCcfdY3g":{"text":"My boyfriend and I went on the VooDoo tour with James and thoroughly enjoyed ourselves. Yo","useful":0,"cool":0},"7TfwGZ_n7qVG7s4-QojU-g":{"text":"We did the voodoo tour with Robi and he was AWESOME! So interactive and we were lucky enou","useful":0,"cool":0},"EPa6OPfe7QbrERtQAaV4wQ":{"text":"I did two of these tours; Garden district and French Quarter. Each one was very interestin","useful":0,"cool":0},"6aXMB62HYOA9w9ZU02kCGA":{"text":"I went on two tours while here..the St. Louis Cemetery and the garden district tour.\nThe S","useful":0,"cool":0},"g_RqugrLSif8haPaTgP-Dw":{"text":"The reviews do not lie, this company is superb! I participated in the French Quarter tour ","useful":0,"cool":0},"0pLICsVB7ztuj1Mk1An1og":{"text":"These tours are great as you receive a historical perspective from natives of the city. Ou","useful":0,"cool":0},"ZdKjAlXHKrSNOfnqGIzfvw":{"text":"My husband and I did 3 different tours with Free by Foot while staying in New Orleans. I l","useful":0,"cool":0},"MDEsKz-yqCvSEwkH0h2Q1Q":{"text":"Spent an enjoyable two hours on the Culinary Tour with Kayla! Exactly what we wanted from ","useful":0,"cool":0},"eGgr7n11VcRgSZJ_0jMevw":{"text":"Did the St. Louis cemetery tour with Kathy. Meet in front of Deja Vu restaurant in the Fre","useful":0,"cool":1},"C-1H6rEqn_jOJP9_dN621w":{"text":"I went on two tours--Joanne's tour of the French Quarter and Sarah's tour of the Garden Di","useful":1,"cool":0},"3GB9IdLGzQ5tU3N5TldEsw":{"text":"We did the ghost tour with Kyle and really enjoyed it! He was a great guide and I should h","useful":0,"cool":0},"ruu4v0mt3bqaDruWpWM7BQ":{"text":"Awesome Tour of the FQ!\n\nThank you so much Free Tours by Foot for the wonderful day tour o","useful":0,"cool":0},"OIgcLVvogg0vaXNA9RbTLA":{"text":"We took several of the tours offered by the company, and it's true: you pay what you want!","useful":3,"cool":0},"pzWWSsJSXmp0N7gtKMjukg":{"text":"I recently visited NOLA for a weekend conference. On my one day off, I took the voodoo tou","useful":0,"cool":0},"Hac3cwx84roYFp1Rrh0xnQ":{"text":"Took the garden and cemetery to our with Denver!! He was awesome! Wish we had time to take","useful":2,"cool":1},"a72qmfuu0pPi83SQpaqhCw":{"text":"Amazing tours and tour guides. My husband and I took the cemetery tour and garden district","useful":0,"cool":0},"tuk_QcEAj86o1vffQTRfxw":{"text":"Amazing tour. Highly recommended. Ask for Denver. He is amazing. Makes the tour very inter","useful":1,"cool":1},"UQHmuYDMKPb-4gpqRsDDcQ":{"text":"We are visiting New Orleans on a very tiny budget and this was definitely one of our favor","useful":0,"cool":0},"S5-8wthRMy_LkvLvvYEgbQ":{"text":"When I visit a new city, I love taking a walking tour early on because I find it always in","useful":0,"cool":0},"vLGVfYBo7Z5m2LEBxoy5-Q":{"text":"A third \"free tour by foot\"!  This time to the Garden District and Lafayette Cemetery with","useful":2,"cool":0},"JWcPFvwLepF3TfgE3Ly7Cg":{"text":"Very informative and a lot of fun!\nRobi was great, he brings to the group detailed history","useful":0,"cool":0},"KrZDMtjwq-4t3zvheT3Lgw":{"text":"My friend and I went on the ghost tour with Teri as our tour guide. She was very knowledge","useful":0,"cool":1},"T3OSJvO36zyBjfKTkSvOSw":{"text":"We did the Garden District tour starting at the Lafayette cemetery today.\n\nOur guide, Sara","useful":1,"cool":0},"N-Ph-8UnhbGuMFvJe3di2w":{"text":"Just finished our tour of the Garden District with Kyle Potter best tour guide EVER!!!. Ve","useful":0,"cool":0},"JQJMsVm0O1Qo2pOZNc3Alg":{"text":"This tour company was great. We took the French quarter tour with Ryan and he was knowledg","useful":1,"cool":0},"nSzneQkdQ3WtIMsSDS7Q3g":{"text":"We booked a private tour of Lafayette Cemetery and the Garden district for 15 people which","useful":0,"cool":0},"jyvKmigAkuf1CZFXF4j-Sw":{"text":"This is a review about the VooDoo tour- \n\nMy boyfriend and I went on this tour yesterday m","useful":0,"cool":0},"G8HvTBspnPPhAX_xeaZHGA":{"text":"Elizabeth V was great! We did the cemetery #1 tour and get provided fun facts and helps ti","useful":0,"cool":0},"YoyspdJiQ55L6devcrRAWA":{"text":"Such a great service provided we did the French Quarter tour today and plan on doing a few","useful":0,"cool":0},"CjVNJJennFL6DEALMz9RJA":{"text":"Love this tour company. Moral is so high for their tour guides, they are always the nicest","useful":1,"cool":0},"sIIjvdb-hLhWV6APPytuCA":{"text":"Had a great tour of St.Louis #1 lead by Elizabeth. She was very knowledgeable of the histo","useful":0,"cool":0},"plQZ61RuI74yN0Qa3zEwKg":{"text":"Took a tour of the St. Louis Cemetery #1 with Kathy. It was a phenomenal tour!  She was in","useful":0,"cool":0},"OkktKNTvcwcpfjfm_Tp4tw":{"text":"Great tour of the NOLA Garden District and Lafayette Cemetery. Very professional despite n","useful":0,"cool":0},"_cP-NW4lbXlNck5JNKkfDA":{"text":"2 Great tours, first was 7:30pm July 5 ghost tour with Alec. He was a great guide, engagin","useful":0,"cool":0},"S5kFU-8PVzaH8kYCYmSP1w":{"text":"Terry was our tour guide of the cemetery. What a knowledgeable wonderful guide! She had a ","useful":0,"cool":0},"vLn5-VYGwfpPxwKT5MS7FA":{"text":"I took a ghost tour with Teri Elaine my first night in NOLA, what a great way to start my ","useful":0,"cool":0},"C1pp7nFAbO8y3ePnmXooUw":{"text":"This is a cool tour. It's advertised as 2 hours long but our guide shortened it due to the","useful":26,"cool":21},"Ls7yp4HGTtRcavpTu9jvTg":{"text":"This was my second trip to New Orleans and my second voodoo tour with Free Tours by foot. ","useful":0,"cool":0},"mzPcVonNMiPd7T1DgGmsBw":{"text":"David's New Orleans Culinary Tour was nothing short of fantastic. I HIGHLY RECOMMEND you d","useful":2,"cool":0},"mnWmjCw5pJThNkJC1vkirQ":{"text":"Fantastic tour, great way to learn a lot about the city! My boyfriend had done a walking t","useful":0,"cool":0},"qcealzD3yRg6T_21cB672w":{"text":"Garden District tour, New Orleans\n\nDenver, our guide, was awesome! He has so much knowledg","useful":1,"cool":1},"rdSaw0hP-Lwm1E-QV4YYbA":{"text":"Great tour around the French Quarter. Our tour was led by Kathy and she is very knowledgea","useful":0,"cool":0},"SMTozZXN7EnK2UuiLR8r_g":{"text":"Our French Quarter Ghost Tour with Sandy was great. She is very knowledgeable and funny.","useful":0,"cool":0},"p1OAqMEaTmwpTPnZ3l4D0A":{"text":"As a first time visitor to New Orleans, I highly recommend the French Quarter tour with Jo","useful":1,"cool":0},"U5L-T0ufeU8bZVmvrjVPiw":{"text":"Went to New Orleans for the last thanksgiving and the free tours by foot was a true findin","useful":0,"cool":0},"pK2tWo_vZ_KezneFVAEAdg":{"text":"My friends and I came to New Orleans on a whim and decided to go on the French Quarter Gho","useful":0,"cool":0},"1RkgXy9n3B2gVDTrTICQyw":{"text":"The tour was pleasant. My 12 year old son enjoyed it very much. Stacy kept it nice and cle","useful":0,"cool":0},"mlGnQDjexsT176tpv9TtdA":{"text":"We liked our first tour of the French Quarter with Andrew so much that we booked two more ","useful":0,"cool":0},"eazUp_3Rq_JzUGAp46k1BA":{"text":"Had a great tour with Elizabeth in the Garden District. Loved the in depth history and fun","useful":1,"cool":0},"nDt03QQFITptdpNxicBwOA":{"text":"Excellent walking tour of the French quarter led by James!  No doubt, this knowledgeable a","useful":0,"cool":0},"TjBF3bP6_NYNQeEiMDeEOw":{"text":"Took this tour last evening. Our guide Stacy was animated, friendly and very knowledgeable","useful":0,"cool":0},"NxeojpQ-_v4ERyAuNmvo5g":{"text":"The best walking I've been to. Besides being incredibly knowledgable, our guide was gifted","useful":0,"cool":0},"fEqg_3Zx_UIxjrayO_YM1Q":{"text":"The Voodoo tour was great. Very entertaining and informative. Toni is very passionate abou","useful":0,"cool":0},"Ou3fUXw8CvedgFvgfuXggw":{"text":"As a former tour guide, my standards for tours are very high and it is not often that I en","useful":5,"cool":3},"0yiO3e_LTFUQwDNXVEhAzQ":{"text":"We had our tour with KYLE. Kyle is the bees knees. Very knowledgeable dude, made the tour ","useful":0,"cool":0},"VPiyo1CRNKv5hJt5u-L2Bg":{"text":"My friend and I are visiting and went on the Ghost Tour. Our guide was Sandy and she was a","useful":0,"cool":0},"8SK7d0oa-RtW8X8A5vtJkA":{"text":"We used this company to tour the French Quarter and the Garden District. Both tour guides ","useful":0,"cool":0},"h2e0aq3I4WuM30aqhJC8dQ":{"text":"We did 2 tours on a recent weekend in New Orleans: the 10am Voodoo tour on Friday and the ","useful":0,"cool":0},"RnRi7u4VX9IGwVEoneK32g":{"text":"I took the Ghost Tour on my first night in New Orleans, it was freezing cold but 12 people","useful":1,"cool":0},"Dnv9Drd1100Zm5ucSZHGrA":{"text":"Our tour guide Renee was wonderful on the NOLA Garden District tour.  She had a very good ","useful":0,"cool":0},"MWGPQgRYkin_Z0ilR3OfKw":{"text":"Really enjoyed my Ghost Tour with Stacy! She knows her stuff and is very entertaining. I l","useful":0,"cool":0},"S-mDbGEBpv19JXDYmozujQ":{"text":"Awesome....we did the French Quarter, Garden District, Ghost and Voodoo...one a day! We lo","useful":0,"cool":0},"Ih2IZNSCsUO5lSsPokwCow":{"text":"Kayla led the Culinary History Tour, which was wonderful.  She is very engaging and knowle","useful":0,"cool":0},"5h-R2j05wg_2K607-q_hcw":{"text":"Nat was an awesome tour guide! She told us interersting facts about all of the locations o","useful":4,"cool":1},"CDLDBmMz7MJWK3dSxFilQA":{"text":"Our group did the French Quarter tour with our guide, Joanne, and had a great time. I only","useful":1,"cool":0},"W4PG3YwdFf4qeLEbNkmzFg":{"text":"Excellent tours with both Denver (Garden District/Lafayette Cemetary) and Stacey (Ghost to","useful":0,"cool":0},"DH_kOxb8J9TmlWG9d-B6ug":{"text":"I love the idea of \"Pay what you wish\" walking tours as it is a great way to see a new cit","useful":0,"cool":0},"iqOrJU6KIDliqgWtiN4ZfQ":{"text":"Did the Garden District/Lafayette Cemetery with Renee Whitecloud and the tour was great! B","useful":0,"cool":0},"4fsAXS5K-oa3HiU7hZ0bBA":{"text":"Went on the Treme tour. Our tour guide was Sandy Hester..it was not only informative, but ","useful":0,"cool":0},"yE9c0gS38BRP4Aawfzlw1Q":{"text":"Had an awesome tour with Stacey last night! Super informative and interesting. Not cheesy ","useful":0,"cool":0},"euZwr4NuQdAj0HlWk9x9qA":{"text":"Great tours for free! You cant beat that. Other places charge you about $25 per person per","useful":2,"cool":1},"uOWqhJ5QbnMcmZHOerFpqA":{"text":"We took the ghost tour with Stacy. It was great walking around with French Quarter with so","useful":0,"cool":0},"1ZQyLUvJ4CsECrR9oFg-Sw":{"text":"DO IT! Go with these guys. They know what they are doing. \n\nYou HAVE TO book online. \n\nI l","useful":0,"cool":0},"6iwc6maHINiHj43Q1BdbUw":{"text":"i did the garden district walking tour with sarah, and it was AMAZING!  sarah was a wealth","useful":1,"cool":0},"be40XxjoBcHyklh1crOxOQ":{"text":"We did the Garden District and Lafayette Cemetery tour and it was so interesting and infor","useful":0,"cool":0},"ISYaKvbJ9Xd_52PE1Ru0EQ":{"text":"I went on five different tours with this company when I went to New Orleans: lower garden ","useful":2,"cool":1},"Sgl0hwKs1CBHB9kuSWsF3w":{"text":"I went on the Cemetery/Garden District tour and it was a fantastic tour. Sarah covered a l","useful":0,"cool":0},"VFmkjZK4am5hTkzAGPYQuA":{"text":"Amazing experience. Up and close with the historic places in New Orleans' French Quarter. ","useful":0,"cool":0},"Z1qaHCpNgHnBPPTERAVFsw":{"text":"We did the ghost tour with James as our guide and got more than we expected!  The tour was","useful":0,"cool":0},"ohUT8n5FNtV6z_9CKkDasw":{"text":"Elizabeth was great on the St. Louis #1 cemetery tour - she really knew the history and en","useful":1,"cool":0},"bclC8jfuwgzAqsFEpAHibA":{"text":"I used Free Tours by Foot for all of the tours that I went on in New Orleans. Every tour g","useful":1,"cool":1},"hHQBFGnQLqOL8xllw4ZL-Q":{"text":"We took two tours from Free Tours by Foot and both were excellent. Sara led a fabulous tou","useful":0,"cool":0},"ZvNXh1nV6cNQNxQ0dnZaww":{"text":"We're so glad we signed up for this Garden District Tour. Our guide was Kat and she was te","useful":0,"cool":0},"dSBaHEuiEEp9S9Oq7qqaIA":{"text":"David's Culinary History Tour is a must do for anyone coming to New Orleans! I give David ","useful":1,"cool":0},"xpS5so5GHAe4_Rja-IgOmg":{"text":"Was blessed to have James as a guide for the ghost tour last night. Although he wears norm","useful":2,"cool":0},"MOQ-7hUjJ1vDTojjrIDIEQ":{"text":"had an awesome time on all 4 tours. We jammed packed our weekend with tours to learn about","useful":4,"cool":2},"LZ4IwY8_-Swi7inZCa2szQ":{"text":"Andrew did our cemetery tour.  He was fantastic.  Was able to answer all our questions (ev","useful":0,"cool":0},"1gYK0UNhHE-6iEL86f6GWA":{"text":"Voodoo tour by Robbie. Best part of my 6 days in New Orleans. Very engaging, inclusive, in","useful":0,"cool":0},"gMt0urdKglPpu-9iWCZLBA":{"text":"Our tour of the French Quarter by Kate was awesome.  She is knowledgeable and funny. The t","useful":0,"cool":0},"hycZylPnNWKndkTnbTMtTg":{"text":"Love Free Tours by Foot!  Libby led us on the 2 hour Sunday morning Garden District tour. ","useful":0,"cool":0},"LahRcccdnaHNfiQdKoXPWA":{"text":"I did two tours by Free Tours by Foot (Ghost Tour and St. Louis Cemetary) and was very ple","useful":0,"cool":0},"iVoyGldwidITv0LBnBqv-Q":{"text":"We had Mikko from Mexico via NOLA via Boston via NOLA via SCarolina.\n\nHe had a good, thoug","useful":2,"cool":1},"u2a9EanQso8DO0ZgFJspGg":{"text":"We did the Garden district tour with Matthew. I highly recommend the tour and him. You sta","useful":0,"cool":0},"1Ts5aosKdSHRTIVBtfQ-Ew":{"text":"Took the Haunted Walking Tour with Mikko. It was outstanding. An honest look at the harrow","useful":1,"cool":0},"za7oD-Srntir3HyGi1KTww":{"text":"We did the garden district/cemetery tour with Renee and the Voodoo tour with Robi. Both to","useful":0,"cool":0},"JWDex8sLCYQ4zLPmr_f7Mg":{"text":"Robi is am amazing tour guide. He is a VODOU high priest so he gives the true history. I e","useful":0,"cool":0},"SUtvwJ7OQOhEThIC2hxyfA":{"text":"Took the St Louis Cemetery #1 tour with Teri yesterday. I hope my words can do her justice","useful":0,"cool":0},"Uma7C0W4XH99YptpdoITvg":{"text":"Went on the French Quarter Food & History Tour with Kayla as the guide. I couldn't believe","useful":3,"cool":1},"Lv9-h2Ey2dAesnFWkaB7Yw":{"text":"I really enjoyed my Tour of Treme today in New Orleans. Our tour guide was Sandy \"with a y","useful":1,"cool":1},"HfiLG7m2bs6_5YAdDlXMWQ":{"text":"Elizabeth Nicholson was our guide for the French Quarter tour.  She was friendly and did a","useful":0,"cool":1},"QLiJhqvJGxbPaJl7h9yPjA":{"text":"Did the St Louis #1 tour with Kathy! She was AMAZEBALLS!! Total encyclopedia of  NOLA know","useful":0,"cool":0},"IRvqfMHEQJ5QwzlMv8xbnA":{"text":"We had so much fun with James on our walking ghost tour! Wasn't sure what to expect, but i","useful":3,"cool":0},"iZg--aQa94574NN5VRH2mQ":{"text":"Excellent walking tour of the garden district. The tour guide was very informative and ent","useful":0,"cool":0},"MsrE42oSwNNSYU7LSEOXuQ":{"text":"Ok just finished the French Quarter tour with Elizabeth. Great guide. She made it fun and ","useful":1,"cool":1},"vlYi_iBz4u0ERqBeWy26xg":{"text":"Following the advice of other reviewers we took the French Quarter Food & History Guide to","useful":1,"cool":0},"sx7lwQCsfvSETEmPSODwbg":{"text":"Don't miss the VooDoo Tour with Robi. Robi invites you into his family for a meaningful ex","useful":0,"cool":0},"7SriyQgBZCLsgvqoQEXlsQ":{"text":"Great tour by Stacey! She was great, easy to understand and amazing at projecting her voic","useful":0,"cool":0},"B8QN7SJ_XO4m-MgC0kXDDg":{"text":"We did the French Quarter tour, our guide was Sandy. \n\nSandy was awesome! Very knowledgeab","useful":1,"cool":0},"mMGXsCDE8LvHoCqxDGYMVA":{"text":"We went on two (Garden District and French Quarter Culinary) tours with Free Tours By Foot","useful":0,"cool":0},"ZX0UWWip7EAoe5fMY9pEWw":{"text":"We did the Louis Cemetery Tour #1 with Elizabeth, and she was great  She kept us in the sh","useful":0,"cool":0},"ac1tF_534XomFdlwLHpE6w":{"text":"I'm so glad I found out about Free Tours By Foot on Yelp. My friend and I decided last min","useful":0,"cool":0},"snU6JYz7Tzq6NzVTOhufYw":{"text":"The Voodoo tour is a must when visiting NOLA. It's the same level quality as something you","useful":0,"cool":0},"xm7IRMssjH1KjhT9J86Eyg":{"text":"The Voodoo tour with James was fabulous! So much history about the practice, with really i","useful":0,"cool":0},"lzjl55ELvfVbfCe9UbeWSw":{"text":"LOVED the tour of the garden district by Sarah. She was so animated and knowledgeable. Des","useful":0,"cool":0},"nIB7uLjDycCfuY2oG1FnBg":{"text":"Our first time in in New Orleans and booked the ghost tour not knowing what to expect. We ","useful":0,"cool":0},"zmepz1T_-BF_nEoQxn6Hvg":{"text":"We did the 9:30 St. Louis #1 cemetery today.  Our tour guide Elizabeth (I can't remember h","useful":0,"cool":0},"RFsJw8FXzoCWNRi1bJVghw":{"text":"Awesome tours! \nTook the Marigny tour with Sean - he is very knowledgeable about the area,","useful":1,"cool":0},"Lv79nQm3vecFLcvXpnPdIg":{"text":"We highly recommend this place for tours!!! We went on three and loved every single one. A","useful":0,"cool":0},"lKbH3pQHbBebZ8Omxrx_EQ":{"text":"I did two tours with these lovely folks because one is not enough! My first one was the ga","useful":4,"cool":0},"eWbOXFmvNh27-n0fj5yAUw":{"text":"We did 2 tours.\nFor the Garden District and Lafayette Cemetery, our tour guide was Scully.","useful":5,"cool":2},"l1LwJq0LG87KC7QQKXgn9A":{"text":"We did the St. Louis Cemetery No. 1 tour with Elizabeth Broussard as our guide and she was","useful":4,"cool":1},"m7AkV2v7arogfW4nUCXg3w":{"text":"We took the Voo Doo tour with Melissa and were pleased. She was knowledgable about the are","useful":0,"cool":0},"OcaD3USllrDfm3svjyxl5w":{"text":"We really enjoyed the French quarter tour, 5 stars. We then took the garden tour. This one","useful":0,"cool":0},"coEAwi7XUyFIlggCV10plg":{"text":"Bobi, was a great tour guide. I have been on a number of yours in NOLA and this was hands ","useful":0,"cool":0},"fXzdQOCdOAEwmxF_rmR5FQ":{"text":"Free Tours by Foot is a great concept because I like that I am paying guides who are indep","useful":3,"cool":0},"v6NgmgDf4F1-GWe45votgg":{"text":"I learned so much. This tour was great and very enjoyable. This is a must do if you have t","useful":0,"cool":0},"NDUMb0NuqIS8VOxsjgU-sw":{"text":"Robi was by far the BEST tour guide ever! The voodoo tour was amazing,! It's crazy how peo","useful":0,"cool":0},"58Eo2wIBccwcK-dbel_xTw":{"text":"Everytime I travel I always book a tour with them. They are amazing!! The guides really kn","useful":1,"cool":0},"QRL_Rs5XiRKZRU5DOYOhfA":{"text":"I enjoyed the tour in New Orleans. I regreted that I did not make the tour on my first day","useful":0,"cool":0},"HyZUz55dfS6l8OvZhT5qQg":{"text":"Stacy lead our ghost tour and she was fantastic. No camp. Just interesting stories with ac","useful":0,"cool":0},"eX5IT3LwLuYMDshNtIiDEg":{"text":"We tried three tours in New Orleans recently. Melissa Vo0doo tour quite good. She's very k","useful":0,"cool":0},"WBFw5abVEgd4in_NpeGOSA":{"text":"It was an unusually cold night in New Orleans, so a walking tour under those conditions co","useful":0,"cool":0},"P044hGTY7SL1LkKsF6fAvg":{"text":"I went on the Ghost Tour of the French Quarter with Kyle and he was amazing! It was a chil","useful":1,"cool":0},"Z7cllh5zxEMvjEk8OL-SQg":{"text":"James McWilliams- Ghost tour was a phenomenal walk. The mn knows his New Orleans. I highly","useful":0,"cool":0},"jKhwCyXcSsvU2v1OrAL5jw":{"text":"Kyle was our tour guide and he was truly amazing! Never a dull moment and never dragging. ","useful":0,"cool":0},"2hegRfbsKNlM3j6AknMpdw":{"text":"David was a great tour guide. We took the culinary French Market tour. We didn't have to t","useful":1,"cool":1},"3W40Pu4fP9AyWRgoxcuI7Q":{"text":"This was the best decision I made while planning my trip to NOLA. We did 4 different tours","useful":8,"cool":2},"42DByr10gOgohRFhm6LC1w":{"text":"Mikko is one of the best tour guides you can ask for. He was passionate and only cared abo","useful":0,"cool":0},"AIW6P5uAkgHGuLKuCGCL4w":{"text":"I have taken several Free Tours By Foot and enjoyed every single one of them. So much so, ","useful":0,"cool":0},"VWWVr8ZoMujtdTYibclulQ":{"text":"Had a incredible tour of the French Quarter by Elizabeth. She was high energy and very ent","useful":1,"cool":0},"oB_wHoGu8Am9VElgErh4JA":{"text":"I've done several tours with this company, here in NOLA, and the best experience was my to","useful":0,"cool":0},"ZTNfvvWZBDRMdhRMa66akg":{"text":"Libby was our awesome guide today for the Garden District tour!  She packed so much great ","useful":0,"cool":0},"XOB3B3LPib60dmRGdYYw2w":{"text":"The free tours by foot tour of the New Orleans Garden District was excellent!  Sarah was o","useful":1,"cool":0},"SiqiLq4yRL_rXU2tLwBePQ":{"text":"I recently returned from a weekend trip to New Orleans and I couldn't have been happier wi","useful":0,"cool":0},"VL9DSCxHbc1pn9Wn6EdnpQ":{"text":"I have used Free Tours by Foot in New York,Chicago and Washington DC. This is a great comp","useful":0,"cool":0},"N-fZvlK003Y7My02_d6xbQ":{"text":"This was my first visit to New Orleans and the tour of the St. Louis cemetery and Garden D","useful":0,"cool":0},"9m-IFnaQRID-0034X9Fi6A":{"text":"Mikko and the Garden District tour was AWESOME! FIVE stars for the tour itself and the gui","useful":0,"cool":0},"0uywDSKnEfGwlQ_L0mOcSw":{"text":"We took the French Quarter tour last week and our tour guide, Matthew was great! He knew s","useful":0,"cool":0},"7ajhZSH1h93h73XjB6nA1g":{"text":"I did the ghost tour with a friend who had done this before and I didn't have high expecta","useful":0,"cool":0},"rTSn77bPVDN7vS2lq4cqVw":{"text":"I've done Free Tours by Foot in other cities and have never been disappointed, but this to","useful":1,"cool":0},"3fAWltm85i8_bV0hSF_TZw":{"text":"Lots of interesting historical information.  Not one of those goofy jump-scare walks.  Ver","useful":0,"cool":0},"JfCJa6TiUN6oHu6Mr_HGGA":{"text":"My son and I had a super duper AWESOME time on the tour. Our tour guide was Libby.\n\nI can'","useful":0,"cool":0},"YHjScjsNh9LTL-dOxeFC0A":{"text":"Sandy was a great tour guide of Treme -- she was great at explaining the history of the ne","useful":0,"cool":0},"I6Utp-HEDKCmdhn5x3ar0w":{"text":"Bottom line first . . . These tours are perfect.   In a couple of hours you get a broad pi","useful":2,"cool":0},"Q6Rb7cLOIv5ANahaRJ373g":{"text":"What a great concept!\n\nWe are retired, want to see the sites in the cities we visit, but c","useful":0,"cool":0},"2jrsX9FR9H6xTnuHy-Umqg":{"text":"I took the Ghost Tour with Andrew and had a great time. It was fun and educational. I wish","useful":0,"cool":0},"OLtUVc7ambJxyxRdyuZzmw":{"text":"The 1st thing you should do when you get to New Orleans! I am confident that I know more t","useful":0,"cool":0},"xJ9XM3LuPItE0cqsu4xl3w":{"text":"Did a tour of the French Quarter with Elizabeth Daniels and she was wonderful! Learned so ","useful":0,"cool":0},"l_XHgck9vcv1-Hw8Mbc8GQ":{"text":"Tour started out great.  The guide was interesting and informative at first.  But about ha","useful":0,"cool":0},"9MyF6viA2W3jJ_jCEO1zsg":{"text":"Fabulous! Learned some fun facts and got a recommendation for the pharmacy tour which we d","useful":0,"cool":0},"xz-bzN9KeqfOa9Pv-kih9A":{"text":"Did a haunted tour with Sandy and she was the best one we've had since we've been here tak","useful":0,"cool":0},"BPpSGMa3cQjf6hSOz1FGFA":{"text":"Melissa did a wonderful job capturing the history of voodoo, not only New Orleans, but the","useful":0,"cool":0},"2JsmcbbKYrEkbaBs11pG6w":{"text":"Garden District tour with Andrew was wonderful.  He is smart and funny and knows how to en","useful":0,"cool":0},"Xaz3s6iBqyltn8rwXuH51A":{"text":"4 of us took a walking tour of the Garden District, and we all loved it. Just long enough ","useful":0,"cool":0},"3CPADW8R19rQ1UifM_rUOA":{"text":"Stacey was awesome today! Fun personality, she's got the ins on the locations, and I learn","useful":0,"cool":0},"UANIde6UF4cFlYadUB8EMg":{"text":"I originally intended to book with Two Chicks because I didn't trust the notion of a free ","useful":0,"cool":0},"9lQURZ58K4DmpwAAHym43Q":{"text":"This review is long overdue as we took our tours back in April but I must say both Andrew ","useful":1,"cool":1},"IKoX7QFxRtfYkNS4THJMPA":{"text":"Our guide for  the French Quarter tour was Kathy and she was amazing! She is a wealth of k","useful":0,"cool":0},"CjKBXlYJXwGQE1I8gX07mQ":{"text":"Great Tour.\nNatalie was fun and gave us a bunch of fun and cool facts about the french qua","useful":0,"cool":0},"5RW1608-smvBNasuAncthA":{"text":"I went on a tour of the French Quarter with a group of 14 guys for a bachelor party and it","useful":0,"cool":0},"1deY4WzzCyyocs4r-sr1Jg":{"text":"My sister and I took a tour of the Garden District. Our tour guide Sarah was awesome. She ","useful":0,"cool":0},"VRvuaCw-wG77ui22W-ZAEA":{"text":"Robi was fantastic! Really enjoyed the history and info that he gave us. The tour was inte","useful":0,"cool":0},"vbJIICbqOI0_MfAsH_E-uw":{"text":"We did a walking voodoo tour with Robi Gilmore today 12/9/17 at 9am. I can not say enough ","useful":0,"cool":0},"tz5Cym7AEuHUKN6FHdZtow":{"text":"Loved it! Sarah was a knowledgeable and enthusiastic tour guide. It was great to learn abo","useful":0,"cool":0},"_qohgVjPZGw9dVvDXh1UuQ":{"text":"Denver was our tour guide and he was awesome! He seemed to really know the history of the ","useful":1,"cool":1},"b4zw8i_ynzRbU9M44FSJQQ":{"text":"Did several tours: St. Louis no. One, garden district and layette cemetery, and the ghost ","useful":0,"cool":0},"U_xQfND1H2EatDDzIcTPDg":{"text":"My husband and I did a walking tour of the French Quarter on Christmas Day with this tour ","useful":0,"cool":0},"QLOCzm4APMGvzpxezl2eQQ":{"text":"We toured St. Louis cemetery no.1 this morning with Elizabeth and had a great time! She wa","useful":0,"cool":0},"vrIoXjF6nBYuOjFF0DEynw":{"text":"Two of my friends and I did the Ghost tour with Elizabeth. For a \"free\" tour, Elizabeth sh","useful":0,"cool":1},"e2Tz673WDeWfw9aSGQ3tWA":{"text":"Great tour! Elizabeth Daniels is a highly  knowledgeable guide and we strongly recommend o","useful":0,"cool":0},"-20YVsbsSZfzbsluHq_nyw":{"text":"Great culinary history tour with David!  Loved that it wasn't a foodie tour per se, but ra","useful":0,"cool":0},"gEpaO8Vjlsd3LxY9NeHCCw":{"text":"Went on the Ghost tour with Andrew through the French Quarter in NOLA. Can't say anything ","useful":0,"cool":0},"FC05Ae28qptwv8BBlrFzCw":{"text":"A great company and the guides really know there stuff.  Can't beat free!","useful":0,"cool":0},"kRK0z1ePPDa5_Rxb_IEKIg":{"text":"Kyle was our tour guide for the ghost tour in New Orleans. He was FANTASTIC! Not only was ","useful":0,"cool":0},"PXchCP8lYVzQuA6QN-lmKQ":{"text":"Elizabeth D. Was simply amazing during the tour today. I've been here 4 times and this was","useful":0,"cool":0},"w6HaE9ZQBNDzduEDy3FjCA":{"text":"I liked the idea of not paying until the end because I feel that the tour guide would then","useful":0,"cool":0},"tiGDIjbOTzg5qT0I_rNW0w":{"text":"James was fantastic! The voodoo tour was interesting and James was enthusiastic and very k","useful":0,"cool":0},"fY0bmuXqq_1tQWrO87m4KA":{"text":"Loved our tour of the Garden District with Scully!! He grew up here and it was so fun to h","useful":2,"cool":1},"jiw9jWTY6MljXg2TZfL7OA":{"text":"If you get a chance to take the Garden District tour with Denver, you're in for a fun time","useful":9,"cool":5},"V8dnNuVYGXwqerlxZp5BYQ":{"text":"We went on a ghost tour last night in NOLA and it was great. Lots of interesting history a","useful":0,"cool":0},"7B9vjdLt9hPPkrB55LLDdQ":{"text":"My friend and I booked by phone for the 8:15pm ghost tour in the French quarter and enjoye","useful":0,"cool":0},"kmNrQQknLEwSEZNEIb4h7w":{"text":"Excellent walking tours. We had a limited amount of time in NOLA and were able to take two","useful":4,"cool":1},"PGt0jZL16HPuoQxWt0_FBA":{"text":"Daniel was a great tour guide for the New Orleans Ghost Tour.  Tons of historical knowledg","useful":0,"cool":0},"D0iP17cdWs4tT_ttfulAuQ":{"text":"On a whim my husband and I booked a Garden District tour yesterday and so glad we did. We ","useful":1,"cool":0},"yJip_Y_3h8MLJDds9jmcYg":{"text":"We had a great tour with Sean of the French quarter. It covers a pretty small walking area","useful":0,"cool":0},"B7ABZkDIE7chgr3lsxjGcg":{"text":"I did the French Quarter Tour with Mikko, and it was informative, interesting, and fun! I ","useful":0,"cool":0},"VRO7qVSCBaPqNauwCAl1Ug":{"text":"Sandy, our tour guide, exceeded our expectations. She was extremely knowledgeable and kept","useful":0,"cool":0},"myBTUZAT9LAcoKgVNYaUJA":{"text":"Wonderful tour! After a wonderful tour of the French Quarter with Elizabeth, I went back f","useful":0,"cool":0},"wqhsMkEj9yoiydYY7FEUnQ":{"text":"We did Sarah's, the owner, tour of the garden district/cemetery and Robi's voodoo tour. Th","useful":0,"cool":0},"Iqf_zA2Yc-UOpEY24zVvyg":{"text":"Excellent!  Just went on a ghost tour with Jonathan, and he was fantastic!  So knowledgabl","useful":0,"cool":0},"NVvnANI0pvWB3wjTelke8g":{"text":"I went with a few friends to the voodoo tour with Robi and totally loved it! He was really","useful":0,"cool":0},"YE_50-FSZynhpt60r9JqfA":{"text":"we booked the STL Cemetery #1 tour online and Kathy was absolutely AMAZING!  \nas a general","useful":2,"cool":0},"cSyV42gXW2FjXvbkZyycEQ":{"text":"Excellent Tour!!  Ryan was very friendly and knowledgable!!\nWe'll defintely try free tours","useful":0,"cool":0},"5wBMO2Jcmbv8v164UekDFw":{"text":"Did the food walking tour in New Orleans. Great mix of history, humor and of course knowle","useful":0,"cool":0},"fn42J1rhbEdfocDQh5SWJA":{"text":"Had a second fabulous tour, this time of the Garden District and cemetery. Well-informed t","useful":3,"cool":0},"3jYTXMSxAjX6ESXse4khVA":{"text":"wonderful, informative, fun. did three tours - cemetery / garden - french quarter - fq foo","useful":2,"cool":0},"8gJ9I4g0skxBBqsKpCAqlg":{"text":"We did the Garden District walking tour. It was great and our guide Andrew was so knowledg","useful":0,"cool":0},"bfbYbgHJQDoI4gT_VqZPRQ":{"text":"Joanne Parkinson was an amazing tour guide. She talked about the town history, gave good t","useful":2,"cool":0},"ds6nSzdpYVHASSfDvRPArQ":{"text":"Robi was amazing! Thoroughly entertaining. He educated us all on true origins of Voodoo. M","useful":0,"cool":0},"TFCz468vml3NusA5eg8qYg":{"text":"We did a cemetery walking tour that was great. Our tour guide Cathy was great. She told us","useful":0,"cool":0},"4OWA9T7b0hUeQd6pCvaypA":{"text":"Teri Elaine was amazing! We went on the St Louis No.1 tour and we learned so much in such ","useful":0,"cool":0},"7ofMtxa3KwyDw_8xMw-s6g":{"text":"This was my first experience at this kind of tour.  It was well worth the price! . Our tou","useful":1,"cool":1},"FqzuWhx3T5W7vxtKp1cEyw":{"text":"Kayla was our French Quarter tour guide and hope you're lucky enough to land in her group ","useful":0,"cool":0},"epkfon8ARDUB3z6lrFroVg":{"text":"My girlfriend and I participated in Robi's voodoo tour.  He was a highly entertaining and ","useful":0,"cool":0},"0_OSHOJQZJQfskBqk-bKAA":{"text":"Our first time there we thought we should start out with a tour to get familiar with every","useful":0,"cool":0},"YCAe8V6aG2xbtspM6DmSQA":{"text":"Just finished our 3rd tour in 3 days - very highly recommended!  These guys are the real d","useful":4,"cool":1},"H4iIYBignqAKp5ynymwljQ":{"text":"I love the idea of a tour where you pay what you think it was worth at the end; such an ac","useful":4,"cool":0},"A2TZGaut-aKHW7-lmY7qMA":{"text":"Took the tour of Treme with Sandy Hester and it was one of the most amazing experiences. I","useful":0,"cool":0},"iCAQGyVP1Yxur3V23zEt7A":{"text":"I wasn't sure what to rate FTBF. The weather was beautiful and the guides were solid. A op","useful":0,"cool":0},"JCJk42V6vAisqJK7pBGZgQ":{"text":"Kyle is an amazing tour guide. He is knowledgeable and seems truly interested in meeting a","useful":0,"cool":0},"KeI85TYJtoCZw-MG7GmwPw":{"text":"Did the French Quarter tour with Nat. Very informative and amusing, never a dull moment li","useful":3,"cool":1},"mRUCcuv-aYhjpGzDmbKkLg":{"text":"My family and I had the pleasure of taking the voodoo tour and ghost tour with Robi! First","useful":2,"cool":0},"bZyGmEAsqvV8t_D2uQJhSA":{"text":"I was really surprised how wonderful this your was. I thought because it was free we would","useful":1,"cool":0},"MkE_3fck6jq2_YaFMSRBCg":{"text":"Went on the garden district walking tour 3/22/15 with a great tour guide, but cannot remem","useful":2,"cool":0},"_ZVH5YTLipqw2mLETGkZnw":{"text":"We went on the cemetery and garden district tour with Kat. The tour was great and informat","useful":1,"cool":0},"beI73g8MOFWIXBTTXWOFmw":{"text":"We had just disembarked 9AM from a cruise to Mexico, and our flight wasn't until 5:30PM. T","useful":0,"cool":0},"g3MnwvqRSysK1kRK2QDh7g":{"text":"Great tour hosted by Sandy. Very informative. The two hour tour seemed as it only lasted 2","useful":0,"cool":0},"I9EJGhKxdsD4lxNNXBA1XQ":{"text":"We did the garden district tour and it was a really great experience. My friends and i wer","useful":0,"cool":0},"cEfRl3TTbTnpEB5UwOwKlw":{"text":"I have to say, this was one of my most favourite tours. We booked it with www.freetoursbyf","useful":0,"cool":0},"AxQorh8PxJKZyCFfA8TJSA":{"text":"Robi was our guide. So awesome! His tour is really fun but also powerful in the way he edu","useful":0,"cool":0},"1TOLLHLe1in1MQyLsQLKbA":{"text":"Andrew was an amazing tour guide! We learned so much about architecture and history of the","useful":0,"cool":0},"89SZYhi4agUChttwY6Ntiw":{"text":"Took the Voo Doo tour with our 3 kids (14, 12, 10) and we all learned so much! It was fasc","useful":0,"cool":0},"x6jR3WZwqQUkyZnT30z-Ug":{"text":"Went on the cemetery tour with Denver in the morning and the ghost tour last night with Al","useful":0,"cool":0},"65lmBInM8J23LDlUXq8GQg":{"text":"We took the French Quarter tour with Joanne P.  the second day we were in NOLA.  She was a","useful":1,"cool":0},"SajyKbvuS3lRffI--CsHLw":{"text":"Requirements for tours:\n-Dad jokes kept to a minimum\n-Balance of history and juicy tidbits","useful":0,"cool":0},"wz9Lo_N387upG39frJ6eWw":{"text":"This tour was great! Sarah really knew her stuff and made the tour educational and fun at ","useful":2,"cool":0},"DqTIlrWWkes9ZLlEslioFg":{"text":"This was my first free walking tour in the south (I also booked one in Savannah, GA which ","useful":1,"cool":0},"EHJESshCyOsAN2tn6eN28A":{"text":"We really enjoyed our cemetery tour with Elizabeth. She greeted everyone warmly and had gr","useful":0,"cool":0},"dlbS9KT3pM09Z84p7GvuDQ":{"text":"Looking for a fascinating tour of New Orleans, filled with history, culture and a whole lo","useful":2,"cool":1},"6DzVi9do4Puh66q7OFfwkw":{"text":"These employees are the best!!! Just took a few of my friends that never got a chance to g","useful":0,"cool":0},"sHu9ZrLb6SUtJMP_aRe5aw":{"text":"My boyfriend and I booked two tours through Fee Tours By Foot.  I highly recommend this co","useful":3,"cool":2},"yb2S4qYUHdrUc3BsRHAzAw":{"text":"We did the Voodoo tour and the St. Louis Cemetery #1 tour. Both were great but the voodoo ","useful":0,"cool":0},"OeFiqECm-zrusrhGW9uUsQ":{"text":"AMAZING TOUR. Went on the Saturday 10:00am VooDoo tour with Robi and he was great! So info","useful":0,"cool":0},"ARRAmF6LD4GfiHr7Ar3upw":{"text":"We just got done with our ghost tour with James and we couldn't be happier with our experi","useful":1,"cool":0},"FpmGcROLnLYmD6uUVMN8zQ":{"text":"My mother, sister and I went on 4 seperate tours with this company during our stay recentl","useful":1,"cool":0},"9_6ldzrugcnEdWtKfbgkLQ":{"text":"We did the ghost tour at night. lots of cool ghost stories and very educational. if you're","useful":1,"cool":0},"v0A_t_wdjuwB88Pj22FarQ":{"text":"This was a great tour. It is \"pay what you want\" at the end, and it was definitely worth s","useful":1,"cool":1},"8f7Gj2A52TUrEyuPIVNtqQ":{"text":"Get Melissa as your guide! We had a great two-hour tour through the French Quarter, and sh","useful":0,"cool":0},"Ma3cy_IizaTH2omNJOrjmg":{"text":"My husband and I went on the Garden District Tour with Sarah and she was a stellar tour gu","useful":2,"cool":1},"y5AYuS0fDWAVul5Wn9ziew":{"text":"Tour guide, Renee, was timely in both starting and ending the lafayette/garden district to","useful":0,"cool":0},"AhJVfggj2E3SJXDr1YoFIw":{"text":"Great tour! Our guide, Sarah, was super informative and entertaining. I highly recommend t","useful":0,"cool":0},"F7lYZ2f_EXUK-ZxipRZsFw":{"text":"As a Nola resident, I always book tours with Free Tours by Foot when I have people visitin","useful":1,"cool":0},"3RbWQW0maoFA4i-N9qWcJg":{"text":"Enjoyed the tour. Guide was knowledgable but also very businesslike and seemed in a bit of","useful":0,"cool":0},"wYQP94oYp1H_8REFmAh4lA":{"text":"Sandy was awesome! The tour was very informative and fun. We learned so much about the his","useful":0,"cool":0},"RZKTCVVDI8zulrI0RsuFLA":{"text":"Our tour guide Kathy Harrell was a wealth of knowledge. She did an extraordinary job walki","useful":0,"cool":0},"y_pVKyayJPdEjP-UiVjNEQ":{"text":"We did a Saturday night ghost tour with Terri who was amazing. She was knowledgeable and f","useful":0,"cool":0},"g-41n3NV75VlhiO8TPqwVQ":{"text":"Kyle was our guide  great guide very informative  and doesn't sugar coat or make up stuff ","useful":0,"cool":0},"9-U764Yjn_Hk9B1f_95_iA":{"text":"I took a French quarter walking tour with Stacey that was wonderful. So much interesting h","useful":0,"cool":0},"kMD22XTkBxWqGPbu65QyEQ":{"text":"Went on the cemetery tour of St. Louis Cemetery No. 1 with Matthew. He was very knowledgea","useful":0,"cool":0},"OPprXedZyk5MA_7-9XFDgw":{"text":"This tour company is excellent!  I did 2 tours with them...the French Quarter tour with Jo","useful":0,"cool":0},"kBuTuPhVQ8SntJURRxDtFw":{"text":"Found these tours on Yelp!  We did the French Quarter tour with Elizabeth.  Learned a lot ","useful":0,"cool":0},"JH3r1pkDWapNtHiIGlcOqw":{"text":"We just did a food eating tour in the French quarter with free tours by foot. Overall it w","useful":0,"cool":0},"rJHC83WZrzfvrZjcS3-uFg":{"text":"I went on the Garden District/Cemetery Tour. Sarah Hester was our guide. She was a delight","useful":0,"cool":0},"W9JJ_m7pd8c7pN8KK0Dkug":{"text":"We went to New Orleans recently and had taken the free tours by foot tours 3 times!\nFrench","useful":1,"cool":0},"JWTfDR-UJH2HJwKcap1CkQ":{"text":"Took two tours with these guys one of the French Quarter and the other a bicycle tour both","useful":0,"cool":0},"k4EJe-CCvnhChtkrzRyuGQ":{"text":"Our guide Sarah was very spooky. I thoroughly enjoyed her wit and knowledge during the tou","useful":0,"cool":0},"6FCM_y296D2m_o_3roRxIQ":{"text":"Just finished the walking tour with Sarah and she was fantastic!  She is so knowledgable a","useful":1,"cool":0},"hRUTUjMebsQP-UzJOVuVqw":{"text":"My husband and I took Robi's voodoo tour.. it was awesome and he is awesome.. a must if yo","useful":0,"cool":0},"uWU6CM7PwuvKpstjZh3jOg":{"text":"Melissa was great and talked loud and clearly. A lot of information in the voodoo tour we ","useful":0,"cool":0},"-VeXzGZD3Kn3k1EHIS3IYg":{"text":"Loved the French Quarter tour. Only our 2nd day in New Orleans and made a big difference i","useful":2,"cool":0},"P-DSULF83q-0PhfusbLNaQ":{"text":"I went to New Orleans 3 times last year. On my 3rd trip, my friend and I had 0 plans. We w","useful":0,"cool":0},"TjzcVzl-a36_GeUT8mgv1g":{"text":"Loved this! Took the Voodoo Tour and Historic Garden District Tour with James B. as our gu","useful":1,"cool":0},"ItJQZssQj_sSCMRw34-ImQ":{"text":"Excellent voodoo tour with Melissa and ghost tour with Teri! They were both extremely know","useful":0,"cool":0},"C3e0xe0GUs2eS1NZefGvSw":{"text":"Free Tours By Foot is an amazing MUST if you are visiting NOLA. My husband and I did 2 tou","useful":4,"cool":3},"s1DLmUxfs8c97r097_QEyA":{"text":"Had Libby, she was very entertaining and knowledgeable. Booked the tour for a few hours af","useful":0,"cool":1},"mKT-BqKx8lWrQKgBSKZRcA":{"text":"Took the Garden District cemetery and home tour this morning. Sarah is fantastic as a guid","useful":1,"cool":1},"KjydIuMW8D8g-1Pxv1uxtg":{"text":"I booked at the last moment and the only tour available was for the Garden District/Lafaye","useful":0,"cool":0},"p4cRTvfXNActo9lAMxi3Sw":{"text":"Had Libby, she was great. The stories and her personality really worked great together. Sh","useful":0,"cool":0},"G6fszhXTtwcKsNpHGetwNg":{"text":"Their tours are excellent. We took a ghost tour with Stacey and a tour of St. Louis Cemete","useful":0,"cool":0},"Gf19XtW2y8h2znPSdgxLvg":{"text":"We took the Garden District/Lafayette Cemetery tour in New Orleans.  It was excellent-far ","useful":0,"cool":0},"ki56is1NQ2qsOMk2SgJ-cQ":{"text":"We did two awesome tours - the ghost tour with Mikko and the voodoo tour with Melissa. Gho","useful":0,"cool":0},"Zs8z8YUqup7CS5UD41Q2bA":{"text":"Did a ghost tour with Elizabeth and really enjoyed it. She was well knowledgeable and a wo","useful":0,"cool":0},"56vFWxEKkEJvMs4QsEgWgQ":{"text":"This tour was far better than any of the other pre-paid tours I took in New Orleans. I was","useful":0,"cool":0},"tK2qole1UzK46O1b96xfPg":{"text":"Signed up for this tour for the night Ghost Tour with Terri and voodoo with Melissa. If yo","useful":2,"cool":0},"XuLtAY735i60twDoth7MLQ":{"text":"We really enjoyed our Garden District tour. Kat gave us the tour and did a great job. We s","useful":0,"cool":0},"_ILpO_c2WjAGp0nZHSv9rw":{"text":"We recently took the Culinary Tour of the French Quarter with David. Highly recommend this","useful":1,"cool":0},"5YbCybVZ99jI7vZyfZU2gA":{"text":"We took two tours while we were in NOLA, the Garden District tour with Renee and the VooDo","useful":0,"cool":0},"-gV9YwcMRufyZdRnSvx68Q":{"text":"I highly recommend the three guides that led the tours we went on. Natalie led the French ","useful":0,"cool":0},"GJinVNkb2oDgbwGy9URLuQ":{"text":"Elizabeth Daniels is highly knowledgeable, friendly and delivers well the special vibe of ","useful":0,"cool":0},"D-0rbb6M-xITvFa-uNtk4A":{"text":"Elisabeth was fantastic! Very knowledgeable and entertaining. She's a local with NOLA root","useful":2,"cool":1},"te1j1Mqg3tTsQ8MVYvFbog":{"text":"This was one of the best things we did in New Orleans! Sarah was our guide, and she was so","useful":1,"cool":1},"97vRwKyx6nZZa-XFTFhyzw":{"text":"I booked a tour with Free Tours by Foot (aka Sarah) while visiting New Orleans. We were a ","useful":1,"cool":0},"wyR-mrsG6rMg_DXKJm0VCA":{"text":"Wasn't sure what to expect on this free tour but James was fantastic. \n\nHe was our guide f","useful":0,"cool":0},"-opRO30s7AVMayhQ9VxsPA":{"text":"Awesome! Only would have been better with an additional bathroom/drink break.\n\nOur tour gu","useful":2,"cool":0},"g_bj6GlVkAL76-emiIrBig":{"text":"James was our tour guide for the New Orleans Voodoo Walking Tour. He was wonderful, full o","useful":0,"cool":0},"1Qs8ECKPvp9CBvPHwd6IKQ":{"text":"Everything was really great. The location to meet was very accessible, parking was not dif","useful":0,"cool":0},"rlsSgX2HQ4GIfsaCiNGI_g":{"text":"We went on the Garden District/Cemetary Tour with Dave as our guide on St. Patrick's Day a","useful":0,"cool":0},"8bZdfJZ-T9lWVX6CGf09HQ":{"text":"Robi was an amazing tour guide! The tour was so much more than I thought it would be. I le","useful":0,"cool":0},"3wDuIIcopMXqxvbGTRaRAw":{"text":"I did the Garden District cemetery tour.  Sarah was as great as people say.  She's charism","useful":0,"cool":0},"_ErVVZfKtnEI3CFKrWtNmQ":{"text":"Husband and I did two Free Tours By Foot during our week in New Orleans and enjoyed both i","useful":10,"cool":7},"Sh7ahOLmp3nL9sDJZnZjxQ":{"text":"We took a ghost tour on New Year's Eve and it was fabulous. Covered so much ground and lea","useful":1,"cool":0},"8MsERvWCLs6sKf9bb5aTng":{"text":"Took two tours with N.O crew and really enjoyed both.  Matt was great at finding us shade ","useful":0,"cool":0},"EBkHpM8kU_0rGmWz8P8Y8w":{"text":"My 13 year old son and I took a tour of Treme with Sandy. We were blown away by her knowle","useful":0,"cool":0},"8H-rfpo-tszKg9JrMJu8mQ":{"text":"During a long weekend in New Orleans (first time visiting), we went on three walking tours","useful":0,"cool":1},"fEe_r2FGqDXttb8KgzWPfw":{"text":"It was cold and windy, but our guide Joanne was fantastic. We felt so sorry for her as she","useful":2,"cool":0},"4LSXieIwBfOm4XwJtoJiWA":{"text":"Highly recommend this tour company! We did two tours, the food tour and the cemetery tour.","useful":3,"cool":0},"FvYb-bdDNpwTxBjgQtS8ZA":{"text":"My boyfriend and I did two Free Tours By Foot on our recent trip to New Orleans: The Frenc","useful":0,"cool":0},"ia2kCG3mQlrXD3ptUEHSDA":{"text":"I can not suggest free tours by foot enough. For the cash-strapped traveler - these tours ","useful":1,"cool":0},"ehSVRC0uBLriuvwCy80vGQ":{"text":"I loved it! Our guide Kyle had a great flair for storytelling and the walk was perfectly t","useful":0,"cool":0},"3ToM2zS68SPpSKHeuKmiLA":{"text":"We did a ghost tour with Al when visiting the city,  and it was phenomenal! Just the right","useful":0,"cool":0},"fKDuEavzpbsJXanoi3Ccag":{"text":"Our Voodoo Tour facilitated by Robe was outstanding! It was by far one of my favorite tour","useful":1,"cool":2},"RMRwuo9JvCRdE5B47bBtSw":{"text":"Great concept and a great tour! It was a fun way to learn about the gruesome past of this ","useful":0,"cool":0},"uVTkwFexcmU3CE9Ou5ZHBQ":{"text":"Every time I go somewhere new I will look for a Free Tours By Foot!  Melissa was great.  K","useful":0,"cool":0},"GKIUZItnj1AKWCXbUcFB5Q":{"text":"We went on the two hour garden and cemetery tour. Loved it! Perfect length of time! Our to","useful":0,"cool":0},"f8YaYZkK1EY3wuI5FuBMHw":{"text":"Our first time to NOLA and my wife was smart enough to book the culinary history tour earl","useful":3,"cool":0},"DVcSP3z5nmHHSBL0yAUOVQ":{"text":"We did the French Quarter Tour with Matthew and it was simply awesome. Highly recommend th","useful":0,"cool":0},"sPhHxSnoloM86-_lhqjN5A":{"text":"INCREDIBLE. We were a little skeptical about how good a pay as you wish tour could be, but","useful":0,"cool":0},"RcD_Qm-nfjAy1og0OVJR4A":{"text":"We did 3 tours (ghost, voodoo, and food) a week ago.  The guides were all interesting, and","useful":1,"cool":0},"SLtH45e3sOu6Q34l0XZv7Q":{"text":"I had a tour with Kate and she was sweet, funny and very knowledgable. After the tour she ","useful":0,"cool":0},"ipPKCGHfyNLft7L3rqVCeg":{"text":"My S.O and I did the Ghost Tour @ 8:15 PM on Wednesday (6/12) with Alec and the Voodoo Tou","useful":0,"cool":0},"PelLBQRoridRe0XWd-4vPQ":{"text":"We went on the Garden District Tour yesterday with Elizabeth and were blown away. She was ","useful":0,"cool":0},"VvGGWBoT5beWCEPSaOkIBw":{"text":"One of the highlights of our trip. Our tour guide, Denver, was very knowledgeable and a gr","useful":1,"cool":1},"fgzkuANbZrvNNmkSNrqM3g":{"text":"My husband and I took Robi's Voodoo tour on 29Dec and it was awesome! He was passionate ab","useful":0,"cool":0},"241nfhjpISuXF0DzpmhPNw":{"text":"We went on the Ghost, Treme and Frenchman St. tour. We enjoyed all of them and wished we h","useful":0,"cool":0},"_JxWYn9wdF77l7LERwC3vQ":{"text":"We did several Free Tours by Foot:  French Quarter, Garden District and Bike Tour.  The fi","useful":1,"cool":0},"j8iWM3Z2iMcPTJHPuibIkw":{"text":"We were on a short trip to New Orleans during my spring break(teacher.)My daughter found F","useful":0,"cool":0},"NFZ50njvFeZkd_ybH2ymNQ":{"text":"Our group was part of the 33000+ Lutheran Youth Gathering in New Orleans for 6 days.  Our ","useful":0,"cool":0},"aQ5oWJCzhTfOJh0tTMyQfw":{"text":"My friends and I did two tours with this company on our recent trip to New Orleans. The fi","useful":1,"cool":0},"koWPFZ4gv8r-5HMLQveCnQ":{"text":"We did the voodoo and garden district tours with James, and the French Quarter tour with N","useful":1,"cool":0},"lzNQTpYL3wndQPEdODf_GA":{"text":"Sandy was our tour guide for the Real New Orleans St. Louis #1 Cemetery Tour.  The tour wa","useful":0,"cool":0},"uYH_n7jjoEFSKhsuwQUkYA":{"text":"Did the Garden District tour with Sully.  He was great.  No planned memorized stories, no ","useful":0,"cool":0},"4WUmfQrPWvjt6BxoJXZfvQ":{"text":"This was my first time participating in tours by Free Tours by Foot.\n\nI took the French Qu","useful":1,"cool":0},"8zqwuS3aSb_YPuvDobCyrA":{"text":"I highly recommend Free Tours By Foot! Love the concept of pay what you think the tour is ","useful":0,"cool":0},"r3h-2B86yXCQ75IgRNFyAQ":{"text":"Our party of 3 went on the Garden District Tour and had a great time.  The tour guide was ","useful":0,"cool":0},"8LEfUXpKi7H40iQqA36mfQ":{"text":"So awesome, well done, and easy to find/get to.  Totally recommend it. We felt 20 a person","useful":2,"cool":0},"amo6HjJncmPGI7ft6jZQIw":{"text":"amazing.  best deal and tour in new orleans.  took the garden district and cemetery tour. ","useful":1,"cool":1},"1gnocm1gzMYuWO6A-T36BA":{"text":"Had a great time on the cemetery tour! Definitely recommend doing at least one during your","useful":0,"cool":0},"c8buQ8zRAoH8sZ_f3f3G4g":{"text":"I recently took a walking tour by Sarah in the Lafayette cemetery.   Sarah was so knowledg","useful":0,"cool":0},"9DjFVF3r-M_PKLrQ1_OEZw":{"text":"Fun tour! Really liked our guide Mikko. He was fun and had good input about the city!","useful":0,"cool":0},"dTVmXsmg4w1NFOx0SzUTjA":{"text":"An absolute must on your NOLA visit. We were in town for a short trip, our first time, and","useful":4,"cool":2},"0zeIzn6yul3SO8VnZil-Fg":{"text":"Took the 1:30 Garden District tour with Sarah Hester today. She was extremely knowledgable","useful":1,"cool":0},"wP1nV7vYFIxnggaNeXlNsw":{"text":"Great tour of St. Louis Cemetary No. 1.  Matt was our tour guide and did a great job.  Ver","useful":0,"cool":0},"LjWDG1AWsBYzB4A-oM2k_g":{"text":"I went on two tours while in New Orleans.  The ghost tour with TERRY was very good.  She o","useful":0,"cool":0},"vZN0ZADy0awWkAhmP-hwEA":{"text":"If i could, i would give a 10star rating. Was in New Orleans for work and decided to do so","useful":0,"cool":0},"WTDou_BlVusEGwy5D2waxA":{"text":"The vodou tour by Robbie was amazing. Highly recommend for accurate information about vodo","useful":0,"cool":0},"qY4FJpILbgrir1P7qdjXEQ":{"text":"My family and I highly recommend this company. We did the French Quarter tour and had Kath","useful":0,"cool":0},"9Jc8tL9MkTFxx5FWobeXQQ":{"text":"We did the French Quarter walking tour on 4/27/2015. Despite the weather forecast of upcom","useful":2,"cool":1},"zNLMiedy86SSmgsgijbwRA":{"text":"Free Tours By Foot offers a variety of tours throughout the day with no upfront cost!  At ","useful":10,"cool":6},"ZE9EGq436N-xmOh7iM09iQ":{"text":"I am so glad I went with Free Tours by Foot for my tours of New Orleans! I went on the Gar","useful":1,"cool":0},"ZzuA87Rm9VHNNZBatuv02Q":{"text":"I took three tours with this company, and since I cannot figure out how to post three sepa","useful":2,"cool":1},"373fyncvh6r5MMo44nzYeQ":{"text":"I took 2 tours with Free Tours By Foot in New Orleans.  The \"Treme\" neighborhood with Sand","useful":0,"cool":0},"HO3X6DVndRRcTeK_Zhm1qw":{"text":"Many cities now have free walking tours so makes sense that NO should also. Went on the vo","useful":1,"cool":0},"1ofwmznma7FwV41yN_TAOQ":{"text":"Wow!  We went on the Voodoo tour with Robi this morning, and it was fantastic!!  He is kno","useful":1,"cool":0},"O4PbMDyIQw_LD-ystxxwPA":{"text":"This is one of my favorite things to do in New Orleans. We did 3 tours in 2 days because t","useful":0,"cool":0},"FdULwfSwNLY4FNUiE_xWhg":{"text":"The French Quarter tour is a great introduction to the city because you get some history a","useful":1,"cool":1},"k2YxHaKz--HZ8VMX3QDegg":{"text":"Just went on a St. Louis Cemetery No. 1 tour with Kathy of Free Tours by Foot last week. L","useful":1,"cool":1},"7ijGkDCcDjyWYwlcrqNuYw":{"text":"Kyle was our tour guide for the ghost tour in New Orleans. He was FANTASTIC! Not only was ","useful":1,"cool":0},"0e5mP3JoELWnrQoEba6ecQ":{"text":"At first I was thinking over 500+ reviews with perfect stars ratings?!?! Nah...too good to","useful":8,"cool":5},"E5--Wh-OS2nGkPGP-Kwy3Q":{"text":"I've done many FTbF across the country, and they are always great. Elizabeth, Sarah, Renee","useful":0,"cool":0},"rHhevJV_QdAFkyCs3ETKhw":{"text":"It was a wonderful tour and the group leader  was great. It was an enjoyable experience.We","useful":0,"cool":0},"krV5gVuEaLtLGxCHNVUqWA":{"text":"Elizabeth was personable and knowledgeable. Enjoyed the cemetery tour with her a lot!","useful":1,"cool":0},"axMxOFDx6zeA5LHnxAKMvw":{"text":"Thank you Robi for an amazing voodoo experience! And setting the record straight about wha","useful":0,"cool":0},"hYJDJF7ODXfeSKx4DcHwmg":{"text":"A great tour!  Our guide Terri was super-friendly and super-informative.  History buffs wi","useful":0,"cool":0},"ym4mbx0Cs7jP-fAQRe3MtA":{"text":"This was by far the best tour we have taken! This is our second time to New Orleans and we","useful":0,"cool":0},"CHOBl4EukBYu27XIIZ-5Ew":{"text":"We did a couple of tours using Free Tours By Foot and we thoroughly enjoyed both. \n\nThe fi","useful":8,"cool":0},"6YQMkyGmcv78S0BTOOlhJw":{"text":"I want on the voodoo tour with guide Melissa she was so knowledgeable about this fascinati","useful":0,"cool":0},"BVK1c5xNRhUybJ7JEqZOSQ":{"text":"Great times with our friend Robi!!! He was such a great tour guide and very informational.","useful":0,"cool":0},"AGg4Nb6ks_az5xAt3-1lnA":{"text":"Kathy ran our tour of the St. Louis cemetery.   She was an excellent tour guide. She knew ","useful":0,"cool":0},"eMv3XLjlxlwyBSHNdlGl8w":{"text":"I just finished a tour of the French Quarter with Kate.  She was very knowledgeable and ma","useful":0,"cool":0},"ifZjji4txaDesGTShwo_IA":{"text":"Last week I was in NOLA for a friends wedding and since most of my party likes late nights","useful":3,"cool":2},"kvui6Jo8YAXdEMu1EOwP4g":{"text":"10am VooDoo tour with Robi:  this tour ruined all of the rest of the day's tours!  He was ","useful":0,"cool":0},"13_ny7_JS0aFokk0pDxu6g":{"text":"We did the haunted history tour with Stacey. It was really interesting and fun. Stacey was","useful":1,"cool":1},"mZKg9iO9GSF2YDvU4dCLfQ":{"text":"We went on the Voodoo Tour with Robi, and it was amazing! We learned so much about the rel","useful":0,"cool":0},"WtLKT4mxwDYt8N4InDmrcQ":{"text":"The Voodoo tour with Robi was GREAT! It's the opposite of what you think when you hear the","useful":1,"cool":0},"PmM9FdgfX8rL2OxSFrf_YA":{"text":"We chose to do the garden district tour with Andrew and it was a fantastic informative exp","useful":0,"cool":0},"EVoCe9XaPNmvfnAXUlQskg":{"text":"Had a great time on the tour. Historical information in addition to the sad/haunted storie","useful":0,"cool":1},"NrpBFP9jyT7RjT6dnzkNQQ":{"text":"I took the French Quarter ghost tour with Jonathan, and I appreciated that he double check","useful":2,"cool":3},"Bn2UOrnxnItAQiYkZW0y2w":{"text":"We did two of these tours during our stay in NOLA. The first of the Garden District, and t","useful":0,"cool":0},"_2GAiLnL01r0Zr__syrv0A":{"text":"I have been on the French Quarter Ghost Tour twice now, over the course of several years, ","useful":0,"cool":0},"ZbJkIUXwJcc9Fp6bHfGK-w":{"text":"On our recent trip to NOLA, we took the French Quarter Culinary History Tour with Kayla an","useful":0,"cool":0},"c7pKFxBsoJxpDmZM_82pww":{"text":"Amazing tour guide Daniel! He knew everything and was very enthusiastic! Defintley recomme","useful":0,"cool":0},"9T7aryZCnaj8TaQDVWoKGg":{"text":"Oh my god.\nHonestly five stars for the voodoo tour because my guide was incredible for tha","useful":1,"cool":0},"nk6vsGGlWRIEV43XQXZZkQ":{"text":"Took the Garden District/Lafayette tour with Joanne. Flat out great tour! Joanne came to N","useful":0,"cool":0},"gKpp_kf-ntP73PBPeN2aRA":{"text":"We had Sarah for our tour since the company we tried to work with bailed on us. \n\nShe prov","useful":0,"cool":0},"2d2NY-yWtI4KZ4gNffZvwg":{"text":"I did two tours today, the French quarter with Sean and the ghost tour with Libby. Althoug","useful":0,"cool":0},"9PFBKLPbMjYr4XsDsSfyog":{"text":"Ghost tour with plenty of ghosts in homes and hotels.  Must come early. Very interesting! ","useful":0,"cool":0},"hQbvJicxjK8HiE-up2AyBw":{"text":"We went on the St. Louis Cemetery #1 tour on Halloween day.  The cemetery was mobbed with ","useful":0,"cool":0},"WSm5FXskSOV3iD8e4lFvhA":{"text":"Took the ghost tour.  Stacey was our guide. She was amazing.  She knew the history of all ","useful":0,"cool":0},"2P6fOApNwql5Os5uipm1kQ":{"text":"We had a blast. Thank you Kate! \n\nRE: Free Tours by Foot\nNOLA - Ghost Tour - Host/Guide = ","useful":0,"cool":0},"esuIN5tQlBg6wGyJB9qdOw":{"text":"Just finished the culinary history with Renee. What a wonderful experience.  Renee was so ","useful":0,"cool":0},"LIWxulkS0_uNtakd9fm9iw":{"text":"My husband and I did three tours with this company. We did the Garden District tour (with ","useful":0,"cool":0},"0uk_Kw3PNoQn3Z_ZdyHJUQ":{"text":"We went on two tours on our trip to New Orleans. A ghost tour with Stacy and a bike tour w","useful":0,"cool":0},"B5BtxY7QQk-RXkzSKpCeNA":{"text":"Teri B. Was a fantastic tour guide for the cemetery tour.  She had a lot of great stories,","useful":0,"cool":0},"kQXYoCMJxTPkUZ3vAPgfkg":{"text":"Their tour guides are awesome! I highly recommend signing up for all of their tours. Guide","useful":0,"cool":0},"ajVYx3wcA2TLOqhsInZlGQ":{"text":"FREE TOURS BY FOOT is a must do while visiting New Orleans especially if you're on a budge","useful":10,"cool":8},"KzIn20Q2qvRt6yXBjrHCTA":{"text":"Did The voodoo walking tour with Robi today.  It was amazing!  Not only did he give us a l","useful":0,"cool":0},"_e52k9DyoOtk50MVwM8Ckw":{"text":"We just finished the ghost tour with Stacey. Wow, what a great tour and informative.  She ","useful":0,"cool":0},"FinsLFr2l3-8Xm10_eriIg":{"text":"Cathy our your guide for the French quarter was outstanding! I will recommend to all my fr","useful":1,"cool":0},"_YGweEs-i62Xu2kwAisegA":{"text":"Alec is awesome!  Super engaging, fun, and intelligent!  Interesting inside facts and stor","useful":0,"cool":0},"b_ynHLEFJBixxhoF6lQHew":{"text":"I can't say enough good things about Free Tours by Foot.  On our recent trip to New Orlean","useful":1,"cool":1},"nED_YW5A9M9OuN14OqqteQ":{"text":"We went on 2 tours: The French Quarter and the Ghost Tour.  They were fantastic - better t","useful":0,"cool":0},"DTCPVLLjHLbWYkH8M3FH1Q":{"text":"The two tours I took with Free Tours be Foot were definitely a highlight of my last trip t","useful":4,"cool":0},"yZBGv-MtF3I-CNB_YXSKUw":{"text":"Robi was our tour guide.  He was hilarious and very interactive and informative.  It was a","useful":0,"cool":0},"BKrJgMpGN5Yt1zQZ-3YZKA":{"text":"I did the tour with Robbi, it was amazing, a great speaker, he explained everything really","useful":0,"cool":0},"FtlKEAlFG6GjxAa6FeeMjw":{"text":"This was a highlight of our trip! My friends and I were on the voodoo French quarter tour.","useful":2,"cool":1},"Vx898Qj6UPU7ikQixugw8Q":{"text":"I went on the St. Louis Cemetery I walking tour on a Friday morning. What a treat! Our tou","useful":0,"cool":0},"O8G2NJ57bEN_l--QNOVv8Q":{"text":"Estuve en New Orleans y una amiga me recomendó Free Tours by Foot, el sistema de reservaci","useful":0,"cool":0},"AiTGAiUat_rE8_Ma49H88Q":{"text":"We did the voodoo tour with Robi and he was great. It felt\nlike we were interacting with a","useful":1,"cool":1},"CWakbD7U9lx_fWpLvh8jSQ":{"text":"New Orleans culinary tour with Kayla on June 15. Fantastic! Kayla was a delight! Educated ","useful":1,"cool":0},"QCKn0zNOjOTb53jaDGcl4w":{"text":"We made reservations for the tour and joined the tour but the tour guide was extremely rud","useful":0,"cool":0},"lzFsPEgX3mn-tWxv938HAg":{"text":"We had a great time at the St. Louis Cemetery #1 Tour with Kathy on Friday, August 21, 201","useful":0,"cool":0},"D34uhcf46AYVFrRwvki8Lg":{"text":"I did four tours with this company in two days. The french quarter tour (Elizabeth?), the ","useful":1,"cool":0},"HD-SyDDPyXtHpzTeQaU06A":{"text":"French Quarter Tour:\nWe had Stacey who was absolutely amazing!! Very knowledgeable about t","useful":0,"cool":1},"Z_3f8s3nloy9S2CuTTLdMA":{"text":"This was our first time using Free Tours by Foot and we loved it. Elizabeth was our guide ","useful":0,"cool":0},"P7T6uKH7Ko7GP1-ZGrbMZw":{"text":"We took a private French Quarter tour this morning with Sandy. Her knowledge, candor, and ","useful":0,"cool":0},"MDbTo-sKk4ckSMIAvEI1Jg":{"text":"The Ghost Tour French Quarter is a must-do when visiting NOLA. My tour guide was Kyle and ","useful":0,"cool":0},"3ChMkv3jJg4AHeabPilEzg":{"text":"We took a ghost tour with Libby and it was so fun. She was extremely nice and very knowled","useful":0,"cool":0},"bbjqZc8kVj_RDoR-r_-S6Q":{"text":"Took the Voodoo Tour with Robie today... so much fun and so much great information. Highly","useful":0,"cool":0},"E6eaPVf_nG6QmWc-hBDZhg":{"text":"We did three walking tours while here in New Orleans from this group.  One ghost tour, one","useful":1,"cool":0},"AyMDLjfVFqIfmRieg9jBnA":{"text":"If you're considering a walking tour, I cannot recommend this one highly enough. James was","useful":0,"cool":0},"eNNe02uZN6a9EKBpyJDksQ":{"text":"Excellent tour.  Guide was well informed, articulate and funny.  Worth every minute we spe","useful":0,"cool":0},"4T0W9fg86sZkACoR7csNLw":{"text":"It was my first trip to New Orleans and my first walking tour since high school days. I wa","useful":0,"cool":0},"cHSN5CUsenkHyRRgY3HGkA":{"text":"We took two tours during our trip to New Orleans (Cemetery and Voodoo).  Both were equally","useful":1,"cool":1},"Iqjv3J-7mSy9Af8WKRvkQg":{"text":"We had a tour of the Garden District with Denver. He is so knowledgeable and funny. My hus","useful":2,"cool":1},"2thGhns3lrrOtWLfHv1lbQ":{"text":"My wife and I took the Ghost Tour with Teri last night and it was awesome! She did an exce","useful":3,"cool":0},"iGtGMdiBP9q6_XwSOivypw":{"text":"We took 2 tours from them and both were awesome! 4 stars for being great, one extra star f","useful":0,"cool":0},"rqVR9B7FHMrmejI19pBHjw":{"text":"I've been using this tour company for the last few years. My husband and I want to move to","useful":0,"cool":0},"ca6UbwpVO5HV-SxiCqfKNg":{"text":"We had a great tour of the Garden District with Andrew Farrier. Highly recommend. These to","useful":0,"cool":0},"NJn5f0v0DGB2HrYtJ-pnKQ":{"text":"Great tour with Stacey through St. Louis Cemetery #1.  Super informative. She explained NO","useful":1,"cool":1},"vwj-J-ruZNCd6iv0TY3U9g":{"text":"We did the cemetery tour with our guide Matthew, and he was fantastic!!!..Packed full of i","useful":2,"cool":2},"GQ8EcbV1AfEQP2Vt2po27w":{"text":"Alec was fun, knowledgeable, engaging, and had so many stories to tell! We did the French ","useful":0,"cool":0},"h65XZIF8SBn-osqIPaD8vQ":{"text":"Loved this tour! James was a wealth of knowledge and really brought voodoo down to earth. ","useful":0,"cool":0},"rII7UmAlU0ZByFLDSuQfxA":{"text":"Went on an excellent walking tour on Sunday with Shawn (Sean?).  \n\nWe met at the Andrew Ja","useful":4,"cool":0},"uGchx7ldQ-GEo-3EOEiJqQ":{"text":"Alec was an amazing guide! He was Charming, witty, and incredibly knowledgeable. He was ve","useful":0,"cool":0},"qhpFHUSDhEI0mrsQIaRxCQ":{"text":"Did the Voodoo tour w Robi and the Cemetery tour w Elizabeth.  Both we amazing and super i","useful":0,"cool":0},"NQa7DtdcK8AkMtqkOM1pHA":{"text":"Kayla Lemaire was an exceptional tour guide.  We learned a lot about New Orleans' history ","useful":0,"cool":0},"63m3ijtpOPHZm1HjcjoRLQ":{"text":"On my first trip to New Orleans, this was one of the only \"educational\" things I did, and ","useful":2,"cool":0},"bu2M_qYCH7tMMHOCKUrdjg":{"text":"We love walking tours and have gone on tours in London, Berlin, Florence, Chicago, Philade","useful":0,"cool":0},"Ejo3R5Z4TnG-WSPdUqz45g":{"text":"We attended the Garden district tour our guide was Andrew Farrier (HIGHLY HIGHLY recommend","useful":0,"cool":0},"55qtsYxH137hVfig3qapiw":{"text":"Joe was our guide around the French Quarter. Very knowledgeable and friendly. He even gave","useful":0,"cool":1},"wGpzVJrZg1Suf9fBhgcq4Q":{"text":"5 stars, hello it's free...ok, not really.  But they are so sure you will enjoy the tour t","useful":0,"cool":0},"u1AV-FFVWAlyBKOXLixa3w":{"text":"Our family of 5 really enjoyed our tour...Robi is so passionate and informative and we rea","useful":0,"cool":0},"wXOEhprPAvcHz58FJ830OA":{"text":"We use this company to do a tour of Saint Louis Cemetery #1. Our tour guide was Kathy and ","useful":0,"cool":0},"2H33o09U2AJs45hLpPd95A":{"text":"Renee led a fantastic tour of Lafayette #1 and the Garden District. She knew so much and h","useful":0,"cool":0},"jw6lDXk6cFBh62K4u8qfkA":{"text":"Alec was great! I really like his sense of humor and factual/historical approach for telli","useful":0,"cool":0},"eEZXABQXA5npDpBi0A2TAg":{"text":"We went on the Ghost Tour in the french quarter and by Jackson Square as well as the tour ","useful":0,"cool":0},"sVruYwFZYAV4F4sHUuwmoA":{"text":"This is a great way to see the city on a budget. Make sure to bring water and some decent ","useful":0,"cool":0},"guYEdOdHNv2SVvKazlcRNw":{"text":"This tour was amazing. Alec Quig is THE best tour guide! So much history and spooky all in","useful":0,"cool":0},"c0wgartKMGuM9JDN6wfZOg":{"text":"Walking tour of Music, Arts etc \n\nAndrew was more than amazing. He is extremely knowledgea","useful":0,"cool":1},"AHLncoNPhYCe3jvsh9FOjw":{"text":"This was our first time in New Orleans and we are so happy that we decided to take this to","useful":0,"cool":0},"S21waa9yOLnuC8Guf83X4w":{"text":"Did the voodoo tour with Robi!  Super informative but also very funny and entertaining! Le","useful":0,"cool":0},"DG_2QkXqIpM1w8oUzShQuw":{"text":"We took the New Orleans ghost tour led by Alec on 3/26/19.  We especially liked that Alec ","useful":0,"cool":0},"FVcebpM2ee2hfbqnTJhXLA":{"text":"We took 2 waling tours: one was of the Garden District and Lafeyette Cementary with Denver","useful":3,"cool":1},"iBRujGXn4RktSsedJPg1pA":{"text":"We did three tours with this company.  French Quarter with Melissa, Ghost with Kyle and Ga","useful":0,"cool":0},"wcZq9AysvOubCUYkaHtn2w":{"text":"we were in new orleans and figured a walking tour of the french quarter would be great.  s","useful":0,"cool":0},"xrouMKwIhdkNBiZ1_7Y29Q":{"text":"Vodoo tour\nI attended the Monday 10am Voodoo tour with my mother and boyfriend. Our tour g","useful":1,"cool":1},"zO2Bu9q0AHnZ_6zfT6lWAQ":{"text":"The Voodoo Tour with Robi was FANTASTIC - fun, funny and informative.  Really, this tour w","useful":0,"cool":0},"lV2DTdAniW3Pq83GigqL_A":{"text":"We found these guys on the Internet and after looking at all the 5* reviews I thought we w","useful":5,"cool":1},"rUW0RPInasCvnDSLED9BOg":{"text":"While in NOLA, I booked the French Quarters Tour. This was a very educational and fun tour","useful":0,"cool":0},"xStFcKfAptcuXnY9cbBEwA":{"text":"We were in NOLA last week and decided to try Free Tours by Foot.  Totally worth it.  We ha","useful":0,"cool":0},"kgJk29UNlzrXl3dckqQrGA":{"text":"Why don't more cities have this?? I think every city should have this type of tour. The to","useful":1,"cool":2},"1t7CCdLetOyyCtSJfvyjgQ":{"text":"Kathy was a very informed and articulate guide. Importantly, she seemed to love her work, ","useful":1,"cool":0},"g-1bScjkzUaDnyHTQR5dTQ":{"text":"Big Al (Alec) was the BEST tour guide!!! So knowledgeable and entertaining!! Thanks for a ","useful":0,"cool":0},"wRQCJ93AMXyeHB24A5t0Eg":{"text":"Informative! Entertaining! A fantastic way to spend a few hours learning about and enjoyin","useful":2,"cool":0},"f569PTTuy83i6HCR1c8rhA":{"text":"Elizabeth was amazing!!! I did a ghost tour last monday night in New Orleans and she was s","useful":0,"cool":0},"e_O7A6IHGdPPgP8cjK_mpg":{"text":"Went on this tour today and it was by far one of the best things I've done in New Orleans.","useful":0,"cool":0},"C1zBO7IHVhbAH0QHFTW-vA":{"text":"Stacey Herald was a fantastic guide with endless knowledge of NOLA's history. She's even b","useful":0,"cool":0},"SIcTV0cR_QylRXEk61SwuA":{"text":"\"Big Al\" was an excellent tour guide. The right combination of knowledge and humor to make","useful":0,"cool":0},"TqCokISsUlEMTOdrkitf8w":{"text":"Misleading. The tours are not free. The only thing that's free is the first few minutes wi","useful":0,"cool":0},"kMJlq_s717SGX45CWav2Zw":{"text":"Stacey was incredibly knowledgeable and had a great sense of humor.  Highly recommend!!!","useful":0,"cool":0},"SL-BmIoriKKbhPSN7tYsyw":{"text":"It was my first time visiting New Orleans and I definitely wanted to do some tours of the ","useful":0,"cool":0},"07_lhLAWr6nv88Ki4_ScsQ":{"text":"We took the Treme tour today and Sandy was our guide. It was one of the best tour experien","useful":0,"cool":0},"DG9Ndg2i53gAceo_kCQ2cA":{"text":"The Voodoo tour with Robi is an absolute must!!! Not only do you learn about the religion,","useful":1,"cool":0},"IzCtHgt291TvA5KM9INyXA":{"text":"Robi is simply the best tour guide I have had anywhere. Very thorough presentation with hu","useful":0,"cool":0},"WWMCPCnjFQ3XGVYmzTptKw":{"text":"Re: NEW ORLEANS GHOST TOUR.  This tour company NEVER disappoints!! We have used Free Tours","useful":1,"cool":1},"HlDVHAmd3uq2Hezlj89HHw":{"text":"My husband, 18-month-old daughter, and I took a great walking tour with Alec Quig on New Y","useful":0,"cool":0},"wmQW82OFth7YxnLj0sLBZw":{"text":"Robi's Voodoo tour was a blast! He was lots of fun and gave great insight into his family'","useful":0,"cool":0},"kalVRpV0vZCgLj73mfmVQg":{"text":"We had INCREDIBLE tours with both Elizabeth for a Ghost Tour and with Sandy through St. Lo","useful":22,"cool":19},"Gnb76BA8AHrM_uAeFABqdA":{"text":"Went on three of the free walking tours: the french quarter tour, the ghost tour, and the ","useful":0,"cool":0},"Ixr66Atft9TgWQRo_d_VyQ":{"text":"Visiting New Orleans on Easter weekend, we decided to do a few tours and saw that Free Tou","useful":0,"cool":0},"p7LcWZ2ySGsmaVgpa24C8w":{"text":"Went on the Ghost tour with Kyle. He was a great tour guide and we had a great time! Very ","useful":0,"cool":0},"q4sQN0hqBmPBOKmba6K1OA":{"text":"FTBF was a fantastic way to experience NOLA particularly if you are limited in time. We th","useful":0,"cool":0},"Y6AENlV37_mNPSeqZKU18A":{"text":"We took two tours with this company on our trip and had a great time. \n\nThere are a lot of","useful":2,"cool":2},"5xH9U1jJHWnHMH59KVaplQ":{"text":"I love the idea of this tour! My boyfriend and I are both grad students so taking multiple","useful":4,"cool":2},"Zy2AqdwRBY-XVLDnvg80jQ":{"text":"My tour guide is Joanne. She's fun and knows a great deal about New Orleans. I learned a g","useful":0,"cool":0},"WtqegdEJw3vOY_MMcjGwnw":{"text":"We were recently in New Orleans and were lucky to be on two of your tours.\nBoth were great","useful":0,"cool":0},"O2g-fyEMw3PyeBIh_J71zg":{"text":"We signed up for the French Quarter Tour and the Ghost Tour.  Alec was our guide for both ","useful":2,"cool":1},"a3q4aqyOS16Io3FBfo8JDw":{"text":"So happy we found out about free tours! We took two with them - garden district and French","useful":1,"cool":0},"H1GpFWOXRyfb5i3rIXW-PQ":{"text":"My friend and I were down in NOLA for Mardi Gras. Going on the tour of the cemetery was an","useful":0,"cool":0},"Tb5FaIFIlsqYSIWJKVbBiA":{"text":"Just did the French Quarter ghost tour with Stacey. It was fantastic. Stacey is a natural ","useful":0,"cool":0},"ZA0n4TeZFAycQkIEZchYOQ":{"text":"Our guide, Joanne Parkinson, was friendly and greeted all warmly.\n\nWe took this tour with ","useful":0,"cool":0},"QVSQG6cZiiWVQoDYI6Opmw":{"text":"Big Al was the best!! He was very knowledgeable about all of the ghosts & ghost stories. L","useful":0,"cool":0},"62YVqSRGQKus6bqBLvbU0A":{"text":"I used three tour companies in New Orleans and Free Tours by Foot was by far the worst. We","useful":1,"cool":0},"AIjWcQRMzbBJ60qD2cQ-lw":{"text":"Sarah was a great guide.  Very upbeat and loves her New Orleans!  It was a 2 hour tour wit","useful":0,"cool":0},"hUPW_qeObnDBINlCcJN2TA":{"text":"My husband and I enjoyed the  French quater tour with Stacie. She made the tour very infor","useful":0,"cool":0},"EsBKcn3SYj8qWzrgwqfmow":{"text":"Tonight I took a ghost tour with Alec Quig and he was absolutely wonderful! The tour laste","useful":0,"cool":0},"-L7S33GAmft0wItwNeYdzg":{"text":"It was our first visit to NOLA and thanks to free tours by foot, we had the chance to lear","useful":0,"cool":0},"30mn_ZZ0tDlNPOvs2vKJ9w":{"text":"We went on 3 tours with this company while in NOLA. The foodie tour, ghost tour and cemete","useful":1,"cool":1},"HzJAH6CfW_sVyru-0PwCow":{"text":"I'm so sorry I can't remember the guides name but she was awesome! Sunday morning 11am Voo","useful":0,"cool":0},"_Ic0Wkf_rIY-wVDa-djrEw":{"text":"\"Just one of those type deals\" my favorite quote from tour guide Scully.\n\nMy boyfriend and","useful":2,"cool":3},"g2li5Ngp2RBai6Sy2Wo6IA":{"text":"Alec gave us a ghost tour tonight and it was so good. He is quick witted and highly educat","useful":0,"cool":0},"8FiYPqMfEYKWxkWU1OS6xQ":{"text":"We took a cemetery walking tour with Melissa. She is very knowledgeable and hits the hot s","useful":0,"cool":0},"mrjuWlWAknqeK116qnUltA":{"text":"Elizabeth was awesome! My boyfriend and I really enjoyed the tour and she was full of know","useful":1,"cool":1},"B__pWUDiYxBx6kZcjObUMw":{"text":"We had the owner, Sarah, leading our group on the Lafayette Cemetery and Garden District t","useful":3,"cool":0},"0ncuiEf1OIFkOwHJVGDXpg":{"text":"Amazing company to use! First time in New Orleans and have nothing but great things to say","useful":0,"cool":0},"lgGArxpiHFHbPSrYHo6vng":{"text":"I'm clearly in the minority here but I didn't think this (Voodoo) tour was all that great.","useful":0,"cool":0},"wxNnawsY5QX8yc1rTlGugw":{"text":"Alec Q. was our tour guide on the Ghost tour and although I didn't take any other ghost to","useful":0,"cool":0},"7CHZx8w8wcZ88M8fIHRUXA":{"text":"Absolutely love these tours! As a first-time New Orleans visitor, I wanted to book tours f","useful":0,"cool":0},"fJosfXNi0CtuPKjEzpR2Xg":{"text":"Visiting New Orleans? Do yourself a favor and start with a Free Tours By Foot tour! The Fr","useful":0,"cool":0},"90svoTFukn41P1etzGm1xA":{"text":"I was recommended Free Tours By Foot by my sister & now I'd highly recommend it to anyone ","useful":0,"cool":0},"GbOqILsiONstK93_ap4PdQ":{"text":"We rolled into NOLA on Fri evening and settled into our French Quarter hotel late. I wante","useful":0,"cool":0},"D1FsCt01YpBnUPvXDdDHiQ":{"text":"Took the French quarter tour with Matthew and loved it!!! Super knowledgeable and full of ","useful":0,"cool":0},"DuWuMKx-UaeGe8f5PAig-A":{"text":"I went on New Orleans ghost tour with Alec, and he was the best tour guide I've ever had. ","useful":0,"cool":0},"pvVTiMWDD5_pXZLmimM2tw":{"text":"Everyone has already said it...but amazing tour guides and service!  I did two of the NOLA","useful":0,"cool":0},"N73DoxOJzXxPiCtB0YRMXw":{"text":"Excellent tour guides provide a great experience! Unlike most tour companies that charge y","useful":2,"cool":1},"eoLXyBMCdRK1NVQd4qCWtw":{"text":"Andy was awesome today!! We learned a ton and he is so well spoken! He makes you feel like","useful":0,"cool":0},"Y5-aZ4urIy0zceUexDHSZQ":{"text":"A group of seven of us at the cemetery tour and the ghost tour with Kyle. Awesome experien","useful":0,"cool":0},"VSyoyvV3Y8Q3bvR5tM6CNw":{"text":"I LOVED Free Tours by Foot! Found them by doing some searching on Google for cool affordab","useful":1,"cool":1},"pHicnDa-xsQNf4SZ0BA2ow":{"text":"Had two tours yesterday, one french quarter tour with Stacey and one ghost tour with Casey","useful":0,"cool":0},"MpkssoCszDssnpFhYH3IwA":{"text":"My husband and I went on the Cocktail Tour with Stacey back in May. She is awesome! Very k","useful":0,"cool":0},"99OhbNCHTSlPG0If9tjO0g":{"text":"I'm a huge jazz fan, so I set the bar high for history and info about music. Andrew Farrie","useful":0,"cool":0},"Cui6NIeun2A1oAVTNTodCg":{"text":"Free Tours By Foot is the place to go!! I took a walking tour with Andrew my first night t","useful":1,"cool":1},"wxgLkEXMXumG-DuRepWxbw":{"text":"Robi was absolutely amazing. We did the Voodoo tour and learned so much about the culture.","useful":1,"cool":0},"FvpVTaQYWvRGQg13kJTW5Q":{"text":"We did two tours, the French Quarter and also the Voodoo tour. We had Sandy who had a grea","useful":0,"cool":0},"eMQyuXSrdLieA_gSLoWQJw":{"text":"So happy we booked a Ghost Tour with FTBF. Our guide, Stacey, was so well informed about t","useful":0,"cool":0},"pXG1Tz2EgzFBJxZEz82Llw":{"text":"We've schedule the 8:15 Ghost Tour and it was EXCELLENT!!! Our tour guide, Miko, was very ","useful":0,"cool":0},"oO-9eUezPmbYNBNF9DoNVQ":{"text":"Robi was absolutely wonderful. Extremely knowledgeable. Very upbeat and energetic. I highl","useful":0,"cool":0},"49fX8tqeriSRHIfC892VDA":{"text":"Robi was my tour guide for two tours while visiting New Orleans, and he was fantastic and ","useful":3,"cool":0},"rS0nZfLOfoPGIMX9zxNA9A":{"text":"I love the fact that you donate whatever you think the tour was worth! \nWe took the Garden","useful":1,"cool":1},"rRjgmj65KR1BpTI4xJi4NQ":{"text":"I took the Cemetery and Garden District Tour. Sarah, our tour guide, was knowledgeable, sp","useful":0,"cool":0},"MTT5jUhZtjRqMbC4UUuuNw":{"text":"When my boyfriend and I were in New Orleans for a long weekend we wanted to do a a few wal","useful":0,"cool":0},"KyrTXpd9Covl4b7s3WQ1yg":{"text":"Take these tours! \n\nMy guide was professional upbeat and helpful. Renee Whitecloud was my ","useful":0,"cool":0},"4QAyy2fQAAIS7fQZpRZR5A":{"text":"We did the French Quarter Culinary History Tour in January of 2018 on a visit to New Orlea","useful":1,"cool":1},"V2j_xewlN3kgTS5qKMOlbg":{"text":"I did a tour of the garden district/ Lafayette cemetery with Denver and it was amazing! He","useful":0,"cool":0},"djf6x41-nZCD70dwOnNghA":{"text":"I love New Orleans. The history, the beautiful buildings, the food, the fun! I always take","useful":0,"cool":0},"0TPVmPdt7NPkQ97OITagPQ":{"text":"We did the free ghost tour and was able to get a spot for two without reservation. Our tou","useful":0,"cool":0},"0hrrsmBXySjdRH0Y8RGwEg":{"text":"Had a great time last night with Al. He knew his ghost hauntings! He was articulate, enter","useful":0,"cool":0},"51QFMXhvreGB6P_H11XTjQ":{"text":"We thoroughly enjoyed both tours that we went on this past week.  Our first tour was the S","useful":0,"cool":0},"kfBq0qVvvdFCCfenNCvVAQ":{"text":"Big Al was hands down the best tour guide I think I've ever had. He absolutely knows what ","useful":0,"cool":0},"5VNnAsJfHuc17WfPi99q-A":{"text":"Our VooDoo tour with Robby was amazing! We highly recommend Robby (pronounced ROW-BEE)!!!.","useful":0,"cool":0},"hTbjTfeRWkryRMUleceJ2A":{"text":"We did the St. Louis Cemetery #1 walking tour with Kathy Harrell as our guide. Great tour!","useful":0,"cool":0},"17_rorRTQoHsdkLg-gB2JQ":{"text":"Fantastic! Fun! Full of history. A great way to see the city too. Highly recommend the wal","useful":1,"cool":0},"HWWzyquH214kcXsQeOFXOg":{"text":"We took a tour of the St. Louis Cemetery #1 with Elizabeth Broussard, and I had no idea ho","useful":1,"cool":0},"zmpWPmKG5Eihr5hQEt-CxA":{"text":"Just got finished with the ghost tour, we had a great time! Our guide Stacey was wonderful","useful":0,"cool":0},"OzmARRo7MlBV1OeB51sQBw":{"text":"My husband and I took the French quarter tour with Sean and the ghost tour with Alec on ou","useful":0,"cool":0},"49Si3d7oitR3--MplEPVBA":{"text":"Mikko was a great tour guide!! We came here during the Mardi Gras and boy did we spend a t","useful":0,"cool":0},"BRB4R1jZ7Lo1rdKP3PYx6g":{"text":"We went on three of these tours, all were fantastic! I think my fave though was the Garden","useful":0,"cool":0},"ipxcPV2BlMlX18-f_WTG1g":{"text":"Um, free. How can it not get 5 stars? Please take money to give a tip. I personally think ","useful":3,"cool":1},"W1ckAuJBwdatHAIH1IwRqw":{"text":"My wife and I took multiple tours from your company and had an awesome experience on each ","useful":1,"cool":1},"ODS71lSweA76dKf6GM-Pew":{"text":"Awesome! We took the French Quarter Culinary tour with Kayla (I believe that was her name,","useful":2,"cool":1},"fwvfvVm8I0i5-Pgx7gZ8pQ":{"text":"I try to mention this tour company to every visitor I hear talking about taking a tour in ","useful":7,"cool":3},"kvNHXVTLHntaHwrhigTdOA":{"text":"We just finished the St. Louis 1 cemetery tour with Kathy. She was a delight. Bubbly, exci","useful":0,"cool":0},"i3UuEe-p0HWLGo05z3s0eA":{"text":"My husband and I did the Voodoo Tour with Robi this morning and it was fabulous. The tour ","useful":0,"cool":0},"l-odObN0GwZWnK_UMwDwcA":{"text":"We did the ghost tour with Stacy. She was very informative, entertaining, and professional","useful":0,"cool":0},"-BOwDVDzBoBYgbmaKbGAYw":{"text":"We did the ghost tour with Teri last night. This was one of the best ghost tours I've ever","useful":0,"cool":0},"Ge41CA3AEnVof_32d9ZBEw":{"text":"Loved the tour with Renee. She was a great guide and very engaging. I highly recommend it.","useful":0,"cool":0},"fnvCM_mNN49GffpqCM45Lg":{"text":"We did the New Orleans Ghost Tour with Libby. Note: we only stayed for half of the tour.\n\n","useful":5,"cool":0},"Cg92uyklioX_7ciwnPgWkQ":{"text":"That was my first experience with Free Tours by Foot. I chose the ghost tour with Mikko. H","useful":0,"cool":0},"oJnRoghDbUvGKQGq2wyVfA":{"text":"This is going to be a review of two tours but both equally deserve 5 stars each.\n\nThe firs","useful":0,"cool":0},"D5mM-Rr6AFY0RYIiHG3h1A":{"text":"Look no further, this IS the tour you're looking for! Tour guide you ask? STACEY is the on","useful":0,"cool":0},"K4-GGXLsgALoHWErXyY4yg":{"text":"Did a ghost tour with Elizabeth. It was amazing. She  is a great storyteller and I really ","useful":0,"cool":0},"xOQhvIwFGsBjX00rTEN5jw":{"text":"This was our first time visiting New Orleans. We enjoyed the garden district tour. Sarah w","useful":1,"cool":0},"0QQdWH157oRGQqICBov_Lg":{"text":"My best friend and I are big true crime and paranormal buffs. Though she's a New Orleans n","useful":0,"cool":1},"1G3R8EmtvyUPeCpm9njbtQ":{"text":"I took two tours with Free Tours by Foot: the ghost tour with Alec and the cocktail tour w","useful":0,"cool":0},"puer00WRIxL9s1BikxneJg":{"text":"We took a cemetery tour this past weekend with Free Tours by Foot.  Elizabeth Broussard wa","useful":0,"cool":0},"aE0kVOkOVuYmQ1KqrKJEOw":{"text":"Just completed the Ghost Tour (around the French Quarter and beyond) with Stacey, and VERY","useful":1,"cool":0},"OdABDElGX7f5mZ6MEhe7gQ":{"text":"Took a tour by alec previously for a ghost tour and had a blast. Today we took a voodoo to","useful":0,"cool":0},"OIltZG-CEjaFW9NwODVvFg":{"text":"Went on the Voodoo, or should I say, Vodou tour with Robi. THE only High priest tour guide","useful":0,"cool":0},"raVRa77W8A-H9-4eOfFBrg":{"text":"Sandy was our guide for the ghost tour in New Orleans this Saturday! Great pace, awesome s","useful":0,"cool":0},"jrnoJyY023XmRW_GXUPeYg":{"text":"Big Al was fantastic. He knows so much about New Orleans he should write a book. He was en","useful":0,"cool":0},"_anHUrLuWyTFqCogxGzL_Q":{"text":"We did the St. Louis Cemetery #1 tour with Kyle April 1 - he was absolutely the perfect gu","useful":1,"cool":0},"NF0zGcEP1DoXdO8Dujg4Og":{"text":"I went to three tours with this company and they were all awesome. Start out with the Fren","useful":3,"cool":4},"G3o3KRTF1QMY6ZcGIJe7Iw":{"text":"Ask for Robi to get the authentic scoop on the voodoo tour.   He is the real deal and full","useful":0,"cool":0},"DLoDO3S_Uhbt_CF4R08-MQ":{"text":"I recently went on a walking tour of the Garden District & Lafayette Cemetery through this","useful":2,"cool":0},"L9tto5fh2KQ0JRkFht6koA":{"text":"Robi!  This was so much fun. This company does a really good job. This is my second tour w","useful":0,"cool":0},"XK2Ztb48MfLuluNIUeVbgw":{"text":"We had a great tour of the French Quarter with Al . He was so knowledgeable, funny, and ke","useful":0,"cool":0},"Z2ia09WgsO7khrl19s2DmQ":{"text":"My husband, some friends, and I did four tours with Free Tours by Foot in New Orleans a co","useful":0,"cool":0},"zcVJlKBVO5lKXzAYHTxpyw":{"text":"Wow! I just took the Ghost tour last week with Stacey and it was amazing. I was in NOLA fo","useful":0,"cool":0},"2S1h4_zShmDaaqkw35O0ng":{"text":"We did the french quarters tour. Its was funny and informative.","useful":0,"cool":0},"lcfzQmKC0GsuMwjoyxnxew":{"text":"Went on the Ghost Tour tonight. Stacey was a great guide. Funny, interesting, knowledgeabl","useful":0,"cool":0},"XFHMtVH8t3zaiT18FltiSg":{"text":"Alec was an awesome tour guide who had us laughing the whole time. He made sure to not sug","useful":1,"cool":1},"TkaVkflBnO444KHeE3k7og":{"text":"My husband and I took both the St. Louis Cemetery #1 Tour on 09/16 with Kathy as well as t","useful":0,"cool":0},"fGjjTbhC_i7pSSSyLvt4LA":{"text":"My husband and I are celebrating our 1 year wedding anniversary in NOLA from the Dallas, T","useful":1,"cool":1},"bvat74imFgVr9JYxrPlhUA":{"text":"We took a ghost tour with Alec Quig around the French Quarter. He was awesome. The perfect","useful":0,"cool":0},"-gJ7kFP3r03xTYWXyumpjQ":{"text":"We took the French Quarter ghost tour in the heart of Mardi Gras, in the middle of all the","useful":0,"cool":0},"ZqhgsvCygJytJ_PyYbrFCA":{"text":"I did the Tremé tour with Sandy on 6/23/18. She was fantastic. She was very knowledgeable,","useful":0,"cool":0},"spjBwd5YZI85lblIBoTqNQ":{"text":"Got my walking tour with Robi on January 1, 2018. It was 10 am, and I must confess I wast ","useful":14,"cool":8},"2XPu944rxcygrHbmEr35BQ":{"text":"Going into New Orleans, we knew two things. We wanted good food and spooks. We scoured the","useful":0,"cool":0},"fqXOANLD9jRjR4MNw1IQdg":{"text":"We took Sarah by foot walking tour and it was very, very good. She is a very knowledgeable","useful":0,"cool":0},"pFom0nlwk7xC_x2QmyzG5g":{"text":"Kyle was the best guide you could get. This is my first time in New Orleans and I decided ","useful":1,"cool":0},"51xjXqmIaWKODMPwdJG4eg":{"text":"The last tour we had while in New Orleans was with Joanne Hughes. She was great and very i","useful":0,"cool":0},"D3hBA94CVvsZsNrjBLUM7w":{"text":"August 2015.  We took the Garden District/Lafayette Cemetery tour.  It was a lot of fun an","useful":0,"cool":0},"653HeXqHP_VoOvugK70ImA":{"text":"Myself and 3 friends did the ghost tour at 8:15pm. Alec was a great tour guide and we cove","useful":1,"cool":0},"zDBtNDaBItXhuxEzhVGkUQ":{"text":"Highly recommend going on one of the tours. We had a lot of fun during one if their cemeta","useful":0,"cool":0},"TcRZix-GlXWjoO2OxUlKkQ":{"text":"Was in NOLA last week and did the Voodoo tour on Friday morning and a Ghost tour that Frid","useful":1,"cool":1},"JgswnTmjObz9SneDDd8YKg":{"text":"Try to get Alec Quig to be your tour guide.  Very knowledgeable, affable, and truly hilari","useful":0,"cool":0},"LWMI1WL5zuv76Cl0J7xQsg":{"text":"This was our first time using free tours by foot and we did the St.Louis cemetery tour wit","useful":0,"cool":0},"RfM1ZKB0wKCucI88JNzBbA":{"text":"We did the Garden District/Lafayette cemetery tour and the French Quarter tour during our ","useful":2,"cool":2},"iyh47aFXLLU_1_q-pGQWUQ":{"text":"I've done two tours with this group. The first was a cemetery tour led by Kathy who was gr","useful":0,"cool":0},"GqlCkDeEIl9_O6JUO0Gbeg":{"text":"We took the garden district/cemetery tour with Renee and the French Quarter tour with Eliz","useful":0,"cool":0},"Rpv-SAX5YPd4DOa0Qsya8A":{"text":"Fun tour and very informative. Learned a lot about local history in New Orleans. Tour guid","useful":0,"cool":0},"BdLpwDiAPAi0VcmXYrruAA":{"text":"We did the 8:15 Ghost Tour with Alec tonight.  Alec was very informative and had a great u","useful":0,"cool":0},"E63OHjU2JJ_tNnNmsOTyQg":{"text":"The tour of the St. Louis Cemetery #1 led by Elizabeth Broussard was one of the best walki","useful":1,"cool":0},"KUvhkdg3dVaBd6GQY4OlFw":{"text":"Our tour guide Melissa lead an excellent walking tour.   Full of great info and treasures ","useful":0,"cool":0},"kUa1vYxedLyRF_ybwrpw4A":{"text":"Stacey Herald gave an excellent ghost tour last night -really enjoyed her stories and know","useful":0,"cool":0},"b3MWDkVd1hRkrYFbw3TuOQ":{"text":"A group of 8 of us went on the Ghost Tour day in the evening. Our tour guide was good but ","useful":2,"cool":3},"dHQ84kMqmrYD16bsb7W-9A":{"text":"Garden Tour with Daniel\n\nThis guy was a professional guide, and I mean he is a pro. Super ","useful":0,"cool":0},"XMnOsgBWJ6ztMDZIhFgeBg":{"text":"Alex is awesome. We had a ton of fun on his tour. New Orleans is beautiful and much deeper","useful":0,"cool":0},"t1U5WQkwVwssPXwzjmcUTw":{"text":"First off Robi was great!  Best you can get out there. Friendly, Knowledgeable,  and Humor","useful":0,"cool":0},"FLwkrK2R-J10b3BJalTt0A":{"text":"Robi is the definition of a \"tour guide\" and we are truly enlightening by the voodoo tour,","useful":0,"cool":1},"yOAtgkJrFEeNirKbEOvW7A":{"text":"I highly recommend using FTBF. They have a bunch of different tours and every one I've tak","useful":0,"cool":0},"dHlihlsamWl2D3CtUpOTtg":{"text":"In New Orleans French Quarter I highly recommend the Voodoo tour. Robi is a voodoo priest ","useful":0,"cool":0},"LN4HcopRKx_mfyuoJ4l2aA":{"text":"My husband and I took the voodoo tour with Robie as our guide. My lord, Robie was amazing!","useful":0,"cool":0},"kH4F8px_8dkPO9BQhOSPNw":{"text":"Sandy was an awesome and gave us an amazing lesson of all of the rich history of New Orlea","useful":0,"cool":0},"N5S83T9RzPqWamJRfjVT5w":{"text":"My husband and I went on two tours from this company - the Garden District with Daniel and","useful":1,"cool":1},"QBZCZjaTYuxofwyCPet4XQ":{"text":"We did the Free Tours By Foot Ghost Tour. If you're coming to New Orleans, I highhhhllllly","useful":0,"cool":0},"8p1tG1tm1YPcf9A8Lrc82A":{"text":"Last week, my daughter and I were in New Orleans celebrating a special birthday and we too","useful":0,"cool":0},"TQud7bOe2RSWGjP3I1msbQ":{"text":"We did a tour of the Marigny neighborhood with Daniel. It was a really interesting  tour a","useful":0,"cool":0},"ZOQKxaZU-GnBgTfFozfBqw":{"text":"Took the evening ghost tour with Alec Q and he was fantastic! He's the type of tour guide ","useful":0,"cool":0},"1lLLZQNuudKbI0BKWYwFhw":{"text":"I can't recommend this company enough. After a different company cancelled my tour two dif","useful":0,"cool":0},"PcFoQZkkipmW6QlgPKEVpg":{"text":"A 2-hour tour for just $2? If this sounds way too good to be true, guess what? It isn't! F","useful":5,"cool":5},"ZyakzmnxASSgI3YKH_kELQ":{"text":"I took the theme by foot tour with Sandy in New Orleans. I would said she was very much th","useful":0,"cool":0},"IvmkeShR8NYX7i53YBezzQ":{"text":"On the last day of our first visit to New Orleans, my two friends and I had signed up for ","useful":1,"cool":0},"NDTAv-h3sbvgbQokOf9_LA":{"text":"We did our evening ghost tour with Stacey and she was fantastic. We learned so much from h","useful":0,"cool":0},"Zz43w6p0VNPS8OIdql8eLw":{"text":"Stacey is awesome!! You can tell she really know her history and is very thorough!! Also v","useful":0,"cool":0},"2Hlq4gQeyNqEBiUjjj4XWg":{"text":"This was great! Al was our tour guide and he was the bomb. He genuinely seems obsessed wit","useful":0,"cool":0},"MIOjdt7jVOvuMayk5fmwew":{"text":"Priest Robi is amazing!  He is flamboyant, theatrical, and interesting!  He told us the ta","useful":1,"cool":0},"KGRXr3FbO8Rj2lJRcuXICw":{"text":"Many tour options are available especially for the French Quarter, but I was definitely ha","useful":6,"cool":5},"FJd2kea9rdMjqsnNDhyF2A":{"text":"Had a tour of St Louis Cemetery #1 with Elizabeth. We had a great time and learned a lot. ","useful":0,"cool":0},"XBSz07JmUeVHX3Dktr391g":{"text":"I did Priest Robi's Voodoo Tour and the St. Louis Cemetery #1 Tour with Liz. Both were exc","useful":0,"cool":0},"jo4oSxpTR8TBXim_Z6cpWg":{"text":"Voodoo tour. I'd give Robi a 5 star. Great person historian orator comedian and just lovea","useful":0,"cool":0},"CKoXjG2q5t3tq0dTdAtWOA":{"text":"Easily the highlight of our vacation was finding this tour company. Thanks Yelp! I knew th","useful":10,"cool":3},"hEGpxjH3u-aNridFaxcaHQ":{"text":"I love a good walking tour.  It's one of my favorite things to do as a tourist.   I found ","useful":7,"cool":3},"5X69U6oH_gL4u4S9HB7knw":{"text":"We loved Free Tours by Foot so much that we took three tours during our one weekend in New","useful":3,"cool":0},"Qzp_lw802fw319WUHBI-_A":{"text":"Wonderful tours! Did the voodoo tour with Melissa, amazing! Did the evening with Stacey on","useful":0,"cool":0},"Y5m8sWwpJPAEcDZZyZtYYw":{"text":"We did the French quarter tour with Libby.   We've done a lot of tours.   Libby was very g","useful":1,"cool":1},"xiXnohfaw58FWoLaP7KCAw":{"text":"We did a french quarter tour...the tour guide was amazing. She emailed and texted the say ","useful":0,"cool":0},"cnef75WBaSPnAknM5XsbtQ":{"text":"Went on a \"free\" ghost tour with Alec Quig! The tour was $5 for parties with members less ","useful":1,"cool":0},"99oeP9Ll_JEZcBwfczJTtg":{"text":"This was my first time visiting NOLA and it was made even better with this tour to St. Lou","useful":2,"cool":1},"5C3KfnUIS-FwnnKDO0pFtQ":{"text":"We did this tour on what felt like the hottest day of the year.  We did the New Orleans Cu","useful":3,"cool":0},"3JcYIdSWHVe_3Tou-HAA1w":{"text":"Omg Sracey ROCKS!!! She was very fuuny, insightful and knowledgeable about New Orleans his","useful":0,"cool":0},"vdDu-Uqh0Imt4utagfqE5A":{"text":"Would highly recommend these tours! Our group loved them so much went on three different t","useful":1,"cool":1},"nxm_MHLiGP7Ev0WKKDbm_Q":{"text":"We went on the tour of Saint Louis Cemetery #1. The tour guide was very informative. She t","useful":0,"cool":0},"Ffj6mL2LWKGY2MEuugVcbA":{"text":"Robi - wow! He made us feel so welcome, and we learnt so much about the history of Vodu  \n","useful":1,"cool":0},"OggJHr8YFwWuq_HFGpQQkQ":{"text":"We signed up for a Free Tours by Foot: Garden District/Lafayette Cemetery Tour. It was a g","useful":1,"cool":0},"cL1rj4UvlfHMaN_Fi18Mig":{"text":"The tour of the French Quarter was a string of facts in a loud monotone with no cohesive t","useful":0,"cool":0},"vA8uj2Ui9YMsrXffVEW73g":{"text":"The quality of the tours vary and are highly dependent on the tour guide you end up with. ","useful":0,"cool":0},"qxDgGtASZyR8XK2iXIzn_g":{"text":"For the holidays I decided to take a solo trip to New Orleans and I was really unsure what","useful":4,"cool":2},"TWEOFKx3iEFc66MAsI-VIw":{"text":"Our family took the FQ and Garden District tour on 2 separate days. I made reservations th","useful":2,"cool":0},"f5xPESOiBqw8poEvjAYrcg":{"text":"My boyfriend and I took the French Quarter tour with Andrew and absolutely loved it! Andre","useful":0,"cool":0},"QSCbVJRbORltb8S3xqVeXw":{"text":"I absolutely love the philosophy of this company -- pay what you want at the end, because ","useful":5,"cool":0},"Wze0TQoWNHRZJi9KQyHyPA":{"text":"Our group did the Garden District/Lafayette Cementery Tour. We arrived a few minutes late,","useful":2,"cool":2},"T2Wma_jwEjPoGvmbPoqQ3g":{"text":"I did the Garden District tour with Renee and she was lovely and knowledgeable. She had a ","useful":0,"cool":0},"EuO1ZGy5R2GrxifgbKL7Wg":{"text":"Our tour guide Stacy was super, knowledgeable, funny, and patient. We found out a lot abou","useful":0,"cool":0},"nzjmmqY0ttocuSBbWidxQQ":{"text":"I highly recommend using this company if you're interested in touring St. Louis Cemetery 1","useful":12,"cool":9},"HaG_Rl0cTI07dxrX5CB-6A":{"text":"Fantastic tour, Garden District and Lafayette Cemetery.  Great tour guide.  Learned a lot ","useful":0,"cool":0},"bUYfAC7c3G2EtU0pTleNWg":{"text":"I love these tours! It's such a great way to see the city. Since each tour meets at differ","useful":2,"cool":1},"BtwaWJYB1qPDee7wY32-vw":{"text":"Super duper down-to-earth and dedicated - the tour guides really delivered.\nWithin each to","useful":1,"cool":0},"FT71k4vegn_fINOSG-IsYA":{"text":"Our family participated in the New Orleans Ghost Tour and the Cemetery Tour (through St. L","useful":1,"cool":0},"YBuqP5zwMVaEBTAPlYhH9Q":{"text":"Kathy Harrell was an amazing tour guide, definitely recommend this.  We toured St. Louis #","useful":0,"cool":0},"5E-pkqK8raPxVz5TkbPlRA":{"text":"Took the Voodoo Tour with Robie today... so much fun and so much great information. Highly","useful":0,"cool":0},"zHg9Q7ed-ypC4LdMk7SmDg":{"text":"We took the voodoo tour with Robi, and it was fantastic! He did a great job making the tou","useful":0,"cool":0},"ILdkJg9AFcuRmyQqHMBIww":{"text":"Awesome! So started a little bummed out because they were booked for the evening we were t","useful":2,"cool":1},"AiwUIlcu1hA9RvYyaXXN6Q":{"text":"\"Three Tours in Two Days -- All Amazing!\"\n\nWe took the Garden District & Lafeyette Cemeter","useful":2,"cool":0},"YnXHj0R9w1k1gTi1U1gddA":{"text":"We did the Garden District Tour, and it was led by the owner of the company. Unfortunately","useful":2,"cool":3},"Uqbk_vxjURkBAj9QXmK69g":{"text":"Very knowledgeable tour guides. No gimmicks, just focused on the educational/ historical p","useful":0,"cool":0},"C3Z_AYQiutlBzgZqXvPfCA":{"text":"Can i give more than 5 stars though? I did a ton of research about which tour was the best","useful":0,"cool":0},"-8p83l6Kj1UxSi9XqZC_CA":{"text":"I did the Voodoo tour with Robi. It was excellent. His passion and knowledge about the sub","useful":1,"cool":0},"7UpXL8w7D2pF7tMcE07fOw":{"text":"We had a great time! Stacy was funny and knowledgeable as she took us around historical si","useful":0,"cool":0},"pGeNDDzJKm6RxCDKPTaaZg":{"text":"This was our third Free Tour. Our second in Nola. Yesterday's Garden district Tour with De","useful":3,"cool":2},"f4w4h1hkB13x9CbX_PCPoA":{"text":"Due to short notice scheduling, we split our family of 4 into two different tours. My 17 y","useful":0,"cool":0},"r6eEA1RD3oY_6kotLiDh3g":{"text":"I really wish I could give this organization waaay more than 5 stars. I actually wish that","useful":1,"cool":1},"nmtWddqNBUV3Fvnzc9DRDQ":{"text":"We did three different tours in NOLA with Free Tours by Foot: the Food Tour with Kayla, th","useful":0,"cool":0},"P09-IQY2lLWeZtP5WRAZFw":{"text":"I have to give Stacey 5 stars! She is knowledgeable, passionate, and an amazing story tell","useful":0,"cool":0},"CIC70B1GIAMNgN6UdQUFAA":{"text":"Stacey Herald is terrific. Our tour of the French Quarter was interesting and lots of FUN.","useful":0,"cool":0},"xFkHjOSiEBnB8iEv8jyMoQ":{"text":"I took three tours with that company in NOLA and they were all exceptional!\nI had two tour","useful":1,"cool":0},"CZ-VY9cy2BfdkXLSzFPkoA":{"text":"My wife and I did the Free Tours By Foot ghost tour last night and I was blown away by the","useful":0,"cool":0},"qZYugveyarcUVhvMn9ZiPA":{"text":"My husband and I went on the French Quarter tour with Kathy today. It was really good. I l","useful":1,"cool":1},"Z8_GHhxmuFe35YbdPBtdmQ":{"text":"My group of friends took two walking tours from this company and I could not have been hap","useful":0,"cool":0},"DyMWi_vRnA7w7j-HVxRhaQ":{"text":"We took three tours by Free Tours by Foot, two with Sandy and one with Andy. Both were gre","useful":0,"cool":0},"Oz0oOPgmLbA1ycH0KH6ezQ":{"text":"This was a great tour. Our guide, Denver, is a local history professor and his passion for","useful":1,"cool":0},"284Sl6ANalGTjx_NSIk4jw":{"text":"Sandy was funny and had a lot of knowledge.  I really enjoyed her tour.  We got a tremendo","useful":0,"cool":0},"Gj7jW378kczlOU023VIbCg":{"text":"Renee was a great tour guide.. we started at Lafayette cemetery and toured the beautiful h","useful":0,"cool":1},"e_IbrYdIqvndkk6syK5zSg":{"text":"Whenever we travel Europe, we love doing free walking tours.  We were so happy to find the","useful":0,"cool":0},"lz3UTNe1rOMNeDYyZLL2Xg":{"text":"Fantastic tour of the garden district NOLA by Andrew!!  Loved this experience and will def","useful":0,"cool":0},"HUzzBvqtHblu5ePkSXXm3A":{"text":"Garden District and Lafayette Cemetery tour.  Matthew is a nice guy, friendly, spoke well,","useful":1,"cool":1},"2s7Hd7ak4ite8UnDjkbEWg":{"text":"Fantastic tour!\n\nJoanne from Australia was our wonderful guide for a French Quarter tour a","useful":3,"cool":2},"dHhqyUBIi7OBaPBcSUQQNA":{"text":"My boyfriend and I did the French Quarter Culinary History Tour on a Friday at 10 am. Our ","useful":2,"cool":0},"PpYh3hdYLVHYuUMBAB9LMQ":{"text":"Can not recommend enough! We did the Voodoo and St. Louis #1 tours, both with Melissa (who","useful":3,"cool":0},"io8fgbEcFQrlejEB_g6Pkg":{"text":"Of all the things that Kris and I did during our first ever trip to New Orleans Free Tours","useful":14,"cool":11},"AeZ3CK1Uyk3JLmmCQ_k7XA":{"text":"I didn't know what to expect, but I'm so glad that we stuck with it, because it was a grea","useful":0,"cool":0},"QuQsctE0aofMUtCQmlaMgA":{"text":"I can't say enough good things about FTBF! We planned an impulse, low budget trip to New O","useful":2,"cool":1},"fEfFVa1Su15vXgUuTPW7Cw":{"text":"Booked a voodoo tour and a ghost tour with them. Sandy was the tour guide for both. The vo","useful":0,"cool":0},"nkuZm5kkrwYnDgtgZ4U60g":{"text":"For the 'name your own' price the Garden District tour with Scully was well worth it. Coul","useful":1,"cool":2},"GboXdUN9tPp1mEf5tMikPw":{"text":"The Mardi Gras 2021 Virtual Tour was fun and educational.  I've been to New Orleans a few ","useful":0,"cool":0},"X6nrIAtapo9wzRRO8Z8RPg":{"text":"My family and I (8 total) booked a Ghost Tower by foot during our stay in New Orleans. Jam","useful":0,"cool":0},"fX213HIT1Lk-LzE1XyM8mg":{"text":"We took two of these tours for the Garden District and the French Quarter and had great ex","useful":0,"cool":0},"WPKJqkxerTM0Xh7LYbaO7Q":{"text":"Sandy with a y provided is with the utmost educational and entertaining tour by foot.  If ","useful":0,"cool":0},"GRRgO9y08ES1Phq93ng6mA":{"text":"If you want to learn about the history of New Orleans for a good price, well, free, look n","useful":3,"cool":0},"RfYOzD3ArEpYP3P-Xzy0iw":{"text":"The tour was entertaining, informative, and great for a group! Stacy was a terrific guide ","useful":0,"cool":0},"atxTVgGsaX8aTDjaqUtVjQ":{"text":"Sandy was funny and had a lot of knowledge.  I really enjoyed her tour.  We got a tremendo","useful":0,"cool":0},"hvNsqVgVJA_kKwYs1VwOSg":{"text":"Sandy took us on our tour today to learn more about the history of voodoo in New Orleans. ","useful":2,"cool":0},"lcaeM1kT7as7lHPJMLZlkQ":{"text":"I did the cocktails tour and what could go wrong did!  The tour was not off to a good star","useful":0,"cool":0},"UkHNlD5SaFjoT-NOaxbtDA":{"text":"If for some reason, you haven't already been persuaded by the hundreds of 5 star reviews t","useful":1,"cool":0},"_Y85sO2aduLXbAKT-OXLmw":{"text":"Mikko was our tour guide for the Garden District Tour.  He was wonderful, with great knowl","useful":0,"cool":0},"-EJT4ByY8jDQKPs9scgsSA":{"text":"My sisters and mom and I attended the Voodoo tour offered by free tours by foot. It was on","useful":0,"cool":0},"QQ5hzeV4NidXVuW87gT76A":{"text":"ABSOLUTELY AMAZING!!! Not just because you name your own price. The guides are very knowle","useful":0,"cool":0},"DXuwjiSmW4O0iyoaUpzGiw":{"text":"WOW! seriously. Free Tours By Foot is our new must-do when we go to New Orleans! We reserv","useful":0,"cool":0},"wM3RnSGJDTdKLRw5s2vPGg":{"text":"We did two in one gorgeous NOLA day and they were rad. New Orleans is obviously the ideal ","useful":0,"cool":1},"5h2lbUIpl4j6RwnfptSp4A":{"text":"I never use yelp, so this is definitely legit... but DUDE this ghost tour by Alec was AWES","useful":0,"cool":0},"RvWrxCvBi4zOUeMWphW8CQ":{"text":"Let me start by saying that I will definitely try out this company again in the future. I ","useful":0,"cool":1},"B-rQBDDlKPuyy_m4qaFXNA":{"text":"Just took our French Quarter tour with Sandy and it was awesome! She's incredibly knowledg","useful":0,"cool":0},"eoFsqqp8N0uQzgP6xQ0yuA":{"text":"Free Tours by Foot is really as amazing at it sounds. You get quality tours at whatever pr","useful":7,"cool":2},"kqcOBWkHEHkhoL0dudL_eA":{"text":"We toured with Ms Kayla in the 10 AM French Quarter history tour and the 1 PM French Quart","useful":0,"cool":0},"GBVdX-XL860ZLPw42fhBug":{"text":"We went on two tours by this company in two days - the ghost tour and the Voodoo tour. For","useful":0,"cool":0},"hdM6yOYJup3en8010W7usg":{"text":"We took the French Quarter walking tour today with Sandy Hester. She was very knowledgeabl","useful":0,"cool":0},"SCi5D5cR_vQZP0wmGgvWPw":{"text":"This was a pleasant surprise. Our guide, Stacy was amazing. She gave us an in depth tour o","useful":0,"cool":0},"DkWR_UNp73Td5_Foc5uY_Q":{"text":"Absolutely loved the Ghost Tour with a lady tour guide (sorry forgot her name). The guide ","useful":2,"cool":1},"ehhw8LwyXDyXKdrpBFlhbw":{"text":"Our group had a ghost tour with Matt, which was a great experience! Prior to booking a tou","useful":1,"cool":0},"bOMHv7yOgWO7pYvCjBGTZw":{"text":"Did a couple of tours with Sean on the French quarter and garden district tour etc. Felt v","useful":0,"cool":0},"Aaje7HxtbmN9_49-lIohGw":{"text":"Wow!! What an awesome tour experience. We took the Garden district/Lafayette Cemetery tour","useful":2,"cool":2},"5BD9coPIC5vH2g6Zx29FEA":{"text":"In New Orleans for a long weekend with my daughter and we wanted to go on one of the local","useful":0,"cool":0},"Uf6KRf7suBFdUKm4PqrFcQ":{"text":"Last week I visited New Orleans for the first time, and about two months ago I found Free ","useful":19,"cool":18},"wQrAS4xVfEFbK43Jr1Bgzw":{"text":"Did Voodo and French Quarter tours with Sandy, both amazing and informative.\nDid Garden Di","useful":0,"cool":0},"T1XXp9QqO4Z2D2qgZRJ2yw":{"text":"At the end of the day, I really liked the tour. The tour was scheduled to go until 4 pm, b","useful":0,"cool":0},"4KYsyNDIbwV86XUcopKDSg":{"text":"We had an excellent tour of the French Quarter with Elizabeth N.  She was extremely knowle","useful":0,"cool":0},"JYaqjRI63Mn05Hq30sg9hw":{"text":"Every time I'm in NOLA I still repeat the Tours by my fav guides.  This is ONE of them, th","useful":2,"cool":0},"Lh5h1TGlPpY_ZSbqC2AJ4w":{"text":"I've taken a few tours from this company in my many trips to New Orleans, most recently th","useful":1,"cool":0},"dxcWyA5LliDIEKU9bWXQiQ":{"text":"We did the 10am \"VooDoo\" tour with Robi. Robi was super informative, entertaining, and ene","useful":1,"cool":0},"sy8Pii8h-pxzHUzdLac9-g":{"text":"I love taking tours because I find them fascinating,informational and entertaining. The vo","useful":4,"cool":5},"7hQWfBLxjHxpopMjjVyLmg":{"text":"Kathy was amazing! She will forever be part of a great memory for us. Highly recommend!!","useful":0,"cool":0},"T5F2RNEY8AjWfwhQ3GOb-Q":{"text":"We did a voodoo tour and it was great even though it was pouring rain we still did the tou","useful":0,"cool":0},"VsnYUzmMODMgtEJ2k0RwzQ":{"text":"I go to New Orleans about 5-6 times year but this is the first time to go on a walking tou","useful":1,"cool":0},"pAIU4FJn8FDwuJayo_TPRg":{"text":"The walking tour through the cemetery led by Elizabeth Broussard was the very best tour I ","useful":48,"cool":43},"URuBlIJMfT9TsafmMIjHAQ":{"text":"I used FTBF on two occasions while in New Orleans for a spell. The Food Tour was a good wa","useful":4,"cool":2},"OvBaThPSFpWeqKhZ4B9E3A":{"text":"We choose the Voodoo tour and Sandy with a Y was our tour guide. We got a little lost and ","useful":0,"cool":0},"Z38LdDxwbbb9OFLZGvvZ9w":{"text":"Robi's voodoo tour was absolutely amazing.  It was so great to have a tour led by an actua","useful":0,"cool":0},"9EBk9nSaUZZkgPS3qir7VQ":{"text":"Never had such a bad experience with Free tours by foot... very disappointing! We booked a","useful":1,"cool":0},"c3KnS94ybVh07PhwO4Lf5A":{"text":"While in NOLA we booked two walking tours: Cemetery (9:30 AM) and Ghost Tour (7:30 PM). Un","useful":7,"cool":0},"mKyTSKw-1fHVozjsHT7AIA":{"text":"I was there for a destination birthday with 5 other women.  I never even had considered a ","useful":0,"cool":0},"dThCvMGSoWgnE0eM1sI6IA":{"text":"We did the 10am \"VooDoo\" tour with Robi. Robi was super informative, entertaining, and ene","useful":0,"cool":0},"Pu3mfJbnbtOYbFhlyhDRPw":{"text":"My sister and I went on a tour of St. Louis Cemetery #1 last Friday led by Kathy Harrell. ","useful":0,"cool":0},"q_A1SKRSO6PZiya-3XbGwA":{"text":"We did the Garden District Tour with Sarah and had a fantastic time! As a local NOLA resid","useful":3,"cool":2},"BG4rs4XyNulJH_I02PaK-w":{"text":"If you're in NOLA and especially the French Quarter, you have got to give Free Tours by Fo","useful":1,"cool":0},"QNFkMSs34Q560WgLTATD1w":{"text":"Did the french quarter tour with MELISSA. We met on Jackson sq, even though it's free you ","useful":2,"cool":0},"1i3znbGmDAWHj4g0gmcqOQ":{"text":"Seriously I highly recommend getting your tour through them! \nWe did the ghost tour with S","useful":1,"cool":1},"FCiBBDT3B-bY4MiohMgisw":{"text":"We where a family of 4 (2 adults and 2 teens) for about 5 days in New Orleans), I wish I'd","useful":0,"cool":0},"BQaLS9sybXAXT80yCtU_7Q":{"text":"Tours were informative especially the Voodoo Tour with Melissa. She shares historical fact","useful":2,"cool":2},"L2DAnCABhHzENaNtBcm9JA":{"text":"Best part of our trip! Did the food tour and the ghost tour- both great in their own ways.","useful":0,"cool":0},"oQ_7dMGjRk-zYIG7dI1L1A":{"text":"Great tour of Lafayette Cemetery/Garden District with Elizabeth! When we initially got to ","useful":1,"cool":0},"-FkIiyYCnQ8HMVJqaxt-xw":{"text":"I took the Garden District tour and Renee was an excellent guide.  She was extremely infor","useful":2,"cool":1},"2UsKqP8d4e25alfjacR17g":{"text":"Stacey's French Quarter Tour\n\nStacey was our tour guide for the French Quarter Tour and sh","useful":0,"cool":0},"UJ0msZ1oLPpuSFwKnBhRyw":{"text":"My girlfriend and I were so grateful to have had the opportunity to be in the Voodoo tour ","useful":0,"cool":0},"TNJISqwGuzh2KFqKoZMzUQ":{"text":"My friends and family came to Nola to celebrate my 50th birthday. This was my 2nd time her","useful":0,"cool":0},"OOk3YTCOxdyaAGEW1JCGJA":{"text":"We had a wonderful time exploring the cemetery. It was very neat and interesting to see su","useful":0,"cool":1},"EQwNzw1v9bIfZ8aKJVLCDA":{"text":"Just did a tour of the French Quarter w/ Elizabeth D as guide. She was smart, well-informe","useful":0,"cool":0},"_llJmrOj7P8-HthMW3gI_Q":{"text":"We booked the ghost tour and it was very informative. Our guide, Stacey was very energetic","useful":2,"cool":3},"SiMc9l4_qvhzsWY5-qNLqQ":{"text":"Awesome!! Thanks Free Tours by Foot!! Definitely book at the very least one of these when ","useful":21,"cool":22},"vPuiL_6kruw0KbgMLMaDYQ":{"text":"Free tours by foot rocks! I recommend this to everyone. It's in many city's and its free!!","useful":0,"cool":0},"xiqKjGN5t6BwIogHMLLgMA":{"text":"5 stars for our tour guide Alec. He knew exactly what he was talking about and seemed real","useful":2,"cool":0},"3sbA-Kn2KCR22uWKdb7GPg":{"text":"I attended two tours arranged by Free Tours by Foot, I did the French Quarter Tour with Sa","useful":1,"cool":0},"uZOEYUBRbDHJfpIVS8ovMg":{"text":"We did the Voodoo tour with Sandy and she was amazing. Wish we could've done more tours wi","useful":0,"cool":0},"rQxRnyhEVh0gKiximrSlzQ":{"text":"Alec was awesome! Great tour guide, provided super detailed ghost tour! Went above and bey","useful":0,"cool":0},"ZHYoIkM0yJzkGZsVubMfUQ":{"text":"Remember to tip the guide!  I recommend at least $10 per person for a crowded tour, $20 pp","useful":2,"cool":1},"pqw5VKf1wvfg3InTgCBplQ":{"text":"We went on the Ghost Tour 12/26/2021 with Mary- she was great. Lots of historical info, pa","useful":0,"cool":0},"y2EzkD8jkgXNjyZeq8IS4Q":{"text":"While in New Orleans recently, we took the Ghost Tour offered by Free Tours By Foot; and w","useful":0,"cool":0},"fgwQ0xUlDW4xLDhkd1zi4A":{"text":"Das Prinzip ist sehr einfach, aber gut. Locals aus der Gegend geben kostenlose Touren und ","useful":2,"cool":1},"SDvIMxEUcord_imlO6tJig":{"text":"U can not tell you how happy I was with Free Tours by Foot - New Orleans. It was fantastic","useful":0,"cool":0},"H6rxdAkmQLkX1wjVTxSiXw":{"text":"I really enjoyed our tour of the French Quarter with Stacey. She was super knowledgeable a","useful":2,"cool":0},"q2U-UWWm6H2jjZOUZa0ktA":{"text":"We did 3 walking tours over the course of our trip and they were all so informative and in","useful":2,"cool":0},"Fg9OoVNg-fw6A2weMluLnA":{"text":"Can't recommend Melissa enough! She was our guide for the voodoo tour in New Orleans and w","useful":0,"cool":0},"dJgN6gVE9-QndOxBGXxeBA":{"text":"Led by James, he was a tour guide as expert as he was easy going. Great mixture of history","useful":0,"cool":0},"suTpuKOqFGvru-gY4Hw9Fg":{"text":"This is the second tour we did with this company and it did not disappoint! Had a great to","useful":1,"cool":0},"YieNR3qpVp0lQABAdELjKQ":{"text":"Hubby and I did the Voodoo Tour. Very informative and interesting tour which gave lots of ","useful":4,"cool":4},"Z7cHBdHvoRqjsHEv58wC4Q":{"text":"We did the ghost tour, our tour guide was Elizabeth. We really enjoyed getting to hear som","useful":0,"cool":0},"D3ervlJaYHLLYfIuWG5RMw":{"text":"There are a lot of tour companies in New Orleans, but Free Tours By Foot is the only one t","useful":0,"cool":0},"zgLw-yLF2UGTbJSAB-PTfQ":{"text":"Sandy was absolutely wonderful.  Very knowledgeable with just the right amount of sarcasti","useful":0,"cool":0}}