{"oJm5wwXHTiLjMbDa6f9Ctg":{"text":"Worst class ever. And worst experience overall. Oksana was at the front desk. I greeted he","useful":0,"cool":0},"S_R3WY5iKh8hCAvwh8gAeA":{"text":"Such a powerful experience and amazing instruction. I DID feel incredible out of place at ","useful":1,"cool":1},"rl6X-zh25ERNuEiIQHBP4Q":{"text":"this is not just a yoga studio...it's a healing center and a sanctuary. they have done eve","useful":2,"cool":0},"-wOpsiyCcHUe6zEEmoUabQ":{"text":"This review is based on my first visit to and class at the yoga room.\nI called prior to co","useful":6,"cool":0},"zmYLAUqdkr6bqorPz9Ulew":{"text":"Melanie was my first yoga teacher. I spent 7 months practicing under her. When I moved to ","useful":0,"cool":0},"CNCoLjXHMD0ByfhtqhqH1g":{"text":"mixed feelings. beautiful space. many great classes. however, I've tried many times, 4 or ","useful":0,"cool":0},"C1RzJcshW_S61jzNoLYYSw":{"text":"Melanie transmits a beautiful practice from her uptown studio in the heart of a vibrant an","useful":0,"cool":0},"JbEyVzXXynQmBNa1qxcrKw":{"text":"I LOVE THE YOGA ROOM! I purchased the Living Social voucher last winter, and since then ha","useful":2,"cool":0},"Iyk5r0m7qBwMxGuPBkiSeQ":{"text":"I'd never been to the Yoga Room and chose to do my teacher training here pretty randomly [","useful":6,"cool":2},"hAi-Etlb46L8t6IQTJC1Ng":{"text":"Only place in the city or state where you can pratice traditional Mysore. Melanie is an am","useful":3,"cool":3},"E23y9dXHHy-AydIDXadMEA":{"text":"TerribleExperience.\n\nNot Recommended. \n\nDont Waste Your Time and Energy.\nThe owner, Melani","useful":0,"cool":0},"1JrxbdVmEX18drIJtxZeBA":{"text":"I can understand first impression not being the best, but I have grown to really enjoy The","useful":3,"cool":1},"VHneQfQ894tmLl72D3BWtQ":{"text":"amazing yoga classes and instructors! huge rooms, and small ones for private meditation. i","useful":1,"cool":1},"jfwo3BKQYN6WPWzDLZMGjg":{"text":"Only place in the city or state where you can pratice traditional Mysore. Melanie is an am","useful":1,"cool":1},"K_PvIm6JK1xF5qO5PQw-Yg":{"text":"I practice Ashtanga and Mysore style yoga out of state but when I visit my family in Louis","useful":2,"cool":1}}